{
  "id": 1016109,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "今年过年在街边吃饭手机被偷了，想了解一下现在 iPhone 的安全做到什么地步？",
          "en": "My phone was stolen while I was eating at a street-side restaurant during the Spring Festival this year; I'd like to know how secure iPhones are now?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "小偷他把我的手机拿走能做什么？ 卖掉吗？ PS （当天立马就去补手机卡了）",
          "en": "What can a thief do with my phone? Sell it? PS (I immediately replaced my SIM card that day)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "会打电话过来骗密码...我之前隔了几个月 冒充 apple store 说有人拿手机到店里维修, 后台查询到是丢失状态, 拦截下来了让我 xxx, 然后 xxx, 最后忽悠我要到了锁屏密码... (不是 apple id 密码)然后就 GG 了.....",
          "en": "They will call and try to phish for your password... Months ago, someone pretended to be from the Apple Store and said someone brought my phone in for repair.  The system showed it was lost, they intercepted it and asked me to do xxx, then xxx, and finally tricked me into giving them my lock screen password... (not the Apple ID password) And then I was screwed....."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前看了英国一个留学生，在英国丢了手机，最后手机定位是在华强北。",
          "en": "I previously read about a Chinese student in the UK who lost their phone; the phone's final location was in Huaqiangbei."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "卡槽的卡最值钱，完全可以用这张卡登陆你任何 app ，各种借贷。手机丢了第一时间锁卡。",
          "en": "The SIM card is the most valuable. They can use this card to log in to any of your apps and take out various loans. Lock the card immediately if your phone is lost."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "朋友们，有个黑市软件叫 icloud bypass ，支持的机型和 ios 可以看下面的链接，我是看你们在讨论才发，和我没有利益关系。",
          "en": "Friends, there's a black market software called icloud bypass.  You can see the supported models and iOS versions from the link below. I'm posting this because I saw you discussing it, and I have no vested interest."
        },
        {
          "zh": "如果三件是 A11 之前，那么由于 iboot 的硬件漏洞，所有系统都可在开机时即跳过。",
          "en": "If it's before A11, then all systems can be bypassed at boot time due to the hardware vulnerability of iboot."
        },
        {
          "zh": "如果是 A12 以后的，那么只有 ios 16.6.1 以下才有机会被 bypass\nhttps://docs.google.com/spreadsheets/d/1IfjnVY4p8eAwi8q3BoQV7p36Ye6n3MWLWSZBhWxdM6c/htmlview",
          "en": "If it's after A12, then only iOS 16.6.1 and below have a chance to be bypassed. https://docs.google.com/spreadsheets/d/1IfjnVY4p8eAwi8q3BoQV7p36Ye6n3MWLWSZBhWxdM6c/htmlview"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@492 哈哈哈  看来你是有苦痛经验的。  这些区域活动的偷儿是他们的常客，都认识的。 管？管不过来的。 甚至是不想管的。",
          "en": "@492 hahaha looks like you've had a painful experience. The thieves active in these areas are their regulars, they all know each other. Manage? They can't manage it. They may not even want to manage it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果不能骗到解锁密码，就只能拆了卖硬件吧",
          "en": "If they can't trick you into giving the unlock password, they can only take it apart and sell the hardware."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "华强北了解一下",
          "en": "Check out Huaqiangbei"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先骗解锁密码，骗不到就拆配件卖吧",
          "en": "First try to phish for the unlock password, if they can't get it, then take it apart and sell the parts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一般是两种一种是卖给别人，靠忽悠的那种。另一种就是拆机。说实话拆机根本不赚钱。。",
          "en": "Generally, there are two ways: one is to sell it to others, relying on deception. The other is to disassemble the phone. To be honest, disassembling the phone doesn't make any money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "邮件、短信骗你密码，实在骗不到就拆机卖配件了",
          "en": "They will use emails and text messages to phish for your password; if they can't get the password, they'll disassemble the phone and sell the parts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "密码基本是解不开的，所以不用担心；但是手机可以刷机重新使用，不至于拆配件",
          "en": "The password is basically uncrackable, so don't worry; but the phone can be flashed and reused, so they don't have to disassemble it to sell the parts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iphone 大部分还是拆配件吧",
          "en": "Most iPhones are still disassembled to sell the parts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@duange7X24 ip 刷机有点不现实",
          "en": "@duange7X24 ip flashing is a bit unrealistic."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iPhone 原装屏值 1000",
          "en": "An original iPhone screen is worth 1000"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@duange7X24 现在还可以刷机吗，我的系统一直是最新的。",
          "en": "@duange7X24 Can you still flash the phone? My system is always the latest."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bzw875 屏幕没什么瑕疵，一直贴膜的。13pro 后玻璃倒是碎了。",
          "en": "@bzw875 The screen has no flaws, I've always had a screen protector on it. The back glass on the 13 Pro is broken though."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你放心，肯定是被拆成零件被卖了。整机除非能骗到你解锁手机（其实以现代人的警惕心，还是挺有可能的）",
          "en": "Rest assured, it's definitely been taken apart and sold as parts. Selling the whole phone is only possible if they can trick you into unlocking the phone (which is actually quite possible given the modern person's vigilance)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有 ID 锁，骗不到密码解不了锁的话，只能拆了卖配件",
          "en": "If there is an ID lock and they can't trick you for the password, they can only disassemble it to sell the parts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@duange7X24 解不开密码刷机怎么绕过锁",
          "en": "@duange7X24 How do you bypass the lock when you can't unlock the password and flash?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小心密码不要被骗",
          "en": "Be careful about your password, don't be tricked"
        }
      ],
      "type": "replies"
    }
  ]
}