{
  "id": 1014028,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "你们年终奖都发了多少？",
          "en": "How much have you all received in year-end bonuses?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "兄弟们你们年终奖发了啥，发了多少？我媳妇他们公司发了一箱馒头！！！",
          "en": "Brothers, what did you get for your year-end bonuses, and how much? My wife's company gave out a box of steamed buns!!!"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "md 跟你们这些有年终奖的拼了",
          "en": "Damn, I'm competing with you guys who have year-end bonuses"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哥删了呗，我是无所谓的，但是我一个朋友可能有点汗流浃背了，他不太舒服想睡了，当然不是我哈，我一直都是行的，以一个旁观者的心态看吧，也不至于破防吧，就是想照顾下我朋友的感受，他有点破防了，还是建议删了吧，当然删不删随你，我是没感觉的，就是为朋友感到不平罢了，也不是那么简单破防的。",
          "en": "Delete the post, bro. I don't care, but a friend of mine might be sweating a little; he's not feeling well and wants to sleep. Of course, it’s not me, I've always been fine. Let's look at it from a bystander's perspective; it shouldn't be too heartbreaking, right? I just want to take care of my friend's feelings; he’s a little heartbroken. I still suggest deleting it. Of course, it's up to you whether to delete it or not; I have no feelings about it. I'm just feeling upset for my friend, and it's not that easy to be heartbroken."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "也不知道，问了下有说发个锤子的，也有说发个毛线的，我都不需要就没有去领，拿去卖了估计能值个几块钱吧。",
          "en": "I don't know either. I asked around, and some said they got a hammer, and some said they got nothing. I don't need any, so I didn't go to get them. Selling them might be worth a few yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "得结合这个来看",
          "en": "You have to look at this in context"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "明年不裁我就当做年终奖了",
          "en": "If I'm not laid off next year, I'll consider it a year-end bonus"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哈哈，看到大家的回复，我心里平衡了不少，谢谢各位~",
          "en": "Haha, I feel much better after seeing everyone's replies. Thank you all~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "为什么这个帖子会在 Linux 节点下面",
          "en": "Why is this post under the Linux node?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wxw752 你不觉得你有点不太合群吗？",
          "en": "@wxw752 Don't you think you're a little out of place?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哥删了呗，我朋友是无所谓的，但是我有点汗流浃背了，我不太舒服想睡了，当然是我哈，我一直都是不行的，以一个当事人的心态看，直接破防了，就是想照顾下我的感受，我有点破防了，还是建议删了吧，当然删不删随你，我是很有感觉的，就是为我自己感到不平罢了，很简单破防的。",
          "en": "Delete the post, bro. My friend doesn't care, but I'm a bit sweaty; I'm not feeling well and want to sleep. Of course, it's me, I've always been not okay. Looking at it from the perspective of someone involved, I'm completely heartbroken. I just want to take care of my feelings; I'm a little heartbroken. I still suggest deleting it. Of course, it's up to you whether to delete it or not; I have strong feelings about it, I'm just indignant for myself, it’s easy to be heartbroken."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你小子是个不合格的伙夫吧？烧水都烧不好？哪壶不开提哪壶",
          "en": "You kid, you're a bad cook, aren't you? You can't even boil water properly? Why are you bringing up things that are best left unsaid?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "什么是年终奖",
          "en": "What is a year-end bonus?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一个月",
          "en": "One month"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们发了个锤子",
          "en": "We got a hammer"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "发个 jj",
          "en": "Received a dick"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一个月",
          "en": "One month"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "深圳小公司....年后才发....",
          "en": "Small company in Shenzhen.... will be issued after the New Year...."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你真的扎了我的心了",
          "en": "You really hurt my feelings"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年终奖是毕业大礼包。",
          "en": "The year-end bonus is a graduation gift package."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "发了个蛋",
          "en": "Got an egg"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "明年不把我开了就好了",
          "en": "It would be great if they didn't fire me next year"
        }
      ],
      "type": "replies"
    }
  ]
}