{
  "id": 1019375,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "好奇问下，两边父母都无法带娃的夫妻们都是如何解决大城市带娃问题的？",
          "en": "Just curious, how do couples whose parents on both sides can't help with childcare solve the problem of raising children in big cities?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我这边父母 70+，身体不好；老婆那边母亲不在，父母离婚，父亲不管。\r\n孩子 6 月生，考虑找熟悉的亲戚过来带娃。但是已经有好几个亲戚拒绝了。",
          "en": "My parents are 70+, and their health is not good; my wife's mother is deceased, her parents are divorced, and her father doesn't care. The child is due in June, and we're considering asking familiar relatives to help take care of the baby. However, several relatives have already refused."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "OP 我没有冒犯的意思我是真的想知道，为什么会有 `找熟悉的亲戚过来带娃` 这种 不可思议的选项",
          "en": "OP, I don't mean to offend, I really want to know why there is an unbelievable option like `asking familiar relatives to help take care of the baby`."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我这边的话，可能我会全职在家带孩子，毕竟我老婆工资比我高太多了",
          "en": "In my case, I would probably stay at home full-time to take care of the child, after all, my wife's salary is much higher than mine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "选靠谱的托班，离工作地点近一些，方便接送。我娃 8 个月就进托班，现在两岁多。算是扛过了最难的阶段。",
          "en": "Choose a reliable daycare center that's close to your workplace for easy drop-off and pick-up. My child entered daycare at 8 months old and is now over two years old. We've made it through the most difficult phase."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "花钱雇个人，父母当监工",
          "en": "Hire someone and have the parents supervise."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实不生是最好的选择，我现在很痛苦",
          "en": "Actually, not having children is the best choice. I'm in a lot of pain right now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是过来人， 老婆有产后抑郁倾向，让老婆全职带娃会很大风险。前期都是请保姆 ，比老婆工资还高。2 岁后托班",
          "en": "As someone who's been there, if the wife has a tendency towards postpartum depression, having her take care of the baby full-time would be very risky. In the early stages, we hired a nanny, which cost more than my wife's salary. Daycare after 2 years old."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@carlinglm 注意选择有责任心的园长、班主任和保育员就行。现在各地政府都在加强这方面的基础服务建设，常常会有机构评选和推荐，选到自己放心的就没问题。我们选的机构是和师范类、卫生保健类学校合作的，算是实习和示范基地，宝宝吃喝拉撒的照顾不比我们自己照顾的差。",
          "en": "@carlinglm Just be sure to choose a responsible principal, homeroom teacher, and caregiver. Local governments are now strengthening the construction of basic services in this area, and there are often institutional evaluations and recommendations. It is no problem selecting one that you are comfortable with. The institution we chose cooperates with normal and health care schools and is considered an internship and demonstration base. The care for our baby's eating, drinking, and excretion is not worse than what we would have done ourselves."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "0-3 岁，找个老人当监工，看着保姆干活3 岁后上幼儿园上学了，带娃压力就小多了。看看能不能男女一方找个下班早点的工作，就自己带吧我个人孩子 3 岁之后就两人自己带了",
          "en": "From 0-3 years old, find an elderly person to supervise the nanny. After 3 years old, when they go to kindergarten and school, the pressure of raising children will be much less. See if one of you (male or female) can find a job that gets off work earlier and take care of the child yourself. I personally raised my child ourselves after they turned 3."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前都是我们自己带，我媳妇辞职带娃，现在大一点了，我妈妈也过来了",
          "en": "We took care of them ourselves before. My wife quit her job take care of the child, and now that the child is older, my mother is also here."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "媳妇辞职在家带娃，就是媳妇有点辛苦。其他都弄的很好。",
          "en": "My wife quit her job at home to take care of the children, so she is a bit tired. Everything else is fine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 装摄像头，找靠谱渠道请育儿嫂。2. 其中一个人全职带娃，或者找个时间灵活的远程办公工作。实在没钱就只能接受可能养得不太好，要想养得好就只能接受花钱多。",
          "en": "1. Install cameras and hire a nanny through reliable channels. \n2. One of you takes care of the baby full-time, or find a remote job with flexible hours. If you really don't have money, you can only accept that the child may not be raised very well. If you want to raise the child well, you can only accept spending more money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "(很可能是一种不适合繁殖的场景",
          "en": "(It is very likely a scenario not suitable for reproduction"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wzy44944 全职带娃少一半家庭收入，而且另外一半少了一个上升期的事业。这损失比请保姆大多了。我司很多女程序员就是顾全托的保姆。因为她自己工资不低，请个全托的保姆还能顺手把一些简单的家务包了",
          "en": "@wzy44944 Staying at home full-time to take care of the baby means losing half of the household income, and the other half loses a career in its growth phase. This loss is much greater than hiring a nanny. Many female programmers in my company are just using full-time nannies. Because their own salary is not low, hiring a full-time nanny can also take care of some simple housework."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我太太已经 5 年没有上班了，但是带孩子还是让彼此精疲力尽——尤其是在孩子生病的时候。",
          "en": "My wife hasn't worked for 5 years, but taking care of our child is still exhausting for both of us - especially when the child is sick."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@horaceray #63 就我个人的理解，这个亲戚大概率只有 我姑和我姨两种选择1 、给不给钱？如果给钱，为什么不找外面的保姆，如果不给钱，就算我姑我姨我也开不了口。2 、专业上，亲戚肯定不如外面的保姆强，而且 保姆是 雇佣关系，还可以要求对方按自己的方式来，亲戚和你的方式不相同的时候怎么弄？保姆觉得不行，你还可以换，亲戚你觉得带的不好，怎么办？3 、万一小孩子有点小磕碰，你可以骂保姆，亲戚你怎么说？4 、如果是保姆，大概率不会住你家吧，如果是亲戚是不是还住你家，或者你给她在附近租房子？如果是住家，会不会特别不方便？我们家那边也没有这个习惯，所以我才觉得  `找熟悉的亲戚过来带娃` 这种 不可思议的选项。有时候人情真的很贵很贵的。",
          "en": "@horaceray #63 In my personal understanding, the relative is most likely either my aunt or my aunt. \n1. Do you pay them? If you pay them, why not find an outside nanny? If you don't pay them, I can't bring it up even to my aunt or aunt. \n2. Professionally, relatives are definitely not as skilled as outside nannies, and nannies have an employment relationship, and you can ask them to do things your way. What if the relative's way is different from yours? If the nanny doesn't like it, you can change them. What if you think the relative isn't taking care of the child well? \n3. If the child gets a minor bump or bruise, you can scold the nanny. What do you say to a relative? \n4. If it's a nanny, they probably won't live with you, right? If it's a relative, will they live with you, or will you rent them an apartment nearby? If they live with you, won't it be especially inconvenient? We don't have this custom in my area, so I find the option of `asking familiar relatives to help take care of the baby` unbelievable. Sometimes favors are really, really expensive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@QlanQ 可能 OP 没说完整，我就是找的熟悉的亲戚来带娃，但是是付工资的，毕竟亲戚能靠谱点。",
          "en": "@QlanQ Maybe OP didn't say it completely. I also found a familiar relative to take care of the baby, but I paid them, after all, relatives can be more reliable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很多人说老婆辞职在家带,我不是很建议.第一:带娃是很累很累的,让你老婆突然脱产带娃,可能还得自己做饭,日复一日,极有可能不适应,而且小孩晚上大概率还得你老婆带着睡,她会非常累第二:一旦脱产带娃,后面再工作多少也会有影响宁愿你们俩都上班,请人带娃",
          "en": "Many people say the wife should quit her job to take care of the baby at home, but I don't really recommend it. First: Taking care of a baby is very, very tiring. Suddenly letting your wife take care of the baby and possibly have to cook every day, day after day, may very likely not be good, and the child probably still has to sleep with your wife at night, and she will be very tired. Second: Once she quits her job to take care of the baby, it will affect her ability to work later. I would rather you both work and hire someone to take care of the baby."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "比较合理的就是，你老婆如果收入不高，就辞职吧。因为孩子这个事咋说呢，谁带和谁亲。我想你应该明白这个厉害关系。鱼和熊掌不可兼得",
          "en": "The more reasonable thing to do is, if your wife's income is not high, then she should quit her job. Because when it comes to children, whoever takes care of them is who they are closest to. I think you should understand this important relationship. You can't have both a fish and a bear paw."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.不建议全职带娃，收入和事业能保证家庭的稳定经营2.白天请保姆，晚上自己带，家里装摄像头查看白天保姆照顾孩子的情况",
          "en": "1. Don't recommend full-time childcare, income and career can ensure the stable operation of the family. 2. Hire a nanny during the day, take care of the child yourself at night, and install cameras at home to check the nanny's care of the child during the day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我家小朋友 1 岁多，现在在公司附近找了个托班，上班送过去，下班接回家。托班最小有 6 个月的，估计是双职工休完产假就送托班的。",
          "en": "My child is over 1 year old and now I have found a daycare center near my company. I send them there when I go to work and pick them up after work. The youngest in the daycare center is 6 months old, presumably dual-income families send them there after finishing their maternity leave."
        }
      ],
      "type": "replies"
    }
  ]
}