{
  "id": 1015388,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想给老父亲半个流量卡，有推荐的吗",
          "en": "I want to get my dad a data package. Any recommendations?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "之前给老爹办的卡是移动冰淇淋卡 59/月  200M 宽带、100 分钟通话和 10G 流量，不过他外地干活有时候 10G 流量捉襟见肘，找我说几次想办个流量卡，不过他并不是每个月都需要，而且再多 10G 左右我感觉就够他用的了，看了下流量卡，大部分是套路起初便宜一两年后恢复原套餐，而且对他来说流量太多，不太合适。\r\n总结一下，理想的流量套餐\r\n\r\n* 月租尽量在 20 以内\r\n* 流量 10G 以上\r\n* 不要套路套餐\r\n* 通话功能不是刚需，主卡就可以了\r\n* 最好可以弹性付费，不用流量的月份少一点月租\r\n\r\n其实之前米粉卡之类的很合适，可惜早就停办了，2024 不知道还有类似的套餐吗",
          "en": "I previously got my dad a China Mobile Ice Cream card for 59 yuan/month, which included 200M broadband, 100 minutes of calls, and 10G of data. However, he works in other places and sometimes 10G of data is not enough. He has asked me several times to get him a data package, but he doesn't need it every month, and an additional 10G or so would be enough for him. I looked at the data packages, and most of them are scams that are cheap for the first year or two and then revert to the original package, and there's too much data for him, which is not suitable.\r\nIn summary, the ideal data package:\r\n\r\n* Monthly rental should be less than 20 yuan.\r\n* Data should be more than 10G.\r\n* No deceptive packages.\r\n* Call function is not a necessity, the main card is enough.\r\n* It is best to have flexible payment, with a lower monthly rental for months when no data is used.\r\n\r\nActually, the Xiaomi Mi Fan card used to be very suitable, but it has been discontinued. Does anyone know if there are similar packages available in 2024?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "给一整个不好吗？",
          "en": "Why not just give him a whole one?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liaojl 找到了https://m.10099.com.cn/h5wap/busiClient/account/huiminCard/index.html?chanId=VCH020001187",
          "en": "@liaojl Found it: https://m.10099.com.cn/h5wap/busiClient/account/huiminCard/index.html?chanId=VCH020001187"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jeffw #7 笑死 我就是进来找这条回复的",
          "en": "@jeffw #7 LOL, I came here to find this reply."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "sim.quickso.cn",
          "en": "sim.quickso.cn"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "主卡改成移动芒果卡套餐就够用了，20g 通用+30g 定向+宽带 价格一样",
          "en": "Just change the main card to the China Mobile Mango card package. It has 20g of general data + 30g of targeted data + broadband, and the price is the same."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://haokawx.lot-ml.com/Product/Index/376076这里很多，要看地区发货的",
          "en": "https://haokawx.lot-ml.com/Product/Index/376076 There are many here, but it depends on the region for delivery."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己套餐流量溢出的话可以考虑办张副卡共享",
          "en": "If your own package has excess data, you can consider getting a secondary card to share it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前在 v 站看到一个广电的年付套餐，折合下来大概 16 块左右？好像是 100G 流量，找不到链接了。不过广电的号段不好，只适合当流量卡，打电话容易被当作骚扰电话。",
          "en": "I saw a China Broadcasting Network annual package on V2EX before, which costs about 16 yuan per month? It seems to be 100G of data, but I can't find the link. However, the CBN number segment is not good and is only suitable as a data card. Making calls is easy to be mistaken for harassment calls."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我去年办的 20 块钱月租的电信卡，每月 150G 流量，根本用不完",
          "en": "I got a China Telecom card last year for 20 yuan per month with 150G of data per month, which I can't use up at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liaojl  你这个是一年一共 100GB  还是每月 100GB.",
          "en": "@liaojl Is that a total of 100GB per year or 100GB per month?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "广电卡要看有没有移动 5g",
          "en": "You need to check if the CBN card has China Mobile 5G coverage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@neilp 网上有晒 app 套餐详情页的，是每月 100G",
          "en": "@neilp There are screenshots of the package details page of the app online, and it is 100G per month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你先看一下年龄限制，大部分优惠流量卡都限制 60 岁或 65 岁办理。另外，目前新办的套餐基本上都是长期 29 元起，低于 29 元的优惠期基本上最长 2 年。",
          "en": "First, check the age restrictions. Most discounted data packages are limited to people aged 60 or 65 and older. In addition, newly offered packages are now basically 29 yuan or more for the long term, and the promotion period for packages below 29 yuan is basically no more than 2 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@snw 用卤煮的身份证办呗，啥卡都能办，现在好多都可以线上销户了",
          "en": "@snw Just use the OP's ID card to get one. You can get any card, and many can be cancelled online now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://www.yitong.wiki/order/onLineGD20240112View01?siteid=8498&sign=fsfsad&mid=1001110&prodid=4045&wx_aid=13938017672&tid=13950758072&gdt_vid=wx0dhvichmw5g5cs00&wx_traceid=wx0dhvichmw5g5cs009 块钱一个月 190G",
          "en": "https://www.yitong.wiki/order/onLineGD20240112View01?siteid=8498&sign=fsfsad&mid=1001110&prodid=4045&wx_aid=13938017672&tid=13950758072&gdt_vid=wx0dhvichmw5g5cs00&wx_traceid=wx0dhvichmw5g5cs00 9 yuan a month for 190G."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "10G 流量，我觉得订个流量包就能解决了。",
          "en": "For 10G of data, I think subscribing to a data package would solve the problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "满 50 岁就可以办理“暖心流量包”了，10 元 10g ，20 元 20g ，可以在移动 App 办理（底下菜单栏服务那里）另外，发送 7226 给 10086 ，可以连送 12 个月每月 2g 的通用流量，能白嫖一点是一点。",
          "en": "If you are over 50 years old, you can apply for the 'Warm Heart Data Package', which is 10 yuan for 10g and 20 yuan for 20g. You can apply in the China Mobile App (in the service section of the bottom menu bar). In addition, send 7226 to 10086 to get 2g of general data per month for 12 consecutive months. Every little bit helps."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liaojl 不是，你这个 100G 是每个月还是每年？",
          "en": "@liaojl No, is that 100G per month or per year?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就直接把现在的套餐改芒果卡套餐就行了，20g 流量 100mins 300m ，月租还是 59",
          "en": "Just change the current package to the Mango card package. It's 20g of data, 100mins, 300m, and the monthly rent is still 59."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "b 站直接搜流量卡。我之前是办的电信 29 一个月 150g 的，然后提前充值 100 多块会每个月返还 10 元。相当于 19 元/月。",
          "en": "Search for data packages directly on Bilibili. I previously got a China Telecom package for 29 yuan a month with 150g, and then I got a 10 yuan refund every month for pre-charging over 100 yuan, which is equivalent to 19 yuan/month."
        }
      ],
      "type": "replies"
    }
  ]
}