{
  "id": 1019431,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "你们用的是哪个运营商的手机卡，什么套餐，月租多少？话费太多，怎么最大化变现呢？",
          "en": "Which carrier's SIM card are you using, what plan, and how much is the monthly rent? There's too much phone credit, how can I maximize its monetization?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "运营商：联通\r\n套餐：广东流量王纯享版 + 58 元低消 （ 103G 高速流量，限速不限量流量，100 分钟通话时长，300 短信，200M 宽带）\r\n月租：58 元\r\n剩余话费：1W+",
          "en": "Carrier: China Unicom\r\nPlan: Guangdong Flow King Pure Enjoy Edition + 58 yuan minimum consumption (103G high-speed traffic, speed-limited unlimited traffic, 100 minutes of talk time, 300 SMS, 200M broadband)\r\nMonthly rent: 58 yuan\r\nRemaining phone credit: 10,000+ yuan"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "最多的时候话费 3 万多，营业厅当时给了一万充值卡，剩下两万一个月营业厅才给退回来，平时没有营业厅大额缴费了",
          "en": "The most I had was over 30,000 yuan in phone credit. The service hall gave me a 10,000 yuan recharge card at the time, and the remaining 20,000 yuan was refunded by the service hall a month later. I usually don't make large payments at the service hall."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总支出=239-240= -1 元武汉电信：总资费 239 。199 套餐+40 升级 100M 上行，4g 十全十美，2 条宽带（ 1000M ，100M ），2 条 IPTV ，40G 流量不限速，2 张副卡宽带跑 PCDN ，8 元/天，收入 240/月",
          "en": "Total expenditure = 239-240 = -1 yuan Wuhan Telecom: Total cost 239. 199 plan + 40 to upgrade 100M upload, 4g perfect, 2 broadband (1000M, 100M), 2 IPTV, 40G traffic unlimited, 2 secondary card broadband running PCDN, 8 yuan/day, income 240/month"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "运营商：0755 联通套餐：广东流量王纯享版 49 元（ 103G 高速流量，100 分钟通话时长，0 短信，1000M 宽带）月租：原本也是 58 低消，谈完心后变成 29 手机套餐+20 元千兆宽带",
          "en": "Carrier: 0755 China Unicom Plan: Guangdong Flow King Pure Enjoy Edition 49 yuan (103G high-speed traffic, 100 minutes of talk time, 0 SMS, 1000M broadband) Monthly rent: Originally it was also 58 minimum consumption, after chatting it became 29 mobile phone package + 20 yuan gigabit broadband"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "官方 APP 有很多话费支付的会员，二三十一个月，然后每月领一个各大平台的会员、支付券、E 卡什么的。",
          "en": "The official APP has many membership options for paying with phone credit, costing twenty or thirty yuan a month, and then each month you can receive a membership for various platforms, payment coupons, e-cards, etc."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "两张卡都是 5 块钱月租，以前还是五星客户，现在只有一星了 ;(",
          "en": "Both cards have a monthly rent of 5 yuan. I used to be a five-star customer, but now I'm only one-star ;("
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一万的话费余额咋来的？正常充值进去的，销户可以取回",
          "en": "How did you get a balance of 10,000 yuan? It was from normal top-ups, you can get it back by canceling the account."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@opengps 来源有点年头了，之前有充值活动充 2 千话费，送 1 千电子券啥。后面是断断续续的 5 折以下的充值。主号，销不得。",
          "en": "@opengps The source is a bit old, there were recharge activities before where you recharge 2,000 phone credit and get a 1,000 electronic coupon. Later, there were intermittent recharges at 50% off or less. It's my main number, I can't cancel it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gh0st 怎么个谈心法，应该很久以前的事情了吧？现在各种低销已经下架了。你这套餐很划算啊。",
          "en": "@gh0st How did you have that conversation? It must have been a long time ago, right? All kinds of low-consumption plans have been removed now. Your plan is very cost-effective."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SherlockKevin 联通现在好像搞了个新的星级，判断依据是每个月的消费。",
          "en": "@SherlockKevin It seems that China Unicom has a new star rating system, which is based on monthly consumption."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JerryLee13 去年 11 月找客服谈的，每月话费减了 20 ，宽带 20 升级到千兆，你也可以试试。",
          "en": "@JerryLee13 I talked to customer service last November, and my monthly phone bill was reduced by 20, and the broadband was upgraded to gigabit for 20. You can also try it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "绝版联通老王卡，月租 19 ，300 短信，100 通话，70G 通用，40G 定向，200M 宽带",
          "en": "Out-of-print Unicom Old Wang card, monthly rent 19, 300 SMS, 100 calls, 70G general, 40G dedicated, 200M broadband"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "携号转网 理论上可以提现？",
          "en": "Number portability can theoretically be cashed out?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "电信 9 元，280GB ，半年后 29 ，所以到时候换卡",
          "en": "Telecom 9 yuan, 280GB, 29 after half a year, so I'll change the card by then."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "运营商：010 联通（ 1 主卡 4 副卡）套餐：4G 畅爽冰激凌国内流量任性用套餐（钉钉版）-99 元/月（ 5 折）-折后 49.5 元5G 联通云盘普享版-10 元/月1 元 100 分钟羊毛包-1 元/月4 张 0 元副卡，可 5 个家庭（未开通）月租：60.5 元（ 49.5+10+1 ）（ 手动双不限，400 分钟通话，0 短信，1G 速率，VVIP ，2T 联通云盘）运营商：江西联通套餐：冰激凌专属 5G 套餐（钉钉版）-129 元/月（ 3 折 2 年 1 续）-折后 38.7 元存费送费存 240 送 480 （每月送 20 元送 24 个月）月租：18.7 元（ 38.7-20 ）（ 30G ，钉钉定向双不限，500 分钟通话，0 短信，500MB 速率，1000M 宽带，每月可领 1 个视频会员）",
          "en": "Carrier: 010 China Unicom (1 main card, 4 secondary cards) Plan: 4G Refreshing Ice Cream Domestic Traffic Unlimited Use Package (DingTalk Edition) - 99 yuan/month (50% off) - 49.5 yuan after discount 5G Unicom Cloud Disk Universal Edition - 10 yuan/month 1 yuan 100 minutes wool package - 1 yuan/month 4 0 yuan secondary cards, available to 5 families (not activated) Monthly rent: 60.5 yuan (49.5+10+1) (Manual dual unlimited, 400 minutes of call, 0 SMS, 1G speed, VVIP, 2T Unicom Cloud Disk) Carrier: Jiangxi Unicom Plan: Ice Cream Exclusive 5G Package (DingTalk Edition) - 129 yuan/month (30% off for 2 years and 1 renewal) - 38.7 yuan after discount Deposit fee to send fee Deposit 240 to send 480 (20 yuan per month for 24 months) Monthly rent: 18.7 yuan (38.7-20) (30G, DingTalk dedicated dual unlimited, 500 minutes of call, 0 SMS, 500MB speed, 1000M broadband, 1 video membership can be received every month)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "lz 可以研究下怎么把话费套现啊",
          "en": "LZ, you can research how to cash out the phone credit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@meishiwanwan520 老哥牛逼！",
          "en": "@meishiwanwan520 Awesome, bro!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jiangyang123 对啊，这就是我发帖子的目的。",
          "en": "@jiangyang123 Yes, that's the purpose of my post."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同套餐, 但是我用两张卡, 然后手机开热点当宽带用.",
          "en": "Same package, but I use two cards, and then I use my phone as a hotspot for broadband."
        },
        {
          "zh": "我想知道那个宽带是手机累计开各种服务叠到 58 块钱月租, 然后就免费送一条宽带吗?",
          "en": "I want to know if the broadband is a free broadband service that's bundled with a bunch of services that amount to 58 yuan a month?"
        },
        {
          "zh": "一直想知道非归属地的能不能拉, 最近老家快交房了, 想拉一条到新家去.",
          "en": "I've always wanted to know if you can get service outside your home province. My hometown house is about to be delivered, and I want to get broadband installed there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "携号转网  可以提现",
          "en": "Number portability can be cashed out"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我知道消号可以退余额到银行卡，可能携号转网也行？可以去问问",
          "en": "I know that cancelling the account can refund the balance to the bank card, maybe number portability works too? You can ask."
        }
      ],
      "type": "replies"
    }
  ]
}