{
  "id": 1016157,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "安徽农村赌博的风气有多严重？",
          "en": "How serious is the gambling habit in rural Anhui?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我们县城属于安徽一个穷县城，大家基本都在外面打工或者做生意。\r\n每年回家，唯一的娱乐活动就是赌博。动辄几千上万的输赢，无论男生女生，老年人小孩子。\r\n而且酒席从初一到初九，各种理由的酒席，满月酒，周岁，十岁，腿摔了。\r\n份子钱 500 起步，打麻将抽水也要抽很多，乐此不疲。",
          "en": "Our county town belongs to a poor county in Anhui. Everyone is basically working outside or doing business.\r\nEvery year when I go home, the only entertainment activity is gambling. The win or loss is often several thousand or tens of thousands, regardless of whether it's boys, girls, the elderly, or children.\r\nMoreover, there are banquets from the first to the ninth day of the Lunar New Year, banquets for various reasons, full moon celebrations, one-year-old birthdays, ten-year-old birthdays, and even for broken legs.\r\nThe gift money starts from 500, and a lot of money is also taken from playing mahjong, and they enjoy it."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "底层有点奶头乐也无所谓的。不杀人不放火，已经很好了。",
          "en": "It doesn't matter if the bottom class has a little bit of entertainment. If they don't kill or set fires, it's already very good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们大家族里几乎个个赌钱他们把我当作例外但是如果把 a 股算上按亏钱来说我才是那个最大的赌徒",
          "en": "Almost everyone in our big family gambles; they consider me the exception, but if you count A shares, I am the biggest gambler in terms of losing money"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐标浙北，据我粗略观察，我这边赌博越来越少了，我想主要还是大家生活水平上去了，娱乐代尝体系太丰富了，基本上过年都去旅游了，远点的去北京，三亚这些。近点就附近自驾爬爬山什么的。另外现在手机方便，抖音，手游啊。反而是打牌的真的越来越少，除了个别老古董，其他的很少了。",
          "en": "Located in northern Zhejiang, according to my rough observation, gambling is decreasing here. I think the main reason is that people's living standards have improved, and the entertainment system is too rich. Basically, everyone goes traveling during the New Year; some go to Beijing, Sanya, and other far places. Some go for self-driving trips and climb mountains nearby. In addition, mobile phones are convenient now; there are Douyin and mobile games. On the contrary, fewer and fewer people play cards, except for a few old-fashioned people. Other people play very little."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "城里玩股票玩彩票可以 农村打打牌打打麻将咋了",
          "en": "It's okay to play stocks and lotteries in the city, so what's wrong with playing cards and mahjong in the countryside?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "皖南安庆农村：酒席只有这几种：  a. 结婚（这个过年最多）  b. 大学升学酒（一般暑假就办了）  c. 新房入住（一般不在过年的时候）酒席对象：  a. 一般是本组村民（一个自然村下面分多个组，每个组一般都是一个姓，可以理解是一个祖先），这个一般随礼很少，基本意思一下就行了，每家一般一个人参加  b. 亲戚，这个随礼会根据各自情况和亲戚关系远近，一般几百左右赌博：大部分情况只能算是娱乐，算不上赌博，一方面持续时间短就过年几天而且其他事情也多（祭祖、拜年），确实很多打工人回来没事干，除了打牌好像也没啥有意思的",
          "en": "Rural Anqing in southern Anhui: there are only a few types of banquets: a. Marriage (this is the most during the New Year) b. University enrollment banquet (usually held during summer vacation) c. New house entry (usually not during the New Year) Banquet guests: a. Generally, it is the villagers of the group (a natural village is divided into multiple groups, and each group usually has the same surname, which can be understood as an ancestor). The gifts are generally small, and it is basically a formality, and usually one person from each family participates. b. Relatives, the amount of the gift will depend on their respective situations and the distance of relationships with relatives, usually around a few hundred Gambling: In most cases, it can only be regarded as entertainment, not gambling. On the one hand, the duration is short, only a few days of the New Year, and there are many other things (ancestor worship, New Year greetings). It's true that many migrant workers are back and have nothing to do, and it seems that there's nothing interesting other than playing cards."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这些跟大 A 比玩的都算小的了",
          "en": "These are all small compared to playing with the big A."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@FreshOldMan #22 安庆既不是皖南也不是皖北，皖中偏南",
          "en": "@FreshOldMan #22 Anqing is neither southern nor northern Anhui; it's in central Anhui, leaning south."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@FreshOldMan 皖北行署区 只是一个历史存在的过渡性的行政区化，和现在的 北 中 南 不是一回事",
          "en": "@FreshOldMan The Northern Anhui Prefectural Administrative Region was just a historical transitional administrative division and is not the same as the current North, Central, and South."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小赌怡情，过年么乐呵乐呵得了，赌注太大可不好",
          "en": "Small gambling is fun. It's okay to have fun during the New Year, but too big a stake is not good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪都一样",
          "en": "The same everywhere."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "社交",
          "en": "Socializing"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喜欢赌？来玩末日期权啊",
          "en": "Like gambling? Come and play with terminal options"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这赌博可能有些人白干一年啊",
          "en": "This gambling might mean some people have worked for nothing for a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "安徽不是挺火吗现在，黟县什么的。",
          "en": "Isn't Anhui quite popular now, such as Yixian?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "浙北，现在赌博比较少了，过年会有一些，几百的输赢那种年酒几乎不办了，大家都嫌麻烦周岁酒都有，满月有些不办的，十岁是什么鬼，没听说过病愈出院也有办酒席的，不过不随份子，因为探望的时候一般已经送过礼了这边办酒席几乎不挣钱，只有亲戚随份子，而且很少，本家/同姓不随份子。物料人工都很贵，而且还要回礼，不随份子的本家一样有回礼",
          "en": "Northern Zhejiang, gambling is less common now. There will be some during the New Year, the win or loss of a few hundred. Those New Year banquets are hardly held anymore; everyone thinks it's troublesome. One-year-old birthday parties are still held, and some full moon celebrations are not held. What the hell is a ten-year-old birthday party? I haven't heard of banquets being held for recovery from illness or leaving the hospital, but no gifts are given because gifts are usually already given during the visit. It's almost impossible to make money by holding banquets here; only relatives give gifts, and few do. Those of the same clan/surname don't give gifts. Materials and labor are very expensive, and you have to give gifts in return, and the members of the same clan/surname who don't give gifts also receive returns."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "农村除了赌博没有其他的娱乐方式了",
          "en": "There are no other forms of entertainment in the countryside except gambling."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一样  老家氛围就是吃喝嫖赌在行，其他啥都不行。",
          "en": "Same, the atmosphere in my hometown is that they are good at eating, drinking, whoring, and gambling, and nothing else."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一年到头也就过年那几天，不至于，过年回家我们可以玩游戏约人逛街，老一辈能干吗，打个牌怎么了，我们这边一般一个人输到上千同桌就不会让他继续了，都是乡里乡亲的输多了不好看",
          "en": "It's only those few days during the New Year throughout the year, it's not that serious. When we go home for the New Year, we can play games and go shopping with people. What can the older generation do? What's wrong with playing cards? Here, generally, if a person loses over a thousand, we won't let him continue, as we are all villagers from the same village; it's not good to lose too much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过年打麻将玩几天也就几百块，娱乐一下。",
          "en": "Playing mahjong for a few days during the New Year is only a few hundred yuan; it's just for entertainment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "娱乐活动的缺失吧，如果大家都有别的事情可以干，就会好一点",
          "en": "The lack of entertainment, if everyone had other things to do, it would be better."
        }
      ],
      "type": "replies"
    }
  ]
}