{
  "id": 1014002,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "24 年了，想换个手机",
          "en": "It's been 24 years, I want to change my phone"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "现在用的是华为荣耀 20pro ，3 年了，最近屏幕砸了，想直接换个新的。\r\n\r\n几乎不玩手游，不追求手游性能，不太拍照也不需要啥特别好的摄像头。\r\n想要个价位 2500 左右，不超过 3000 ，电池容量大，存储 512g ，耐用的手机，求各位推荐下。\r\n最好能买个 5 年质保啥的方便我保修更换损坏的配件。",
          "en": "I am currently using a Huawei Honor 20pro, it's been 3 years. Recently the screen broke, and I want to replace it directly with a new one.\r\n\r\nI hardly play mobile games, I don't pursue mobile game performance, I don't take many photos, and I don't need a particularly good camera.\r\nI want a phone priced around 2500, not exceeding 3000, with a large battery capacity, 512g storage, and a durable phone. Please recommend some.\r\nIt's best if I can buy a 5-year warranty to make it convenient for me to repair and replace damaged parts."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "红米 note12t 16+1T 不到 2K",
          "en": "Redmi note12t 16+1T under 2K"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "IQQO 11s",
          "en": "IQQO 11s"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别买太贵的，我买某米折叠屏后悔死了，刚开始用着是挺爽，摔了一次 4900 心痛大半年了，现在 2 只手捧着用，买了个祖宗。下一台我必不能超过 2500 。另外你这个价位我只能给你一个错误答案，排除 nova11SE",
          "en": "Don't buy too expensive ones. I regret buying a Xiaomi foldable screen. It was great at the beginning, but I dropped it once and it cost 4900, I was heartbroken for half a year. Now I have to hold it with both hands, I bought an ancestor. The next one I buy must not exceed 2500. Also, at this price point, I can only give you a wrong answer, excluding nova11SE"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红米、iqoo 、一加、等中端机都符合你的需求",
          "en": "Redmi, iqoo, OnePlus, and other mid-range phones all meet your needs"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一加 ace3",
          "en": "OnePlus Ace 3"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "需求跟我类似，现在用的是 k60pro （用了快一年），感觉还不错",
          "en": "Similar needs to me, I'm currently using k60pro (used for almost a year), feels pretty good"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首推蓝绿两厂包括一加，然后再是小米红米",
          "en": "First recommend the blue and green factories including OnePlus, then Xiaomi and Redmi"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小米 13",
          "en": "Xiaomi 13"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "安卓机说实在 2.5k 左右的很难用 5 年, 我以前刚工作时一直用红米, 配置看起来还蛮高的, 但是用了不到一年那破系统更新后就变卡了. 楼主不如趁此机会多加 2k 上 iPhone",
          "en": "Honestly speaking, it's difficult to use an Android phone around 2.5k for 5 years. I used Redmi when I first started working, its configuration seemed quite high, but after less than a year after the system update, it became laggy. The OP should take this opportunity to add another 2k to get an iPhone"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红米 k70 系列都不错，需要大电量的话建议 k70e 足够用，我 k50 标准版用了 3 年了依然坚挺",
          "en": "The Redmi k70 series are all good. If you need a large battery, the k70e is sufficient. I have been using the k50 standard version for 3 years and it's still going strong"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Haku 蓝厂：vivo 的，包含 vivo 跟 iqoo  绿厂：oppo ，包含 oppo 跟 realme  你看他两家 logo 颜色",
          "en": "@Haku Blue factory: Vivo's, including Vivo and iqoo. Green factory: Oppo, including Oppo and realme. Look at the logo colors of the two companies"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@weijancc 你也说了，刚工作的时候。是时候换个安卓改观下了。。。",
          "en": "@weijancc You also said that when you first started working. It's time to change an Android phone to refresh your view..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "magic5pro 。你这需求最好挑着上代旗舰买，设计细节和做工比当代性价比机型好得多。",
          "en": "magic5pro. For your needs, it's best to choose the previous generation flagship model, the design details and workmanship are much better than the current cost-effective models."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "realme gtneo5 se     16+1TB  PDD 上才 1790 。",
          "en": "realme gtneo5 se 16+1TB only 1790 on PDD."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这种不追求手机性能的，继续用荣耀也行，不用烦",
          "en": "For someone like you who doesn't pursue phone performance, it's also okay to continue using Honor, no need to worry"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@IAMQ 现在的小米 13 价格真香，喜欢小屏绝对首选",
          "en": "@IAMQ The price of Xiaomi 13 is really good now, it's definitely the first choice for those who like small screens"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Philippa 24u ，等港版跳完水就很香了",
          "en": "@Philippa 24u, it will be really good when the Hong Kong version drops in price."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "根据 op 的预算，喜欢曲面屏一加 ACE3 ，直面屏红米 K70",
          "en": "Based on the OP's budget, if you like curved screen, OnePlus ACE3, if you like flat screen, Redmi K70"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Falcon1 不太懂，蓝绿两厂是啥？我手机关注得少。",
          "en": "@Falcon1 I don't really understand, what are the blue and green factories? I don't pay much attention to phones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Haku 蓝厂系统更流畅，绿厂硬件更高调教稀碎",
          "en": "@Haku The blue factory's system is smoother, the green factory's hardware is higher, but its tuning is terrible"
        }
      ],
      "type": "replies"
    }
  ]
}