{
  "id": 1017442,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "遇到一个现实问题，有小孩后谁来照顾？",
          "en": "Facing a real problem, who will take care of the child after having one?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "- **情况** ：我和老婆老家河南农村，已在上海落户，孩子刚出生两个月，目前我妈和老婆在家照顾，老婆 5 月产假结束，我妈一个人照顾。",
          "en": "- **Situation**: My wife and I are from rural Henan, we have settled in Shanghai, and our child is two months old. Currently, my mother and my wife are taking care of the child at home. My wife's maternity leave ends in May, and then my mother will take care of the child alone."
        },
        {
          "zh": "- **问题**：我妈只上过两年学，人属于比较老实沉闷的类型，做饭只是基本能吃，育儿知识基本没有，担心以后她独自照顾孩子有困难。",
          "en": "- **Problem**: My mother only went to school for two years and is a relatively honest and taciturn person. She can only cook basic meals, and has basically no knowledge of childcare. I'm worried that she will have difficulty taking care of the child alone in the future."
        },
        {
          "zh": "- **选择**：",
          "en": "- **Options**: "
        },
        {
          "zh": "1. 白天我妈带，夜晚我俩带，三岁以后白天幼儿园，夜晚我俩带。",
          "en": "1. My mother takes care of the child during the day, and we take care of the child at night. After three years old, the child goes to kindergarten during the day and we take care of the child at night."
        },
        {
          "zh": "2. 请保姆，但是担心保姆的人品和耐心，毕竟不是自己的孩子。",
          "en": "2. Hire a nanny, but worry about the nanny's character and patience, after all, it's not their own child."
        },
        {
          "zh": "3. 我 or 我老婆全职带娃，经济来源就会不足，生活更困难。",
          "en": "3. I or my wife take care of the child full-time, which will lead to insufficient financial resources and make life more difficult."
        },
        {
          "zh": "请教 v 友们都是怎么带孩子的，有没有其他更好的选择，谢谢",
          "en": "I would like to ask how you, v-friends, take care of your children. Are there any other better options? Thank you."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "中产返贫三件套：买房、孩子报班、老婆不上班首先排除 3",
          "en": "The three-piece set for the middle class to return to poverty: buying a house, enrolling the child in classes, and the wife not working. First, exclude option 3."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "女方父母愿意来带吗？如果愿意就不错，以后矛盾会少很多。1.三岁前，小孩子吃的压根不会在意口味，基本上奶，和辅食，吃的问题我觉得是小问题2.反倒是育儿理念冲突是个大问题，不过也要看你父母性格能不能接受你们小辈的理念，如果不接受的又强势的，那么后期相处会比较难。3.你的三个选择。第一条，别想着幼儿园后白天幼儿园，非常可能经常生个病在家一个星期两个星期的。",
          "en": "Would the wife's parents be willing to help? That would be great if they are, there would be fewer conflicts later. 1. Before three years old, children don't really care about the taste of food, basically milk and supplementary food, I think the eating problem is a small problem. 2. The conflict of childcare concepts is a big problem, but it also depends on whether your parents' personality can accept the concepts of you younger generation. If they do not accept and are strong-willed, then it will be more difficult to get along later. 3. Your three options. For the first one, don't think about the child going to kindergarten during the day after kindergarten, it's very likely that they will often get sick and stay at home for one or two weeks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "情况跟我有点像，我家娃是 23 年 10 月的。给你的建议：1. 如果奶奶愿意的话奶奶带，你们平时多费费心。家里的“规矩”早点立起来，比如育儿理念以你们夫妻为准，让奶奶多做执行的事情。带小孩主要费心神，并没有那么高的门槛。2. 奶奶年纪大了精力不够或者身体不好的话，可以请育儿嫂，奶奶做监督工作。上海的标准应该和深圳差不多，6000~10000 。咬咬牙扛到上托班的年纪。3. 现在有些托班几个月的小孩也收，上班送去下班接回，费用我不了解我只是知道有这个东西你可以问问周边人或者社区。4. 不要轻易脱产，即使你老婆收入低于育儿嫂的费用，也请谨慎考虑。",
          "en": "The situation is a bit similar to mine, my child was born in October 2023. Here's my advice: 1. If the grandmother is willing, let the grandmother take care of the child, and you should spend more time on it. Establish the \"rules\" of the house earlier, for example, the childcare concept should be based on you and your wife's, and let the grandmother do more of the execution. Taking care of a child mainly requires effort and mental energy, and it doesn't have a high threshold. 2. If the grandmother is old and lacks energy or is in poor health, you can hire a nanny, and the grandmother can supervise the work. The standard in Shanghai should be similar to Shenzhen, 6,000~10,000. Grit your teeth and hold on until the child is old enough for a nursery. 3. Now some nurseries also accept babies a few months old, and you can send them to work and pick them up after work. I don't know the fees, I just know that this thing exists, you can ask people around you or the community. 4. Don't easily take time off work, even if your wife's income is lower than the cost of a nanny, please consider it carefully."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "请保姆，保姆懂育儿的，加上你妈，你妈可以盯着保姆",
          "en": "Hire a nanny, a nanny who understands childcare, and add your mother. Your mother can keep an eye on the nanny."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同在上海，娃今年 8 岁，三岁前我妈在这带过两年时间，带回老家过半年多，两岁半到三岁之间就进了托班，我妈负责接送，三岁之后基本都是我们自己在带早上送去幼儿园/小学，晚上让托班去接，托班能给拖到 7 点半到 8 点到样子，不同托班不一样，正好我们下班能赶上去接，基本都是老婆去接的，加班不多，她要有事或加班的时候，我就去接下孩子吃好，注意身体，目前暂时还未出现过因为生病在家一周两周的情况，不过有在家一两天，两三天的情况，那就夫妻俩轮流请假带，不过这情况也不多自己带必然辛苦，不过能省很多事情，也能深入感受孩子的成长",
          "en": "Also in Shanghai, my child is 8 years old this year. Before the age of three, my mother took care of him here for two years, and took him back to my hometown for more than half a year. Between the ages of two and a half and three, he entered a nursery, and my mother was responsible for picking him up and dropping him off. After the age of three, we basically take care of him ourselves, sending him to kindergarten/primary school in the morning, and letting the nursery pick him up in the evening. The nursery can keep him until around 7:30 to 8 o'clock, different nurseries are different. We can catch up to pick him up after work, and my wife basically goes to pick him up. She doesn't work overtime much, and when she has something to do or works overtime, I will go to pick up the child, make sure he eats well, and pay attention to his health. At present, there hasn't been a situation where he has to stay at home for a week or two due to illness, but there are situations where he stays at home for one or two or three days, then the couple takes turns taking leave to take care of him. However, this situation is not very frequent. Taking care of him yourself will inevitably be hard work, but it can save a lot of things and deeply feel the child's growth."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "丈母娘啥情况？能帮忙带吗？你老婆和你收入咋样，如果请保姆的钱接近你们其中一个人的收入，还不如让一个人全职，等娃上了幼儿园再上班。",
          "en": "What's the situation with your mother-in-law? Can she help take care of the child? What are your and your wife's incomes like? If the cost of hiring a nanny is close to the income of one of you, it's better for one person to work full-time and then go back to work when the child goes to kindergarten."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@goodryb 老人城里呆不惯，心情差，这个确实感觉我妈刚来的时候很不自在",
          "en": "@goodryb Elderly people are not used to living in the city, and they feel unhappy. This is true, I feel my mother was very uncomfortable when she first came here."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "谁污染谁治理，谁生谁养。",
          "en": "Whoever pollutes, should clean up, and whoever gives birth, should raise."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 白天我妈带，夜晚我俩带，三岁以后白天幼儿园，夜晚我俩带。A:  大部分情况下可行，但你得做好和你妈对接的思想工作，什么对孩子有害的，怎么抱孩子的姿势正确，奶粉尿不湿的注意事项。1 岁之前宝宝还是要很多关注的2. 请保姆，但是担心保姆的人品和耐心，毕竟不是自己的孩子。A:  请保姆你以为便宜？相当于经济割一刀出去3. 我 or 我老婆全职带娃，经济来源就会不足，生活更困难。A：慎重，除非你或你老婆两人中有稳定的生活来源，你或你老婆其中失去收入，花对方的钱双方都没有意见（目前来看多少在一段时间后出问题），并且重回职场会有一段不适感，或者没那么顺利回到职场（不然怎么有那么多宝妈到处在网上喊人求带）本质上来说一个人带娃是一项非常心累和琐碎的事情，我孩子刚好一岁，过年期间我一个人几乎带了 7 天：早上 7 点孩子醒来吃奶，吃 200Ml 爱他美奶粉，换衣服，和拉拉裤尿不湿，我一副没睡醒的狗样背着孩子刷牙洗脸。下一步把孩子放安全的地方我换好衣服，之后带孩子出去散步 15 分钟，期间会陪孩子玩到 10 点 30 左右，很快孩子困了要睡到 11 点 10 分左右。这时起来准备食材准备中午饭同时给孩子喂奶。12 点做好饭了，但是要快速吃完。期间会背着孩子洗碗扫地拖地....下午搞搞卫生哄孩子睡觉，要是孩子醒了就领出去溜达。17 点开始做孩子的辅食同时把冰箱的肉拿出解冻。6 点开始做晚饭，期间背着孩子炒菜蒸米饭等等。老婆回来后帮孩子喂辅食，我吃饭后洗碗扫地拖地。大约 20 点给孩子洗澡，这时候孩子一身脏兮兮的只能先手洗刷掉污渍再用洗衣机洗，之后便交给老婆...太多了。期间孩子表现比较抗拒，每一刻都想给他一巴掌",
          "en": "1. My mother takes care of the child during the day, and we take care of the child at night. After three years old, the child goes to kindergarten during the day and we take care of the child at night. A: This is feasible in most cases, but you have to do a good job of communicating with your mother, what is harmful to the child, how to hold the child correctly, and the precautions for milk powder and diapers. Before the age of 1, the baby still needs a lot of attention. 2. Hire a nanny, but worry about the nanny's character and patience, after all, it's not their own child. A: Do you think hiring a nanny is cheap? It's equivalent to cutting a knife out of your finances. 3. I or my wife take care of the child full-time, which will lead to insufficient financial resources and make life more difficult. A: Be cautious, unless one of you or your wife has a stable source of income if one of you or your wife loses income, neither of you has any objections to spending the other's money (it seems that it will be a problem after a period of time), and it will be uncomfortable to return to the workplace, or it will not be so smooth to return to the workplace (otherwise, why are so many mothers asking for help online?). In essence, taking care of a child alone is a very tiring and trivial thing. My child is just one year old, and I took care of him for almost 7 days during the Chinese New Year: at 7 am, the child woke up to drink milk, drank 200 ml of Aptamil milk powder, changed clothes, and put on pull-up diapers. I looked like a sleepy dog, brushed my teeth and washed my face while carrying the child. Next, I put the child in a safe place and changed my clothes, then took the child for a 15-minute walk, during which I would play with the child until about 10:30, soon the child was sleepy and wanted to sleep around 11:10. At this time, getting up to prepare ingredients, preparing lunch and feeding the child at the same time. At 12 o'clock, the meal is ready, but I have to eat it quickly. During this period, I would carry the child and wash dishes, sweep the floor and mop the floor.... In the afternoon, I clean up the hygiene and coax the child to sleep, and if the child wakes up, I take him out for a walk. At 5 pm, starting to make complementary food for the child and taking the meat out of the refrigerator to defrost. At 6 pm, starting to cook dinner, during which I carry the child and stir-fry dishes, steam rice, etc. After my wife comes back, she helps the child feed complementary food, and after I eat, I wash dishes, sweep the floor and mop the floor. At around 8 pm, give the child a bath, at this time the child is covered in dirt, I can only wash off the stains by hand first and then wash it with a washing machine, and then hand it over to my wife... it's too much. During the period, the child performed quite resistant, every moment I wanted to give him a slap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@492 @mumbler 收入不是高到离谱的话，无论如何不推荐另一半脱产，尤其是在大城市，即使他/她的工资收入抵不上育儿嫂。原因有三：1. 带娃并不是一件轻松的事，相比之下只要你不是在什么血汗工厂工作一般都比带娃轻松2. 脱离职场后想回归不是一件轻松的事（参考一开头说的，除非一个人的收入足以养活整个家庭并且可持续）3. 全职爸爸/妈妈的劳动价值往往很难评估，时间久了夫妻感情很容易产生裂缝（还是参考一开头说的，不是大富大贵的家庭不要轻易脱产！）",
          "en": "@492 @mumbler If the income is not ridiculously high, it is not recommended to let the other half quit their job under any circumstances, especially in big cities, even if his/her salary is less than the cost of a nanny. There are three reasons: 1. Taking care of a child is not an easy task, compared to which, as long as you are not working in some kind of sweatshop, it is generally easier than taking care of a child. 2. It is not easy to return to the workplace after leaving (referring to what I said at the beginning, unless one person's income is enough to support the whole family and is sustainable). 3. The labor value of full-time fathers/mothers is often difficult to assess, and it is easy for the relationship between husband and wife to crack over time (also referring to what I said at the beginning, don't easily quit your job unless your family is rich!)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不少同事选择 3 ，生活很拮据。不过没有别的好办法。",
          "en": "Many colleagues choose option 3, and life is very tight. But there is no other good way."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一岁前就是吃喝拉撒，老人能带最好，以后的事情以后再看。问题是压根不提你老婆家准备怎么帮？",
          "en": "Before the age of one, it's just eating, drinking, peeing, and pooping. It's best if the elderly can take care of it, and we'll see what happens in the future. The problem is, there's no mention of how your wife's family is prepared to help?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jasonchen168 小舅子也有娃了，丈母娘要照顾，所以来不了，请保姆的钱低于我老婆的收入",
          "en": "@jasonchen168 My brother-in-law also has a child, and his mother-in-law needs to take care of him, so she can't come. The money to hire a nanny is less than my wife's income."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们是老人带，然后找个钟点工阿姨来给做饭打扫卫生",
          "en": "We have the elderly take care of the child, and then find a part-time housekeeper to cook and clean."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@BeforeTooLate 2.目前矛盾还不多 3.生病在家这个倒是没有考虑，谢谢提醒",
          "en": "@BeforeTooLate 2. There are not many conflicts at present. 3. I didn't consider staying home when the child is sick, thank you for the reminder."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fredweili 老婆家也有小孩要照顾",
          "en": "@fredweili The wife's family also has children to take care of."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@HelloWZ 生活没矛盾就维持现状，几个月的孩子就是喂奶换尿布哄睡觉，以后的事情以后再说",
          "en": "@HelloWZ If there are no conflicts, maintain the current situation. A few months old baby is just about feeding milk, changing diapers, and coaxing to sleep; we will talk about what happens later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有钱就住家育儿嫂，不然就白班育儿嫂，晚上你们两负责洗漱哄睡，睡觉和你妈睡。不然长久必有矛盾",
          "en": "If you have money, hire a live-in nanny; otherwise, hire a daytime nanny. You two are responsible for washing, putting the child to sleep and sleeping with your mother. Otherwise, there will inevitably be long-term conflicts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 请育儿嫂到孩子 2 岁，你妈负责做饭就行2. 2 岁后上托班，无缝衔接幼儿园",
          "en": "1. Hire a nanny until the child is 2 years old, and your mother is responsible for cooking. 2. After 2 years old, the child goes to a nursery and seamlessly transitions to kindergarten."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老人白天带，晚上下班你们自己带。上幼儿园以后就是你们自己带了。知足吧，有老人给带就不错了。",
          "en": "The elderly take care of the child during the day, and you take care of the child yourselves after work. After the child goes to kindergarten, you will take care of the child yourselves. Be content, it's good enough that the elderly can help."
        }
      ],
      "type": "replies"
    }
  ]
}