{
  "id": 1015942,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "3700 字， 80 张图，西藏游记终于写好了！",
          "en": "3700 characters, 80 pictures, the travelogue of Tibet is finally finished!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "如果你年轻时有幸去过西藏，那么你的余生无论去往哪里，西藏永远会与你在一起。\r\n\r\n3700 个字，80 张图，断断续续写了好久......",
          "en": "If you were fortunate enough to visit Tibet when you were young, then no matter where you go for the rest of your life, Tibet will always be with you.\r\n\r\n3700 characters, 80 pictures, I've been writing this on and off for a long time..."
        },
        {
          "zh": "- 公众号文章地址： https://mp.weixin.qq.com/s/8fk4I8JxVHG0vYyJeOXGxg",
          "en": "- WeChat official account article address: https://mp.weixin.qq.com/s/8fk4I8JxVHG0vYyJeOXGxg"
        },
        {
          "zh": "- 博客链接： https://blog.sunguoqi.com/posts/2c20bbfc/",
          "en": "- Blog link: https://blog.sunguoqi.com/posts/2c20bbfc/"
        },
        {
          "zh": "一些说明：",
          "en": "Some notes:"
        },
        {
          "zh": "- 建议阅读微信公众号版本，排版会更好。",
          "en": "- It is recommended to read the WeChat official account version, the layout will be better."
        },
        {
          "zh": "- 文中所有图片，只要是相机拍的，都是直出，无后期。",
          "en": "- All the pictures in the article, as long as they are taken with a camera, are straight out, without post-processing."
        },
        {
          "zh": "- 网站里的图片画质更高清，喜欢哪张可以自取，无需授权。",
          "en": "- The pictures on the website have higher quality, you can take whichever one you like without authorization."
        },
        {
          "zh": "- 如果能关注一下我的公众号，支持一下，我会非常开心。",
          "en": "- If you could follow my WeChat official account and support me, I would be very happy."
        },
        {
          "zh": "[小孙同学 Coding ]  mp.sunguoqi.com",
          "en": "[Xiao Sun's Coding] mp.sunguoqi.com"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "西藏游记，被看成了西游记",
          "en": "The Tibet travelogue was mistaken for Journey to the West"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Preposterous 读万卷书，行万里路。在知中行，在行中知。我的观点是：没必要完全了解一件事情再去做，出发最重要，即使是跟风，也会留下一些难忘的记忆。旅行的目标是去感受，是去阅历，而不是成为某方面的专家。",
          "en": "@Preposterous Read ten thousand books, travel ten thousand miles. Know in action, and know in action. My point is: there is no need to completely understand something before doing it, going is the most important thing, even if you follow the trend, you will leave some unforgettable memories. The goal of traveling is to experience, to gain experience, rather than become an expert in a certain area."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年轻真好",
          "en": "Being young is great"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有意义",
          "en": "Meaningful"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "nice",
          "en": "nice"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要问我子词不子词，我当然是子词的",
          "en": "If you ask me if I support this, of course I do"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@churchmice Way To Explore ~",
          "en": "@churchmice Way To Explore ~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以为是 SOLO ，原来是跟团。看风景，还是最喜欢川西。西藏和新疆都相对单调。",
          "en": "I thought it was SOLO, it turned out to be a group tour. When it comes to scenery, I still like Western Sichuan the most. Tibet and Xinjiang are relatively monotonous."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真不错，原来上次珠海骑行也是你",
          "en": "That's great, it turns out the Zhuhai cycling trip last time was also you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "写的真好，看的也很棒",
          "en": "Well written, and it's also great to read"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dgmgso 某种程度上说，确实是西游记（手动狗头）",
          "en": "@dgmgso In a certain sense, it is indeed Journey to the West (dog head emoji)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@allpass2023 害，主要是通行上不方便。下次去一定自驾～",
          "en": "@allpass2023 Oh, it's mainly inconvenient for transportation. I'll definitely drive there next time ~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sherlockwhite 哈哈哈，是我。不过没有在拉萨骑车（狗头）",
          "en": "@sherlockwhite Hahaha, it's me. But I didn't cycle in Lhasa (dog head emoji)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真好，被红土上的圆月感动到",
          "en": "Great, touched by the full moon over the red earth"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真好呀 前两天我去的新疆 最西边 赛里木湖 路过果子沟大桥 也是随手一拍就是壁纸",
          "en": "That's great! I went to Xinjiang the other day, to the westernmost side, Sayram Lake, passed the Guozigou Bridge, and took a picture at random, it's a wallpaper."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "gps 那个是什么 app 呀",
          "en": "What app is that gps?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有心有力出去走走挺好的，我也写公众号，写还是要坚持哈哈",
          "en": "It's good to be able to go out and about, I also write a WeChat official account, you have to keep writing haha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@stevenchow1219 小米手机是指南针自带的，苹果有一个 GPS 海拔好像是。",
          "en": "@stevenchow1219 Xiaomi phones have a built-in compass, and Apple seems to have a GPS altitude function."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上高原，火车上去，太快，开始吸氧就基本离不开了，必定高反，反倒是慢慢上去，比如徒步，骑行，基本没有高反",
          "en": "Going to the plateau, going up by train is too fast, and if you start breathing oxygen, you basically can't leave it, you will definitely have altitude sickness. On the contrary, going up slowly, such as hiking or cycling, basically doesn't cause altitude sickness"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我去了十次西藏和青海，并没有觉得什么会永远跟我在一起。见过唐古拉，我就想去喜马拉雅，到了喜马拉雅，还要去尼泊尔，去了尼泊尔，向往雷克雅未克。后来才懂得，看过很重要，看见现在也很重要。所以这就是一场旅游，还有第二场，第三场。总之年轻挺好的，但说永远在一起，那可就不必了。",
          "en": "I have been to Tibet and Qinghai ten times, and I don't feel that anything will always be with me. After seeing Tanggula, I wanted to go to the Himalayas, and after arriving at the Himalayas, I wanted to go to Nepal, and after going to Nepal, I longed for Reykjavik. Later, I understood that seeing it is very important, and seeing the present is also very important. So this is a trip, and there will be a second and a third. In short, being young is great, but it's not necessary to say that it will always be with you."
        }
      ],
      "type": "replies"
    }
  ]
}