{
  "id": 1017767,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "过年花两周时间，将 X 从 100 做到 2k+ fo，准备 All in 独立工作者布道，求建议",
          "en": "Spent two weeks during the Lunar New Year, growing X from 100 to 2k+ followers, planning to go all-in on evangelizing independent workers, seeking advice."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "为了脱离职场内卷，开启第二曲线，之前一直是准备做独立开发者的，攒了一堆的 idea （ https://x.com/cellinlab/status/1734063512723537969?s=20 ），但是一直因为想法太多，时间太少没法下手去做。\r\n\r\n大年三十的时候，和一位大佬做了下讨论，最后突然发现，比起做开发，我更适合做流量。",
          "en": "To escape the rat race in the workplace and start a second curve, I had been preparing to become an independent developer, accumulating a bunch of ideas (https://x.com/cellinlab/status/1734063512723537969?s=20), but I couldn't get started because I had too many ideas and too little time.\r\n\r\nOn New Year's Eve, I had a discussion with a big shot and suddenly realized that I was more suitable for traffic generation than development."
        },
        {
          "zh": "而且，经过一番合计，就算我做产品开发，最后产品出来后还是要去做营销、推广、运营。",
          "en": "Moreover, after some consideration, even if I develop a product, I still have to do marketing, promotion, and operations after the product is released."
        },
        {
          "zh": "如果等推广阶段，发现流量做不起来，那就投入太多成本了。",
          "en": "If I wait until the promotion stage and find that I can't generate traffic, I will have invested too much cost."
        },
        {
          "zh": "所以，拥抱变化，在大年初一晚上重构了 2024OKR ，将原来的 [独立开发者] 变成了 [独立工作者布道人] 。",
          "en": "So, embracing the change, I restructured my 2024 OKRs on the first night of the Lunar New Year, changing the original [independent developer] to [independent worker evangelist]."
        },
        {
          "zh": "当然，做流量我也基本是零基础，于是我试着在各种社群开始做一些绝对利他的事情，我相信，当你脱离利益关系去单出利他的时候，你的能量场会变强，会有强大的吸引力。",
          "en": "Of course, I also have basically zero experience in traffic generation, so I tried to do some absolutely altruistic things in various communities. I believe that when you detach yourself from interests and focus on altruism, your energy field will become stronger and you will have a powerful attraction."
        },
        {
          "zh": "举个例子，我在 Sora 火了之后，突然发现有一个默默做视频生成技术方案的公司 founder 的推，当时他只有 100+fo 。",
          "en": "For example, after Sora became popular, I suddenly discovered a tweet from the founder of a company that was quietly working on video generation technology solutions, and he only had 100+ followers at the time."
        },
        {
          "zh": "我合计者可能是个风口，如果我帮忙推他一下，可能会给他带来不少流量，于是用 Chatgpt 结合他家官网介绍生成了一条推文（ https://x.com/cellinlab/status/1759066425648664839?s=20 ），没想到居然流量爆了，截止目前已经浏览 17w+次，帮节子哥涨 fo 1.4k+。",
          "en": "I figured it might be a trend, and if I helped promote him, it might bring him a lot of traffic, so I used ChatGPT to generate a tweet based on his company's website introduction (https://x.com/cellinlab/status/1759066425648664839?s=20). I didn't expect it to explode with traffic, and so far it has been viewed 17w+ times, helping Jiezi increase his followers by 1.4k+."
        },
        {
          "zh": "后来我结合这次推广，输出了一些利他的逻辑（ https://x.com/cellinlab/status/1759603403469308327?s=20 ），也做到了 8w+流量，算是摸到了流量密码。",
          "en": "Later, combined with this promotion, I output some altruistic logic (https://x.com/cellinlab/status/1759603403469308327?s=20), and achieved 8w+ traffic, which can be regarded as figuring out the traffic code."
        },
        {
          "zh": "说了这么多，回来说我的 OKR 和定位：\r\n其中一个 O 是：\r\n年度 O2：初步形成“独立工作者布道师”个人品牌影响力\r\nKR1：X fo 达到 5k\r\nKR2：小红书 粉丝达到 5k\r\nKR3：做独立工作者吧 公众号关注达到 3k ，输出文章 20 篇\r\nKR4：IndyWorq 主站上线，累计访问用户达到 2w +\r\n\r\n初步定位是：成为全国最大的独立工作者布道人，让更多的人看见、相信、成为独立工作者，做超级个体。",
          "en": "After saying so much, let's get back to my OKRs and positioning:\r\nOne of the Os is:\r\nAnnual O2: Initially form the personal brand influence of \"Independent Worker Evangelist\"\r\nKR1: X followers reach 5k\r\nKR2: Xiaohongshu fans reach 5k\r\nKR3: The WeChat official account \"Let's be Independent Workers\" reaches 3k followers, output 20 articles\r\nKR4: IndyWorq main site goes live, with a cumulative of 2w+ visiting users\r\n\r\nThe initial positioning is: to become the largest independent worker evangelist in the country, so that more people can see, believe in, and become independent workers, and become super individuals."
        },
        {
          "zh": "以上判断和规划的依据是建立在：\r\n1. AI 大模型 赋能个体，成为个人能力的放大器\r\n2. 大陆地区整体雇佣环境恶化，市场增速变慢，导致职场内卷加剧，越来越多人被迫离开职场\r\n3. 网络信息传输，海外的独立工作者案例不断输入，内陆地区越来越多的独立工作者成功个例出现",
          "en": "The basis for the above judgments and plans is based on:\r\n1. AI large models empower individuals and become amplifiers of personal ability\r\n2. The overall employment environment in mainland China is deteriorating, the market growth rate is slowing down, which leads to increased workplace involution, and more and more people are forced to leave the workplace\r\n3. Network information transmission, overseas independent worker cases are constantly input, and more and more successful individual cases of independent workers appear in the inland areas"
        },
        {
          "zh": "求建议：\r\n1. 我的判断有没有大的逻辑漏洞或者脱离客观现实的部分\r\n2. 做布道师可能会遇到哪些坑\r\n3. 什么情况下可以去全职做布道师\r\n4. 做布道人，有哪些可以养活自己的方法\r\n\r\n感恩感恩，比心",
          "en": "Seeking advice:\r\n1. Are there any major logical loopholes or deviations from objective reality in my judgment?\r\n2. What pitfalls might I encounter as an evangelist?\r\n3. Under what circumstances can I become a full-time evangelist?\r\n4. As an evangelist, what are some ways to support myself?\r\n\r\nThank you, thank you, with love"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@hedgehog886 #1 意思就是卖课给独立开发者",
          "en": "@hedgehog886 #1 It means selling courses to independent developers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2,833 Following2,275 Followers尴尬了，这 2k+ fo 是互粉来的",
          "en": "2,833 Following 2,275 Followers Embarrassing, these 2k+ followers are from mutual following."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人拙见，少用这些术语：赋能、超级个体、放大器。",
          "en": "In my humble opinion, use these terms less: empower, super individual, amplifier."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "阿里出来的？味儿这么冲",
          "en": "From Alibaba? The smell is so strong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "味太冲了，熏的我快吐了",
          "en": "The smell is too strong, it's making me want to vomit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好兄弟，我很乐见于你摸索到了些门道。",
          "en": "Good brother, I am very happy to see that you have found some tricks."
        },
        {
          "zh": "你的分享也很实在，确有启发。",
          "en": "Your sharing is also very realistic and indeed inspiring."
        },
        {
          "zh": "我来跟你讲讲我的看法，要说做独立工作者布道师，其实就是做自媒体。",
          "en": "Let me tell you my opinion. To be an independent worker evangelist is actually to be a self-media."
        },
        {
          "zh": "1-做全职布道师就是脱实向虚，如果自己没有真正做过项目，道听途说可能有点立不住。",
          "en": "1-Being a full-time evangelist is divorced from reality. If you haven't actually done a project yourself, hearsay may not stand up."
        },
        {
          "zh": "2-做自媒体最难的就是坚持，只要坚持输出有价值的东西，粉丝不成问题。",
          "en": "2-The most difficult thing in self-media is to persevere. As long as you persist in outputting valuable things, fans will not be a problem."
        },
        {
          "zh": "3- X 上的流量转化非常难，而且你面向的是猴精的自由职业者群体，短期很难有什么收入。",
          "en": "3-Traffic conversion on X is very difficult, and you are targeting a group of very shrewd freelancers, it is difficult to have any income in the short term."
        },
        {
          "zh": "4-有了流量就不愁转化，无论是推自己产品还是帮人发广告都行。",
          "en": "4-Once you have traffic, you don't have to worry about conversion, whether it's promoting your own products or helping others post ads."
        },
        {
          "zh": "5-在没做出名堂之前，千万不要全职干这个，很容易饿死。",
          "en": "5-Don't do this full-time until you make a name for yourself, it's easy to starve to death."
        },
        {
          "zh": "做类比的话，我应该算是副业布道师。",
          "en": "By analogy, I should be considered a part-time evangelist."
        },
        {
          "zh": "通过布道赚钱太难了，还不如学 AI 李大师信息差来赚的快。",
          "en": "It's too hard to make money through evangelism, it's better to learn from AI Master Li to earn money quickly by exploiting information gaps."
        },
        {
          "zh": "这是我之前的发言： https://www.v2ex.com/t/886962#reply35",
          "en": "This is my previous statement: https://www.v2ex.com/t/886962#reply35"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看见 OKR 就头疼",
          "en": "Headache when I see OKR."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "独立工作者 这个词还是太虚，我理解，你做的还是互联网 toC 类的工作，帮其他产品做宣传，营销活动。",
          "en": "The term independent worker is still too vague. I understand that you are still doing Internet toC work, helping other products with publicity and marketing activities."
        },
        {
          "zh": "1 、独立产品/小产品本来就没钱做营销，你去帮他做，也没收入。",
          "en": "1. Independent products/small products originally have no money for marketing. If you help them do it, you won't have any income either."
        },
        {
          "zh": "2 、由于你可能做过产品，还可能会对产品不满意，还会和他在产品上有争论， 没法把自己纯粹当服务者，为甲方宣传营销。",
          "en": "2. Since you may have done products, you may still be dissatisfied with the product, and you may still have disputes with him in the product, and you can't purely act as a server to promote marketing for the client."
        },
        {
          "zh": "3 、不同的独立产品，消费者画像肯定不一样，你也不容易积攒通用的用户，没有长尾效应，都是一个个烟囱式项目服务，累而收获不大。",
          "en": "3. The consumer portraits of different independent products are definitely different, and it is not easy for you to accumulate general users, without the long-tail effect, they are all chimney-style project services, which are tiring and not rewarding."
        },
        {
          "zh": "独立开发者都是对自己的产品很有信心，自我鸡血，奋斗的。",
          "en": "Independent developers are very confident in their products, self-motivated, and working hard."
        },
        {
          "zh": "希望踩中风口。",
          "en": "Hoping to catch the trend."
        },
        {
          "zh": "虽然 99%以上的独立产品最后的结局是失败。",
          "en": "Although the final outcome of more than 99% of independent products is failure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没太看明白什么意思",
          "en": "Didn't quite understand what it meant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hedgehog886 啊这，就是原来准备做独立开发者，现在准备做独立工作者布道，求建议（比心）",
          "en": "@hedgehog886 Ah, that's it, I originally planned to be an independent developer, and now I plan to evangelize independent workers, seeking advice (with love)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kaicity 不卖课，不割韭菜，我从厂商拿钱，比如推荐独立开发者要的服务、工具，或者去行业论坛布道拿出场费等",
          "en": "@kaicity I don't sell courses, I don't cut leeks, I get money from manufacturers, such as recommending services and tools that independent developers need, or going to industry forums to evangelize and get appearance fees, etc."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "布道，需要积攒个人影响力，这里面的投入有时间（相比独立开发者，会需要比较长的积累），金钱，精力等；你个人是否有比较富余的钱做支撑呢；跟早期做 xx 赋能一样，产品赋能，项目赋能",
          "en": "Evangelism requires accumulating personal influence, and the investment in it includes time (compared to independent developers, it will require a longer accumulation), money, energy, etc.; do you personally have relatively spare money to support it; it's just like doing xx empowerment in the early days, product empowerment, project empowerment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“布道”这个词不能准确描述你要做的事。",
          "en": "The word \"evangelism\" cannot accurately describe what you want to do."
        },
        {
          "zh": "如果是帮助独立开发者建立个人品牌、推广、增长，这个是有需求的。",
          "en": "If it is to help independent developers build personal brands, promote, and grow, there is a demand for this."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@qsnow6 哈哈",
          "en": "@qsnow6 Haha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是很明白布道师是干啥的，具体服务感觉不是很清楚，这个名字建议优化下，不过话说回来，你先讲讲你的推在没有啥粉丝的情况下是如何做到 10 几万阅读的，这个就厉害了。",
          "en": "I don't quite understand what an evangelist does. The specific service doesn't feel very clear. It is recommended to optimize the name. But then again, tell me first how your tweet achieved 100,000+ reads when you didn't have many followers, which is amazing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这种说难听点就是割韭菜，和清华那个卖课的没啥区别",
          "en": "To put it bluntly, what you're doing is cutting leeks, which is no different from that Tsinghua course seller."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@qsnow6 超级个体还是比较形象的吧，当然用网红更合适。",
          "en": "@qsnow6 Super individual is still relatively vivid, it would be more appropriate to use influencer of course."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@iyiluo 不是吧，哥哥，我不和目标用户收费啊，咋是割韭菜，再说割韭菜和知识付费还是有区别的，不能有刻板影像哈哈哈（或许你可以看下我另外一个 10w+ 的讨论，关于割韭菜，咱们客观讨论 https://x.com/cellinlab/status/1754714520390689146?s=20 ）",
          "en": "@iyiluo No way, brother, I don't charge my target users, how is that cutting leeks? Besides, there is a difference between cutting leeks and knowledge payment, you can't have stereotypes hahaha (maybe you can take a look at my other 10w+ discussion about cutting leeks, let's have an objective discussion https://x.com/cellinlab/status/1754714520390689146?s=20)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wikii 我目前没有投入一分钱，只是投入时间精力，推广的话，我目前摸索到一个融资模式，可以参考我做的这个社会实验，个人融资相关的（ https://x.com/cellinlab/status/1760330275236860404?s=20 ）",
          "en": "@wikii I haven't invested a penny yet, just time and energy. For promotion, I'm currently exploring a financing model. You can refer to this social experiment I'm doing, which is related to personal financing (https://x.com/cellinlab/status/1760330275236860404?s=20)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ljinkai 嗯嗯，你说的没问题，帮助建立其实是面向的已经知道独立开发者这个事情的人。",
          "en": "@ljinkai Yes, you are right. Helping to build is actually aimed at people who already know about independent developers."
        },
        {
          "zh": "我主要面向那些不知道独立开发者，或者说不相信独立开发者能成功的人，这种用户基数更大",
          "en": "I mainly target those who don't know about independent developers, or those who don't believe that independent developers can succeed, and this user base is larger."
        }
      ],
      "type": "replies"
    }
  ]
}