{
  "id": 1016579,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "工作 8 年，职业倦怠如何破局",
          "en": "How to break the cycle of burnout after 8 years of work?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "做了 8 年程序员了，也变更过工作城市，从二线到一线，一开始信心满满，觉得有一天能够让自己的工作内容完美匹配自己的兴趣，但是随着工作时间延长越来越发现这是不可能的，来公司就是给公司创造价值的，而不是为了我的兴趣。",
          "en": "I've been a programmer for 8 years, and I've changed cities, from a second-tier to a first-tier city. At first, I was full of confidence, thinking that one day I would be able to perfectly match my work content with my interests, but as the working hours increased, I realized that this is impossible. Coming to the company is to create value for the company, not for my interests."
        },
        {
          "zh": "不管分到什么杂活都得做好才行。",
          "en": "No matter what chores are assigned, I have to do them well."
        },
        {
          "zh": "一边是不想放弃的薪水，另一边是内心不想干的工作内容，感觉陷入了自我认知失调，知行不合一。",
          "en": "On one side is the salary I don't want to give up, and on the other side is the work content I don't want to do, which makes me feel like I'm in a state of cognitive dissonance, where my knowledge and actions don't match."
        },
        {
          "zh": "也想过换工作，但也都大同小异，没什么太大区别，无非是一个围墙进入另一个围墙。\r\n\r\n每天单程通勤一小时来上班，下了班到家 9 点多，稍微歇会儿就 10 点多了，什么都不想干，每天就是上班下班，周末倒是可能看看自己想学的知识，但是基本感觉还是像行尸走肉一样。",
          "en": "I've also thought about changing jobs, but they're all similar, with no major differences. It's just entering another walled city.\r\n\r\nI commute one hour each way to work every day. After getting off work, I get home after 9 o'clock, and after a short rest, it's past 10 o'clock. I don't want to do anything. Every day is just work and off work. On weekends, I might look at the knowledge I want to learn, but I basically feel like a walking corpse."
        },
        {
          "zh": "至于赚来的钱，在北京这地方算不得什么，况且一想到买房和未来的医疗之类的意外情况，就不敢乱花，活的比较无趣。\r\n\r\n一想到后面几十年可能都得这样度过，到老了会不会后悔这种机械且无趣的生活。",
          "en": "As for the money I earn, it's nothing in Beijing. Moreover, when I think of buying a house and unexpected situations like future medical care, I don't dare to spend it recklessly, and I live a rather boring life.\r\n\r\nWhen I think that I might have to spend the next few decades like this, will I regret this mechanical and boring life when I'm old?"
        },
        {
          "zh": "但另一方面，不做这个又不知道做什么，每次假期过完从家里返京都有一种返京综合征，想逃离又无法下定决心。",
          "en": "But on the other hand, if I don't do this, I don't know what to do. Every time I return to Beijing from home after a holiday, I have a Beijing return syndrome. I want to escape but can't make up my mind."
        },
        {
          "zh": "听闻二线小城生活安逸工资低，现在如果打道回府倒也能乐得自在，但是还是心有不甘，现在就是上不去又下不来，实在难受。\r\n\r\n各位同僚在哪个城市呢，工作久了又是什么感觉呢，喜欢自己的工作吗，还是仅仅为了赚钱，赚的钱又花在哪了呢。",
          "en": "I heard that life in second-tier cities is comfortable and the salary is low. If I go back home now, I can also enjoy myself, but I'm still unwilling. Now I can't go up or down, which is really uncomfortable.\r\n\r\nWhich city are you colleagues in? What does it feel like to work for a long time? Do you like your job, or is it just for making money? And where do you spend the money you earn?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "刚上班第二天 都坐不住了 别说你八年",
          "en": "I can't sit still on the second day of work, let alone you after eight years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "答案只有找兴趣build 的内啡肽一定是最舒服最持久的找除了 coding 外的，持续的兴趣没兴趣？",
          "en": "The only answer is to find interests to build endorphins. It must be the most comfortable and lasting. Find continuous interests other than coding. No interest?"
        },
        {
          "zh": "就继续找，咬着牙去尝试各种事情，不能停，直到找到为止",
          "en": "Then keep looking, grit your teeth and try all kinds of things, don't stop until you find it."
        },
        {
          "zh": "注意一定要是自身延伸出的兴趣，而不是用社会标准来麻木自己和填满时间，比如结婚生子、交友人脉",
          "en": "Note that it must be an interest that extends from yourself, rather than using social standards to numb yourself and fill your time, such as getting married and having children, making friends and building connections."
        },
        {
          "zh": "社会标准是无法填补内心倦怠和虚无的，反而会把你拖入更加无法反悔的深渊，直到你被锤打到真的泄气并妥协，那基本也相当于提前入土了",
          "en": "Social standards cannot fill the inner weariness and emptiness, but will drag you into a deeper abyss from which you cannot repent, until you are hammered to the point where you are really discouraged and compromise, which is basically equivalent to being buried in advance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@LavaC 偶尔早跑的话 7 点到家就会感觉突然多出好多时间，特别爽，有一次走的早，天都没黑，地铁进站后我都没认出这是我的目的地，心里还想着天怎么这么亮，阳光怎么这么好看。",
          "en": "@LavaC If I occasionally leave early and get home at 7 o'clock, I feel like I suddenly have a lot more time, which is particularly great. Once I left early, it wasn't even dark yet. After entering the subway station, I didn't even recognize that this was my destination. I was thinking, why is it so bright and the sunshine is so beautiful."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "\"一想到后面几十年可能都得这样度过\"别担心，过不了太久，35 左右差不多该毕业了",
          "en": "\"When I think that I might have to spend the next few decades like this,\" don't worry, it won't be too long. You'll probably be graduating around 35."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是工作个一两年就会辞职出去玩一年，如此往复。。。",
          "en": "I quit my job and go out to play for a year every year or two, and so on..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一样，不只是职业倦怠，简直人生倦怠了",
          "en": "Same here, not just job burnout, but life burnout."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我怎么发帖了",
          "en": "How did I post?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以适当卷自己，多读书，读自己感兴趣的和一些工作相关的，英语不好用多邻国或者百词斩每天计划练习，你就会发现，破局点就在当下，不在于即时反馈，而在于长期坚持。",
          "en": "You can appropriately push yourself, read more books, read what you are interested in and some work-related books. If your English is not good, use Duolingo or BaiCiZhan to practice according to a daily plan. You will find that the breakthrough point is in the present, not in instant feedback, but in long-term persistence."
        },
        {
          "zh": "找个自己真正喜欢做的，对自己是身心有益的，坚持下去。",
          "en": "Find something you really like to do that is beneficial to your body and mind, and stick to it."
        },
        {
          "zh": "别给自己太大压力，放平心态，周末有时间可以周边游一下，没有伙伴自己游也图个清净。",
          "en": "Don't put too much pressure on yourself, relax, and if you have time on weekends, you can take a trip to the surrounding area. If you don't have a partner, you can travel alone to enjoy the peace and quiet."
        },
        {
          "zh": "大同这些都离北京不远。",
          "en": "Datong and these places are not far from Beijing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "7 年之痒，似乎很多人这个时长都会开始产生动摇。",
          "en": "The 7-year itch, it seems like many people start to waver after this length of time."
        },
        {
          "zh": "有的结个婚养个娃就过去了，有的换个工作换个环境过去了，有的创业重头来也过去了。",
          "en": "Some get married and raise a child and it passes, some change jobs and environments and it passes, and some start a business from scratch and it passes."
        },
        {
          "zh": "唯独窝着不动提升是最少的，人的提升是靠环境驱动的，太有道理了，走不出舒适区就不懂珍惜也不动努力。",
          "en": "The only thing that stays the same is staying where you are. People's improvement is driven by the environment, which makes a lot of sense. If you don't get out of your comfort zone, you won't know how to cherish it and you won't make an effort."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "慢慢来，重要是每天向自己想要的方法前进一小步。",
          "en": "Take your time, the important thing is to take a small step forward every day towards the method you want."
        },
        {
          "zh": "想要学英语就每天学一点，哪怕每天抽 1 个小时。",
          "en": "If you want to learn English, learn a little every day, even if you only spend 1 hour each day."
        },
        {
          "zh": "想要 WLB ，就去找，每天都找一找。",
          "en": "If you want WLB, look for it, look for it every day."
        },
        {
          "zh": "其实发这个帖子就是一种很好的尝试，既给自己，也给有相同烦恼的人。",
          "en": "In fact, posting this post is a very good attempt, both for yourself and for people with the same troubles."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我已经超过十年了，我认为你的问题核心来源就是对未来的焦虑，你提到的买房和医疗啥的对抗这些东西的唯一办法就是放低期望，不要给自己那么大的压力。",
          "en": "I've been doing this for more than ten years. I think the core source of your problem is anxiety about the future. The only way to combat the things you mentioned, such as buying a house and medical care, is to lower your expectations and not put so much pressure on yourself."
        },
        {
          "zh": "这些其实和工作关系都没那么大，如果你不对未来有那么高的期望，你现在做做杂活，周末还不用加班，就能赚那么多钱，岂不是天大的好事？",
          "en": "These things don't have that much to do with work. If you don't have such high expectations for the future, it would be a great thing if you could do odd jobs now, not have to work overtime on weekends, and still earn so much money?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "PS 一下，什么个人提升，在我看来本质上也是焦虑的很大来源，这是有很大问题的",
          "en": "PS, in my opinion, what is personal improvement is essentially also a major source of anxiety, which is a big problem."
        },
        {
          "zh": "首先是到底提升啥？",
          "en": "First of all, what exactly is being improved?"
        },
        {
          "zh": "提升了有没有用？",
          "en": "Is it useful to improve?"
        },
        {
          "zh": "大部分时候就没啥用，反正我现在学习就是纯粹为了学习，不为了其他",
          "en": "Most of the time it's useless, anyway, I'm learning purely for learning now, not for anything else."
        },
        {
          "zh": "其次是提升效果如何？",
          "en": "Secondly, how effective is the improvement?"
        },
        {
          "zh": "大部分高效率的提升都是需要主观+客观的，当你在一个公司担任某个职位，对应能力会非常快速提升，你自己一个人蹲在家里苦哈哈的看书，是很难提升的。",
          "en": "Most high-efficiency improvements require subjective + objective factors. When you hold a position in a company, the corresponding ability will be improved very quickly. It is difficult to improve if you stay at home alone and read books hard."
        },
        {
          "zh": "大部分做出来的东西，也就是个玩具",
          "en": "Most of the things made are just toys."
        },
        {
          "zh": "最后，如果你提升为了未来，那现在呢？",
          "en": "Finally, if you improve for the future, what about now?"
        },
        {
          "zh": "未来和现在都是你的生命，凭什么牺牲现在去换不可预知的未来？",
          "en": "The future and the present are both your life, why sacrifice the present for an unpredictable future?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作 12 年 撑着呗~",
          "en": "12 years of work, just stick with it~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同是 8 年，也有你这种想法，不知如何破局，哈哈哈，感觉生活不知为了啥，玩不好，睡不好，放不下，其实生活还是照常进行，缺乏洒脱的勇气",
          "en": "Also 8 years, I have the same idea as you, I don't know how to break the cycle, hahaha, I feel like I don't know what life is for, I can't play well, I can't sleep well, I can't let go, but life goes on as usual, lacking the courage to be free and easy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找个兴趣爱好",
          "en": "Find a hobby."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "me too,  理想生活是有个自己的小店 养活自己",
          "en": "me too, the ideal life is to have my own small shop to support myself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我干四五个月就职业倦怠了",
          "en": "I get job burnout after four or five months."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "3 年半，不想干了，上班就坐牢真不是瞎讲的",
          "en": "3 and a half years, I don't want to do it anymore. Going to work is like going to jail, I'm not kidding."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作九年，一样的困惑，每天跟行尸走肉一样，没有了刚毕业的激情，每天按部就班的工作，很多时候都想着离职去过自己喜欢的生活，但是又世俗的放不下金钱。",
          "en": "Nine years of work, the same confusion, every day is like a walking corpse, there is no passion of just graduating, every day is step by step work, many times I think of leaving to live the life I like, but I can't let go of money in the secular world."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作第七年了，我去年也单程通勤一小时，搞了三年多，因为喜欢开车，郊区住的条件也好，后来嘛，供房，买车玩车花的多，不得不减少住房开销，住到公司附近，贼省时间，大把时间玩，休息，房有，代步车 玩具车都有，嗨就完事了，坐等裁员拿一笔钱回老家了，老家的大豪宅还等着我住呢",
          "en": "It's my seventh year of work. I also commuted one hour each way last year, for more than three years. Because I like driving, the conditions in the suburbs are good. Later, I had to reduce housing expenses because I spent a lot of money on housing, buying cars, and playing with cars. I moved to live near the company, which saved a lot of time. I have a lot of time to play and rest. I have a house, a car for transportation, and toy cars. Just have fun. I'm waiting for layoffs to get a sum of money and return to my hometown. The big mansion in my hometown is still waiting for me to live in."
        }
      ],
      "type": "replies"
    }
  ]
}