{
  "id": 1015563,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "看完《热辣滚烫》后你有什么感触呢？",
          "en": "What are your thoughts after watching 'YOLO' (Hot and Spicy)?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "有没有一些什么启发和感悟呢，下一步又有什么计划",
          "en": "Do you have any inspiration or insights? What are your next plans?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "还是游民老哥攻击性强，这电影就凭这恶心人的营销就可以不看了。",
          "en": "The Gamer brothers are still aggressive. I wouldn't watch this movie just based on its disgusting marketing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感触是减肥请用司美格肽鲁",
          "en": "My feeling is, if you want to lose weight, use semaglutide."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一个人为了减肥，拍了一部电影的励志故事"
        }
      ],
      "type": "replies",
      "en": "An inspirational story of a person making a movie to lose weight."
    },
    {
      "chunks": [
        {
          "zh": "我没看过电影，只讨论减 100 斤，想说的是作为导演演员她已经是 priviledged 的了，她有钱请营养师健身教练跑步教练，但很多普通人连获取到科学减重知识的渠道都很少（想象一下百度到某种减肥药泻药广告的情况）",
          "en": "I haven't seen the movie. I'm just discussing the weight loss of 100 pounds. What I want to say is that as a director and actress, she's already privileged. She has the money to hire nutritionists, fitness coaches, and running coaches. But many ordinary people have very few channels to obtain scientific weight loss knowledge (imagine searching on Baidu and finding ads for diet pills and laxatives)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还没看。印象中有女拳在挺这部电影，厌屋及乌吧，这点让人有些恶心。",
          "en": "Haven't seen it yet. I have the impression that some feminists are supporting this movie. I dislike it by association, which makes me feel a bit disgusted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年会不能停，挺好看"
        }
      ],
      "type": "replies",
      "en": "Never Say Never (Annual Meeting Cannot Stop), it's pretty good."
    },
    {
      "chunks": [
        {
          "zh": "根本就不能叫电影。很同意知乎一个评论，应该叫大小品或者大抖音。就是一些弱关联性的小品拼起来的，把开头结尾拿出来直接看、中间部分全剪掉也完全能看懂"
        }
      ],
      "type": "replies",
      "en": "It can't be called a movie at all. I strongly agree with a comment on Zhihu that it should be called a collection of skits or a large Douyin video. It's just a bunch of loosely related skits pieced together. You can completely understand it by just watching the beginning and end and cutting out the middle part."
    },
    {
      "chunks": [
        {
          "zh": "先说我对这部片子的宣发观感: 这部片就是贺岁片, 励志/减肥等等只不过是宣发噱头, 吸引你进来看, 但是不妨碍这部片子或许是个不错看的片子, 在宣发层面挺吸引人的, 不会引起普遍反感, 挺想去看.",
          "en": "First, my opinion on the film's marketing: This film is a New Year's film. Inspiration/weight loss, etc., are just marketing gimmicks to attract you to watch it. But that doesn't prevent this film from being a good one to watch. The marketing is quite attractive. It won't cause widespread aversion. I really want to see it."
        },
        {
          "zh": "而且索尼影业已经拿下全球代理权, 期待我这里能很快上院线.",
          "en": "And Sony Pictures has already acquired the global distribution rights. I hope it will be released in my local theaters soon."
        },
        {
          "zh": "接下来我的评论:从本帖评论区来看, 恁站喜欢靠贬低来增加优越感的人真不少, 暗中透露的厌女情绪.",
          "en": "Next, my comment: Judging from the comments in this thread, there are quite a few people in this community who like to increase their sense of superiority by belittling others, secretly revealing misogynistic sentiments."
        },
        {
          "zh": "而且也确实不少人没有好好去减肥过......如果本片是个二三百斤的男胖子“减肥励志”估计评论区都是夸的.",
          "en": "And indeed, many people haven't really tried to lose weight properly... If this film were about a 200-300 pound fat man's 'weight loss and inspiration,' the comments section would probably be full of praise."
        },
        {
          "zh": "这部片子又不像某狼某地球电影靠煽动民粹情绪来赚流量宣传卖票 (就像买某为手机), 靠“减肥/励志” (或许带一些女性自立自强)来做宣传卖点又如何?",
          "en": "This film is not like certain Wolf or Earth movies that rely on inciting populist sentiments to gain traffic, promote, and sell tickets (like buying a certain Huawei phone). What's wrong with relying on 'weight loss/inspiration' (perhaps with some female independence) as a selling point for promotion?"
        },
        {
          "zh": "作为一个胖子被这波宣传激励到不也是挺好么?",
          "en": "Isn't it a good thing for a fat person to be inspired by this wave of promotion?"
        },
        {
          "zh": "又说人家手术啦, 又说人家嗑药啦, 又说人家“打拳”啦, 又说人家不好看啦, 又拿个截图说恶心啦什么的真是恶意满满......",
          "en": "Saying she had surgery, saying she took drugs, saying she's 'feminist,' saying she's not good-looking, and taking a screenshot saying it's disgusting... it's really full of malice..."
        },
        {
          "zh": "(说个稍微远的, 就像玩游戏一个优秀大作或者磨了 N 多年的优秀独立游戏, 游戏买断 200-500, 有些人不仅不买或者找破解玩, 还天天说“都是为了赚钱”, “又是同性恋桥段真恶心”, “你看它贴图错了, 穿模了, LGBT 打拳了, 幸亏我没买, 什么垃圾游戏”等等, 然后转手给原 P/穷铁充值 688*n, 给抖阴小姐姐打赏大火箭)",
          "en": "(To go a little further, it's like playing a great game or an excellent indie game that has been polished for many years. The game costs 200-500 to buy out. Some people not only don't buy it or find a cracked version to play, but also say every day, 'It's all for making money,' 'Another homosexual scene, that's disgusting,' 'Look, the textures are wrong, it's clipping, LGBT is pushing their agenda, I'm glad I didn't buy it, what a lousy game,' etc., and then turn around and recharge 688*n for the original P/poor iron, and give big rockets to Douyin hostesses)"
        },
        {
          "zh": "就感觉非要人家作为女胖子天天卖惨自曝各种三高疾病各位的嘴才能说点好的(也未必能说好的, 照样能挑刺和嘲笑人家胖), 反倒是对那些垃圾 (某球某狼某 P 某铁等等) 转手就氪还大呼过瘾别人批评就出征.",
          "en": "It feels like you want her, as a fat woman, to sell misery and expose all kinds of hyperlipidemia diseases every day so that you can say something nice (but you may not be able to say something nice, you can still nitpick and laugh at her being fat). On the contrary, you immediately spend money on those garbage (certain Sphere, Wolf, P, Iron, etc.) and shout that they are great, and when others criticize them, you go to war."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要把它批判一番，我就不需要下一步计划。如果你说你受到了激励，我就说你被 pua 了。（电影我没看，看影评我有这个感觉）",
          "en": "As long as I criticize it, I don't need a next plan. If you say you were inspired, I'll say you were PUA'd. (I haven't seen the movie, I have this feeling from reading reviews)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "辣眼睛",
          "en": "An eyesore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没看，但是看到一个抖音的观点，叫“他律”。你说她说自律吗？不是，如果自律的话早几年就减下来了。",
          "en": "I haven't seen it, but I saw a viewpoint on Douyin called 'other-discipline.' Do you say she is self-disciplined? No, if she was self-disciplined, she would have lost weight years ago."
        },
        {
          "zh": "这个观点的意思是，电影前期投了那么多钱，整个剧组等着她减肥，不减肥下来电影就拍不了。这种“他律”，成为她减肥成功的很重要因素",
          "en": "This viewpoint means that so much money was invested in the film in the early stages, and the entire crew was waiting for her to lose weight. If she didn't lose weight, the movie couldn't be filmed. This 'other-discipline' became a very important factor in her weight loss success."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有钱真好",
          "en": "It's good to be rich."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给我 2000 万（我只要 2000 万），我就有动力减肥 100 斤，前提是我 200 多斤",
          "en": "Give me 20 million (I only need 20 million), and I'll have the motivation to lose 100 pounds, provided that I weigh more than 200 pounds."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderlxm +1....这营销搞得我现在看到贾玲就犯恶心",
          "en": "@coderlxm +1.... This marketing makes me feel disgusted whenever I see Jia Ling now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "补充一下，网上有她发的每天重量变化日志花絮可以看到，她最开始那几天是胡吃海喝把体重硬撑上去，最后几天控盐空水压低身体水分，所以实际的变化大概是 60 斤左右而已，只是 60 斤和 100 斤相比，实在是不响亮",
          "en": "To add, you can see the daily weight change logs and behind-the-scenes footage she posted online. In the first few days, she gorged herself to artificially increase her weight, and in the last few days, she controlled salt and limited water intake to reduce body moisture. So the actual change is probably only about 60 pounds. It's just that 60 pounds is not as impressive as 100 pounds."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挺好看的，楼上盯着减肥看的，只能说可能是被营销误导了。其实这部电影的核心并不是减肥，而是改变。",
          "en": "It's pretty good. Those upstairs who are focusing on weight loss have probably been misled by the marketing. The core of this movie is not weight loss, but change."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zjuster @Perry @BaseException兄弟，健身常识和目标不用你们来科普了，网上到处都是，某些 APP 上还有阶段型健身课程，免费的。",
          "en": "@zjuster @Perry @BaseException Brothers, you don't need to popularize fitness common sense and goals. It's everywhere online. Some apps even have phased fitness courses, for free."
        },
        {
          "zh": "难点是：你得先是个大腕儿，才会有除你家人外在意你的减脂情况；你得先是个大腕儿，你的减脂情况才会换到票房，换到钱；你得先是个大腕儿，你的身材情况才对赚钱来说重要。",
          "en": "The difficulty is: you have to be a celebrity first to have anyone other than your family care about your weight loss; you have to be a celebrity first for your weight loss to translate into box office revenue and money; you have to be a celebrity first for your body shape to be important for making money."
        },
        {
          "zh": "先是个大腕儿，可就难多了，天时地利与人和外加时运，你比贾玲强，你上。",
          "en": "Being a celebrity first is much more difficult. It requires the right time, place, and harmony, plus good fortune. If you're stronger than Jia Ling, you go for it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "电影院看完还可以吧，没有同期的《飞驰人生 2 》好看。当然一个是女性向电影，另一个是男性热血向，可比性并不强。个人作为男观众，还是力推《飞驰人生 2 》。",
          "en": "It's okay to watch in the cinema, but it's not as good as 'Pegasus 2,' which was released at the same time. Of course, one is a female-oriented film, and the other is a male-blooded film, so there isn't much comparability. As a male audience member, I still strongly recommend 'Pegasus 2'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉 2 个小时还行，下一步准备看下另外的贺岁片",
          "en": "It felt okay for 2 hours. Next, I plan to watch another New Year's film."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好多年没看过国产电影了。因为好多年前留下了某种好印象。",
          "en": "I haven't seen a domestic movie for many years. Because it left a good impression many years ago."
        }
      ],
      "type": "replies"
    }
  ]
}