{
  "id": 1015585,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "iPhone 免越狱支持通话自动录音了！就差 NFC 模拟卡片了！",
          "en": "iPhone supports automatic call recording without jailbreaking! Only NFC card emulation is missing!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "iPhone 免越狱支持通话自动录音了！巨魔安装 audiorecorder ipa 就可以用了 ![]( https://i.imgur.com/9xygTy2.jpeg)  ![]( https://i.imgur.com/v814enh.jpeg)  ![]( https://i.imgur.com/eZikaLh.jpeg)",
          "en": "iPhone supports automatic call recording without jailbreaking! You can use it by installing audiorecorder ipa with TrollStore. ![]( https://i.imgur.com/9xygTy2.jpeg)  ![]( https://i.imgur.com/v814enh.jpeg)  ![]( https://i.imgur.com/eZikaLh.jpeg)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "以前用 iPhone ，很希望有通话录音功能。",
          "en": "When I used an iPhone before, I really wanted a call recording function."
        },
        {
          "zh": "但是换了安卓一年多了，一直，开着通话录音，但是从来，没回听过...",
          "en": "But after switching to Android for more than a year, I've always had call recording turned on, but I've never listened back..."
        },
        {
          "zh": "所以我逐渐发现对我来说基本是个伪需求了。",
          "en": "So I gradually realized that it's basically a pseudo-requirement for me."
        },
        {
          "zh": "如果真的有很重要的通话需要录音，那开免提直接用另一部手机录音甚至录像更具有证据性。",
          "en": "If there really is a very important call that needs to be recorded, then using another phone to record or even video record directly with the speakerphone is more evidentiary."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果记忆力不好，有时别人说的事情会记不全，为了避免搞错，偶尔会需要回听通话录音再次确定。",
          "en": "If your memory is not good, sometimes you can't remember everything other people say. To avoid making mistakes, you may occasionally need to listen to the call recording again to confirm."
        },
        {
          "zh": "所以这个并不是伪需求，有这个需求的也不全都是为了什么留证据。",
          "en": "So this is not a pseudo-requirement, and not everyone who has this requirement wants to keep evidence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@GoodRui #11 是一个平常无感，但是遇到了能很有用的事情。",
          "en": "@GoodRui #11 is something you don't feel normally, but it can be very useful when you encounter it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有时候很不理解那些通话录音、防撤回等功能，这些是什么心态。",
          "en": "Sometimes I don't understand those call recording, anti-recall and other functions, what kind of mentality is this."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "巨魔这东西跟越狱也没啥区别吧，利用了系统的 bug 的，不能支持最新系统",
          "en": "Isn't TrollStore the same as jailbreaking? It uses system bugs and cannot support the latest system."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@naminokoe 没太理解你的杠点…… 免越狱也能触发越狱杠？似乎无论是否越狱，PO 主或者开发者都承诺支持最新系统。就一个免越狱通话录音软件，仅此而已。",
          "en": "@naminokoe I don't quite understand your point... Can non-jailbreaking trigger jailbreaking arguments? It seems that whether or not you are jailbroken, the OP or the developer promises to support the latest system. It's just a non-jailbreaking call recording software, that's all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX #6 做生意需要，交易需要",
          "en": "@TenProX #6 Needed for doing business, needed for transactions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@GoodRui 我一直都开着自动录音，至今为止真正有必要录音的情况一共有三次。",
          "en": "@GoodRui I have always had automatic recording turned on. So far, there have been only three situations where it was really necessary to record."
        },
        {
          "zh": "其中两次是重要通话的记录。",
          "en": "Two of them were records of important calls."
        },
        {
          "zh": "还有一次作为维权的证据。",
          "en": "And once as evidence for safeguarding rights."
        },
        {
          "zh": "找人装修被坑，然后对方翻脸不认账了，之前信誓旦旦的承诺都说没说过，不知道。",
          "en": "I was scammed by someone for decoration, and then the other party denied it and said that the vows they had made before had not been said, and they didn’t know."
        },
        {
          "zh": "到工商局投诉，有这录音就管用，没这录音他们就不管。",
          "en": "If you complain to the Administration for Market Regulation, this recording will work. If there is no recording, they will not care."
        },
        {
          "zh": "除此以外，大多数时间里确实是“没用”的……",
          "en": "Other than that, it is indeed \"useless\" most of the time..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@GoodRui 哈哈哈，你这个逻辑就跟“我买了保险，但是一次都没有出险过，所以我逐渐发现保险是个伪需求”有得一拼了。",
          "en": "@GoodRui Hahaha, your logic is comparable to \"I bought insurance, but I have never had an accident, so I gradually realized that insurance is a pseudo-requirement\"."
        },
        {
          "zh": "P.S. 如果你想让录音具有“证据性”，而不是作为某个证据链的一（小）部分，那你自己换什么设备录音录像大概率也是没多大用的",
          "en": "P.S. If you want the recording to be \"evidentiary\", rather than as a (small) part of an evidence chain, then changing to any device for recording is probably not very useful."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX 有时候很不理解那些苹果脑残粉，我不用=这个功能是垃圾，什么心态？",
          "en": "@TenProX Sometimes I don't understand those Apple fanboys. I don't use it = this function is trash. What mentality is that?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@naminokoe 只是签名漏洞，不会破坏系统。也不会出现不稳定重启的情况。也没有 root",
          "en": "@naminokoe It's just a signature vulnerability and won't damage the system. There will be no unstable restarts either. No root either."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Aitisikuoliv1d 巨魔就是给 App root 权限吧，否则 App 怎么突破沙盒",
          "en": "@Aitisikuoliv1d TrollStore gives the App root privileges, right? Otherwise, how can the App break through the sandbox?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bao3 因为是利用系统 bug ，所以无法保证是否真的不影响系统稳定性和续航。https://github.com/opa334/TrollStore 巨魔不支持最新系统的吧16.7.x (excluding 16.7 RC) and 17.0.1+ will NEVER be supported (unless a third CoreTrust bug is discovered, which is unlikely).",
          "en": "@bao3 Because it uses a system bug, it is impossible to guarantee that it will not affect system stability and battery life. https://github.com/opa334/TrollStore TrollStore does not support the latest systems 16.7.x (excluding 16.7 RC) and 17.0.1+ will NEVER be supported (unless a third CoreTrust bug is discovered, which is unlikely)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX 可能你没遇到过故意打电话把事情讲的暧昧不清，故意坑你的同事。",
          "en": "@TenProX Maybe you haven't encountered colleagues who deliberately call and ambiguous about things, deliberately tricking you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX  证据需要",
          "en": "@TenProX Evidence needed"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX 所有的快递员的通话都会有通话记录，避免扯皮。",
          "en": "@TenProX All couriers' calls will have a call record to avoid disputes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在还有几个需要打电话的？都是小而美了。这个需求几乎用不了吧？",
          "en": "How many people still need to make phone calls now? Everything is small and beautiful. This requirement is almost unusable, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX 法院打官司没录音证据损失上百万，对方华为 OPPO 小米自带通话自动录音语音转文字支持搜索功能",
          "en": "@TenProX If you go to court without recording evidence, you will lose millions. Huawei OPPO Xiaomi comes with automatic call recording, voice-to-text and supports search function."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Alfie007 谈生意还是电话方便，语音清晰不掉线，微信语音网络问题会卡死听不清，苹果接听微信语音也不方便。",
          "en": "@Alfie007 It's still more convenient to talk business on the phone, the voice is clear and doesn't drop. WeChat voice network problems will freeze and cannot be heard clearly. It is also inconvenient for Apple to answer WeChat voice."
        },
        {
          "zh": "@GoodRui 法院也认可华为小米安卓自带的通话录音",
          "en": "@GoodRui The court also recognizes the built-in call recording of Huawei Xiaomi Android"
        },
        {
          "zh": "@Free3 @coinbase @hapsinge 现在美团外卖哈啰顺风车滴滴打车全是隐私号码中转号码自带录音语音转文字用于客服判责。",
          "en": "@Free3 @coinbase @hapsinge Now Meituan Waimai, Hello Chuxing, and Didi Chuxing are all private number transfer numbers with built-in recording and voice-to-text for customer service judgment."
        },
        {
          "zh": "没录音就没法判责，顺风车司机说电话已经联系接上了乘客，乘客硬说没坐上车。美团外卖外卖员说已经打电话亲手交给了顾客顾客投诉说没收到撒餐",
          "en": "Without recording, there is no way to judge responsibility. The carpool driver said that he had contacted and picked up the passenger by phone, but the passenger insisted that he had not gotten in the car. The Meituan Waimai delivery person said that he had called and handed it to the customer, but the customer complained that he had not received the scattered meal."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "通话录音 必备 觉得没啥的 是没被坑过",
          "en": "Call recording is essential. Those who think it's nothing have never been scammed."
        }
      ],
      "type": "replies"
    }
  ]
}