{
  "id": 1016005,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "孩子天天只想玩游戏，如何在路由器 openwrt 上屏蔽游戏和短视频网站",
          "en": "My child only wants to play games every day. How do I block games and short video websites on an OpenWrt router?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "如题求助",
          "en": "Seeking help as per the title."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "堵是堵不住的，相反你应该思考自己是不是从没有给孩子适当的娱乐时间。还想娱乐的孩子就还有救，等你把孩子治到无欲无求了，就开心了。",
          "en": "Blocking doesn't work. Instead, you should consider whether you haven't given your child appropriate entertainment time. A child who still wants entertainment can be saved. You'll be happy when you've 'cured' your child to the point of having no desires."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "封建余孽，活烧了你。",
          "en": "Feudal remnants, burn you alive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老爸天天限制我玩游戏，如何无声无息地拔他氧气管",
          "en": "Dad restricts me from playing games every day. How do I silently unplug his oxygen tube?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关于这个, 你其实有几种选择:1. 堵设路由器屏蔽网站, 设置网络密码等2. 疏带孩子出去玩,或者参加活动 等.3. 导引导孩子玩优秀的游戏, 看有价值的视频 等. 这三个选择, 你可能选哪一个都无法很好的解决问题,  那是因为这三者其实需要做为一整个 \"解决方案\" 一起使用.",
          "en": "Regarding this, you actually have a few choices: 1. Block websites by setting up the router, setting network passwords, etc. 2. Divert: take the child out to play, or participate in activities, etc. 3. Guide the child to play excellent games, watch valuable videos, etc. You may not be able to solve the problem well by choosing any of these three options, because these three actually need to be used as a whole 'solution'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我好奇楼上回复的，有孩子的占比是多少。",
          "en": "I'm curious about the percentage of people with children who replied above."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "退一步想，玩游戏好过刷短视频",
          "en": "Thinking one step back, playing games is better than watching short videos."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过年期间，我跟我幼儿园的儿子把马里奥惊奇通关了，断断续续打了几个月时间。小孩子的想法确实比大人惊奇的多，通过玩游戏，我发现他很多的想法我都想不到，由衷的给他竖大拇指。 下一个游戏准备玩 “双人成行”，本来打算跟老婆玩的， 结果老婆不爱玩，一直搁置着，还好生了个儿子可以陪玩。",
          "en": "During the Spring Festival, my son and I, who is in kindergarten, completed Super Mario Wonder, playing on and off for several months. Children's ideas are indeed more surprising than adults. By playing games, I found that many of his ideas I couldn't even think of, and I sincerely gave him a thumbs up. The next game we're ready to play is 'It Takes Two'. I originally planned to play it with my wife, but she doesn't like playing, so it's been put off. Fortunately, I had a son who could play with me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "带他出去走，看风景也好，爬山，逛商场也好，只要不待家里，就会没那么想玩手机，游戏问题的本质是无聊或者没其他事吸引他，才刷视频玩游戏，一旦有其他吸引，就能脱离这个环境改变了把游戏访问的网页跟视频网站的网址，设置成禁止访问，host 屏蔽https 网站用 adguard 或者 koolproxy 过滤",
          "en": "Take him out for a walk, enjoy the scenery, climb mountains, or go shopping. As long as he's not at home, he won't want to play on his phone as much. The essence of the game problem is boredom, or a lack of other things to attract him, that's why he watches videos and plays games. Once there's other attraction, he can break away from this environment. Set the webpage addresses of the game and the video website to be forbidden, host block HTTPS websites, and use adguard or koolproxy to filter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://www.fros.org.cn但是现在的手机卡流量都挺多的，他把 WiFi 关了还是照样能玩",
          "en": "https://www.fros.org.cn But now the phone cards have a lot of data, so he can still play even if he turns off the WiFi."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "来错地方了，你要是问被家长路由器限制了游戏短视频该怎么破解绕过，这里应该会有人回答你，",
          "en": "You've come to the wrong place. If you were asking how to crack and bypass parental router restrictions on games and short videos, someone here would probably answer you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1 ，启用 windows 的 family 功能，可以对儿童账号做各种限制2 ，家里使用 adguard home DNS ，直接屏蔽掉游戏大类",
          "en": "1. Enable Windows' Family feature, which can apply various restrictions to child accounts. 2. Use adguard home DNS at home to directly block game categories."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我敢肯定的说你们家长 100%自己看短视频，否则孩子根本不会看的。因为我儿子就很抵触短视频，而我和我老婆从来不看，所以最好的方法就是以身作则。至于游戏，偶尔可以玩下，甚至可以一起玩。然后约定下游戏时间，多点陪伴，大部分问题都可以解决。家里手机不离手的，你如何去教育孩子呢？",
          "en": "I dare say that 100% of you parents watch short videos yourselves; otherwise, your children wouldn't watch them at all. Because my son is very resistant to short videos, and my wife and I never watch them, so the best method is to set an example. As for games, you can play them occasionally, or even play them together. Then, set up a time for playing games, spend more time with them, and most problems can be solved. If you can't put down your phone at home, how can you educate your children?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Opengfw 试试？",
          "en": "Try Opengfw?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这里很多是开发游戏的吧",
          "en": "Many people here are game developers, aren't they?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我不太清楚其它 Android 设备和 PC 设备。因为是果粉，所以我在 Apple 生态里对设备管理了屏幕时间和授权。管理很轻松，包括大人。但楼上说的对，能吸引小孩的，是因为小孩除了游戏之外，没别的「更好的活动」。玩游戏可以锻炼思维，思考怎么走过那条路。短视频是彻底不会思考了。",
          "en": "I'm not very familiar with other Android devices and PC devices. Because I'm an Apple fan, I've managed screen time and authorizations for devices within the Apple ecosystem. Management is very easy, including for adults. But the above commenter is right, what can attract children is because they don't have other 'better activities' besides games. Playing games can exercise thinking, thinking about how to get through that path. Short videos are completely thoughtless."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大禹治水建议游戏排行打不到某个级别就不许做其它的玩乐",
          "en": "Like Da Yu controlling the floods, it's suggested that if the game ranking doesn't reach a certain level, other forms of entertainment shouldn't be allowed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "七匹狼，还孩子一个完整的童年",
          "en": "Seven Wolves, give the child a complete childhood."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议双管齐下，纯靠堵是没有用的，必须要转变孩子的心态，适当给予已定放松娱乐得时间，也鼓励他多做做户外活动",
          "en": "It is recommended to take a two-pronged approach. Relying solely on blocking is useless. It is necessary to change the child's mindset, appropriately give them a set amount of time for relaxation and entertainment, and encourage them to do more outdoor activities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "换过思路， 你一方面千方百计使用各种方法 e.g host 文件，adguard , opengfw 阻止他，另一方面开始向他教授基本网络原理， 学习 Kali Linux ，legal hacking 。 将他的兴趣由看短视频打游戏转向成为网络保安工程师， 争取高中前考获 CISSP 资格。",
          "en": "Change your mindset. On the one hand, try every possible method, e.g., host files, adguard, opengfw, to block him. On the other hand, start teaching him the basic principles of networking, learning Kali Linux, and legal hacking. Shift his interest from watching short videos and playing games to becoming a cybersecurity engineer and try to obtain CISSP certification before high school."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我看上面很多人没有分清楚短视频\\手游和我们以前玩的游戏的区别。这些产品经理对人性的研究可不像以前的游戏开发者那么友好",
          "en": "I see that many people above haven't made clear the difference between short videos / mobile games and the games we used to play. The product managers' research on human nature is not as friendly as that of previous game developers."
        }
      ],
      "type": "replies"
    }
  ]
}