{
  "id": 1014574,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "无解的题：楼上走路声音直击脑门，怎么办？",
          "en": "An unsolvable problem: What to do about the sound of footsteps from upstairs hitting my head?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "除了用 xx 神器互相伤害还有好的解决方案吗？\r\n几百万贷款买的房子还不如我之前在出租屋睡得香\r\n我快要崩溃了，冲茶倒水走路的声音听着不重但是直击脑门",
          "en": "Besides using xx gadgets to hurt each other, are there any good solutions?\r\nThe house I bought with millions in loans isn't as comfortable as the rental I slept in before.\r\nI'm about to break down, the sound of walking and pouring tea isn't loud but it hits my head directly."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "人家正常生活走路你想着 XX 神器？你能不能先解决下自己的脑子回路问题啊。再加点钱换个大别野吧。",
          "en": "They're just living normally, and you're thinking of XX gadgets? Can't you solve your own brain circuit problems first? Add some more money and get a big villa."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "农村出身毕业租房，到现在换了好几个房子隔音都有问题。很难想象以后一辈子积蓄买了这样一个房子。",
          "en": "Born in the countryside, graduated and rented. I've changed several houses by now and the soundproofing has all been a problem. It's hard to imagine buying a house like this with a lifetime of savings later on."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "鸽子笼直接增加了韭菜的内耗，间接建立了永久型韭菜互斗状态机，虽然是概率性建立（万一所有人素质都很好），但能有一个是一个，你要是住 house ，你在你家 basement 开音乐会都没事啊",
          "en": "Pigeon coops directly increase the internal consumption of the leeks, indirectly establishing a permanent leek mutual combat state machine. Although it is probabilistic (in case everyone is of good quality), one is one. If you live in a house, you can have a concert in your basement without any problems."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "走动倒水都能听见，问题就是房子不行。跟人家楼上没啥关系。",
          "en": "You can even hear walking and pouring water. The problem is the house is not good. It has nothing to do with the people upstairs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@smile2wild 加隔音层比较麻烦，除非重装修，一般不做。和房屋外墙内侧加装保温层类似。但是有利有弊，加隔音层会减少房屋层高约 10-15CM ；加保温层会增加外墙的内部厚度约 10-15CM ，减少屋内使用面积。而且使用环保材料的话费用不低。https://www.chiphell.com/thread-2577479-1-1.html这里有加装保温层的照片，加隔音层类似。",
          "en": "@smile2wild Adding a soundproofing layer is more troublesome unless you renovate, generally it won't be done. It's similar to adding a thermal insulation layer to the inner side of the exterior walls of a house. But there are pros and cons. Adding a soundproofing layer will reduce the height of the house by about 10-15CM; adding a thermal insulation layer will increase the internal thickness of the exterior walls by about 10-15CM, reducing the usable area inside the house. And the cost is not low if you use environmentally friendly materials. https://www.chiphell.com/thread-2577479-1-1.html There are photos of adding a thermal insulation layer here, the soundproofing layer is similar."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近也遇到了 估计是楼上小孩放寒假了，或者是玩哑铃。唉，一辈子的钱砸下去还是这个品质。",
          "en": "I've encountered this recently too. I guess the kids upstairs are on winter break, or maybe they're playing with dumbbells. Sigh, the quality is still like this even after putting down a lifetime's worth of money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吸音棉的话我同一个小区的朋友家装过，有用，他的说法感觉上能减弱 50%的日常噪音，但是如果楼上穿硬底鞋走路或者东西掉在地上噪音还是非常大另外说句这些噪音跟楼房品质没关系，只跟楼上住户素质有关，我朋友家豪宅大平层品质算是当地顶级的了，楼板厚度非常厚还做了什么隔音处理，因为是他们公司建的所以了解过这些，但还是被楼上小孩折腾的两家吵的不可开交，遇上有钱的流氓更是一点办法都没有，没有噪音困扰的应该感谢楼上邻居",
          "en": "As for sound-absorbing cotton, a friend of mine in the same community installed it, and it worked. He said that it felt like it reduced 50% of the daily noise. But if the people upstairs wear hard-soled shoes or drop things on the floor, the noise is still very loud. Also, these noises have nothing to do with the quality of the building, but only with the quality of the residents upstairs. My friend's luxury apartment is considered to be the top quality in the local area. The floor is very thick and has some soundproofing treatment. Because their company built it, they knew about these things. But they are still being bothered by the children upstairs, and the two families are having a lot of quarrels. There is nothing you can do if you meet a rich thug. Those who are not bothered by noise should thank their neighbors upstairs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "无解，只能下套房买顶楼或独栋",
          "en": "There's no solution, you can only buy a penthouse apartment or a detached house."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@baihaoyang 我住过顶楼，隔壁一度高分贝长时间的为爱鼓掌，能在半个小时以上甚至长达一个小时，然后就高声放音乐，真的墙壁发颤。曾经交涉过一两次，有所改善。再后来，谢天谢地，他们搬走了。不知道他是在和老婆啪啪还是在做充气娃娃，真的是声音太大，时间太长。",
          "en": "@baihaoyang I've lived on the top floor. The neighbors next door were once loudly applauding for love for a long time, which could last for more than half an hour, even as long as an hour. Then they played loud music, and the walls were really trembling. I had negotiated a couple of times, and there was some improvement. Later, thank God, they moved away. I don't know if he was having sex with his wife or doing an inflatable doll. The sound was really too loud and the time was too long."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "换个楼上，或者换个脑门",
          "en": "Change the upstairs neighbors, or change your head."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一群不知道噪音带来困扰的人在这里冷嘲热讽，真逗，过来人给两个解决方案1.安耳悠隔音耳塞，认真看使用说明，低频也能挡住一些2.引入白噪音，大开窗或者放白噪音音乐，比如雨声流水声丛林声不能改变别人，毕竟别人是正常活动，并不是故意跳跑，重手关门之类，如果超 12 点还经常走来走去也只能好声好气沟通，锅在奸商，本身隔板差然后楼上装修又是木地板，震震果实直击脑门，没办法。我深知声音敏感人群的痛苦，一些题目都不看就在建议人搬走换别墅的，真的，不会说话就请闭嘴",
          "en": "A group of people who don't know the trouble caused by noise are here sarcastically mocking. It's funny. Here are two solutions from someone who has been through this: 1. Use earplugs, see the instructions carefully, and low frequencies can also be blocked. 2. Introduce white noise, open the windows or play white noise music, such as rain sounds, running water sounds, and jungle sounds. You can't change others, after all, others are normal activities, not deliberately jumping, slamming doors, etc. If they are still walking around after 12 o'clock, you can only communicate politely. The problem is with the unscrupulous merchants. The partition is poor, and the upstairs is renovated with wooden floors, the tremor fruit directly hits the forehead, there is no way. I know the pain of people sensitive to sound. Some people don't even read the topic and are suggesting that people move out and exchange villas. Seriously, if you don't know how to speak, please shut up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人要是在家正常走动端茶倒水好像也没啥问题吧，房子隔音这么差？还是楼上故意搞大动作呢 建议先沟通吧",
          "en": "It seems like there's no problem for people to walk around normally and pour tea at home. Is the soundproofing of the house so bad? Or is the upstairs deliberately making big moves? It is recommended to communicate first."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JingXiao 之前租过郊区回迁房，楼上打电话正常说话，一句话我能听清一半还多……就纳闷，楼房隔音水平，不存在相关规定嘛？",
          "en": "@JingXiao I rented a resettlement house in the suburbs before. When the people upstairs were talking on the phone normally, I could hear more than half of their sentences... I am puzzled, are there no relevant regulations on the soundproofing level of buildings?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JingXiao 楼上是出租的，卧室不单纯是卧室",
          "en": "@JingXiao The people upstairs are renting, and the bedroom is not just a bedroom."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MuSeCanYang 出租的，瓶子放地上冲水能不听到吗？敲门还不开门，是真的苟骂都骂不到。。",
          "en": "@MuSeCanYang It's rented, can you not hear the bottle being placed on the ground and the toilet being flushed? They don't open the door when you knock, you really can't even scold them..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "解决办法倒是有，就是麻烦了点喝过了点。局部装修，屋顶加装吊顶层，加吸音棉。",
          "en": "There are solutions, but they are a bit troublesome. Local renovation, adding a suspended ceiling layer to the roof, and adding sound-absorbing cotton."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@testver 吸音棉是直接加在吊顶那边吗？直接找装修公司？老兄你肯定也经历过。。。不像那些人直接怼我",
          "en": "@testver Is the sound-absorbing cotton added directly to the suspended ceiling? Find a decoration company directly? Brother, you must have experienced it too... unlike those people who directly attack me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@uiosun #3 是啊 房子有问题吧，从 OP 描述来看正常走路没有蹦蹦跳跳，杯子放地上冲水这些行为也不算过分的生活行为吧",
          "en": "@uiosun #3 Yes, the house has a problem. According to the OP's description, they are walking normally and not jumping around. Putting a cup on the floor and flushing are not excessive living behaviors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@smile2wild 加上只能缓解，没用。估计楼板厚度和楼上装修都有关系。终极方法，楼上不搬只能你搬了。你这种估计四周的隔音都不会太好",
          "en": "@smile2wild Adding it can only alleviate the problem, it won't solve it. It is estimated that it is related to the thickness of the floor and the decoration upstairs. The ultimate solution is, if the people upstairs don't move, only you can move. In your case, the soundproofing of the surroundings is probably not very good either."
        }
      ],
      "type": "replies"
    }
  ]
}