{
  "id": 1015216,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "美股几巨头真是涨的猛",
          "en": "The major US tech giants are really seeing a sharp rise."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "看着英伟达和他的朋友圈连续狂涨，但是国内只能买到纳斯达克 100etf 的 QDII 不仅分散且限额，看着好眼馋",
          "en": "Watching Nvidia and its circle of friends continuously surge, but I can only buy the Nasdaq 100 ETF's QDII in China, which is not only diversified but also limited in amount, making me envious."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@dhja #9 你上这个网站都违法了，需要你赚钱了你说怕违法",
          "en": "@dhja #9 You are already breaking the law by going on this website, and you're afraid of breaking the law when you need to make money?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@butterls #23 是的，这就是缺点，但你如果长期看到美股的话，这没什么太大所谓，因为延迟也就一天，第二天就更新份额了。我目前配备是纳斯达克 100etf 指数 20%，这个你在支付宝搜就好了，能买哪间买哪间。另外其他就分散买下面的，我买的都是科技股，如果你看好一些特别品牌，可以在支付宝基金搜索重创星巴克的有什么，再点进去看看这只股票包含什么，然后看情况买就好了。https://www.gffunds.com.cn/funds/?fundcode=270023&fromSearch=1https://www.jsfund.cn/main/fund/000043/fundHolding.shtmlhttps://www.py-axa.com/productDetails?fundCode=014002&type=27",
          "en": "@butterls #23 Yes, that's the disadvantage, but if you look at US stocks long-term, it's not a big deal, because the delay is only one day, and the shares are updated the next day. I'm currently allocating 20% to the Nasdaq 100 ETF index, you can search for it on Alipay, and buy whichever one you can. In addition, diversify and buy the following stocks; I buy tech stocks. If you like some particular brands, you can search on Alipay for funds that have significantly impacted Starbucks, then click into it and see what stocks are included, and then buy accordingly. https://www.gffunds.com.cn/funds/?fundcode=270023&fromSearch=1 https://www.jsfund.cn/main/fund/000043/fundHolding.shtml https://www.py-axa.com/productDetails?fundCode=014002&type=27"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接去开个美股账号啊，又不是很复杂，互联网券商不少",
          "en": "Just open a US stock account, it's not that complicated, there are many internet brokers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "IBKR 直接来",
          "en": "IBKR directly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那你为啥不买美股呢",
          "en": "Then why don't you buy US stocks?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看了一下主要是过年前那几天涨疯了.",
          "en": "I looked, and it was mainly the few days before the Chinese New Year that it went crazy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gudiang 开户是小事，国内限额你又不是不知道",
          "en": "@gudiang Opening an account is a small matter, you know the domestic quota limits."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dhja 拿出你写程序的钻研精神 不出半天你就能找到解决办法",
          "en": "@dhja Use the spirit of researching that you have when writing programs, and you can find a solution in less than half a day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去 hk ，开一个 ZABANK 手机开就行了。然后把自己的 RMB 换成 USDT 去 HK 倒卖掉。存入证券账户，如果要换回来，一大把线下的换汇点随便换几十万。开个银联的香港卡存入，直接国内刷。",
          "en": "Go to Hong Kong, and open a ZABANK account, you can do it on your phone. Then convert your RMB to USDT in Hong Kong and sell it there. Deposit it into a securities account. If you want to exchange it back, there are a lot of offline currency exchange points where you can exchange hundreds of thousands. Open a UnionPay Hong Kong card and deposit money, then you can spend it directly in China."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你会发现，大 A 都这么跌了，对国际金融愣是没有屁影响…",
          "en": "You'll find that even though A-shares have fallen so much, it has absolutely no effect on international finance..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@0x010203 前提是不违法",
          "en": "@0x010203 The premise is it's not illegal."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "后悔 60 的时候没买 Cloudflare",
          "en": "Regret not buying Cloudflare at 60."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "货币超发 ...",
          "en": "Currency overissuance..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是的呀，一直在买，建议你关注一下减肥药，诺和诺德，礼来，，我的高位买的，不过又涨了 20% 了",
          "en": "Yes, I've been buying it. I suggest you pay attention to weight loss drugs, Novo Nordisk, Eli Lilly. I bought at a high price, but it has risen another 20%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我今年美股都快翻倍了",
          "en": "My US stocks have almost doubled this year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实可以在支付宝搜索买美股的基金。好处：你基本不用打理，基金经理会去操作，坏处：因为你没法打理，也没法选择股票的比例。我一月份购买的分别吃到 Meta 财报 20%，英伟达的，礼来减肥药的红利，但也不是每一只基金都会包括这几样，建议你分散投资，并且每天都关注一下股票的出入。",
          "en": "Actually, you can search on Alipay to buy funds that invest in US stocks. Advantages: you basically don't need to manage it, the fund manager will operate it. Disadvantages: because you can't manage it, you can't choose the proportion of stocks. I bought in January and respectively benefited from Meta's financial report, 20%, Nvidia, and the dividends from Eli Lilly's weight loss drugs, but not every fund will include these, I suggest you diversify and pay attention to the stock's inflow and outflow every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "国内投资跑掉的钱，总得找个地方继续生蛋",
          "en": "The money that has run away from domestic investment, has to find a place to continue to lay eggs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "（只反应现象，未暗示深度原因）",
          "en": "(Only reflects the phenomenon, does not imply the deep reason)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cuicuiv5 60 时候卖掉的我更后悔",
          "en": "@cuicuiv5 I regret selling it when it was at 60 even more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yyzh 请问下 你这持仓多少啊",
          "en": "@yyzh May I ask how much your holdings are?"
        }
      ],
      "type": "replies"
    }
  ]
}