{
  "id": 1018676,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "流量卡的新选择 广电",
          "en": "A new choice for data plans: CBN"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我看有不少推荐电信 185g 星卡的那个，我之前办理的湖北星就是这种，让我注销掉了，还是 20 年套餐的那种，主要的原因就是网络质量太差了，这个卡在电信网络里面等级应该是最低的那一档，在用户多的地方使用网络会非常的差。",
          "en": "I've seen quite a few recommendations for the China Telecom 185GB Star Card. The Hubei Star card I previously subscribed to was this type. I had it cancelled. It was still a 2020 plan. The main reason was the poor network quality. This card's priority within the China Telecom network should be the lowest tier. The network performs very poorly in crowded areas."
        },
        {
          "zh": "\n\n销户后没有再选择网上电信和联通的那种叠加包的卡了，办理一张广电卡试试，使用了几天发现还不错，推荐市区有移动 5g 的频段使用，也就是 n41/n79 ，如果没有 5g 这卡就是废卡。\n![1000003277.jpg]( https://cdn.sa.net/2024/02/27/T2BgliFbnXIyc3d.jpg)\n这是 n41 户外测试网速，可以看到目前还没有限速的。",
          "en": "\n\nAfter canceling, I didn't choose those bundled packages from China Telecom and China Unicom online anymore. I decided to try a CBN card. After using it for a few days, I found it's not bad. It's recommended to use it in urban areas with China Mobile's 5G bands, which are n41/n79. Without 5G, this card is useless.\n![1000003277.jpg]( https://cdn.sa.net/2024/02/27/T2BgliFbnXIyc3d.jpg)\nThis is the outdoor speed test on n41. You can see that there is currently no speed limit."
        },
        {
          "zh": "\n\n我同时有移动和广电，可以看到 5g 网络下基本一样的。这卡的缺点非常明显，除了 5g 基本不能用，网点少，销户困难，所以说当地没有网点就不要办理。套餐就是 29 块 100g100 分钟，39 块 150g150 分钟，我直接办理了一个惠民年卡，会每个月优惠 10 块钱也就是 19 的双百，不过需要一次性缴费。",
          "en": "\n\nI have both China Mobile and CBN cards. You can see that the 5G network is basically the same. The disadvantages of this card are very obvious. It's basically unusable without 5G, there are few service centers, and it's difficult to cancel. Therefore, don't get this card if there are no service centers in your area. The plans are 29 yuan for 100GB and 100 minutes, 39 yuan for 150GB and 150 minutes. I directly subscribed to a Huimin annual card, which gives a 10 yuan discount each month, making it 19 yuan for both 100GB and 100 minutes, but it requires a one-time payment."
        },
        {
          "zh": "\n\n对了电信销户现在也比较麻烦，需要接归属地的视频营业厅销户，不想的话直接投诉即可。",
          "en": "\n\nBy the way, canceling China Telecom is now also quite troublesome. You need to connect to the video service center in the area where you registered the card to cancel. If you don't want to do that, you can just file a complaint."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@Livid @Kai @Olivia @GordianZ @sparanoid  此贴下面存在多个推广回复",
          "en": "@Livid @Kai @Olivia @GordianZ @sparanoid There are multiple promotional replies below this post."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我前 10 几天前刚在电信 app 销户啊  挺流畅的啊。不需要什么视频哦然后也办理广电的惠民年卡，回老家乡镇，老家原来用电信卡信号极差，上网都成问题，广电倒是稳得很。。",
          "en": "I just canceled my China Telecom account through the app about 10 days ago. It was quite smooth. No video verification was required. Then, I also subscribed to the CBN Huimin annual card. When I returned to my hometown, the signal was very poor with the China Telecom card, and accessing the internet was a problem. CBN, on the other hand, is very stable."
        },
        {
          "zh": "广电惠民年卡，228 元一年（每月 19 元），100g+100 分钟，长期套餐，官方办理（微信公众号）优点 1 ，这个 100g 是可以月结余的，当月用不完的流量可以结余到下个月。而且每月还自动送流量，“用多少送多少”，有几个档位送，免费的。",
          "en": "CBN Huimin annual card, 228 yuan per year (19 yuan per month), 100GB + 100 minutes, long-term plan, officially handled (WeChat official account). Advantage 1: This 100GB can be rolled over monthly. Unused data from the current month can be rolled over to the next month. And each month, data is automatically given away, 'the more you use, the more you get,' there are several tiers of free data."
        },
        {
          "zh": "优点 2 ， 可以办理 2 张副卡，每月只要 6 元！我已经把我妈和老婆的卡全部改为了 8 元保号套餐，然后在办理广电的副卡给他们用。虽然广电惠民卡的流量比不上那些动辄 100 多 g 的其他套餐，但是它的优点非常适合我和家人，我全家整体使用流量不多，因为所在的固定场所都有 Wi-Fi 了，我和家人一起都用不完 100g 的，流量又可以转结下个月，副卡又便宜，主副通话又免费",
          "en": "Advantage 2: You can get 2 SIM cards for only 6 yuan per month! i have changed my mum and wife's sim cards to 8 yuan preservation plans, and then obtained CBN's sim cards. Although the data provided is not as much those other plans with over 100GB, its pros are suitable for me and my family, we don't use much data as we have a fixed location for Wifi, and we can't finish 100GB for me and my family together, and the data can be preserved for the next month, and the SIM cards are cheap, the call logs are free."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@karlxu  这个是官网办理链接，我之前在网上看到的，查了备案确实是广电的网站，后面 chanId 删掉就访问不了，应该不是 aff 。https://m.10099.com.cn/h5wap/busiClient/account/huiminCard/index.html?chanId=VCH020001187我就是在这个链接申请的，选归属地，选号，要提交身份证，然后支付 228 ，第二天京东快递送达，要带身份证，快递小哥协助开卡。",
          "en": "@karlxu This is the official website link. I saw it online before. I checked the record and confirmed that it is the CBN website. If you delete chanId at the end you can't access it, so it shouldn't be an affiliate link.https://m.10099.com.cn/h5wap/busiClient/account/huiminCard/index.html?chanId=VCH020001187 I applied through this link. Choose your area, choose a number, submit your ID card, and pay 228. The next day, JD Express delivered it. You need to bring your ID card, and the courier will help activate the card."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近也想办个广电的惠民年卡",
          "en": "I've been thinking about getting a CBN Huimin annual card recently."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这些卡如果不销户，会有什么影响吗？大哥",
          "en": "What are the consequences if these cards are not canceled, bro?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我办的电信 19 元 190g 的 网络也还好啊，目前体验良好",
          "en": "I got a China Telecom 19 yuan 190GB plan, and the network is okay. I'm having a good experience so far."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "理论上现在销户都很简单的吧",
          "en": "In theory, canceling accounts should be very simple now, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "惠民年卡只有一年优惠",
          "en": "The Huimin annual card only has a one-year discount."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你那个惠民年卡有没有确认是优惠一年还是长期优惠的？会不会变成 29 元每月？",
          "en": "Have you confirmed whether your Huimin annual card is a one-year discount or a long-term discount? Will it become 29 yuan per month?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@TenProX 没啥影响吧，但是占用这个名额。",
          "en": "@TenProX There's no real impact I believe, but it takes up the quota."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@isAK47 不一定, 联通的销户就很简单, 电信的就各种烦人",
          "en": "@isAK47 Not necessarily. Canceling China Unicom is very simple, but China Telecom is very annoying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@isAK47 电信之前 app 直接销户，现在需要视频营业厅了。广电我在 app 没看见在线销户，说是要找客服。",
          "en": "@isAK47 China Telecom used to allow cancellation directly through the app, but now you need a video service center. I didn't see online cancellation in the CBN app. It says you need to contact customer service."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gdfsjunjun 我问了在线客服，客服回复会在最后一个月提醒是否续约年卡，续约就是 19 ，不续就是双百 29 ，客服是这么说，我没用一年我不确定。",
          "en": "@gdfsjunjun I asked the online customer service, and they replied that they would remind me in the last month whether to renew the annual card. Renewal is 19, and without renewal it is 29 for double 100. That's what the customer service said. I haven't used it for a year, so I'm not sure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好多 19 元几十个 G ，29 元一百多两百个 G 的卡。一般一到两年优惠期。有的送一些通话时长。似乎比广电还便宜一点。三大运营商都有。smzdm.com 上一搜一大把。",
          "en": "There are many cards with dozens of GB for 19 yuan and one or two hundred GB for 29 yuan. Generally, the discount period is one to two years. Some offer some free call minutes too. Seems a bit cheaper than CBN. All three major carriers have them. A search on smzdm.com will yield a lot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yhtbiy 在线客服说最后一个月可以续约，我也不太确定。",
          "en": "@yhtbiy The online customer service said that you can renew in the last month, but I'm not sure either."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "什么时候销户也成了难题了？停机一段时间自动销户",
          "en": "Since when has canceling an account become a problem? Accounts are automatically canceled after being suspended for a period of time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "广电用的就是移动的基站，完全看网络情况，室内信号非常差@TenProX 一人名下好像只能绑定 5 ～ 6 张卡，一直扣费失信人？",
          "en": "CBN uses China Mobile's base stations, so it completely depends on the network conditions. The indoor signal is very poor. @TenProX It seems that one person can only bind 5-6 cards under their name. Will continuous deductions lead to being blacklisted?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "信号好不好，这不是看手机和运营商吗，为什么会牵涉到手机卡",
          "en": "Whether the signal is good or not depends on the phone and the carrier, right? Why would it involve the SIM card?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "广电本来办了个 29 的，然后有人又推了个广电校园卡，就转头去把 29 那张卡注销了，去营业厅，10 分钟就注销好了，挺方便的",
          "en": "I originally got a 29 yuan CBN card, and then someone recommended a CBN campus card, so I turned around and canceled the 29 yuan card. I went to the service center, and it was canceled in 10 minutes, very convenient."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Arvin0913 惠民年卡有些地方在线无法办理，比如我这的深圳就是在线没有号，推荐直接打 10099 告知你要办理号卡，套餐为惠民卡，就会有人上门办理。",
          "en": "@Arvin0913 The Huimin annual card cannot be processed online in some places. For example, in Shenzhen where I am, there are no numbers available online. It is recommended to call 10099 directly and say that you want to apply for a number card, and the plan is the Huimin card, then someone will come to your door to handle it."
        }
      ],
      "type": "replies"
    }
  ]
}