{
  "id": 1017206,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想听各位老哥断断家务事",
          "en": "Looking for advice from you all on a family matter."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "想听各位老哥断断家务事，最近几天是心烦意乱，无心上班。",
          "en": "Looking for advice from you all on a family matter. I've been feeling distraught and unable to focus on work these past few days."
        },
        {
          "zh": "\r\n\r\n### 背景：\r\n\r\n1 、OP 家里有兄弟两个，OP 是老大。\r\n2 、OP 和老婆是学校自谈结婚，结婚时订婚加彩礼一共 3W ，买房时父母又资助了 15W 。就这样在某二线城市买房上了车。\r\n3 、OP 有个弟弟，23 年刚毕业参加工作，目前正在相亲。",
          "en": "\n\n### Background:\n\n1.  OP has two brothers, and OP is the eldest.\n2.  OP and his wife met in school and got married. The engagement and bride price totaled 30,000 [currency unspecified]. When buying a house, his parents helped with 150,000 [currency unspecified]. That's how they were able to buy a house in a second-tier city.\n3.  OP has a younger brother who just graduated and started working in 2023 and is currently dating with the prospect of marriage."
        },
        {
          "zh": "\r\n\r\n### 直接问题：\r\n过年回家时，父母谈起了家里的钱说：就剩 OP 弟弟没结婚了，但是钱也不能全都给他，按照给钱时的家庭年收入倍数给。举个例子：OP 是 18 年买的房，当时家庭年收入 4W ，买房给了 15W 。如果弟弟结婚买房，现在年收入是 8W ，就应该给 8*15/4=30W 。",
          "en": "\n\n### Direct Problem:\nWhen I went home for the Spring Festival, my parents talked about the family's money and said: Only OP's younger brother is not married yet, but we can't give him all the money. We will give it based on multiples of the family's annual income at the time of giving the money. For example: OP bought a house in 2018, and the family's annual income at that time was 40,000 [currency unspecified], and they gave 150,000 [currency unspecified] to buy the house. If my brother gets married and buys a house, and the current annual income is 80,000 [currency unspecified], he should be given 8*15/4=300,000 [currency unspecified]."
        },
        {
          "zh": "\r\n\r\n### 矛盾点：\r\n老婆因为这个问题觉得不公平，订婚加彩礼的钱另说，但是买房给的钱不应该按照年收入的倍数来，应该按照房价的涨幅来，说是父母这样不公平，老二有点坐享其成了，啥也不用干就得了 30W 。",
          "en": "\n\n### Point of Conflict:\nWife feels this is unfair. The money for the engagement and bride price is another matter, but the money given for buying a house should not be based on multiples of annual income, but on the increase in housing prices. She says that it's unfair of the parents, that the younger brother is getting something for nothing, getting 300,000 [currency unspecified] for doing nothing."
        },
        {
          "zh": "OP 觉得老人的钱，想怎么给是他们的事情，老婆觉得老人明显不公平，还要装作很公平，心里难以接受。于是争吵了好几天。",
          "en": "OP feels that it's the parents' money and they can give it however they want. Wife feels that the parents are obviously being unfair and are pretending to be fair, which is hard to accept. So they have been arguing for days."
        },
        {
          "zh": "\r\n\r\nOP 实在不擅长处理这些事情，详情各位老哥帮帮忙，出出主意该怎么平息这场“家庭风波”。",
          "en": "\n\nOP is really bad at handling these things. Please help, everyone, and give me some advice on how to calm this 'family storm'."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "钱是你爹妈的 你媳妇凭啥觉得不公平呢就算他们去世了 去世前写个遗嘱 遗产也是想给谁给谁啊她管管你们夫妻共同财产也就算了连父母的钱也要管手也伸得太长了吧",
          "en": "It's your parents' money. Why does your wife think it's unfair? Even if they pass away, they can write a will before they die and give the inheritance to whomever they want. It's one thing for her to manage your joint marital property, but to even manage your parents' money is reaching too far."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有很多楼层说这是父母的钱，该怎么分配无权过问。这是典型的“理想主义”。",
          "en": "Many commenters are saying that it's the parents' money and that others have no right to question how it's distributed. This is typical 'idealism'."
        },
        {
          "zh": "OP 的点也不在于钱，父母的钱哪怕一分不给也无所谓，最重要的是要么都不一分不给，不能不公平。",
          "en": "OP's point is not about the money. Even if the parents don't give a single penny, it doesn't matter. The most important thing is that if they don't give anything, they don't give anything to either side, but it can't be unfair."
        },
        {
          "zh": "现在一方给的多，另一方给的少，就是偏心，不患寡而患不均。",
          "en": "Now, if one side is given more and the other side is given less, it's biased. The problem is not scarcity, but inequality."
        },
        {
          "zh": "就像领导给你分配脏活累活，你同事啥也不干就能拿很高的奖金，你也能说出“领导想怎么分配工作是他的事”这种话来说服自己接受这种不公平吗？",
          "en": "It's like if your boss assigns you dirty and hard work, and your colleague does nothing and gets a high bonus, can you say 'It's up to the boss how he assigns work' to convince yourself to accept this unfairness?"
        },
        {
          "zh": "说服媳妇儿接受是最稳定的做法，总不能家里闹的鸡飞狗跳吧？",
          "en": "Convincing your wife to accept it is the most stable approach. You can't have the house in chaos, can you?"
        },
        {
          "zh": "但不能说因为父母的钱他们愿意怎么分是他们的事，这就像你被职场霸凌了还劝你接受领导的分配一样坏。",
          "en": "But you can't say that because it's the parents' money, they can distribute it however they want. That's as bad as being bullied at work and being told to accept the boss's assignment."
        },
        {
          "zh": "首先你要肯定你媳妇儿的心情，要承认被不公平了，要站在她这边让她觉得被理解了。",
          "en": "First, you have to acknowledge your wife's feelings, admit that it's unfair, and stand by her to make her feel understood."
        },
        {
          "zh": "然后再说现在时代不一样了，每个人结婚要的钱也不一样，让她理解目前的处境。",
          "en": "Then say that times are different now, and everyone needs different amounts of money to get married. Make her understand the current situation."
        },
        {
          "zh": "最后你要说你会好好对她弥补这种亏欠。",
          "en": "Finally, you have to say that you will treat her well to make up for this deficit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不患寡而患不均ls 很多人说父母的钱该怎么给是他们的事这道理是没错。",
          "en": "The problem is not scarcity, but inequality. A lot of people are saying that it's up to the parents how they give their money, and that's true."
        },
        {
          "zh": "但这依旧改变不了在给钱这件事上，父母不公平的事实。",
          "en": "But that still doesn't change the fact that the parents are being unfair in giving the money."
        },
        {
          "zh": "这就好像你过年去拜年，亲戚给了你 10 块钱红包，然后又转头给了你弟弟 100 块钱红包，你的老婆觉得亲戚这就是在侮辱人一样。",
          "en": "It's like if you go to visit relatives during the Spring Festival, and the relatives give you a 10 [currency unspecified] yuan red envelope, and then turn around and give your brother a 100 [currency unspecified] yuan red envelope, your wife would feel like the relatives are insulting you."
        },
        {
          "zh": "自然钱是亲戚的他爱给多少是他的事情，但这么明显的差别对待是另一回事。",
          "en": "Of course, it's the relatives' money and they can give however much they want, but such obvious differential treatment is another matter."
        },
        {
          "zh": "如果 lz 买房后房价暴涨了那还能另当别论，可 lz 是 18 年买的房。。。。",
          "en": "If the housing prices had skyrocketed after LZ bought the house, that would be another matter, but LZ bought the house in 2018..."
        },
        {
          "zh": "lz 自己不在乎无所谓，但至少自己心里得有杆秤，知道自己被差别对待了。",
          "en": "It doesn't matter if LZ doesn't care, but at least you have to have a scale in your heart and know that you're being treated differently."
        },
        {
          "zh": "别到时候说自己妻子小气、劝妻子大度之类的，毕竟俗话说劝人大度遭雷劈。",
          "en": "Don't say that your wife is stingy or advise her to be generous, because as the saying goes, advising people to be generous will be struck by lightning."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "傻瓜，解决这个问题的方式，是评论谁对谁错吗？",
          "en": "Fool, is the way to solve this problem to comment on who is right and who is wrong?"
        },
        {
          "zh": "是让你老婆认识到错误吗？",
          "en": "Is it to make your wife realize her mistake?"
        },
        {
          "zh": "蠢材！！！",
          "en": "Idiot!!!"
        },
        {
          "zh": "正确的处理方式，是安慰老婆、宽慰老婆，让老婆感受到你对她的好。",
          "en": "The correct way to handle it is to comfort your wife, reassure her, and let her feel how good you are to her."
        },
        {
          "zh": "你对她足够好了，你父母的做法她就不会放在心上了。",
          "en": "If you are good enough to her, she won't take your parents' actions to heart."
        },
        {
          "zh": "类似于一些做法，自己偷偷拿个几万块钱给她，说父母补给她的，说父母也知道亏待她了，但心里觉得还是她好，等等。",
          "en": "Similar to some approaches, secretly take tens of thousands of [unspecified currency] yuan and give it to her, saying that her parents are making up for it, saying that her parents also know that they have treated her unfairly, but they still think she is good, etc."
        },
        {
          "zh": "或者，说本来父母希望跟你借个 N 万块钱的给弟弟的，但后来觉得你们也不容易，还是父母承担了相关的费用。",
          "en": "Or, say that the parents originally wanted to borrow N tens of thousands of [unspecified currency] yuan from you to give to your brother, but later they felt that you were not easy either, and the parents still bear the relevant expenses."
        },
        {
          "zh": "或者，补充一下说，你们条件比弟弟好，收入比弟弟高，云云。",
          "en": "Or, add that your conditions are better than your brother, your income is higher than your brother, etc."
        },
        {
          "zh": "让老婆心理上得到满足，得到平衡。",
          "en": "Let your wife be psychologically satisfied and balanced."
        },
        {
          "zh": "不要照搬这样的做法，根据你家情况自由发挥。",
          "en": "Don't copy this approach, feel free to use it according to your family situation."
        },
        {
          "zh": "常理来讲，父母的钱，父母想怎么支配就怎么支配；而且，现在行情与过去不同了，弟弟多一些，也能在情理中。",
          "en": "Logically speaking, the parents' money, the parents can spend it however they want; Moreover, the market is different now than in the past, and it is reasonable for younger brothers to have more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 从你们结婚就给了 3W 彩礼看，这媳妇是真不错的；再加上丈母娘给的 10W 买房钱，丈母娘家也不错。",
          "en": "1. Judging from the fact that you gave 30,000 [currency unspecified] bride price when you got married, this wife is really good; In addition, the mother-in-law gave 100,000 [currency unspecified] to buy a house, and the mother-in-law's family is also good."
        },
        {
          "zh": "2. 楼上说媳妇手太长的。。你们是真的不在凡间生活的理中客么，父母的钱媳妇当然有权参与讨论（本人男，不是偏帮女性；当然这里说的是讨论，不是管理）。",
          "en": "2. The commenter above mentioned that the wife stretches her hand too far... Are you people really rational people who don't live in the mortal world? Of course, the wife has the right to participate in the discussion of the parents' money (I am a man, not biased towards women; of course, this is a discussion, not management)."
        },
        {
          "zh": "因为一旦成为家庭的一份子，父母的钱就不是单纯他们自己的了。",
          "en": "Because once you become a member of the family, the parents' money is not just their own."
        },
        {
          "zh": "想一下，父母后面要养老或者生病了，两个儿子怎么出钱是不是得商量着来？",
          "en": "Think about it, if the parents want to retire or get sick later, don't the two sons have to discuss how to pay?"
        },
        {
          "zh": "如果现在父母「自由」决定把钱都给小儿子了，未来父母需要花钱时却要求两个儿子平分，你们觉得那时候会开心么？",
          "en": "If the parents 'freely' decide to give all the money to the youngest son now, but in the future the parents need to spend money and ask the two sons to split it equally, do you think you will be happy at that time?"
        },
        {
          "zh": "3. 从父母的决策过程会跟大家说明来看，父母其实也蛮好的。",
          "en": "3. Judging from the fact that the parents will explain the decision-making process to everyone, the parents are actually quite good."
        },
        {
          "zh": "一般父母可能直接给了，不会把这个计算方法特意讲明给大儿子、大儿媳听。",
          "en": "Generally, parents may give it directly and will not specifically explain this calculation method to the eldest son and eldest daughter-in-law."
        },
        {
          "zh": "4. 只是人都是好人，但做法是否合理确实有讨论空间。",
          "en": "4. It's just that everyone is a good person, but there is indeed room for discussion on whether the approach is reasonable."
        },
        {
          "zh": "建议 OP 可以私下找父母商量下，可以给大媳妇一两万让她心理上平衡，另一方面多给小儿子的钱可以私下给 —— 家务事很难厘清，有时候人就是挣个面子。",
          "en": "It is recommended that OP can find his parents to discuss in private, and can give the eldest daughter-in-law ten or twenty thousand to balance her psychologically.On the other hand, the money given to the youngest son can be given privately - it is difficult to clarify family affairs, and sometimes people just want to save face."
        },
        {
          "zh": "你媳妇可能也不是在乎钱，就在乎是否有被公平对待，让你父母照顾下她的情绪。",
          "en": "Your wife may not care about the money, but she cares about whether she is treated fairly, so let your parents take care of her emotions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@isc #68 你是会安慰人的",
          "en": "@isc #68 You know how to comfort people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我支持你媳妇，你媳妇明显也是一个通情达理的人， 她愿意也多给些 “应该按照房价的涨幅来”， 相比给老二确实太多了，你应该和你媳妇一边，结婚之后小家庭才是最重要的。",
          "en": "I support your wife, your wife is obviously a reasonable person, she is willing to give more 'should be based on the increase in housing prices', compared to giving the second child is indeed too much, you should be on your wife's side, after marriage the small family is the most important."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你老婆是对的，这么分明显不公平。",
          "en": "Your wife is right, it's clearly unfair to divide it this way."
        },
        {
          "zh": "多打感情牌，现在结婚难，没有房子弟弟没法成家，只能这样说。",
          "en": "Play the emotional card more, it's difficult to get married now, and the younger brother can't start a family without a house, that's all you can say."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这么给明显不公平啊，明显老人是偏袒小的了，还假装公平，你老婆说得很对。",
          "en": "It's obviously unfair to give it this way. It's obvious that the old people are favoring the younger one, and they're still pretending to be fair. Your wife is right."
        },
        {
          "zh": "“OP 觉得老人的钱，想怎么给是他们的事情”，纯放屁，儿媳也没有赡养老人的义务，难道你父母的养老她可以做到完全置身世外吗？",
          "en": "'OP feels that the old people's money, they can give it however they want', that's bullshit. The daughter-in-law also has no obligation to support the elderly. Can she completely stay out of your parents' retirement?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼里说老人的钱想给谁就给谁的，我自己买的烟，朋友聚一起挨个散烟，就你不给，有问题吗",
          "en": "Those in the thread who say that old people can give their money to whomever they want: if I buy cigarettes and distribute them to my friends when we get together, and I just don't give you any, is there a problem?"
        },
        {
          "zh": "能 v2 社区里的，都是有互联网技术能力，在现实生活中有一技傍身的，起码是中产群体，问题不明显，矛盾不突出，要是放到低收入地区这样讲看看",
          "en": "Those in the v2 community all have internet technical skills, have a skill to rely on in real life, and are at least middle-class groups. The problem is not obvious and the contradiction is not prominent. If it were said in a low-income area, take a look."
        },
        {
          "zh": "我建议 OP 向父母和弟弟表明态度，多给弟弟的钱从父母其他地方找补回来，给自己和媳妇都一个交代",
          "en": "I suggest that OP express his attitude to his parents and younger brother, and make up for the money given to the younger brother from other places of the parents, giving an explanation to himself and his wife."
        },
        {
          "zh": "不然就是给以后婆媳关系、岳婿关系和赡养问题埋雷，现在坦率沟通要比以后关系出现裂痕无可挽回要好。（特别是 op 老婆都要直接越过 op 直接和父母谈的情况下）op 面临的问题可以说在中国比较普遍",
          "en": "Otherwise, it will be a landmine for future mother-in-law and daughter-in-law relationships, in-law relationships and alimony issues. It is better to communicate frankly now than to have irreparable cracks in the relationship in the future. (Especially when OP's wife is going to talk to the parents directly bypassing OP). The problem faced by op can be said to be relatively common in China."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那些说父母钱给谁都可以的，可以让你们的父母把钱都给我吗",
          "en": "Those who say that parents can give their money to whoever they want, can you let your parents give all their money to me?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我说句吧，咱俩类似，你要劝你媳妇，你弟结婚前，老两口怎么做都行，哪怕全给了他都行，但是婚后要一碗水端平",
          "en": "Let me say something, you and I are similar, you have to persuade your wife, before your brother gets married, the old couple can do whatever they want, even if they give it all to him, but after marriage, you have to treat them equally."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "清官不断家务事，这种事你就不应该给你老婆说，记住一点家人是家人有血缘关系，女人是外人。",
          "en": "An honest official cannot settle family affairs. You shouldn't have told your wife about this kind of thing. Remember one thing: family members are family members with blood ties, and women are outsiders."
        },
        {
          "zh": "--来自一个被骗婚下头男的经验之谈。",
          "en": "--From the experience of a man who was cheated into marriage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你老婆看法对，买房的 15w 还给父母，本分就到了，剩下的是情分，没什么必须要扶弟这件事情",
          "en": "Your wife is right. Returning the 150,000 [currency unspecified] for the house to your parents is as much as you need to do. The rest is affection. There is no need to help your younger brother."
        },
        {
          "zh": "OP 的看法接近自己的父母，很危险，不要拿“不擅长”做借口",
          "en": "OP's view is close to his parents, which is very dangerous. Don't use 'not good at it' as an excuse."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "家务事难断，从楼上各种各样的评论可以看出。",
          "en": "Family affairs are difficult to judge, as can be seen from the various comments above."
        },
        {
          "zh": "OP 描述中提到“老婆觉得老人明显不公平，还要装作很公平”，这个细节不应该忽略，OP 可以深挖一下。",
          "en": "OP mentioned in the description that 'the wife feels that the old people are obviously unfair, and they still pretend to be fair', this detail should not be ignored, OP can dig deeper."
        },
        {
          "zh": "如果 OP 老婆是一个明事理的人，可能有以下的思考逻辑：- 父母的钱给谁不给谁，公平不公平，跟我没有关系- 但把分配方案拿出来说，拿出来讨论，那就是有明显的动机、预期、目的。",
          "en": "If OP's wife is a sensible person, there may be the following thought process: - It is none of my business who the parents give the money to, whether it is fair or not - But to bring out the distribution plan and discuss it, that is to have obvious motives, expectations, and purposes."
        },
        {
          "zh": "大家心知肚明的赡养问题，明显和我有关系- 我觉得分配方案不公平，但我明事理无所谓，毕竟不是我的钱，我管不着。",
          "en": "Everyone knows the problem of supporting the elderly, which is obviously related to me - I think the distribution plan is unfair, but I am sensible and it doesn't matter, after all, it is not my money, it is none of my business."
        },
        {
          "zh": "但你不能按着我的头，让我认为它公平，并接受以它公平为基础的赡养逻辑- 我赡养老人是因为我有道德，有亲情，有感情。",
          "en": "But you can't press my head and make me think it's fair, and accept the support logic based on its fairness - I support the elderly because I have morality, affection, and emotion."
        },
        {
          "zh": "这种逻辑下的赡养无所谓公平不公平，从自己本心出发。- 父母把家产分配问题拿出来讨论，那就意味把赡养和家产分配挂钩。",
          "en": "It doesn't matter whether the support under this logic is fair or unfair, it starts from one's own heart. - When parents bring up the issue of family property distribution for discussion, it means linking support with family property distribution."
        },
        {
          "zh": "你要按这个逻辑出发，那我就要好好拉扯一下公平分配问题。",
          "en": "If you follow this logic, then I have to seriously pull the issue of fair distribution."
        },
        {
          "zh": "如果 OP 老婆是个明事理的人，很可能有以上思考逻辑。",
          "en": "If OP's wife is a sensible person, there may be the above thinking logic."
        },
        {
          "zh": "这个时候一定要明晰这是一个逻辑问题不是钱的问题，提钱无异于火上浇油。",
          "en": "At this time, it is necessary to clarify that this is a logical problem, not a money problem, and mentioning money is tantamount to adding fuel to the fire."
        },
        {
          "zh": "或者 OP 老婆本身就是在乎钱，但当她提出是逻辑问题时，就要按照逻辑问题分析。",
          "en": "Or OP's wife herself cares about money, but when she raises a logical problem, it should be analyzed according to the logical problem."
        },
        {
          "zh": "问题本质是老人的认知和认识不足，不太能较好的处理家族内钱和感情互相纠缠的问题，对自己，对自己的儿子儿媳没有正确的认识。",
          "en": "The essence of the problem is that the elderly have insufficient cognition and understanding, and are not very good at handling the entanglement of money and emotion within the family, and do not have a correct understanding of themselves, their sons, and their daughters-in-law."
        },
        {
          "zh": "家务事难断，大部分人都是路过，过过嘴瘾，吃吃瓜。",
          "en": "Family affairs are difficult to judge, most people are just passing by, talking for fun, eating melons."
        },
        {
          "zh": "OP 还是结合自己的情况，对自己真诚对家人真诚，认真处理问题为好。",
          "en": "It is better for OP to combine his own situation, be sincere to himself and sincere to his family, and seriously deal with the problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上面很多人说父母自己的钱，怎样分配无权过问，不应该产生任何情绪。",
          "en": "Many people above said that it is the parents' own money, and they have no right to interfere with how it is distributed, and there should be no emotions."
        },
        {
          "zh": "这样说也行，你要是讲这个死理，那大儿子一家也有权不探望老人，按法律最低标准给他们养老，也不嘘寒问暖也不一起吃饭了，同时父母不应该产生任何负面情绪，不可以找大儿子一家理论，旁人也不能说他们不孝之类的。",
          "en": "That's okay, if you talk about this dead truth, then the eldest son's family also has the right not to visit the elderly, provide them with the minimum legal standard for retirement, not care about them, and not eat together, and at the same time the parents should not have any negative emotions, they cannot find the eldest son's family in theory, and others cannot say that they are unfilial."
        },
        {
          "zh": "讲死理，结果就是这样。",
          "en": "The result of telling the dead truth is like this."
        },
        {
          "zh": "但这是最好的结果吗？",
          "en": "But is this the best result?"
        },
        {
          "zh": "讲道理只是手段，不是目的啊，目的是家庭和睦，你讲一个 “父母的钱无权过问”，道理再怎么正确，但它不利于实现家庭和睦的结果，难道手段还能比目的更重要？",
          "en": "Reasoning is just a means, not a purpose. The purpose is family harmony. You tell a 'parents' money has no right to interfere', no matter how correct the reason is, it is not conducive to achieving the result of family harmony. Can the means be more important than the purpose?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不该给老婆说，男人就是挡在女人和父母之间的缓冲区，两边都要哄着。",
          "en": "Shouldn't have told the wife, the man is the buffer between the woman and his parents, and both sides have to coax."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哥们哥们，为什么不聊聊当年结婚你老婆家资助了多少万啊？",
          "en": "Buddy, buddy, why don't we talk about how many tens of thousands of [currency unspecified] your wife's family helped you with when you got married?"
        },
        {
          "zh": "咋滴跟你结婚管你的钱还不够还要管你爸妈的钱啊？",
          "en": "What, is managing your money after marrying you not enough, and you still want to manage your parents' money?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你在 V2 问这种话题，只能得到站在“男性”角度的回答，你在微博问，就会得到站在“女性”角度的回答。",
          "en": "If you ask this kind of question on V2, you can only get answers from a 'male' perspective. If you ask on Weibo, you will get answers from a 'female' perspective."
        },
        {
          "zh": "所有的回答都是不全面的，你问别人不过是为了找人佐证你自己内心的想法而已。",
          "en": "All the answers are incomplete, you ask others just to find someone to corroborate your own thoughts."
        },
        {
          "zh": "你应该多问你媳妇儿，在法律上，你俩是一家。",
          "en": "You should ask your wife more, legally, you two are a family."
        },
        {
          "zh": "在人情上，这种不公平确实让人难以接受，如果让你老婆接受你父母的这种不公平，你能从其他地方弥补她的这种不公平感吗？",
          "en": "From a human point of view, this kind of unfairness is indeed difficult for people to accept. If you let your wife accept this kind of unfairness from your parents, can you make up for her sense of unfairness from other places?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人善被人欺，马善被人骑你老婆明理，然后你丈母娘也明理，也就是所谓的老实人你领导和你说，谁谁谁多困难，年终奖多给他一点，给你少一点，你说行啊行啊",
          "en": "Kind people are bullied, good horses are ridden. Your wife is sensible, and your mother-in-law is also sensible, that is, the so-called honest people. Your leader says to you, whoever is more difficult, give him more year-end bonus, give you less, you say okay, okay."
        }
      ],
      "type": "replies"
    }
  ]
}