{
  "id": 1015987,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "求助近视的各位：用眼一段时间就会导致无法对焦，必须强制休息 - 是散光的原因吗？",
          "en": "Help for those with myopia: After using my eyes for a while, I can't focus, and I have to rest - is this caused by astigmatism?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "先说近视度数，左眼 475 右眼 600 ，都有 50 度左右的散光\r\n\r\n然后这个症状断断续续持续 2 年了，\r\n偶尔出现吧，只要连续使用眼睛一段时间（ 1 小时以上），两个眼睛就无法对焦，单眼看东西都有重影，必须强制休息 30 分钟或者滴眼药才能缓解\r\n\r\n也看过医生，没给出什么具体诊断\r\n\r\n上一副眼镜有这个症状，以为是眼镜的问题，但是频率也不高就忍了一段时间；一个月前刚换了一副眼镜，结果这个症状还是会发生，最近春节晚上看书/打游戏比较多，所以出现的频率更多\r\n\r\n\r\n准备年后再去三甲医院看一下，已经有点影响工作和生活了。\r\n\r\n\r\n但是想先提前问一下：这个症状是比较常见的吗？还有人有类似症状吗\r\n\r\n也提醒好各位 保护好眼睛吧 现在已经影响我看书和学习了",
          "en": "First, let's talk about the degree of myopia. The left eye is 475, the right eye is 600, and both have about 50 degrees of astigmatism.\r\n\r\nThen, this symptom has been intermittent for 2 years.\r\nIt appears occasionally, as long as I use my eyes continuously for a period of time (more than 1 hour), my two eyes can't focus, and there is double vision when looking at things with one eye. I have to rest for 30 minutes or use eye drops to relieve it.\r\n\r\nI've also seen a doctor, but they haven't given a specific diagnosis.\r\n\r\nThe previous pair of glasses had this symptom, and I thought it was a problem with the glasses, but the frequency wasn't high, so I endured it for a while; I just changed a pair of glasses a month ago, but this symptom still occurs. Recently, I've been reading/playing games more at night during the Spring Festival, so the frequency is even more frequent.\r\n\r\n\r\nI plan to go to a top-tier hospital after the new year. It has already affected my work and life to some extent.\r\n\r\n\r\nBut I want to ask in advance: is this symptom relatively common? Does anyone have similar symptoms?\r\n\r\nAlso, remind everyone to protect your eyes, it has already affected my reading and study now"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你千万小心，我 22 年 12 月脑梗。发病前 1 年就是这样，我也去医院看了说不出所以然，看电脑 1 小时就眼睛很累很累，要眯着眼睛看东西，换 2 副眼镜过一段时间就没用了。你去医院检查看看，现在脑梗年龄越来越轻。给你打这段字都很累，所以我现在都不愿意上网发言，但是你这情况忍不住说了。但愿不是，祝健康",
          "en": "Be very careful, I had a cerebral infarction in December 2022. I was like this 1 year before the onset of the disease. I also went to the hospital and they couldn't tell me what was wrong. My eyes would get very, very tired after looking at the computer for 1 hour, and I had to squint to see things. I changed 2 pairs of glasses, but they didn't work after a while. Go to the hospital for a checkup. Cerebral infarction is now occurring at a younger age. It's very tiring for me to type these words, so I don't want to speak online now, but I couldn't help but say something about your situation. I hope it's not the case. Wishing you good health."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wu67 #10 50 度散光不应该这么明显，一般 70 度以下散光都不需要矫正，他这个大概率是眼部肌肉的问题了，最好是看医生。",
          "en": "@wu67 #10 50 degrees of astigmatism shouldn't be so obvious, generally astigmatism below 70 degrees doesn't need correction, his problem is most likely with the eye muscles, it's best to see a doctor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "和我差不多，我是单眼重影加双眼复视说多了都是泪，晚上别玩手机，躺着别玩手机我是刚睡醒特别明显，困了也明显这不是散光的问题，只能少看屏幕多休息唉",
          "en": "Similar to me, I have double vision in one eye plus binocular diplopia. It's all tears to say more. Don't play with your phone at night, and don't play with your phone while lying down. It's especially obvious when I just wake up, and it's also obvious when I'm sleepy. This is not a problem of astigmatism, so just look at the screen less and rest more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "左右差这么多 应该是有侧躺单眼看手机的习惯",
          "en": "The difference between left and right is so much; there should be a habit of lying on your side and looking at your phone with one eye."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "常见，类似，就是散光导致的。",
          "en": "Common, similar, it's caused by astigmatism."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去三甲医院看看眼部肌肉问题吧",
          "en": "Go to a top-tier hospital and check for eye muscle problems."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我有过，长时间呆在室内，后来多活动活动就好了",
          "en": "I've had it before, staying indoors for a long time, and it got better after more activity."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "近视眼睫状肌就是不太行，正常。就跟肥宅和健身肌肉的区别，还是要多户外活动训练",
          "en": "The ciliary muscle of the myopic eye isn't very good, that's normal. It's like the difference between a sedentary person and a fitness enthusiast's muscles. You still need more outdoor activities and training."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多玩点球类运动，不要关灯躺着看手机。找眼科医院重新验光，眼镜可能配的有问题。",
          "en": "Play more ball sports, don't look at your phone lying down with the lights off. Find an ophthalmology hospital to re-examine your eyes, the glasses may have problems with the prescription."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上班长时间在室内 见不到太阳也很少看远。周末出门还会有点畏光刺眼。近视眼就是眼睛不行，体质问题",
          "en": "Working indoors for a long time, not seeing the sun, and rarely looking far away. I also feel a bit photophobic and have stinging eyes when going out on weekends. Myopia means the eyes are not good, it's a problem with the constitution."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不要眼镜店验光（ JINS 这种大的连锁也不行），纯粹糊弄，就是个菜市场。",
          "en": "Don't get your eyes tested at an optical store (JINS and other large chains are also not good), it's purely a scam, like a vegetable market."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就是散光。曾经在夜里用手机刷剧，导致严重的伤害。惧光，尤其是蓝光；无法对焦，重影，非常严重，直接影响工作生活。建议，多点户外活动。",
          "en": "It's astigmatism. I used to watch dramas on my phone at night, which caused serious damage. Photophobia, especially blue light; inability to focus, double vision, very serious, directly affecting work and life. Recommendation, more outdoor activities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "模糊是近/远视, 重影是散光",
          "en": "Blurriness is near/farsightedness, double vision is astigmatism"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我干眼症的症状感觉跟你很相似，所以每台电脑都装了休息提醒软件，20min 休息 20s ，1h 休息 5min ，然后不要熬夜。个人感觉晚睡，特别是睡前玩手机的话，第二天眼睛就特别容易累。也可以试一下睡觉戴蒸汽眼罩，感觉是有点作用的",
          "en": "I feel that my dry eye symptoms are very similar to yours, so I have installed rest reminder software on every computer, 20 minutes rest for 20 seconds, 1 hour rest for 5 minutes, and then don't stay up late. I personally feel that if I go to bed late, especially if I play with my phone before bed, my eyes will be particularly tired the next day. You can also try wearing a steam eye mask when you sleep, it feels like it has some effect."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你至少 100 到 150 的散光，眼镜度数没有配对，去当地大的连锁店吧",
          "en": "You have at least 100 to 150 degrees of astigmatism, the glasses prescription is not matched, go to a large local chain store"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我之前也是看屏幕久了无法对焦，还会流眼泪，去换眼镜时测视力久了都无法聚焦，测了好几次，感觉验光师都要烦了。   后来换了一个有经验的验光师，一下就看出我是视力疲劳了，让我休息一下再测，给我配了防蓝光抗疲劳眼镜，戴上就好了。",
          "en": "I also couldn't focus after looking at the screen for a long time, and I would also shed tears. When I went to change my glasses, I couldn't focus after measuring my vision for a long time, and I had the tests done several times, and I felt that the optometrist was going to get annoyed. Later, I changed to an experienced optometrist, who immediately saw that I had visual fatigue. He asked me to rest and then test again, and he fitted me with anti-blue light and anti-fatigue glasses, and it was fine after wearing them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "也有种可能是镜架有点松了, 在鼻梁上容易下滑, 导致视距不对, 换付镜架能解决",
          "en": "It's also possible that the frame is a little loose, and it can easily slide down on the bridge of the nose, causing the viewing distance to be incorrect, and changing the frame might solve the problem"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rabbbit 害  就是 jins 的 感觉验光不专业吧 步骤还挺多 但是也快速据说国外眼光都要一周不过 jins 眼光出来的度数和我之前基本一样",
          "en": "@rabbbit Oh, it's Jins. I feel the eye exam is not professional. The steps are quite a lot but also fast. It is said that eye exams abroad take a week, but the degree from Jins' eye exam is basically the same as before."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也是这样",
          "en": "Me too"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我视力 5.2 最近也这样了去医院检查说是眼睛干涩 和 视觉疲劳, 要多休息就行....",
          "en": "My vision is 5.2 and I've been the same recently. I went to the hospital for a checkup and they said my eyes were dry and I had visual fatigue, just need to rest more...."
        }
      ],
      "type": "replies"
    }
  ]
}