{
  "id": 1019099,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "怎么给我超过 60 岁的农民爸爸找工作？",
          "en": "How can I find a job for my farmer father who is over 60 years old?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "在北京，不知道有什么渠道能给我爸爸找一个工作。\r\n\r\n他 1962 年生人，没有技术只会种地，养猪（赔过钱），但不怕下力气。",
          "en": "I'm in Beijing and don't know what channels are available to find a job for my father.\r\n\r\nHe was born in 1962 and has no skills, only knows how to farm and raise pigs (lost money), but he is not afraid of hard work."
        },
        {
          "zh": "目前在小区我问过，有清洁工岗位，工资 3K/月。",
          "en": "I asked around in the community and there are cleaning positions with a salary of 3K/month."
        },
        {
          "zh": "他嫌太少，因为家里还有 12W 外债。",
          "en": "He thinks it's too little because the family still has 120,000 in debt."
        },
        {
          "zh": "而且他一年中需要有半年需要照顾我奶奶（或者每个月出 2K 给我叔叔，让叔叔代管）。",
          "en": "Moreover, he needs to take care of my grandmother for half a year (or pay my uncle 2K per month to take care of her on his behalf)."
        },
        {
          "zh": "\r\n\r\n防杠声明：我妈妈替我带孩子，我给她家里买菜钱（ 1.5K/月），给她治病钱 1W 左右，还有大学生妹妹生活费（ 2K/月），我奶奶做手术我替我们家出的钱 8K,年末的奖金 40K 我也帮助还债了。",
          "en": "\r\n\r\nAnti-troll statement: My mother takes care of my child for me, and I give her money for groceries (1.5K/month), about 10K for her medical expenses, plus living expenses for my college student sister (2K/month). I paid 8K for my grandmother's surgery on behalf of our family, and I also helped pay off debts with my year-end bonus of 40K."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "中国的农民太惨了，被剥削了一辈子，退休后领 120 一个月",
          "en": "Farmers in China are too miserable. They are exploited for a lifetime, and receive only 120 yuan a month after retirement."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一分社保没交过的体制内的老爷退休金 1w 多，交了一辈子公粮还服徭役的老农民只有 100 多，这就是社会主义，这就是按劳分配",
          "en": "The retired officials in the system who have never paid social security receive more than 10,000 retirement salaries, while the old farmers who have paid public grain and served in corvée labor for a lifetime only receive more than 100. This is socialism, this is distribution according to work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "太难了，农民被吃三代，你还要养别人父母",
          "en": "It's too difficult, farmers are exploited for three generations, and you still have to support other people's parents."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看 op 父母都是到了领退休金的年纪了，可是农民没退休金啊。",
          "en": "Looking at OP's parents, they are both at the age to receive pensions, but farmers don't have pensions."
        },
        {
          "zh": "op 作为顶梁柱，压力还是挺大的。",
          "en": "OP, as the pillar of the family, is under a lot of pressure."
        },
        {
          "zh": "我提个建议，后面资金有一定富余的情况下，优先给家人配置好各种保险（农村医保、百万医疗、意外险等），给自己再多上个重疾险。",
          "en": "I suggest that if you have some extra money in the future, prioritize getting various types of insurance for your family (rural medical insurance, million-dollar medical insurance, accident insurance, etc.), and get yourself more critical illness insurance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mumbler 你也是人？",
          "en": "@mumbler Are you even human?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hfJ433 不知道你是不是农村人，如果你是的话，你把你描述的这个事情问一下家里人就知道一个月能否有 3K 了；如果你不是，我只能说 你想的真美好。",
          "en": "@hfJ433 I don't know if you are a rural person. If you are, ask your family about what you described and you will know if you can have 3K a month; if you are not, I can only say that your thinking is really beautiful."
        },
        {
          "zh": "在我看来根本达不到的，还要养鸭子养鸡，还得弄猪饲料，价格不好忙活了一年还亏钱，要是家畜得个病可能全部就都死了。",
          "en": "In my opinion, it is impossible to achieve. You still have to raise ducks and chickens, and you have to get pig feed. If the price is not good, you will lose money after a year of hard work. If the livestock gets sick, they may all die."
        },
        {
          "zh": "一个月 3K ，一年 36K ，要是能这么简单达到的话，家里那么多老人 也不至于生活这么困难了。",
          "en": "3K a month, 36K a year, if it could be achieved so easily, so many old people in the family would not have such a difficult life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我爸也遇到这样的问题了60 岁了 没多少地方需要了 我爸前两天来上海打工了 他会基础的电焊 也是通过之前的工友介绍的试试让你爸打打电话问问之前的工友————挺伤感的 这个年纪还需要打工的真的是被时代抛弃了",
          "en": "My dad is also facing this problem. He is 60 years old and there are not many places that need him. My dad came to Shanghai to work a few days ago. He knows basic welding and it was also introduced by his previous workmates. Try asking your dad to call his previous workmates. It's very sad that he still needs to work at this age, he is really abandoned by the times."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找 zf 问问呢？这种情况 它们是怎么安排的~",
          "en": "Why not ask the government? How do they arrange things in this situation?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hfJ433 你是不是对农村生活有啥误解？",
          "en": "@hfJ433 Do you have some misunderstanding about rural life?"
        },
        {
          "zh": "一亩田大概能产出 1100 斤稻谷，一般收购商给的价格是 122 元/百斤。",
          "en": "One mu of land can produce about 1100 jin of rice, and the price generally given by purchasers is 122 yuan/100 jin."
        },
        {
          "zh": "折算起来每亩地的收入是 1342 元。",
          "en": "Converted, the income per mu of land is 1342 yuan."
        },
        {
          "zh": "种植一亩水稻成本：谷种钱：100 元机耕费（包括收割费、运输费）合计：105 元肥料钱（包括复合肥和尿素）合计：141 元农药钱：100 元总计费用：100+105+141+100=446 元按上面数据计算，每亩水稻收入 1342 元，减去 446 元成本费，剩余 896 元。",
          "en": "The cost of planting one mu of rice: rice seed money: 100 yuan, machine farming fee (including harvesting fee, transportation fee) total: 105 yuan, fertilizer money (including compound fertilizer and urea) total: 141 yuan, pesticide money: 100 yuan, total cost: 100+105+141+100=446 yuan. According to the above data, the income of one mu of rice is 1342 yuan, minus the cost of 446 yuan, the remaining 896 yuan."
        },
        {
          "zh": "农村随便搞搞就能搞出 2-3K 一个月的话，谁还愿意背井离乡出来打工",
          "en": "If you can easily earn 2-3K a month in the countryside, who would be willing to leave their hometown to work?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找中介去 HK ，工地的工人，2000 港币一天。",
          "en": "Find an agency to go to HK, construction site workers, 2000 HKD a day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "60 岁 该退休了...",
          "en": "60 years old, it's time to retire..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开直播照顾老人",
          "en": "Start a live stream taking care of the elderly"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同农民子弟, 农民太苦了, 忙活一辈子, 收入被层层盘剥, 老了也没有退休金.",
          "en": "Also a farmer's child, farmers are too bitter, busy all their lives, their income is exploited layer by layer, and they have no pension when they are old."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@deanguqiang #15  @lkkl007 #47 国家对不起农民，初创靠农民，谁知道 上岸第一剑",
          "en": "@deanguqiang #15  @lkkl007 #47 The country owes the farmers, relying on the farmers in the early days, who knew..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别找了，这岁数体力工作的收入，基本都会引发疾病，然后看病倒搭进去不少，当然也可以选择不看病直接折寿",
          "en": "Don't bother looking. At this age, income from physical labor will basically lead to illness, and then a lot of money will be spent on seeing a doctor. Of course, you can also choose not to see a doctor and just shorten your lifespan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "城里 50 ，55 岁退休老人跳广场舞，全国旅游，我父母 60 多还得每天干苦力，也许要做到做不动为止。",
          "en": "Retired elderly people in the city at 50 or 55 dance in the square and travel around the country, while my parents in their 60s still have to do hard labor every day, maybe until they can no longer do it."
        },
        {
          "zh": "国家是想等我们父母这一代人死绝了，就不用负责了。",
          "en": "The country is waiting for our parents' generation to die out, so they don't have to be responsible."
        },
        {
          "zh": "国人常常嘲笑印度的种姓制度，殊不知在我们这个国家，农民就是印度的首陀罗，达利特。",
          "en": "Chinese people often laugh at India's caste system, but little do they know that in our country, farmers are India's Shudras and Dalits."
        },
        {
          "zh": "在城市里的农民工就如同在美国的墨西哥非法移民一样。",
          "en": "Migrant workers in cities are like illegal Mexican immigrants in the United States."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前几年还可以考虑工地搬砖但现在好像因为安全生产的原因，年龄也限制住了",
          "en": "A few years ago, you could consider moving bricks on construction sites, but now it seems that age is also restricted due to safety production reasons."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大厦保洁吧，男 65 以内，有身体健康证明",
          "en": "Building cleaning, men under 65, with a health certificate"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "搞个三轮，拉人呢。",
          "en": "Get a tricycle and carry people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MuSeCanYang 在北京好像没咋看到过开三轮拉客的。",
          "en": "@MuSeCanYang I don't seem to have seen anyone driving a tricycle for passengers in Beijing."
        },
        {
          "zh": "老头乐现在也已经不能上路了",
          "en": "Those electric scooters for the elderly are no longer allowed on the road now."
        }
      ],
      "type": "replies"
    }
  ]
}