{
  "id": 1015705,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "利益绑定婚姻是否可行？",
          "en": "Is it feasible to bind marriage with interests?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "楼主 25 。不相信爱情。婚姻本来就是契约精神。\n\n是否可以通过 车贷，房贷。一些利益去绑定感情。婚姻。",
          "en": "The OP is 25. Doesn't believe in love. Marriage is originally a spirit of contract.\n\nCan emotions, marriage be bound through car loans, mortgages, and some interests?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "再者这个年，我发现过年我发现了。一般家里条件好的。人家找对象，要求没这么高。而且这批人打工意识没那么强。他们更倾向自身发展，考公，人脉还有一种。家里一般般。小农村出来的。然后这批人。打工意识强一点，不愿意回老家，也不愿意考公，在外工资也不算很高。而且对于对象选择。也很慎重。掌握的资源不多。所以很慎重。毕竟没有试错的成本。不想婚姻成为坟墓。也不想为此背上车房。但又想找到一些好的女生。想共同承担风险",
          "en": "Furthermore, this year, I found out during the Spring Festival. Generally, those with good family conditions don't have such high requirements when looking for a partner. And this group of people doesn't have a strong sense of working. They are more inclined towards their own development, taking civil service exams, networking, and another type. Those with average family backgrounds, coming from small rural areas. Then this group of people. Have a stronger sense of working, are unwilling to return to their hometowns, and are also unwilling to take civil service exams, and their salaries are not very high outside. And they are also very cautious in choosing a partner. They don't have many resources. So they are very cautious. After all, there's no cost for trial and error. They don't want marriage to become a grave. They don't want to be burdened with car and house either. But they want to find some good girls. They want to share the risks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你也不用花太多钱去绑定婚姻，因为你要找的肯定是和你一样希望合作的人，是合作，她也有结婚的需求，然后你们一起努力建设家庭美好生活就行了。你要找的不是“员工”，不是你花钱她办事，你要找合作伙伴啊。搞错了这点，反而容易找到不靠谱的人。",
          "en": "You don't need to spend too much money to bind marriage, because what you're looking for is definitely someone who wants to cooperate with you, it's a partnership, she also has the need to get married, and then you work together to build a beautiful family life. What you are looking for is not an employee, it's not that you pay her and she does things, you are looking for a partner. If you get this wrong, it's easier to find unreliable people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个婚 咱非结不可吗?",
          "en": "Do we really have to get married?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cmdOptionKana 我们在座的绝大部多数人都是普通的不能再普通的人，很容易就能找到替代品，如果靠合作关系讲利益没有感情羁绊，那就是有奶便是娘，说离就离，毫无心理负担。如果一定要结婚过得幸福，那就请相信爱情这个邪教，一路狂奔。。",
          "en": "@cmdOptionKana Most of us here are ordinary people, it's easy to find a replacement, if we rely on a cooperative relationship and talk about interests without emotional ties, we'll be 'milk-dependent', we can separate at any time without any psychological burden. If you must get married to be happy, then please believe in love - this cult - and run all the way."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人都是感情动物，这种感情可能不再是爱情，有可能是基于社会道德或者长时间相处产生的互相的归属感，或者其他说不清的东西。在情绪面前利益的考量就显得没那么大了，单纯的利益绑定不太可取。",
          "en": "Humans are emotional animals, this emotion may not be love anymore, it could be based on social morality or a sense of belonging generated by long-term interaction, or other things that are hard to explain. The consideration of interests seems less important in front of emotions, and a purely interest-based binding is not advisable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以的啊。哪有什么感情，都是利益嘛。",
          "en": "Yeah, it's possible. There's no emotion, it's all about interests."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主年纪轻轻就看透了婚姻的本质 大有可为",
          "en": "The OP is young but has seen through the essence of marriage. Very promising."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://v2ex.com/t/1011038#reply34 楼主需要这个",
          "en": "https://v2ex.com/t/1011038#reply34 The OP needs this."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "但是为什么非得结婚呢",
          "en": "But why do you have to get married?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@1145148964 也不是拿这赚钱。只是吐槽下，看看网友观点",
          "en": "@1145148964 It's not about making money with this. Just venting, and checking out the opinions of netizens."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以啊哈哈，婚姻本质就是搭伙过日子，爱情这东西也就最近几十年才流行起来的，不到一个世纪，而且极不稳定",
          "en": "Yeah, haha, the essence of marriage is just living together, love has only become popular in the last few decades, less than a century, and it's extremely unstable"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@iseki 确实，但是人到了 30 也顶不住家里人，亲戚们的狂轰乱炸把？",
          "en": "@iseki Indeed, but when people reach 30, can they withstand the bombardment from their family and relatives?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wonderfulcxm 看明白了爱情是婚姻的充分不必要这个关系后。是不是发现找对象其实也没那么难，条件差不多匹配的。就差不多了其实。",
          "en": "@wonderfulcxm After understanding that love is a sufficient but not necessary condition for marriage. Did you find that finding a partner is not that difficult, the conditions are almost matched, and that's it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "太靠谱了. 只有利益一致才能长久走在一起.  但是你所说的房产的利益还远远不以绑定一个人.",
          "en": "That's very reliable. Only when the interests are aligned can you stay together for a long time. But the benefits of real estate you mentioned are far from enough to bind a person."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别把遵守契约精神看作是很牛笔很吊的东西，契约是商业行为的基石，也就是说你从一开始的出发点就是利益向的婚姻是伦理关系，利益只占一部分，你光有利益没别的，别人凭什么和你结成婚姻呢，还不如直接跟你签交易合同",
          "en": "Don't treat adhering to the spirit of the contract as something very awesome, the contract is the cornerstone of business behavior, that is to say, your starting point is profit-oriented, marriage is an ethical relationship, and interests only account for a part. If you only have interests and nothing else, why would others marry you, it's better to just sign a transaction contract with you directly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "遵守契约的前提是双方认可契约的公平性，而有的人认为自己结婚就是吃亏的，无论得到多少利益还是吃亏的，你的钱是有数的，而他/她的 XX 是无价的。所以为了做到少走弯路，最好用法律对你们的契约进行公正，也就是签婚内财产协议。",
          "en": "The premise of adhering to the contract is that both parties recognize the fairness of the contract, and some people think that getting married is a disadvantage, regardless of how many interests they get, they're still at a disadvantage. Your money is countable, while his/her XX is priceless. Therefore, in order to avoid detours, it's best to use the law to enforce fairness in your contract, which is signing a prenuptial agreement."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "贷款是负债可不是利益",
          "en": "Loans are liabilities, not interests."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跟大学师妹谈了 6 年多到现在，异地异国都经历过，年前结婚了。我知道我是很多人的羡慕对象。",
          "en": "I've been with my university classmate for over 6 years now, gone through being in different places and countries, and got married before the Spring Festival. I know I'm the envy of many people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Takizawa 恭喜老哥",
          "en": "@Takizawa Congratulations, bro."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@renmu 确实，如果我是女生，我也愿意直接找 有车有房的，而不是跟他一起承担贷款",
          "en": "@renmu Indeed, if I were a girl, I would also prefer to find someone who has a car and a house directly, rather than bear the loan with him."
        }
      ],
      "type": "replies"
    }
  ]
}