{
  "id": 1015695,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "百度地图 VS 高德地图",
          "en": "Baidu Maps VS Gaode Maps"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "2024 刚开始 你们用哪家的导航出行(⌐■_■)✈️",
          "en": "Now that 2024 has just begun, which navigation app do you use for travel? (⌐■_■)✈️"
        },
        {
          "zh": "我主用百度地图☺️",
          "en": "I mainly use Baidu Maps. ☺️"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "不用百度。很久之前一直用百度，想着百度怎么说也比高德三流公司靠谱，当时 bat 鼎盛，高德被收购也只是阿里一个下属子公司。几年前，当时导航过程中百度导航有个什么鬼操作(app 自己中途变的)，新功能不适应需要司机手动修改，正好开车在高速上，边开车边手动调整，导致追尾。当时臭骂百度导航，啥产品经理，瞎几把新需求，连最基础的导航过程中不能因产品功能影响司机正常驾驶都不知道？平时产品有没有经常用自己产品，是刚毕业天天坐地铁上下班来搞导航产品么？纸上谈兵。百度导航连确保安全性是最基础都不知道。生命只有一次，特别是行驶在高速路上的导航软件。从此不用百度导航。",
          "en": "I don't use Baidu Maps. I used it for a long time, thinking that Baidu was more reliable than Gaode's third-rate company. At that time, BAT was at its peak, and Gaode was just a subsidiary of Alibaba after being acquired. A few years ago, during navigation, Baidu Maps had some strange operation (the app changed by itself). The new function was not adapted and required the driver to manually modify it. I happened to be driving on the highway, and I manually adjusted it while driving, which led to a rear-end collision. I scolded Baidu Maps at that time, what kind of product manager, blindly creating new demands, not even knowing that the most basic navigation process should not affect the driver's normal driving? Does the product team usually use their own products? Are they just recent graduates who commute by subway every day and develop navigation products? All talk and no action. Baidu Maps doesn't even know that ensuring safety is the most basic requirement. Life is only once, especially for navigation software on the highway. I haven't used Baidu Maps since then."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "百度比较准而且有红绿灯倒计时和 3d 地图",
          "en": "Baidu is more accurate and has traffic light countdowns and 3D maps."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "单纯高架这个问题百度用了三年才修复。可想而知，没有技术，没有水平，没有品德。",
          "en": "Baidu took three years to fix the simple issue of elevated roads. You can imagine, no technology, no level, no integrity."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用了 8 年高德地图，昨天给我导航到死路，夜里 10 点多发了微博吐槽，当时就有人员私信联系我确认情况",
          "en": "I've used Gaode Maps for 8 years, and yesterday it navigated me to a dead end. I posted a complaint on Weibo at 10 pm, and someone immediately contacted me via private message to confirm the situation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@talus 高德可以打车订酒店买星巴克等餐厅团购卷新能源汽车扫码充电，堵车时跟其他司机聊天，叫代驾，没油的时候送油，看汽车评测回收自己的二手车，看新闻看天气预报看官方交警发布的新闻拥堵限行情况，还可以租车打顺风车注册顺风车车主，旅游看景点介绍，叫货车送货，星巴克沿街取开车路过星巴克取咖啡提前下单自动绑定支付宝一键免密支付，献血车险报价，商户标注，线上三角指示牌提醒其他司机，跟奔驰车载高德地图互通互通远程操控车技导航，查油价买出行保险企业用车买火车票高铁票船票轮渡票飞机票，扫哈啰共享单车，办流量卡号卡营业厅，拍商家测评图赚钱，洗车养车换车胎等各种功能，各种小程序 H5App 能不大？我都买 512GB1TB 的 iPhone 了。现在一个小红书淘宝都能 10GB 大。@liaojl @mjzyzh",
          "en": "@talus Gaode can be used to call a taxi, book a hotel, buy Starbucks and other restaurant group-buying vouchers, scan QR codes to charge new energy vehicles, chat with other drivers in traffic jams, call for a designated driver, deliver fuel when you run out of fuel, view car reviews, recycle your used car, read news, check the weather forecast, check official traffic police news about congestion and traffic restrictions, rent a car, take a ride, register as a ride-sharing driver, see tourist attraction introductions, call a truck to deliver goods, pick up Starbucks along the street, order coffee in advance when driving past Starbucks, automatically bind Alipay for one-click password-free payment, blood donation car insurance quotes, merchant labeling, online triangle warning signs to remind other drivers, and remotely control car navigation with Mercedes-Benz in-vehicle Gaode Maps. You can also check fuel prices, buy travel insurance, buy train tickets, high-speed rail tickets, boat tickets, ferry tickets, and plane tickets for corporate vehicles, scan Hello shared bicycles, get data cards and SIM card business halls, take merchant evaluation pictures to earn money, wash cars, maintain cars, change tires, and other functions. How can various mini-programs and H5Apps not be large? I've already bought a 512GB/1TB iPhone. Now even a small Red Book Taobao can be 10GB large. @liaojl @mjzyzh"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前一直用高德，最近慢慢换成苹果地图了，主要是高德广告太多，加上高德在手机和 watch 之间的联动没有苹果地图好。百度很久以前用过，当时感觉路径规划没有高德好，就用的少，后来卸载了是因为有次发现它加了万恶的摇一摇广告，高德虽然广告也多，但至少我没遇到过摇一摇广告。",
          "en": "I used to use Gaode all the time, but recently I've been slowly switching to Apple Maps, mainly because Gaode has too many ads, and the interaction between Gaode on the phone and watch isn't as good as Apple Maps. I used Baidu a long time ago, but I felt that its route planning wasn't as good as Gaode, so I used it less. I uninstalled it later because I discovered it added the evil shake-shake ad. Although Gaode also has a lot of ads, at least I haven't encountered a shake-shake ad."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前两天从老家回来，用的高德，竟然发现导航过程中会语音提示：“后方有车辆快速接近”和“前方有慢速车辆”，大数据玩的越来越遛 6 了",
          "en": "A few days ago, when I came back from my hometown, I used Gaode, and I was surprised to find that it would give voice prompts during navigation: 'A vehicle is approaching quickly from behind' and 'There is a slow-moving vehicle ahead.' The big data play is getting smoother and smoother."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liaojl 国内的苹果地图就是高德，打开苹果地图角落有写",
          "en": "@liaojl Apple Maps in China is Gaode. It's written in the corner when you open Apple Maps."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@4pmBaoZi 苹果地图只是用的高德地图的数据。很多功能没有的，比如车道级导航，只能高德有。",
          "en": "@4pmBaoZi Apple Maps only uses Gaode Maps' data. Many features are missing, such as lane-level navigation, which is only available on Gaode."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@4pmBaoZi 我知道是高德，而且只是地图数据是高德的，其它路径规划导航之类的算法是苹果自家的，不过整体区别不大，可能还没高德好。我看中的是无广告以及和 apple watch 的联动。",
          "en": "@4pmBaoZi I know it's Gaode, and only the map data is from Gaode. Other route planning navigation algorithms are Apple's own, but the overall difference is not big, maybe not even as good as Gaode. I value the lack of ads and the integration with Apple Watch."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "昨天刚卸载用了十多年的百度还高德，至少高德不会在导航主页面给你塞一大堆广告",
          "en": "I just uninstalled Baidu and Gaode, which I've used for over a decade, yesterday. At least Gaode doesn't shove a bunch of ads on the main navigation page."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liaojl 只有骑摩托车没手机支架才用 Watch 导航吧",
          "en": "@liaojl You only use Watch navigation when riding a motorcycle without a phone holder, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jacksonj297 我觉得骑单车和走路都挺好用的，走路的时候抬手就行，不用掏出手机，而且到路口的时候手表会震动提醒。要说开车的话，那还得是高德，车道级导航、红绿灯以及楼上提到的大数据。",
          "en": "@jacksonj297 I think it's quite useful for cycling and walking. When walking, you just need to raise your hand, and you don't need to take out your phone. And the watch will vibrate to remind you at intersections. If you're talking about driving, then it has to be Gaode, lane-level navigation, traffic lights, and the big data mentioned above."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高德，百度以前不知道在高架上，不过 v19 也能识别了。以前经常两个手机同时开百度高德，对于同样的数据错误，转向错误等问题同时反馈给两家，百度的更新修复没有高德快，高德会有专人核实，更新，并电话回访感谢。百度没有动静。但是百度地图基本每个月都会更新，不知道在更新啥没用的。",
          "en": "Gaode. Baidu didn't recognize elevated roads before, but v19 can recognize them now. I used to have both Baidu and Gaode open on two phones at the same time, and I would report the same data errors and turning errors to both companies. Baidu's updates and fixes were not as fast as Gaode's. Gaode would have someone verify, update, and call back to thank me. Baidu didn't do anything. But Baidu Maps basically updates every month. I don't know what useless things they are updating."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在国内感觉没好用的地图了。百度、高德导航的时候都给你弹窗广告，越来越魔幻了！所以选择了苹果地图了。",
          "en": "Now I feel like there are no good maps in China. Baidu and Gaode both pop up ads during navigation, it's getting more and more magical! So I chose Apple Maps."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "apple 全家桶用户自带地图用用也不错，其他高德百度都可以，貌似高速等大路径高德好一点，景区山路走路游玩百度好，内部小路都出来了",
          "en": "It's not bad for Apple full ecosystem users to use the built-in maps. Gaode and Baidu are both okay. Gaode seems to be better for highways and other large routes, while Baidu is better for scenic mountain roads and walking tours, and even shows internal small roads."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wanguorui123 两家都有啊",
          "en": "@wanguorui123 Both companies have it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我用 Waze",
          "en": "I use Waze"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看这两者介绍就知道在导航、地图领域的高下了高德是一家数字地图内容、导航和位置服务解决方案提供商，拥有**导航电子地图甲级测绘资质、测绘航空摄影甲级资质和互联网地图服务甲级测绘资质**\"三甲\"资质北京百度网讯科技有限公司（以下简称“百度”）是依据《中华人民共和国测绘法》、《地图管理条例》、《测绘资质管理办法》等相关法律法规的要求依法申请并持有**互联网地图服务甲级测绘资质**的测绘单位",
          "en": "Looking at these two introductions, you can see the difference in navigation and map fields. Gaode is a provider of digital map content, navigation, and location service solutions, and has the \"Triple A\" qualifications of **Grade A surveying and mapping qualification for navigation electronic maps, Grade A qualification for surveying and mapping aerial photography, and Grade A surveying and mapping qualification for Internet map services.** Beijing Baidu Wangxun Technology Co., Ltd. (hereinafter referred to as \"Baidu\") is a surveying and mapping unit that has applied for and holds the **Grade A surveying and mapping qualification for Internet map services** in accordance with the requirements of relevant laws and regulations such as the Surveying and Mapping Law of the People's Republic of China, the Map Management Regulations, and the Measures for the Administration of Surveying and Mapping Qualifications."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自驾游出行，朋友连车载的时候，华为的手机用不了 android auto ，只能装百度的 Carlife ，也只能用百度地图。",
          "en": "When traveling on a road trip and my friend connects their phone to the car, Huawei phones can't use Android Auto, so they can only install Baidu's Carlife, and can only use Baidu Maps."
        }
      ],
      "type": "replies"
    }
  ]
}