{
  "id": 1014306,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "有哪些技能或兴趣，是你比较擅长，而一般人不太掌握的？",
          "en": "What skills or interests are you good at that most people don't master?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我就是一个一般人",
          "en": "I am just an ordinary person"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "初中 在床上借助墙倒立 然后可以吃到...",
          "en": "In junior high school, I could do a handstand on the bed with the help of the wall, and then I could eat..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "3 个小时。",
          "en": "3 hours."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我的左手可以绕过头摸到左耳",
          "en": "My left hand can reach over my head and touch my left ear"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把耳朵塞进耳朵眼还可以放一个小纸团在里面还可以自主把塞进去的耳朵弹出来，可以射出小纸团两个耳朵都可以以及能同时进行",
          "en": "I can stuff my ears into my ear canals and put a small piece of paper in them, and I can voluntarily pop the stuffed ears out, shooting out the small paper balls from both ears, and can do it simultaneously"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "破解光猫，几乎研究透当前市面 95%光猫",
          "en": "Crack optical modems, having almost thoroughly researched 95% of the optical modems on the market"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan 随着年龄的增长，我倒发现愿意把时间花在某种事情上并为此消耗精力是对这个事情的一种天赋，尤其是这件事情当下没有直接利益关系时。",
          "en": "@coderluan As I get older, I've found that being willing to spend time on something and expend energy on it is a talent for that thing, especially when there's no direct financial interest in it at the moment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用仓颉输入法打繁体字，这在简体字文化圈里应该很少人学。不带电胶片摄影，对焦和测光都全手动纯机械，连钮扣电池都不用，玩这个的人也不多了。",
          "en": "Using Cangjie input method to type traditional Chinese characters, which few people in the simplified Chinese character culture circle should learn. Non-electric film photography, with fully manual and purely mechanical focus and light metering, not even needing button batteries, not many people play this either."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "猜测能力，五分钟就能了解一个东西并能基于它提供方案甚至告诉你它的原理。能做到八九不离十，甚至在专家目前给完全没接触的技术和方案并（招标时矇吹）过关。",
          "en": "The ability to guess, I can understand something in five minutes and provide solutions based on it, even tell you its principle. I can get it right eight or nine times out of ten, even when experts currently give me technology and solutions that I haven't been exposed to at all and (in a bid, I'll exaggerate to) pass the test."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "倒立手冲",
          "en": "Handstand"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "私以为，会用电脑。以前是普及问题，现在是年轻人爱用手机。",
          "en": "I personally think I am good at using computers. It used to be a matter of popularity, now young people prefer to use mobile phones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吹牛逼，特别能吹关于「自以为自己很擅长，而一般人不太掌握的那种技能」方面的牛逼。",
          "en": "Bragging, especially good at bragging about “those skills that I think are better than average people”."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用舌头发出比手打响指更像响指的声音。",
          "en": "Use your tongue to make a sound that sounds more like a snap than a finger snap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lstz 我用搜狗打拼音提示最快都 128 字每分钟。。这个借助云+词库很容易办到吧，而且我是二指禅",
          "en": "@lstz I type with Sogou Pinyin input and get up to 128 characters per minute.. This is easy to achieve with the help of cloud + vocabulary, and I'm a two-finger typist"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@adangcc 牛逼 谢谢你 让我上班期间做了下拉伸",
          "en": "@adangcc Awesome, thank you for letting me do some stretches during work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ck65 #29 快把你的黄金体验镇魂曲叫出来给大伙开开眼界",
          "en": "@ck65 #29 Quickly summon your Golden Experience Requiem to show everyone"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "擅长在人生大考中考出平时考不出的成绩，比如中考全校第一名，高考班级第一名...",
          "en": "Good at achieving results in major life exams that I can't normally achieve, such as first place in the school on the high school entrance exam, first place in the class on the college entrance exam..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "控制耳膜实现主动降噪",
          "en": "Control the eardrum to achieve active noise reduction"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "bbox",
          "en": "bbox"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "疯狂加班[doge]",
          "en": "Work overtime crazily [doge]"
        }
      ],
      "type": "replies"
    }
  ]
}