{
  "id": 1016405,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大家操作系统默认语言使用中文还是英文？",
          "en": "Do you all use Chinese or English as the default operating system language?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "不是，各位用英文的装给谁看啊。。。谁看你操作系统啊。英文和中文还有功能上的差别？",
          "en": "No, who are you flexing for by using English... Who looks at your operating system? Are there any functional differences between English and Chinese?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xz410236056 别那么自卑，用英文就是装？看别人用 iPhone 就说别人装逼，也是你这种人吧",
          "en": "@xz410236056 Don't be so self-deprecating, is using English just showing off? You're the type of person who says others are showing off just because they use an iPhone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xz410236056 > 各位用英文的装给谁看啊。。。谁看你操作系统啊。英文和中文还有功能上的差别？学英语有好处，这点应该很多人认同吧。",
          "en": "@xz410236056 > Who are you flexing for by using English... Who looks at your operating system? Are there any functional differences between English and Chinese? Learning English is beneficial, I think many people would agree with that."
        },
        {
          "zh": "而操作系统用英语，对学英语是有帮助的啊，也许学不了多少单词，但可以非常频繁地看见英语，心理上对英语的抗拒就会少很多（这点实测非常有效）。",
          "en": "And using English for the operating system is helpful for learning English. Maybe you won't learn many words, but you can see English very frequently, and your psychological resistance to English will be much less (this is very effective in practice)."
        },
        {
          "zh": "同时也是对自己的一种提醒和鼓励（提醒自己要学英语，鼓励自己多学英语）。",
          "en": "It's also a reminder and encouragement to yourself (reminding yourself to learn English, encouraging yourself to learn more English)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "英文，因为我 iOS 上用日区的 Apple Music ，系统是中文的话很多名字会用片假名显示，狗都看不懂。",
          "en": "English, because I use the Japanese Apple Music on iOS. If the system is Chinese, many song titles will be displayed in katakana, which is incomprehensible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没啥意义啊，我用过一段时间，其实不管他是中文还是英文，还是日文，你用的多的地方，都是一个符号而已，你根本不会注意这个符号是不是写错了。",
          "en": "It doesn't make much sense. I've used it for a while. Actually, whether it's Chinese, English, or Japanese, where you use it often, it’s just a symbol; you won't even notice if the symbol is written incorrectly."
        },
        {
          "zh": "而如果不常用的地方突然出现英文或者日文，而且还是生词，那就只能又去翻译一下，真是闲的。",
          "en": "And if English or Japanese suddenly appears in places you don't use often, and they are new words, then you can only translate them, which is really idle."
        },
        {
          "zh": "如果真想英文，那你不如去看几篇论文，那全是英文，基本还要一一理解，光改个界面，等你熟悉了，你会在意它实际是 duplicate 还是 copy ？你只会在菜单出来的一瞬间，点第三个或者第四个而已。。。",
          "en": "If you really want to use English, you might as well read a few papers. They are all in English, and you basically have to understand them one by one. Just changing the interface, once you're familiar with it, will you care if it's actually duplicate or copy? You'll just click on the third or fourth item when the menu appears..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是不相信各位，用英文的能不能给张图。",
          "en": "It's not that I don't believe you all; can those who use English give a picture?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Windows 都是中文, 非中文的 Windows 系统字体 fallback 策略是日文字体优先级更高, 到导致部分软件中文字形很奇怪.",
          "en": "Windows is all Chinese. The font fallback strategy for non-Chinese Windows systems prioritizes Japanese fonts, resulting in strange character shapes in some software."
        },
        {
          "zh": "自己改注册表可以解决, 但是太麻烦.",
          "en": "You can fix it by modifying the registry yourself, but it's too troublesome."
        },
        {
          "zh": "懒得弄.",
          "en": "I'm too lazy to do it."
        },
        {
          "zh": "直接装中文了.",
          "en": "I just installed the Chinese version."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "英语 linux 桌面，因为翻译了反而看不懂",
          "en": "English Linux desktop because I can't understand the translation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xz410236056 中文机翻或者烂，果子的复制和拷贝/duplicate&copy 有歧义，有的中英夹生反而增加困难，搜索不方便。",
          "en": "@xz410236056 Chinese machine translation is either poor or bad. Apple's copy and duplicate & copy have ambiguity. Some Englishes and Chinesees are hard to understand, making it difficult to search."
        },
        {
          "zh": "国产软件，国产手机设中文，海外英文问题最少",
          "en": "Set the system language to Chinese for domestic software and domestic mobile phones; overseas English problems are the fewest."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是英语 少数国产软件会手动换成中文楼上某些人要是知道我司国人 channel 里还有中文输入法都懒得在电脑上装的是不是要疯掉 lol",
          "en": "All English. A few domestic software will manually switch to Chinese. If some people upstairs knew that our company's Chinese channel even the Chinese input method is too lazy to install on their computers, they would go crazy, lol"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@noahhhh #27 操作系统机翻你是在逗我吗。。。果子那歧义是历史翻译造成的一直就不改。",
          "en": "@noahhhh #27 Are you kidding me about the machine translation of the operating system... The ambiguity of Apple's translation is caused by historical translations and has never been changed."
        },
        {
          "zh": "“搜索不方便” 这从何说起？ google 的搜索语言跟你操作系统啥关系",
          "en": "“Inconvenient Search” How can you say that? What does the search language of Google have to do with your operating system?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xz410236056 #31 微软有多少机翻你没看到吗，Linux 很多发行版社区中文翻译进度才百分之八九十，有机翻和一堆英文，苹果不说翻译拗口，想搜索使用教程，搜访达，启动台，程序坞等等根本找不到有用的答案",
          "en": "@xz410236056 #31 Haven't you seen how much machine translation Microsoft has? The Chinese translation progress of many Linux distribution communities is only eighty or ninety percent, with machine translation and a bunch of English. Not to mention that Apple's translations are awkward, when searching for tutorials, searching for Finder, Launchpad, Dock, etc. you can't find any useful answers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cmdOptionKana #75 那段时间把手机改成英文，微信下面具体是啥英文重要吗，基本都是看图标，发消息也是中文，所以我说没啥意义，想练习英语有更多更有效的方式，而不是纠结在系统用不用英文这件收益很小的事情。",
          "en": "@cmdOptionKana #75 I changed the phone to English for a while. Does it matter what the specific English is below WeChat? It's basically icons, and sending messages is also in Chinese, so I said it doesn't make much sense. There are more effective ways to practice English, instead of getting stuck on the small benefit of whether to use English in the system."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用过很长时间英文，一段时间日文，最近用繁体中文。",
          "en": "I've used English for a long time, Japanese for a while, and recently Traditional Chinese."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "英语 linux 桌面。以前买过一次美团云，里面的 linux 控制台都是中文的，巨辣眼（也可能是从来没用过中文的没适应），专业词都翻译了，看到中文专业词还要想一会到底指哪个英文词。",
          "en": "English Linux desktop. I once bought Meituan Cloud, and the Linux console inside was all in Chinese, which was extremely annoying (maybe I wasn't used to it since I had never used Chinese). Professional terms were all translated, and when I saw Chinese professional terms, I had to think for a while about which English word it actually referred to."
        },
        {
          "zh": "所以平时看英文资料的还是用同一种语言更好。",
          "en": "So it's better to use the same language when reading English materials."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "手机英文，电脑也想英文但是懒得换了，浏览器倒是英文",
          "en": "English on the phone, I also want English on the computer but I'm too lazy to switch, the browser is in English."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近装的 Windows 我选了 English (Hong Kong SAR)，不喜欢美国的奇葩月日年格式不过就会导致输入法里面会有一个 en-US 和 en-HK 两个语言，还要进注册表删掉一个。",
          "en": "I chose English (Hong Kong SAR) for the Windows I recently installed. I don't like the bizarre month-day-year format of the US, but it will cause there to be two languages, en-US and en-HK, in the input method, and I have to go to the registry to delete one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同 #3",
          "en": "Same as #3"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "中文  简单明了 看起来无障碍 不用费心思转译",
          "en": "Chinese is simple, clear, and looks unobstructed. No need to translate it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想用英文，可是预装的家庭版不能设置英文。。。",
          "en": "I want to use English, but the pre-installed Home version can't be set to English..."
        }
      ],
      "type": "replies"
    }
  ]
}