{
  "id": 1015612,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "人类目前有没有发明出来过减肥食物。。。",
          "en": "Has mankind currently invented any weight loss foods...?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "不是指减肥药，而是说那种吃了能让胃感觉被填满了但是实际上没啥能量的东西。。。我知道果冻好像不加糖的话是没啥能量，不过好像市面上不卖不加糖的果冻。。。有没有健身哥懂这方面的？",
          "en": "I'm not referring to diet pills, but rather something that makes your stomach feel full but doesn't actually have much energy... I know that jelly, if sugar isn't added, seems to have no energy, but it doesn't seem like sugar-free jelly is sold on the market... Any fitness guys know about this?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "观音土",
          "en": "Guanyin soil"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "瘦肉率含量高的卤牛肉 当然水煮吃的消就更好了，  虽然牛肉自身有热量，但是消化牛肉的蛋白质人体需要付出更多的热量。虾、鱿鱼、螃蟹 白灼着吃亦然。其实我们不需要生产用于减肥的食物，大自然的食物都是健康的、营养的。让我们肥胖不健康的，是精加工食品。蛋糕，精加工的面粉、高热量的油脂、极高的蔗糖。 这就是典型的糖友混合物。红烧肉， 大量糖分熬的汤色和猪肉脂肪形成的糖友混合物。蛋炒饭是糖友混合物， 但是白米饭就健康很多， 如果白米饭再参入糙米，那就更健康了。加工程度： 蛋炒饭>白米饭>糙米饭，加工程度越低越健康",
          "en": "Lean beef with a high lean meat content, and it's even better if it's boiled. Although beef itself has calories, the body needs to expend more calories to digest beef protein. Shrimp, squid, and crab, blanched and eaten, are also good. Actually, we don't need to produce food specifically for weight loss; natural foods are all healthy and nutritious. What makes us fat and unhealthy is processed food. Cakes, processed flour, high-calorie oils, and extremely high sucrose. This is a typical sugar friend mixture. Braised pork, a mixture of lots of sugar cooked into the broth and pork fat. Fried rice with eggs is a sugar friend mixture, but plain rice is much healthier. If you add brown rice to plain rice, it will be even healthier. Processing degree: Fried rice with eggs > Plain rice > Brown rice, the lower the processing degree, the healthier."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看见蛋炒饭三个字我心里都一咯噔。。。",
          "en": "My heart skipped a beat when I saw the words \"fried rice with eggs\"..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人体三大营养素：蛋白质、碳水化合物和脂肪。最后都会化作人体需要的能量，用于满足人体的组织器官消耗，包括消化食物本身也是消耗能量的。 一个成年人一天完全不动，也要消耗 1500-1600kcl 的热量（心脏跳动、脑子思考，血液循环，无一不在消耗能量）。- 这其中，消化蛋白质是需要热量最多的，所以每餐一定要保证蛋白质的比例- 但是消化蛋白质需要脂肪酶的，以及蛋白代谢产物的进一步排除也需要脂肪，所以需要脂肪- 人体消耗的能量会造成血糖波动，需要碳水来进行快速的补充，蛋白质消化太慢，速度跟不上，所以碳水也不能完全杜绝。总上来说就是...没有，只能调整自己入口的食物种类。但是你可以选择蛋白的种类、脂肪的种类，特别是碳水化合物的种类，来控制血糖的变化，减少饥饿感和摄入的总量，最终达到热量缺口，从而减肥。比较好的碳水：各种丰富纤维素的食物比较好的脂肪：鱼油、植物油、坚果比较好的蛋白：鸡蛋、鸡肉、牛肉",
          "en": "The three major nutrients for the human body are protein, carbohydrates, and fats. They will eventually be converted into energy needed by the body to meet the consumption of human tissues and organs, including the digestion of food itself, which also consumes energy. A fully sedentary adult also needs to consume 1500-1600kcl of calories per day (heart beating, brain thinking, blood circulation, all consuming energy). - Among these, digesting protein requires the most calories, so the proportion of protein must be guaranteed in every meal. - However, digesting protein requires lipase, and the further elimination of protein metabolites also requires fat, so fat is needed. - The energy consumed by the human body will cause blood sugar fluctuations, and carbohydrates are needed for rapid replenishment. Protein digestion is too slow, and the speed can't keep up, so carbohydrates cannot be completely ruled out. In summary... There isn't a single food that meets the criteria, you can only adjust the types of food you eat. But you can choose the types of protein, types of fat, and especially the types of carbohydrates, to control blood sugar changes, reduce hunger, and reduce the total intake, ultimately achieving a calorie deficit, thereby achieving weight loss. Better carbohydrates: foods rich in fiber, better fats: fish oil, vegetable oil, nuts, better protein: eggs, chicken, beef"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大量纤维素的东西都是啊，魔芋、海带、各种叶子菜、西兰花、洋葱；高蛋白低脂肪低碳水的其实也是，反正吃蛋白质不长胖，鱼、虾、蛋清，鸡胸肉水其实也是..或者各种像纤维素一样不消化的东西，有一段时间流行奇亚籽，其实差不多",
          "en": "Foods with a lot of fiber fit the description: konjac, kelp, various leafy vegetables, broccoli, onions; High-protein, low-fat, low-carb foods are also okay. Anyway, eating protein doesn't make you fat: fish, shrimp, egg whites, boiled chicken breast... Or there are various things that don't digest like fiber. Chia seeds were popular for a while, and it's about the same."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "魔芋？好像说芹菜也是，消化它的能量 大于 吸收的能量",
          "en": "Konjac? It seems like celery too, the energy to digest it is greater than the energy absorbed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@winterbells 芹菜好像是没法大量吃？",
          "en": "@winterbells Seems like you can't eat a lot of celery?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你说的这种食物一大堆，比如麦片，青菜，再搭配点鸡胸肉，饱腹和健康很容易。难点在于：人每天的基础代谢需要很多能量，因此你不得不吃；如果你吃的能量太少，人体首先会分解肌肉，而不是分解脂肪。因此，你想少吃是不行，你还要做运动，而做运动又需要吃东西补充体力。简而言之，难点在于要做运动。",
          "en": "There are a lot of foods like you described, such as oatmeal, vegetables, plus some chicken breast; satiety and health are easy to achieve. The difficult part is: the human body needs a lot of energy for daily basal metabolism, so you have to eat; If you eat too little energy, the body will first break down muscle, not fat. Therefore, you can't just eat less, you also have to exercise, and exercising requires eating things to replenish your energy. In a nutshell, the difficult part is to exercise."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cmdOptionKana 过去半年左右是保持运动量但是吃的方面没怎么控制，该咋吃咋吃，体重变化不明显，感觉还是得在吃的上下功夫",
          "en": "@cmdOptionKana I've maintained my exercise for the past six months or so, but haven't controlled my diet much, eating as I please, and the weight change is not obvious. I feel like I still have to work hard on the eating part."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@LeeReamond 吃肯定也是要控制的，我漏了说一点诡异的地方：人要做很大量运动才消耗很少热量，但吃一点东西就会补充很多热量。所以，你可以算一算每天吃多少热量，做运动消耗多少热量，算过之后会自然不敢吃东西，因为每多吃一口东西你都知道今天要多做多少运动，不想那么累就少吃几口（但又不能过度节食）。",
          "en": "@LeeReamond Eating definitely needs to be controlled. I missed to mention one strange thing: people need to do a lot of exercise to burn a few calories, but eating a little will replenish a lot of calories. So, you can calculate how many calories you eat each day, and how many calories you burn from exercise. After calculating, you'll naturally be afraid to eat, because you know how much more exercise you have to do today for every extra bite you eat. If you don't want to be so tired, eat a little less (but don't over-restrict your diet either)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "寒天啊",
          "en": "Agar"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Aaarnold 还有爱玉",
          "en": "@Aaarnold And Ai-yu (a type of jelly)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cmdOptionKana #5 麦片热量不低，我早上吃一碗 100g 加牛奶，热量就 400 大卡以上了",
          "en": "@cmdOptionKana #5 Oatmeal is not low in calories. If I eat a bowl of 100g with milk in the morning, it's over 400 calories."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没专门研究过,不过印象 健身的蛋白粉就是类似的东西,另外生酮饮食也可以做到对了膳食纤维也可以",
          "en": "I haven't specifically researched this, but I have the impression that fitness protein powder is a similar thing; also, the ketogenic diet can achieve this. Dietary fiber is also an option."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "植物人，完全没消化功能吊，鼻饲的流质营养液，发展下去就是赛博代餐，那也是有能量的，但至少是人类目前近未来的极限了。既要维持生命体征，又得 0 能量，只能自己进化成深海蜉蝣了。",
          "en": "A vegetative patient, with no digestive function... the liquid nutritional solution administered through a nasal tube, the future is cybermeal replacement. That also has energy, but that's at least the limit for humans in the near future. To maintain life signs and have 0 energy, you can only evolve into deep-sea plankton yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你某宝搜代餐，女性真减肥一般就会吃那玩意儿",
          "en": "You can search for meal replacements on Taobao. Women who are seriously trying to lose weight usually eat those things."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ivmm #3 肥胖和精加工食物关系不大，只不过人类能吃饱还没几年而已。精加工的食物热量大，人才喜欢吃，就像野生肉食动物杀掉猎头都是先吃内脏的，野生动物怎么就不担心肥胖呢？",
          "en": "@ivmm #3 Obesity has little to do with processed food; it's just that humans haven't been able to eat their fill for a few years. Processed foods have high calories, and people like eating them, just like wild carnivorous animals kill the prey and eat the organs first, so why don't wild animals worry about obesity?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找个食物热量表看。https://www.boohee.com/food",
          "en": "Look for a food calorie chart. https://www.boohee.com/food"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "金针菇，可以卡 BUG ，循环起来",
          "en": "Enoki mushrooms (Golden needle mushrooms), can exploit a BUG, cycle it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很少有人吃的东西是单纯营养素的组成，麦片、米饭都是典型的大家以为是碳水来源，但他们也有蛋白质和脂肪的成分。补充一点，食物的加工，会影响营养的消化吸收。 最典型的就是米饭和粥。 - 米饭是最常见的碳水来源了，正常的米饭（控制量）完全做减肥餐的主食（当然用玉米、土豆、南瓜之类的会更好一些）。 - 然后经过糊化的白米粥，会非常消化吸收，变成血糖，然后被胰岛素变成肌糖原和脂肪储备起来（因为人体那时候不需要这些能量，就都会储藏起来，形式就是肌糖原、脂肪）。这些东西都是营养学最基础的理论，你 b 站随便找个视频了解一下吧。或者买本书，我看的是《运动营养指南》",
          "en": "Few foods are made of pure nutrients; oatmeal and rice are typical examples that everyone thinks are carbohydrate sources, but they also have protein and fat components. To add, food processing affects the digestion and absorption of nutrients. The most typical example is rice and porridge. - Rice is the most common source of carbohydrates, and normal rice (with controlled amounts) can be a staple food for a weight-loss diet (of course, corn, potatoes, and pumpkins are better). - Then, white rice porridge, which has been gelatinized, will be very well digested and absorbed, turning into blood sugar, and then converted by insulin into muscle glycogen and fat to be stored (because the body doesn't need this energy at that time, it will all be stored, in the form of muscle glycogen and fat). These things are all the most basic theories in nutrition, and you can find a video on Bilibili to learn about it. Or buy a book, the one I'm reading is \"Sports Nutrition Guide\"."
        }
      ],
      "type": "replies"
    }
  ]
}