{
  "id": 1013313,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "低价 GPT4，最低至六毛一美元额度，如大额购买另有优惠，支持高并发",
          "en": "Low-cost GPT4, as low as 0.6 yuan per dollar of credit, with discounts for large purchases and support for high concurrency"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "https://api.kksj.me\r\n本站点提供购买额度之后开箱即用，无需自己配置，具体使用方法详见首页使用方法\r\n除了开箱即用之外，本站点提供 API 调用，可在其他开源客户端调用，如 nextweb,chatbot 等等",
          "en": "https://api.kksj.me\r\nThis site provides ready-to-use services after purchasing credits, no configuration required. See the instructions on the homepage for details.\r\nIn addition to being ready-to-use，this site provides API calls that can be used in other open-source clients, such as nextweb, chatbot, etc."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@cat9life @8888k666 @mosliu 倍率这个词是楼主用的开源程序那边搞出来的一个概念，普通用户很难理解到底是啥意思，然后有一部分中转站就宣称一块钱充一刀但是把倍率调高后，你觉得一块钱充一刀很划算，假设你充了十刀，实际你只能用到 7 刀甚至 5 刀官方对应的量，先宣称低价忽悠客户充值然后在实际使用扣费的过程中做一点手脚。",
          "en": "@cat9life @8888k666 @mosliu The term “multiplier” is a concept created by the open-source program used by the poster. It's difficult for ordinary users to understand what it means. Then, some relay stations claim to charge one yuan for one dollar, but after increasing the multiplier, you think it's a bargain to charge one yuan for one dollar. Assuming you charged ten dollars, you can actually only use 7 or even 5 dollars of the equivalent amount from the official source. They first claim a low price to coax customers to recharge, and then they do something sneaky in the process of deducting fees in actual use."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kryptono 如果你有官网直连 key 你就不会说出这种话gpt-4 指向 gpt-4-0613而即使是 gpt-4-1106-preview 的信息也仅仅是截止到 23 年初。虽然我也是同行，但反驳不是这样反驳的。Azure gpt-4 成本最低 0.1-0.2 人民币 每 美元OpenAI gpt-4 成本最低 0.3-0.4 人民币 每 美元逆向的话成本更低了，一般 0.05 人民币 每 次他是纯粹的用卷价格来挣人气，虽然我觉得是**行为。但现在已经没有什么人会做出 3.5 充 4 的事情",
          "en": "@kryptono If you have an official direct connection key, you wouldn't say such things. gpt-4 points to gpt-4-0613, and even the information of gpt-4-1106-preview only goes to the beginning of 2023. Although I am also in the same industry, this is not how to refute. Azure gpt-4 costs as low as 0.1-0.2 yuan RMB per US dollar. OpenAI gpt-4 costs as low as 0.3-0.4 yuan RMB per US dollar. Reverse engineering would cost even less, generally 0.05 yuan RMB per time. He is purely using the price of coupons to gain popularity, although I think it's ** behavior. But now no one will do the 3.5 charge 4 thing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@8888k666 0.8 人民币当 1 美元使用，这个模型是 15 倍，即 0.8×15=12 ，相当于 12 人民币当 1 美元用，好耶，比官方贵。",
          "en": "@8888k666 Using 0.8 RMB as 1 USD, this model has a 15x multiplier, meaning 0.8 × 15 = 12, equivalent to using 12 RMB as 1 USD. Good, it's more expensive than the official price."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Sosocould 看不懂这计费方式, 来 v 站割韭菜了",
          "en": "@Sosocould Can't understand this billing method, is this to exploit people on V2EX?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前面说的对，人家 openai 根本没有倍率这个概念，是 oneapi 这些项目发明的词，你说什么“官方倍率”就很扯淡",
          "en": "What was said earlier is correct, OpenAI doesn't have a concept of multipliers at all. It's a term invented by projects like oneapi. Saying \"official multiplier\" is ridiculous."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "为啥要加个倍率概念。就直接全部换算成人民币，以一千 token 为单位，注明下官方多少钱，你们的多少钱。多清晰啊，现在根本看不懂了。。。",
          "en": "Why add a multiplier concept? Just convert everything to RMB, use a unit of one thousand tokens, note how much the official price is, and how much yours is. That's so clear, but now I can't understand it at all..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这是 GPT 3 ，包装成 4 来卖了。随便问几句就知道。",
          "en": "This is GPT 3, packaged and sold as 4. You'll know after asking a few questions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Allen626 2023 年各种主流编程语言的使用占比？word count: 15对不起，我无法提供 2023 年各种主流编程语言的确切使用占比，因为我的训练数据只包含了到 2021 年的信息。但是，基于过去的趋势和数据，一些主流的编程语言比如 JavaScript, Python, Java, C, C++, C#, PHP, Swift 和 TypeScript 等可能仍然保持高使用率。有一些公开可用的资源，如 Stack Overflow 的年度开发者调查，可以为你提供更近期的数据和趋势。然而，编程语言的流行程度和使用率可能会因地区、行业和特定的工作需求而有所不同。如果你需要关于某种特定编程语言的情况，或者需要了解某种编程语言在过去几年的趋势，我可以提供帮助。word count: 204, tokens used: 586, model: gpt-4有时效性的问题，GPT4 是能给出回答的",
          "en": "@Allen626 Usage share of various mainstream programming languages in 2023? word count: 15 Sorry, I cannot provide the exact usage share of various mainstream programming languages in 2023 because my training data only includes information up to 2021. However, based on past trends and data, some mainstream programming languages such as JavaScript, Python, Java, C, C++, C#, PHP, Swift, and TypeScript may still maintain high usage rates. There are some publicly available resources such as Stack Overflow's annual developer survey that can provide you with more recent data and trends. However, the popularity and usage rate of programming languages may vary depending on the region, industry, and specific job requirements. If you need information about a specific programming language or need to understand the trends of a certain programming language in recent years, I can help. word count: 204, tokens used: 586, model: gpt-4 There is a problem with timeliness, GPT4 can give an answer"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你是 https://ngedlktfticp.cloud.sealos.io/ 代理吧这家注册送 20 刀，一刀只需要 0.25",
          "en": "Are you a proxy for https://ngedlktfticp.cloud.sealos.io/ This one gives 20 dollars upon registration, and one dollar only costs 0.25"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既然是中转就别搞这些迷惑人的表达，没给方便，光提高门栏了，做商业，自己不反思么。在这里都这么问，你咋推广。",
          "en": "If it’s a relay, don't use these confusing expressions. It doesn't provide convenience, it only raises the barrier. If you're doing business, don't you reflect on this? People are asking this here, how will you promote it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@maxthon 那天应该是网站被打了，目前已经加防御了，应该不会出现这个问题了",
          "en": "@maxthon The website was probably attacked that day, but defense has been added, and this problem should not occur anymore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "（纯好奇）有个疑问，为什么大家都喜欢设置倍率，这样实际价格还要算一下才知道。为啥不直接给出实际使用的价格？",
          "en": "(Purely curious) I have a question, why does everyone like to set multipliers? Then you have to calculate the actual price to know. Why not just give the actual price?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cat9life 便于和官方价格对比吧",
          "en": "@cat9life To make it easy to compare with the official price."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "gpt-4\t 15 倍率? 没看懂怎么算的, 比官方贵 15 倍?",
          "en": "gpt-4 15x multiplier? I don't understand how it's calculated, is it 15 times more expensive than the official price?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没看懂，到底是咋卖的？",
          "en": "I don't understand, how exactly is it sold?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没看懂怎么算的以这个为例：`官方渠道的识图模型，倍率为 30 ，相当于 4.2 元一刀，稍贵，不建议使用，建议使用 gpt-4-all`按前面报价 0.8 元一刀  30 倍 应该是 42 元一刀吧？",
          "en": "I don't understand how it's calculated. Take this as an example: `The official channel's image recognition model has a multiplier of 30, which is equivalent to 4.2 yuan per dollar. It’s a bit expensive, so it’s not recommended. It is recommended to use gpt-4-all`. Based on the previous quote of 0.8 yuan per dollar, with a 30x multiplier, shouldn't it be 42 yuan per dollar?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "四块钱买了五刀，试试先",
          "en": "Bought five dollars for four yuan, let's try it first."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用过的老哥说一下国内网络的连通性怎样",
          "en": "Can the experienced people say how the connectivity is on the domestic network?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是按照官方倍率计算的，除了 4v ，因为识图模型，目前并发低，流量占用高@cat9life",
          "en": "They are all calculated according to the official multiplier, except for 4v, because the image recognition model currently has low concurrency and high traffic usage. @cat9life"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Sosocould 日本机器，用的 iij 线路",
          "en": "@Sosocould Japanese machine, using IIJ line"
        }
      ],
      "type": "replies"
    }
  ]
}