{
  "id": 1015784,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "百万医疗 60 岁后价格翻倍正常么?",
          "en": "Is it normal for the price of Million Medical Insurance to double after age 60?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "父母去年都满 60 周岁了.  ",
          "en": "My parents both turned 60 last year."
        },
        {
          "zh": "一直买的支付宝的好医保, 6 年续费版本的.  ",
          "en": "I have been buying Alipay's Good Medical Insurance, the 6-year renewal version."
        },
        {
          "zh": "这个月续费, 每个月付款从 134.2 涨到 213.04 了. ",
          "en": "This month's renewal increased the monthly payment from 134.2 to 213.04."
        },
        {
          "zh": "我之前一直以为费用是固定不变的.  ",
          "en": "I always thought the fee was fixed."
        },
        {
          "zh": "没想到一下子翻倍了.  ",
          "en": "I didn't expect it to double all of a sudden."
        },
        {
          "zh": "有点不知所谓, 是所有百万医疗都会这样么?",
          "en": "I'm a little confused. Does this happen with all Million Medical Insurance?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "买保险之前没看费率表吗？@rocmax 续费=续保，新投保有 90 天等待期，续保没有@DinoStray 你才是最需要买保险的，父母退休之后你就是家里的顶梁柱。说句难听的，你爸妈就算明天病死，你的生活该怎么过还是怎么过；万一你明天病死，你爸妈的退休生活就要出问题",
          "en": "Didn't you check the rate table before buying insurance? @rocmax Renewal = Reinsurance, new insurance has a 90-day waiting period, renewal does not. @DinoStray you are the one who needs insurance the most. After your parents retire, you are the backbone of the family. To put it bluntly, even if your parents die tomorrow, your life will go on as it is; if you die tomorrow, your parents' retirement life will be in trouble."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实真有用的是意外险， 确诊之后一次赔付多少万的那种这种医疗补充险一年不是住院几十万的消费， 大部分能命中医保， 赔不了多少的， 我去年自己掏了十万左右，一毛都没赔付到， 他们的计算方法和我们想当然的那种计算方法是不一样的",
          "en": "Actually, what's really useful is accident insurance, the kind that pays out hundreds of thousands of dollars in a lump sum after diagnosis. This kind of supplementary medical insurance doesn't involve hundreds of thousands of dollars in hospitalization expenses per year. Most of it can be covered by basic medical insurance, so it doesn't pay out much. I paid about 100,000 yuan out of my own pocket last year, and I didn't get a penny in compensation. Their calculation method is different from the one we take for granted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这类 年度缴费的医疗保险(不是重疾险, 也不是签订合同必须交满十几二十年的那种), 我给自己和家人买了好些年了. ",
          "en": "I have been buying this type of annual medical insurance (not critical illness insurance, nor the kind where you have to pay for a dozen or twenty years) for myself and my family for many years."
        },
        {
          "zh": "大部分这类 商业医疗保险都是一年签合同的, 意味着保险公司有权根据客户前一年度的健康状况不与客户继续签到 新一年的保险合同 (它们当然有这权力, 何况每年都是一个新合同 ... ).",
          "en": "Most of these commercial medical insurance policies are signed on an annual basis, which means that the insurance company has the right not to continue signing a new insurance contract with the customer based on the customer's health status in the previous year (of course they have this right, especially since each year is a new contract...)."
        },
        {
          "zh": "所以, 这类商业医疗保险, 从一个保险客户角度, 看到保险公司有这么几种 \"玩法\":1. 客户一直比较健康(无大几十万的理赔或重大疾病), 就每年一直给你审核通过让你续费. ",
          "en": "Therefore, from the perspective of an insurance customer, this type of commercial medical insurance sees insurance companies having the following \"tricks\": 1. If the customer is relatively healthy (no claims of hundreds of thousands of yuan or serious illnesses), they will continue to review and approve your renewal every year."
        },
        {
          "zh": "可 客户一旦发生大病, 我们都知道大病常常不是几个月一年的治疗能结束的, 但这时候个人又是最需要医疗保险的时候,  可保险公司理赔完当年度, 第二年就停止客户续费, 对保险公司这算\"止损\". ",
          "en": "But once a customer has a serious illness, we all know that serious illnesses often cannot be treated in a few months or a year, but this is when individuals need medical insurance the most. However, after the insurance company settles the claim for the current year, it will stop renewing the customer's policy the following year, which is considered \"loss control\" for the insurance company."
        },
        {
          "zh": "2. 一个保险险种, 隔几年就停止销售停止所有续费,  名字加几个字, 条款换点内容, 就是新产品, 保险公司称之为是\"升级\".  ",
          "en": "2. An insurance product will stop being sold and all renewals will be stopped every few years. Add a few words to the name, change the terms, and it's a new product, which the insurance company calls an \"upgrade\"."
        },
        {
          "zh": "实则, 意味着 所有原客户都失去了 续费条件.  ",
          "en": "In fact, it means that all original customers have lost the renewal conditions."
        },
        {
          "zh": "研究过这类保险合同后就知道, \"保险续费\" 的要求,条件和费用与 \"新入险\"  都是不一样的,  \"新入险\"的年龄要求,健康条件都要更高, 价格也更高不少 [全都对保险公司更有利].  ",
          "en": "After studying this type of insurance contract, you will know that the requirements, conditions, and costs of \"insurance renewal\" are different from those of \"new insurance\". The age requirements and health conditions for \"new insurance\" are higher, and the price is also much higher [all of which are more beneficial to the insurance company]."
        },
        {
          "zh": "3. 很多这类保险, 名义上都会说支持终生续费,  但实际操作上会对客户从大概 55 岁开始往后每年涨相当大幅度的保险费, 然后就出现了楼主说的这种 59-->60 周岁后保险费几乎涨了一倍的状况. ",
          "en": "3. Many of these types of insurance policies nominally say that they support lifetime renewals, but in actual practice, they will substantially increase the insurance premiums for customers every year starting from around age 55, and then the situation described by the original poster occurs, where the insurance premiums almost double after age 59-->60."
        },
        {
          "zh": "再加上第二点, 隔几年彻底停售一波原有保险, 就彻底甩开上年龄的那播\"负担\"客户. ",
          "en": "In addition to the second point, every few years, a wave of original insurance policies is completely discontinued, completely getting rid of the \"burden\" of older customers."
        },
        {
          "zh": "比如:  \"续费\"声称是终生, 合同上也会写着可以终生续费, 但 \"新入险\"大多要求客户年龄要低于 65 岁.",
          "en": "For example: \"renewal\" claims to be for life, and the contract will also state that it can be renewed for life, but \"new insurance\" mostly requires the customer to be under 65 years of age."
        },
        {
          "zh": "这还仅仅只是从我从一个用户角度看到的他们的\"玩法\", 还不是行业内的了解. ",
          "en": "This is just from the perspective of a user, and not from an understanding within the industry."
        },
        {
          "zh": "说起来, 大家都可以不买, 但就这社会保障状况, 这类商业医疗保险仍然是尽可能要买的.",
          "en": "Speaking of which, everyone can choose not to buy it, but given the social security situation, this type of commercial medical insurance should still be purchased as much as possible."
        },
        {
          "zh": "因为如果没有这类保险, 真生大病, 靠那点医保, 连病后的第一年都没人管你, \"死\"的更惨 ......",
          "en": "Because without this type of insurance, if you really get a serious illness, relying on that little bit of medical insurance, no one will take care of you even in the first year after the illness, and you will \"die\" even more miserably..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都会。 算不过人家精算师的。 所以我不买，社保都看不好的病，那就认命嘛。。。咳咳。。。",
          "en": "They all do. You can't outsmart their actuaries. That's why I don't buy it. If social security can't cure the disease, then just accept your fate... Cough cough..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hefish 嗯, 我自己就不打算买了.  ",
          "en": "@hefish Yes, I don't plan to buy it for myself."
        },
        {
          "zh": "但是父母必须买, 我身边好几个父母重病的例子吓我了",
          "en": "But my parents must buy it. Several examples of parents with serious illnesses around me have scared me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人在国外，按月缴费的医疗保险都是只看加入时的年龄算钱的，年轻时费用便宜，相对的交的时间也长。这个“续费”是个啥概念？和重新加入有啥区别？",
          "en": "I'm abroad. The monthly medical insurance only looks at the age when you join to calculate the price. The cost is cheaper when you're young, but you pay for a longer period of time. What is this \"renewal\" concept? What's the difference between it and rejoining?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正常，在你初次购买前已经有具体费率表了，根据不同年龄报价，你可以看看 70 岁或者更高年龄的费用是否会对你产生压力。毕竟保险的东西只是为了安心，因人而异，不是必须的。（新农合、居民医保才是）",
          "en": "It's normal. There's a specific rate table before you first buy it, with quotes based on different ages. You can see if the cost for age 70 or higher will put pressure on you. After all, insurance is just for peace of mind. It varies from person to person and is not required. (New Rural Cooperative Medical Scheme and Resident Medical Insurance are.)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不过住院赔付那块好歹能把保险费赚回来...........也算没亏.....",
          "en": "But at least the hospitalization reimbursement can earn back the insurance premium........... It's not a loss....."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大多数保险 60 岁都不给保的，我给爸妈买的也只能续到 70 岁好像，现在是 1400 一年，就算翻倍也是要续费的。",
          "en": "Most insurance companies don't insure people over 60. The one I bought for my parents can only be renewed until they are 70, I think. It's 1400 a year now, and even if it doubles, I will still renew it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rocmax 国外 65 以上给保吗？还是说价格有没有明显变化的？我这个给父母买的到期后就无法续保了。",
          "en": "@rocmax Do they provide insurance for people over 65 abroad? Or are there significant price changes? The one I bought for my parents cannot be renewed after it expires."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SenLief 我看了一下，我这个是终身保险，年龄 18-85 可以投保，坐标日本。你那个是有期限的到期相当于重新入所以价格会涨吧。我这个根据投保时年龄算保费的，40 岁以上开始投保的话月费明显会高，越往后幅度越大。",
          "en": "@SenLief I checked, and mine is a lifetime insurance policy, and people aged 18-85 can be insured. Location: Japan. Yours has a term limit, so the price will increase when it expires, as it's like rejoining. Mine calculates the premium based on the age at the time of insurance. If you start to insure after the age of 40, the monthly fee will be significantly higher, and the increase will be greater as you get older."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "风险大的费率就高，这才是正常的。",
          "en": "The higher the risk, the higher the rate. That's normal."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rocmax 这种大陆也有，不过个人不推荐这种",
          "en": "@rocmax The mainland also has this, but I personally don't recommend it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我给老爹买的微医保一年期，现在 62 岁是 140.6/月（有社保）续了三年半，去年做主动脉弓支架用上了，除了 1W 免赔额，剩下全报",
          "en": "I bought Weiyi Insurance for my dad for one year. He's now 62 years old and it's 140.6/month (with social security). I've renewed it for three and a half years. Last year, he had an aortic arch stent placed, and everything was covered except for the 10,000 deductible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好像一般长期险不会调整，短期险会调整？长期险：重疾险、定期寿险、终身寿险、年金险等短期险：医疗险、意外险",
          "en": "It seems that long-term insurance generally doesn't adjust, while short-term insurance does? Long-term insurance: critical illness insurance, term life insurance, whole life insurance, annuity insurance, etc. Short-term insurance: medical insurance, accident insurance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我今年停了，实在缴不动了，每年都涨价",
          "en": "I stopped it this year. I really can't afford to pay it anymore. The price increases every year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ZeawinL 不调整的其实就是提前把未来的钱交了，也意味着退保会有大量损失",
          "en": "@ZeawinL Not adjusting actually means paying the money for the future in advance, which also means that there will be a lot of losses if you cancel the insurance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也有买，是贵很多。有个问题，如果得病后，下年还可以续吗？",
          "en": "I also bought it. It's much more expensive. I have a question. If you get sick, can you still renew it next year?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有那种年轻的时候一直买的话一直可以不涨价或者微微涨价续到老年的保险的，建议楼主可以看看",
          "en": "There is a type of insurance that, if you keep buying it when you are young, you can renew it until old age without raising the price or raising it slightly. I suggest the original poster take a look."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rocmax 国内基本上所有的保险都是 6 年左右，然后有些确定可以续保，有些明确不能续保，但是一旦过了 60 基本上都很难续保。哎",
          "en": "@rocmax In China, almost all insurance policies are for about 6 years, and then some are confirmed to be renewable, and some are clearly not renewable, but once you are over 60, it is basically very difficult to renew. Alas."
        }
      ],
      "type": "replies"
    }
  ]
}