{
  "id": 1015627,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "我的生命倒计时可能不足五年，我要如何高质量的过好剩余的每一天？",
          "en": "My time left may be less than five years. How can I live each remaining day to the fullest with high quality?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "农历新年前身体不怎么舒服，去耳鼻喉科看医生很不幸的确诊为鼻咽癌。",
          "en": "Before the Lunar New Year, I felt unwell and unfortunately was diagnosed with nasopharyngeal carcinoma at the ENT clinic."
        },
        {
          "zh": "且已经至少一侧淋巴转移。",
          "en": "There has been at least one-sided lymph node metastasis."
        },
        {
          "zh": "属于晚期，人在广州但年后打算去上海质子医院治疗。碰碰运气。",
          "en": "It's categorized as advanced stage. I'm currently in Guangzhou but plan to go to Shanghai's Proton Hospital for treatment later. Let's see how things go."
        },
        {
          "zh": "35 岁等来的不是裁员的中年危机，而是死神的敲门钟。",
          "en": "At 35 years old, what I didn't expect is a mid-life crisis of job loss, but the grim reaper's knell instead."
        },
        {
          "zh": "还好我还未婚没有子女，唯独觉得很对不起父母，至今仍然瞒着父母。怕他们接受不了。",
          "en": "Thankfully I'm unmarried with no children, but I feel deeply sorry for my parents whom I've kept this hidden from so far. I fear they won't be able to handle it."
        },
        {
          "zh": "擦过一些资料，这个病五年生存率还算好，但我担心自己太晚发现，可能有多处转移。",
          "en": "After reviewing some materials, the five-year survival rate for this condition is decent, but I worry my discovery may have been too late with possible multiple sites of metastasis."
        },
        {
          "zh": "因为住院必须家属陪伴，必须告诉父母，我想问问我应该如何委婉的告诉他们？",
          "en": "Since hospitalization requires family accompaniment, I must inform them. How can I gently tell my parents?"
        },
        {
          "zh": "如果我还有五年命，我应该如何高质量的生活？",
          "en": "If I have five more years left, how can I live life to the fullest with quality?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我平时工作中碰到的鼻咽癌患者，由于治疗中和疗程结束后一直要定期随访，所以据我观察，没侵犯颅脑、颅神经、眼眶，没出现远处转移的情况下，绝大多数都稳定在临床治愈的阶段；真正随访过程中出现进展、随访过程中失访的只占很小很小的比例（由于我没实际统计，只是一个大概印象，严谨点就不硬凹一个大概数字了）。鼻咽癌诊疗水平最高的地方，就是中山肿瘤防治所、广东省人医、武汉协和、湘雅附二几个医院，因为这病是一个高度地域相关的疾病，北方发病率很低，看 OP 说人在广州，如果条件允许，直接去中肿吧，我们（湖南 TOP5 三甲）的鼻咽癌专科医生进修都是去中肿、台湾三军总院，这玩意全球就得看亚洲东南部这几个地方。",
          "en": "In my work dealing with nasopharyngeal cancer patients, many remain clinically cured if they haven't shown central nervous system invasion, orbital involvement, or distant metastasis after regular follow-ups post-treatment. Those showing progression or dropping off follow-ups are a very small minority (without actual statistics, just rough estimates). The best nasopharyngeal cancer care is available at institutions like Guangzhou's Sun Yat-sen Cancer Center, Guangdong Provincial People's Hospital, Wuhan Union Hospital, and Xiangya 2nd Hospital. Since OP is in Guangzhou, I strongly suggest going to Sun Yat-sen—our top Hunan hospital specialists all train there, along with Taiwan Tri-service General Hospital. Globally, this region's expertise is unmatched."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别去做别人认为的高质量生活了，做自己喜欢想做还没好好做的事就是了，陪自己深爱的人。",
          "en": "Don't chase others' idea of quality life. Just do what you love, what you've always wanted but never got around to doing—spend time with those you deeply love."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rykiechin #29 复旦的质子重离子我不太了解，这个治疗技术还没有在临床中广泛应用，颇有点以前 CART 、诱导免疫的研究前沿的试点的风格。我不能直接给您一个决策，只能提供点信息帮你判断：对于肿瘤治疗，国家卫健委国家癌症中心赫捷院士领衔指定的 CSCO 指南是全国最权威的临床路径，您可以直接去搜对应的 CSCO 临床指南，再去 pubmed 查一下流行病学综述，就可以心里有一个大致的了解。例 1 ，CSCO 的头颈外科组，鼻咽癌专病诊疗指南中，编辑组组长、副组长、主笔 8 个人中 6 个人是中肿的专家。例 2 ，上海质子重离子医院招聘公告中，放疗科医生最低门槛为硕士，也未对学校、科研、临床成就提出更高的具体的要求（官网打不开，贴丁香园的 https://www.jobmd.cn/company/6827826.htm ）；中山肿瘤的招聘公告非常多，对于 V2er 来说检索不是难事，我只提一点：医教研的医师序列，博士基本是起步门槛，且土博双非很难进，一般是是要双一流或者留学 PhD ，入院只有合同工待遇，不能直接上临床，要先进博后流动站，在规定期限内完成临床、科研业绩后出站才会转聘，否则解聘（中山系列开启的万恶之源，医学领域的非升即走）。例 3 ，两家医院的临床研究发文量如下图：https://s2.loli.net/2024/02/14/S38bIGjxAYtwp1v.pnghttps://s2.loli.net/2024/02/14/E1mStCNMdzirwsg.png您可以看的出我的倾向性，不过我列出的都是客观信息，您可以自己评判一下。",
          "en": "@rykiechin #29 I'm not familiar with Fudan's proton/heavy ion therapy—the technique is still experimental, akin to early CART cell or immunotherapy trials. Instead of direct advice, I'll provide info for your judgment: Nasopharyngeal cancer care should follow CSCO guidelines led by Her Jie's team (China's most authoritative standard). Review CSCO guidelines and PubMed epidemiological summaries. Ex1: 6/8 CSCO head & neck oncology guideline authors are Sun Yat-sen experts. Ex2: Shanghai Proton's job listings require masters for radiation docs (see jobmd.cn link), while Sun Yat-sen demands PhDs (only top-tier or foreign PhDs qualify)—failure to meet research/clinical targets leads to dismissal. Ex3: Compare their publication volumes (links above). This reflects my bias—but all facts are yours to assess."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rykiechin 其实，@Pika666 说得非常清楚了，广州就去中山大学的肿瘤医院或者叫肿瘤中心，东风路的那家。这家应该是最佳选择了。我是经历过家人的癌症治疗的，2017 年手术放疗，现在很痊愈了，每年年度体检。当时我做了最差的准备，连去 USA 的梅奥和安德森癌症中心都做了准备，找了中介翻译病历。最终还是决定在南方医院治疗。我能理解你现在的心情，别担心，在国内找对好医院和医生，听医生的。帮你找到了这份指南：https://njguloulib.yuntsg.com/ueditor/jsp/upload/file/20210608/1623115681640070240.pdf可以下载保存，打印出来放在手边，以这份规范作为你的治疗依据，除此之外，建议不要相信什么其他的疗法，",
          "en": "@rykiechin @Pika666 has given clear advice. Go to Guangzhou's Sun Yat-sen Cancer Center (on Dongfenglu). My family was successfully treated there in 2017. I had even prepared for Mayo Clinic/MD Anderson abroad but ultimately chose domestic care. Trust specialists here! Download this guideline (link) as your primary reference. Avoid unproven therapies."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "请问 OP 是广东本地人还是外地赴广东工作者？因为刚才查了一下维基百科发现广东地区鼻咽癌的患病率莫名其妙地高。这是与基因有关还是纯粹因为当地环境因素？> 鼻咽癌在美國和大多數其他國家並不常見，在大多數人群中每 10 萬人不到 1 例。但是在中國南方地區非常普遍，特別是在廣東，佔中國所有癌症的 18 ％。它有時被稱為廣東癌，因為它在該地區每 10 萬人約 25 例，比世界其他地區高 25 倍。这句应该是从英维直接翻译的——> NPC is uncommon in the United States and most other nations, representing less than 1 case per 100,000 in most populations. but is extremely common in southern regions of China, particularly in Guangdong, accounting for 18% of all cancers in China. It is sometimes referred to as Cantonese cancer because it occurs in about 25 cases per 100,000 people in this region, 25 times higher than the rest of the world.此外德维提到台湾的患病率和广东一样高，称鼻咽癌是年轻男性最常见的死因，并给出了一个推测是因为食用槟榔——> In Taiwan beträgt der Anteil von Nasopharynxkarzinomen an allen Krebserkrankungen etwa 18%. Dort ist das Nasopharynxkarzinom mittlerweile die häufigste Todesursache bei jungen Männern. Eine Ursache scheint dabei der Genuss von Betelnüssen zu sein.",
          "en": "Is OP a Guangdong native or immigrant? Guangdong has inexplicably high NPC rates. Is this genetic or environmental? The U.S./most countries report <1 NPC/100k. In China's south/Guangdong it's 18% of cancers, named “Cantonese cancer” at 25/100k (25x global rates). German sources note Taiwan’s similar rates, where NPC is young men’s top killer—linked to betel nut consumption."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多陪陪父母",
          "en": "Spend more time with your parents"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "祝好。积极治疗，相信科学，努力活；迟早要说的，趁状态还好时说；和专家们多讨论，如果情况真的不佳，安排好父母的养老事宜、自己的遗嘱，了解临终关怀；找一些病友群，互通有无，互相鼓励。",
          "en": "Best wishes. Fight positively with science. Early communication with parents improves their readiness. Discuss options with doctors. If prognosis worsens, plan for their retirement care, your will, and palliative care. Seek patient communities for support."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "鼻咽恶性肿瘤中，最常见的为鳞癌，我国华南地区较多，与地区流行性 EB 病毒感染高度相关。鼻咽鳞癌很容易发生区域淋巴结转移，区域淋巴结转移并不是预后差的关键因素，对你与描述的单侧淋巴结转移如果是客观的，那么 N 分期不会超过 N2 ，临床分期多半还是在 II 期的阶段，只要没有出现远处转移（例如肺转移、骨转移）、颅内侵犯，预后还是相当好的，III 期之前的鼻咽鳞癌五年生存率超过 60%（来源：新英格兰医学期刊 2019 年文献，快捷查看： https://sci-hub.se/10.1056/NEJMoa1905287 ），实际在医疗条件略好的中国城镇、大城市，OS 、PFS 、DFS 等指标轻轻松松超过 60 个月，对于年轻人来说达到临床治愈也不是难事，不必过于悲观，可以多问几个肿瘤专科医生，好一点的医院，鼻咽癌毕竟是一个大病种，都有自己的专病诊疗中心，分出很多方向的亚专科，治疗手段也很多，调强放疗、同步放化疗、免疫治疗、外科治疗等，祝好！",
          "en": "Squamous cell carcinoma (SCC) dominates nasopharyngeal malignancies, prevalent in China’s southeast from endemic EBV. Lymph node metastasis is common but not prognostically critical—you likely qualify as Stage IIB (N2-). With no distant metastasis/brain invasion, 5-year survival exceeds 60% (NEJM 2019). Survival often exceeds 5+ years with modern care. Multiple hospitals offer specialized programs using IMRT, chemoradiotherapy, immunotherapy, etc. Stay hopeful and consult specialists."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "为你感到难过…下面是美国国家综合癌症网络对于鼻咽癌的诊疗指南，希望能有一点点帮助。https://www.nccn.org/patients/guidelines/content/PDF/hn-nasopharynx-patient.pdf最后，我觉得在这个困难的时刻，亲人和朋友的支持可能是最重要的，有了他们能让你觉得自己不是一个人在孤独地战斗。加油！",
          "en": "This must be hard... Below are NCCN nasopharyngeal carcinoma guidelines (link) for reference. Family/friend support is most vital—know you’re not fighting alone. Keep fighting!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1-早晚还是要告诉父母的，选个合适他们易于接受的方式。2-高质量的生活，就是做自己想做的事情，尽量不留遗憾。3-高质量的生活，就是尽量减少痛苦，活的开心一些。4-是否要进行手术治疗要谨慎对待，跟家人商量好。5-好好想想写好遗嘱，交代下身后之事。6-每个人皆有命运，不受此苦，受彼苦。7-人生如白驹过隙，彗星坠落，瞬间绽放，不过而已。",
          "en": "1- Tell parents eventually, in ways they can handle. 2- High-quality life means doing what you desire, leaving no regrets. 3- Prioritize minimizing suffering and joy. 4- Surgery decisions require careful family discussion. 5- Plan your will. 6- Life's trials change, yet remain inevitable. 7- Life is but a fleeting moment—seize it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找几个嫩模吧，把没干的都去干了，去海外旅游下。去印度看看有没有便宜的药，尽可能的活久点，有时候保守治疗也挺好。身边几个案例，年纪轻轻，有的还在早期，做完手术一年，人就走了，期间还化疗啊疼痛啊各种折磨；不知道为什么，可能新陈代谢快，年轻的，做了手术，反而还生存期更短。",
          "en": "Hire some models, experience everything remaining. Take overseas trips. Explore affordable Indian drugs to prolong life. I’ve seen young patients die within a year of surgery, suffering chemo agony—maybe their youthful metabolisms worsened outcomes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Anshay 我比楼主严重的多， 除了淋巴还扩散了肝、肺和盆腔现在每 21 天化疗一次， 费用在四五千左右， 自费的免疫差不多两万一次，但是有赠药的， 买 4 盒之后送 2 年， 而且我有轻微洁癖， 住的是单人房， 一天 600,  要能住双人或者三人的话，一天几十块，  费用能压到三千而且我化疗了十次左右吧， 也见过有人挂掉的， 但是没见过有人上呼吸机续命的.......真没电视里那么夸张",
          "en": "@Anshay My condition is worse—metastasized to liver/lungs/pelvis. Chemo every 21 days ($450–$500), immunotherapy ($20k/initial+subsequent free supply after 4 boxes). stayed solo rooms (¥600/day; cheaper dorms available). I’ve seen mortality firsthand but no extreme life-support scenarios—it’s nothing like TV."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你觉得没有结婚没有子女还好，但是你父母可能会觉得是他们的任务没有完成，如果几年后你不在了，这也会成为他们一辈子解不开的心结。至于你的问题我没有很好的答案，我也不太懂高质量如何定义。从几年前我就开始设置了一个定时邮件，每月提醒自己固定某天去设置延时至下下个月，如果我失去自主能力或者突然死掉，邮件最迟两个月后会发送到我设置的亲人的邮箱，里面有我一些账号密码和写的一些告别的话，每次修改内容和定时时间都感觉是次重生。之前顺着某个事故的新闻尝试跟我妈讨论意外死亡这个话题，我刚做个假设我妈就泣不成声，讨论无法继续，但是世事无常是常态，我就想到了邮箱这个办法。我年龄跟你差不多，我是家未成，业未立，一事无成，一屁股债，去年换了很多份工作，其中有两份是被撵走的。现在这份工作要求理工科背景，而我是文科出身，虽凭三寸不烂之舌过了三轮面试，可是不知道我能做多久，我希望会很久，因为我会像面试时说的那样——全力以赴不留遗憾",
          "en": "Though you view no marriage/children as an advantage, parents may grieve unfulfilled familial duties. I have no good answers for your question about 'quality'. I set up a timed email reminder monthly—triggered if I become incapacitated—to share account passwords and final messages. Discussing death with my mother ended in tears; life’s uncertainties led me to this digital backup. I relate—you also face existential risks._via: A litany of career failures later, I now work in science against my humanities background—a temporary job, but I’ll commit fully until it ends… no regrets."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@googlefans 鼻塞，鼻涕偶尔带血，容易会吸鼻涕而不是喷出来。耳朵孔变小变敏感",
          "en": "@googlefans Symptoms: nasal congestion, occasional blood in mucus, tendency to sniff rather than blow. Hearing sensitivity decreased."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "推荐读读《无国界病人》这本书，作者得了要命的癌症，但活了 10 多年了，总结起来“学习力”很重要。",
          "en": "Read ‘The Uprooted Patient’—the author survived 10+ with terminal cancer. Key takeaway: relentless learning."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@rykiechin #29 复旦的质子治疗有效，但需评估适配性。上海未必最佳，若见效可再出国（日本更佳）。日本癌症筛查和治疗属全球顶尖，质子治疗约30万人民币，比国内便宜。积极心态同样关键，做想做的事以减轻心理压力。",
          "en": "Proton therapy may help. Japan offers world-class oncology care at roughly ¥300k for proton treatment—cheaper than China. Stay positive, do what brings enjoyment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真是令人难过的消息...  至于建议，我个人总觉得有些人总是喜欢站在第三人称的角度来提供建议，而他们不曾面临同样境地——很可能一生都不会遇到。他们冠冕堂皇地提供自认为十分正确的建议，好像整个世界的正义都掌握在他们的嘴里，而完全忽略了被建议者的主观感受。如果让这些人也面临着同样境况，他们嘴里的正义是否还存在？  你想做什么就做什么？而怎么选择的结果你自己看得恐怕比别人要清楚得多！  祝接下来你所做的事情一切顺遂。",
          "en": "This is tragic…I think some advice-givers speak from privilege, lacking lived experience. Their morally packaged “advice” overlooks your reality. Only you truly know what’s best. Do what you judge, and may blessed paths guide you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "作为一个过来人，给你点建议。假如家里经济一般，在广州中肿治疗，已经是广东乃至全国最好的，上海和北京各有一家比较好的。1. 当时医生对我说，我这个晚期是 7 ，8 成的治愈。你这个转移，估计也没差多少2. 这个治疗属于是流水线级，等于进了流水线，跟着走就行3. 治疗大概 3 ，4 个月4. 会有一些后遗症",
          "en": "From experience: Choose Sun Yat-sen in Guangzhou. It’s top nationally—even for your stage. 1- Doctor predicted 70-80% cure rate. Expect similar odds. 2- Standardized protocol-based care requires compliance. 3- Treatment ~3-4 months. 4- Minor post-treatment side effects likely."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "绝命毒师",
          "en": "Breaking Bad"
        }
      ],
      "type": "replies"
    }
  ]
}