{
  "id": 1018423,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "最近总感觉想要买点什么东西，特别有消费的欲望，怎么抑制？",
          "en": "I've recently been feeling like buying things, especially with a strong desire to spend. How can I curb this?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "# \r\n\r\n## **背景**\r\n\r\n最近发现自己时常产生购物冲动，想买一些东西，即使实际上并不需要。例如，上周强烈想购买一台电子阅读器，尽管我之前已经有一台并且卖掉了。同时，我还对一些本身没有需求的产品产生兴趣，甚至会特地搜索寻找一些看起来有趣的小物件。\r\n\r\n## **思考原因**\r\n\r\n产生这个欲望的原因是因为无聊？空虚？\r\n还是因为购物能得到心理的满足感？\r\n\r\n## **解决方法**\r\n\r\n该如何去解决这个问题呢？",
          "en": "# \r\n\r\n## Background\r\n\r\nI've recently found myself often having the urge to shop, wanting to buy things even when I don't actually need them. For example, last week I strongly wanted to buy an e-reader, even though I already had one and sold it. At the same time, I've also become interested in some products that I don't inherently need, and I even specifically search for some interesting little gadgets. \r\n\r\n## Reasons to think about\r\n\r\nIs this desire caused by boredom? Emptiness?\r\nOr is it because shopping gives a sense of psychological satisfaction?\r\n\r\n## Solutions\r\n\r\nHow should I solve this problem?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "花钱的 \"心痛\" 会随时间慢慢淡忘, 但买不到的 \"后悔\" 是会与日俱增的.",
          "en": "The \"pain\" of spending money will slowly fade with time, but the \"regret\" of not buying will increase day by day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是不是炒股回本了？",
          "en": "Did you make back your money from stock trading?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "无伤大雅的买就买了买电子阅读器比黄赌毒还是好多了几年之后你回头看，花个几千块钱买了一些没用的东西，对生活和人生没有根本影响，噪音而已。",
          "en": "If it's harmless, just buy it. Buying an e-reader is much better than gambling or drugs. Years from now you will look back and see that spending a few thousand yuan on some useless things has no fundamental impact on your life, it's just noise."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也是，淘工厂 3 元 3 件捡垃圾",
          "en": "Me too, Taobao Factory, 3 items for 3 yuan, picking up trash."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因为不消费会找不到上班的意义",
          "en": "Because if you don't consume, you won't find the meaning of going to work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有消费的兴趣，至少说明还是有一颗想要折腾的心，虽然买到之后还愿不愿意继续折腾是另一回事。如果连消费欲都没有了的话，那除了吃喝之外还有什么自己的快乐呢...所以我的想法是，消费能力之内的，该买买，该出出，亏也就几十几百的，折腾这一下快乐就完了。我是个不吸烟的人，过年回家给我最大的冲击是家里亲戚吸烟的，过年都买的 50 一包、65 一包的烟在吸，人多的时候发一圈就没了，一天吸的多的话，两包烟都不够，一百块钱打火机咔哒一声就没了，至少折腾这点东西比吸烟强吧？",
          "en": "Having an interest in consuming at least shows that you still have a desire to try things, although whether you want to continue trying after you buy it is another matter. If you don't even have the desire to consume, then what other happiness do you have besides eating and drinking... So my idea is, within your spending ability, buy what you should buy, spend what you should spend, even if you lose a few hundred yuan, the fun of trying things will be complete. I don't smoke, the biggest shock when I went home for the New Year was that my relatives were smoking, buying cigarettes at 50 or 65 yuan a pack for the New Year. When there are many people, a pack is gone after handing it around. If they smoke a lot in a day, two packs are not enough. A hundred-yuan lighter clicks and it's gone. At least trying these things is better than smoking, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也有这种烦恼，就是会享受买东西前研究这东西的过程和期待东西到手，而真正到手后，这种快乐立马就消失了。就像搏击俱乐部中的男主一开始沉迷购买家具一样。",
          "en": "I have this kind of trouble too; I enjoy the process of researching things before buying them and anticipating getting them, but as soon as I get them, this joy disappears immediately. It's like the protagonist in Fight Club who was initially addicted to buying furniture."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gwkoooo 其实就是多巴胺的原因，多巴胺会促使人产生“想要”的感觉，也就是期待。等物品真正到后，多巴胺消退，“快乐”的感觉就没有了。能够让人产生幸福的感觉靠的不是多巴胺，而是内啡肽。一般会在运动中，或跟人亲密接触比如拥抱中产生。",
          "en": "@gwkoooo Actually, it's because of dopamine; dopamine makes people feel \"wanting\", which is expectation. When the item actually arrives, dopamine fades, and the feeling of \"happiness\" is gone. The feeling of happiness comes not from dopamine, but from endorphins. Generally, endorphins are produced during exercise, or in intimate contact with people like hugging."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "手机、平板、笔记本、耳机、充电头、数据线、无线充电、鼠标、键盘、路由器、电视盒子、switch 、ps5 、显示器、支架、转接头、nas 、软路由、插线板、鼠标垫、屏幕灯、回音壁、吹风机、剃须刀、手电、折叠刀、帐篷、天幕、折叠桌椅、露营灯。。。。。 无穷无尽",
          "en": "Phones, tablets, laptops, headphones, charging heads, data cables, wireless charging, mice, keyboards, routers, TV boxes, switch, ps5, monitors, brackets, adapters, nas, soft routers, power strips, mouse pads, screen lights, soundbars, hair dryers, razors, flashlights, folding knives, tents, awnings, folding tables and chairs, camping lights..... Endless"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“理想情况下，消费者立刻得到满足——消费应该立刻带来满足感，没有时延，不需要旷日持久的技能学习和准备工作；而一旦消费行为完成，这种满足感就应该尽可能快地消失。如果消费者无法对任何目标保持长期关注和欲望，如果他们没有耐心、焦躁、冲动，尤其是容易激动，又同样容易失去兴趣，“即时满足”就达到了最佳效果。”“本来是市场选择了他们，并把他们培养成消费者，剥夺了他们不受诱惑的自由，但每次来到市场，消费者都觉得自己在掌控一切。他们可以评判、评论和选择，他们可以拒绝无限选择中的任何一个——除了“必须作出选择”之外。”摘录来自《工作、消费主义和新穷人》",
          "en": "\"Ideally, consumers get instant gratification — consumption should bring satisfaction immediately, with no delay, and without the need for lengthy skill learning and preparation work; and once the consumption behavior is completed, this sense of satisfaction should disappear as quickly as possible. If consumers cannot maintain long-term focus and desire for any goal, if they are impatient, anxious, impulsive, especially easily excited, and equally easy to lose interest, \"instant gratification\" achieves the best results.\" \"Originally, the market chose them and cultivated them into consumers, depriving them of the freedom not to be tempted, but every time they come to the market, consumers feel that they are in control of everything. They can judge, comment, and choose, they can refuse any of the infinite choices—except for \"must make a choice.\"\" Excerpt from \"Work, Consumerism, and the New Poor\""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近有在看关于 FIRE 的书《 Early Retirement Extreme 》，里面有些观点还是值得仔细思考的：* 消费已经取代了创造力和技能，购物成了一种自我实现的方式，购物本身成为了目的，而不是达成目的的手段。* 具有讽刺意味的是，买买买常常被用作辛勤工作“应得”的报酬。工作是苦差事，让你感到痛苦，为了减轻工作，你把挣来的钱花在了一些可能没什么用的小东西上面，而为此你需要去做更多的工作，让这份痛苦持续下去。当然这本书站在一个很极端的角度对消费主义进行批判，里面一些观点也是仁者见仁。针对楼主的问题，对我来说，相比于买一些小东西来给自己带来快乐，而在几年后的某一天发现自己花了不少的钱在房子里买了一堆用不上的东西，我更愿意把钱存起来出去和父母朋友出去旅游，或者买一些大件物品，学习一项技能之类的。",
          "en": "I've recently been reading the book about FIRE, \"Early Retirement Extreme\", and some of the views in it are worth careful consideration: * Consumption has replaced creativity and skills, and shopping has become a way of self-realization. Shopping itself has become the goal, rather than a means to achieve the goal. * Ironically, shopping is often used as the \"earned\" reward for hard work. Work is a drudgery that makes you feel pain, and to alleviate the work, you spend the money you earn on some small things that may not be of much use, and for this you need to do more work, so that this pain continues. Of course, this book takes a very extreme angle to criticize consumerism, and some of the views in it are a matter of opinion. For me, compared to buying some small things to bring myself happiness, and then finding out one day several years later that I have spent a lot of money on a pile of useless things in the house, I would rather save the money and go traveling with my parents and friends, or buy some large items, learn a skill, and so on."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "钓鱼, 洗脚啥的, 可以转移你的欲望, 缺点是花钱不见得少",
          "en": "Fishing, washing feet, etc., can divert your desires. The downside is that it doesn't necessarily cost less money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都知道健康饮食非常有必要，但你见谁吃一年光吃素菜了呢，期间一顿肯德基、麦当劳、火锅、烤肉的不吃点呢。生活嘛，对不对，平衡着来，开心着整。",
          "en": "Everyone knows that a healthy diet is very necessary, but have you seen anyone eat only vegetarian food for a year? Wouldn't you eat some KFC, McDonald's, hot pot, or barbecue in between? Life is like that, right? It's all about balance, and enjoying the process."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买东西怎么辨别伪需求探寻本质：买这个目的是什么?使用现有方案：现有方案满足？满足不了的话，痛点在哪？判断消费主义下的不必要需求[^1]：把这个换成钱，要钱还是这个东西？——选择要钱就是伪需求克制冲动消费[^4]：过两天再看，还想不想要？——不想就是伪需求，想要就延迟满足[^5]",
          "en": "How to identify false needs when buying things and explore the essence: what is the purpose of buying this? Existing solutions: are existing solutions satisfactory? If not, what's the pain point? Determining unnecessary needs under consumerism[^1]: Replace this with money, do you want the money or this thing?——Choosing the money is a false need. Restrain impulsive consumption[^4]: Look at it again in a couple of days, do you still want it? ——If you don't want it, it's a false need; if you want it, delay gratification[^5]"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "春节后初三回到深圳，对于自己的轿车不太满意， 随机去看 SUV ，头天看 A 车 第二天看 B 车交定金，第三天就把轿车卖了，抑制什么？ 人生短短几个秋，开开心心的，想干啥就干啥！",
          "en": "I returned to Shenzhen on the third day of the Lunar New Year, and was not very satisfied with my sedan. I randomly went to look at SUVs. The first day I looked at car A, the second day car B, paid a deposit, and on the third day I sold my sedan. What to restrain? Life is only a few short autumns, be happy and do what you want!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Yugr CH 陈子平的轴承快开折刀，M390 粉末钢+钛合金手柄，主打一个耐用。用了好几年从来没磨过，刀口依旧锋利。现在好像买不到了，而且很多假的 m390 。",
          "en": "@Yugr CH Chen Ziping's bearing quick-opening folding knife, M390 powder steel + titanium alloy handle, focuses on durability. I've used it for many years and have never sharpened it; the blade is still sharp. It seems like you can't buy it now, and there are many fake M390 knives."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把钱打我",
          "en": "Give me the money"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开个玩笑，主要生活里没啥让你付出精力的东西了，就比如我想去报个班练习唱歌，一想又得找地、去社交、也不知道靠不靠谱，索性还是躺着吧",
          "en": "Just kidding. The main thing is that there's nothing in life that requires you to expend energy. For example, I want to sign up for a class to practice singing, but when I think about it, I have to find a place, socialize, and I don't know if it's reliable, so I might as well lie down."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买房了吗？房贷还剩多少?",
          "en": "Have you bought a house? How much mortgage is left?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多谢！",
          "en": "Thank you!"
        }
      ],
      "type": "replies"
    }
  ]
}