{
  "id": 1016391,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大龄失业如何自救",
          "en": "How can older unemployed people save themselves"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "现状\r\n1. 大龄，年前被裁，拿了 N+1\r\n2. 之前互相好感，联系频繁的相亲对象知道被裁后。慢慢变得冷淡，最后彻底没了联系\r\n3. 年前自己旅游了一圈，旅途很美，一个人旅游很孤单。拍了不少美丽的照片，确不知道分享给谁\r\n4. 和家人过了一个无忧无虑的年，现在回深圳，开始复习八股文\r\n5. 没房没车，感觉脱单挺难\r\n6. 计划学英语，尽可能去外企\r\n7. 回顾毕业到现在，10 年了，一手牌打得稀烂\r\n8. 现在是早上 8 点左右，结束了紊乱的生物钟，实现早起，自律早起是失业自救的第一件事\r\n9. 发完这条我要去跑步了\r\n10. 广深找工作\r\n11. 有没有过来人，给个建议，如何自救？",
          "en": "Current situation\r\n1. Older, laid off before the New Year, got N+1\r\n2. The dating partner who previously showed mutual affection and contacted frequently became indifferent and eventually stopped contacting after knowing about the layoff.\r\n3. I traveled around before the New Year. The journey was beautiful, but it was lonely to travel alone. I took many beautiful photos, but I didn’t know who to share them with.\r\n4. I spent a carefree year with my family. Now I'm back in Shenzhen and starting to review the 'eight-part essays' (typical interview questions).\r\n5. No house, no car, feels difficult to find a partner\r\n6. Plan to learn English and try to work for a foreign company.\r\n7. Looking back from graduation to now, it's been 10 years, and I've played a terrible hand.\r\n8. It's around 8 am now, I've ended the disrupted biological clock and achieved getting up early. Self-discipline is the first thing to do for self-rescue after unemployment.\r\n9. I'm going to run after posting this.\r\n10. Looking for a job in Guangzhou and Shenzhen.\r\n11. Anyone been through this, can you give me some advice on how to save myself?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "1. 离开了前景不好的公司，还拿到了补偿，喜（喜临门打钱）2. 筛选了喜欢你工作胜过你的相亲对象，还不用赔偿她青春，红双喜（红双喜打钱）3. 独自旅游欣赏美景，没有糟心事，享受孤独，三喜4. 过个好年，和家人无忧无虑（说明没有健康等其他事情），四喜（四喜丸子打钱）5. 没有陷入房车两个降价大坑，单身无敌，五喜6. 重新找到方向和学习目标，六喜7. 毕业 10 年，活了 10 年，手里还有牌，七喜（七喜打钱）8. 重拾早起，健康生活，见到了 8 点钟的太阳，八喜（八喜打钱）9. 锻炼还有啥好说的，恭喜恭喜，九喜10. 广深好地段，赢过 90%人，十喜11. 加油，每个人的路都不同，需要自己慢慢走出来，看看失去的，也看看已经有的，重新出发",
          "en": "1. Left a company with poor prospects and still received compensation, joy (Xilinmen pays) 2. Filtered out dating partners who like your work more than you, and don't have to compensate for their youth, double happiness (Hongshuangxi pays) 3. Travel alone to enjoy the scenery, no worries, enjoy solitude, three joys 4. Have a good year, carefree with family (indicating no other health issues, etc.), four joys (Sihui Wanzi pays) 5. Didn't fall into the two big price drops of houses and cars, invincible single, five joys 6. Find direction and learning goals again, six joys 7. 10 years after graduation, lived for 10 years, still have cards in hand, seven joys (Qixi pays) 8. Regain getting up early, healthy life, saw the sun at 8 o'clock, eight joys (Baxi pays) 9. What else is there to say about exercise, congratulations, congratulations, nine joys 10. Good location in Guangzhou and Shenzhen, win over 90% of people, ten joys 11. Come on, everyone's path is different, you need to slowly walk it out yourself, look at what you've lost, and also at what you already have, start again"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "10 年没房没车没老婆那你一定存了不烧钱吧，焦虑个√8 啊",
          "en": "10 years without a house, a car, or a wife, you must have saved money and not spent it, why are you so anxious?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@murmur 一句话伤了人家 4 次，老哥你是懂聊天的/dog",
          "en": "@murmur You hurt someone 4 times in one sentence, brother, you know how to chat /dog"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我现在工作七年不到，回想一下如果没房没车没老婆的话存个小 200w 起码 150w 应该是没啥问题，回家随便找点事躺平比现在苦哈哈的还房贷养娃看着房子跌跌不休不知道要舒服到哪里去",
          "en": "I've been working for less than seven years. Looking back, if I didn't have a house, a car, or a wife, I should have saved at least 1.5 million to 2 million (RMB). It would be much more comfortable to go home and do something casually than to pay a mortgage and raise children while watching house prices fall."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@murmur #1 一句话，让老哥扎心了 4 次",
          "en": "@murmur #1 One sentence made the brother's heart ache 4 times."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "毕业 10 年再怎么也吃到红利，为啥没房没车",
          "en": "After 10 years of graduation, you should have benefited from the dividends, why no house or car?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "tmd 这还焦虑 工作 10 年 吃了 10 年红利 没房没车没老婆这 tmd 的存款直接躺平都可以了 还焦虑 还是吃得太饱了，就是给惯的！",
          "en": "Damn, and you're still anxious? Worked for 10 years, benefited from the dividends for 10 years, no house, no car, no wife, with that kind of savings you could just lie down. And you're still anxious? You must be too full, spoiled!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@apie #51 老哥情绪价值拉满",
          "en": "@apie #51 Brother, the emotional value is maxed out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红利也不是每个人都能吃到，在红利期间，没多跳，就吃不到。还有买房，没有格局的也没吃到。每个人都以为时间倒退多少年，就能吃尽那个时代的红利，但有没有想过，你是在知道结果的时候去回看的，不是身处在那个时代的人。如果你和马云马化腾一个时代，你就能和他们达到一样的成就么？",
          "en": "Not everyone can benefit from the dividends. If you don't switch jobs frequently during a period of dividends, you won't get them. Also, regarding buying a house, those without vision didn't get them either. Everyone thinks that if time goes back a few years, they can enjoy all the dividends of that era, but have you ever thought that you are looking back when you already know the results, and not the people who were in that era. If you were in the same era as Jack Ma and Pony Ma, could you achieve the same achievements as them?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jiaomeng 光标移动到我这条评论的右上角的楼层数位置左移 2 格感谢我",
          "en": "@jiaomeng Move the cursor to the top right corner of my comment, on the floor number, and move two spaces to the left to thank me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "世界这么大我想去看看，换个环境比如国外转转",
          "en": "The world is so big, I want to see it, change the environment, for example, go abroad"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "得三十几了吧 这个年纪被裁员的确是很头大 不过你没有老婆孩子还算压力小的。",
          "en": "You must be in your thirties. It is indeed a headache to be laid off at this age, but you don't have a wife or children, so the pressure is relatively small."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自律早起跑步是一件好事，接下来给自己找一个周边方便的图书馆或者自习室吧，在图书馆工作比较有沉浸感，工作一段时间你就能找到方向的，别焦虑就对了。",
          "en": "Getting up early and running is a good thing. Next, find a library or study room nearby. Working in a library is more immersive, and you will be able to find direction after working for a while. Don't be anxious, that's right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别待在家里",
          "en": "Don't stay at home"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作 10 年又没家庭肯定有些积蓄了, 不用太焦虑, 你这反而是压力最小的生活模式.主要看你长期规划是不是要成家要小孩了, 不同人生选择对应的压力级别差别很大. 如果要那是要抓紧赚钱搞房搞车了, 努努力进个大厂, 外企除非顶尖的否则赚不到钱. 如果不要成家那就无所谓了, 看看新科技领域赌几年可能还更好",
          "en": "After 10 years of work and no family, you must have some savings. Don't be too anxious, this is the life model with the least pressure. It mainly depends on your long-term plan, whether you want to get married and have children. The pressure level corresponding to different life choices is very different. If you want to, you need to work hard to make money, get a house and a car. Work hard to get into a big company. Unless it's top-notch, foreign companies won't make money. If you don't want to get married, it doesn't matter. See the new technology field and gamble for a few years, it might be even better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没房没车不就没贷款么，没老婆孩子，你想做什么事情都可以去做，没有什么顾虑可以阻挡你，有什么好焦虑的。",
          "en": "No house and no car means no loan, no wife and no children, you can do whatever you want, there are no worries that can stop you, what is there to be anxious about?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@apie  有此十喜，欲找工作有何难哉",
          "en": "@apie With these ten joys, what could be difficult about finding a job?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@d29107d hello V: UnV0c2EzZnNhYmg=",
          "en": "@d29107d hello V: UnV0c2EzZnNhYmg="
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "49 的路过，有老婆孩子，房子车子公司关闭本地分公司快半年了一直在家里躺着春节前公司电话让节后去公司总部上班不想跑外地，就离职了打算过完正月开始找工作挑战比你大得多平常心看，如果真要淘汰我们，接受就行了",
          "en": "Passing by at 49, I have a wife and children, a house, a car, and the company closed the local branch for almost half a year. I've been lying at home. Before the Spring Festival, the company's phone call asked to go to the headquarters to work after the holiday. I didn't want to go to other places, so I resigned and plan to start looking for a job after the first month. The challenge is much bigger than yours. Look at it with a normal heart. If we are really going to be eliminated, we will accept it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这个哪有压力啊 兄弟，别自找烦恼了。",
          "en": "You don't have any pressure, brother, don't look for trouble."
        }
      ],
      "type": "replies"
    }
  ]
}