{
  "id": 1014826,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "从十八线到新一线，最后谈薪被压了",
          "en": "From an 18th-tier city to a new first-tier city, the salary was finally suppressed during negotiations"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "苦逼行业跳到新兴行业（都是制造业）\r\n\r\n个人背景：二本码农工，快 27 了，gap 了半年多\r\n\r\n前：苦逼制造业，算年收入税后 11 W ，五险一金很低（市最低工资标准基数\r\n\r\n后：新能源相关，算年收入税前 19.5 W ，五险一金基数也不算高但也翻了有 2 倍（之前是有多低\r\n\r\n薪资是流程中被卡了，砍了 16% 的 base （本来 hr 和技术面后给的更高的\r\n\r\n蠢比的是我：\r\n 1. 报期望薪资太保守，结合原来十八线工作的低基础  \r\n 2. 早早透露没几个面试的致命信息\r\n\r\n现在每月扣完税和房租应该剩万把块出头了，但要涨薪两年才能回到本可拿到的起点还是挺不舒服的。\r\n\r\n应届生的起点真的很重要啊，我愿望就是之后能练好口语进个外企制造业了，互联网高薪恐怕是这辈子沾不到边了吧，面试筛简历对行业和工作经历真的很苛刻。",
          "en": "From a miserable industry to an emerging industry (both manufacturing)\n\nPersonal background: Second-tier university code farmer, almost 27 years old, gap for more than half a year\n\nBefore: Miserable manufacturing, annual income after tax is 110,000, five insurances and one housing fund are very low (city's minimum wage standard)\n\nAfter: New energy related, pre-tax annual income is 195,000, the base of five insurances and one housing fund is not high, but it has also doubled (how low it was before\n\nThe salary was held up in the process and the base was cut by 16% (the HR and the technical interview originally gave a higher offer)\n\nThe stupid thing I did:\n 1. The expected salary was too conservative, combined with the low base of the original 18th-tier city work\n 2. Revealed the fatal information of not having many interviews early on\n\nNow, after deducting tax and rent every month, I should have just over 10,000 left, but it's still quite uncomfortable to have to increase my salary for two years to return to the starting point I could have reached.\n\nThe starting point for fresh graduates is really important. My wish is to improve my oral English and enter a foreign manufacturing company, and I'm afraid I won't be able to get the high salary of the Internet industry in this lifetime. The interview screening of resumes is really strict on industry and work experience."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "流程中还能砍",
          "en": "They can still cut it during the process"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这是 15k 多吧",
          "en": "This is over 15k, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跟我差不多，不敢要高的，新一线不就是二线吗，你这个 base 算还好吧（可能我的要求不高）",
          "en": "Similar to me, I dare not ask for a higher salary. Isn't a new first-tier city the same as a second-tier city? Your base is not bad (maybe my requirements are not high)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@haichao0808 砍之前是的",
          "en": "@haichao0808 It was before the cut"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@daisyliudi 听说公司在翻倍扩招，领导想降低用人成本喽",
          "en": "@daisyliudi I heard that the company is doubling its recruitment, and the leader wants to reduce the cost of employing people"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果不考虑年终奖怕是到手更低，现在很多公司喜欢裁没转正的，所以你算只能算到手，不能算 pkg",
          "en": "If you don't consider the year-end bonus, it's probably even lower in hand. Many companies now like to lay off those who haven't been officially employed yet, so you can only count what you get in hand and not the package"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@murmur 说是 15 薪，不算年终奖确实还得扣个 3 、4w",
          "en": "@murmur It says 15 months’ salary, not counting the year-end bonus, it does have to deduct 30,000 to 40,000"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那也是涨了，而且幅度不小。新的一年，恭喜发财。",
          "en": "That's still a raise, and the increase is not small. Happy new year, congratulations on getting rich."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "继续找找呗 既然不满意 搞新能源的公司大把。下次记得多要点",
          "en": "Keep looking. Since you are not satisfied, there are plenty of companies in the new energy field. Remember to ask for more next time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@guji 感觉现在这种十几薪都不可信了，我去年来当前这家的时候，HR 说好的保底 14 ，多的可能会有 16 薪，结果今年年终一分没有，感觉以后也不会有了，可以的话还是 base 高一点的好一些。",
          "en": "@guji I feel that this kind of over ten-month salary is not credible now. When I came to the current company last year, the HR said the guaranteed base was 14 months’ salary, and there might be 16 months’ salary. As a result, I didn't get any year-end bonus this year, and I feel that I won't get any in the future. If possible, it's better to have a higher base."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "公司会限制涨幅的 一般是 30% 你的第一份工作 base 太低了",
          "en": "Companies will limit the increase, usually 30%. Your first job's base was too low"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加油呗 下一把就是进特斯拉",
          "en": "Come on, the next step is to join Tesla"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "涨辐不小，可以的",
          "en": "The increase is considerable, it's okay"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年终奖写进合同了吗？没有的话，基于还砍薪的情况，估计年终奖也很玄，所以继续面面一线城市的呗，在一线找个 15k 的问题不大",
          "en": "Did you write the year-end bonus in the contract? If not, based on the fact that the salary was cut, I guess the year-end bonus is also uncertain, so continue to interview in first-tier cities, it's not a big problem to find a 15k job in a first-tier city"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "考虑一下劳动力价格，看下当地行情，再算算过去之后是否真的涨了，别到时候入职之后心里还是无法接受，没办法长期留下",
          "en": "Consider the labor price, look at the local market, and then calculate whether you've really got a raise after you go. Don't be unable to accept it in your heart after you join, and you can't stay for a long time"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "制造业对成本很敏感的，报高了就没你啥事了",
          "en": "Manufacturing is very sensitive to costs, if you quote a high price, there will be no job for you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同意楼上, 你的期望薪资其实可能也是你的竞争力",
          "en": "Agree with the above, your expected salary may actually be your competitiveness"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zw1one 主要是 gap 有点长了，因为保密身上还套了枷锁，在小城市工作三年对技术也不是特别自信，这份 offer 年后就要入职了的",
          "en": "@zw1one The main reason is that the gap is a bit long, because of confidentiality, there is still a shackle on my body, and I am not particularly confident in my technology after working in a small city for three years. This offer will be joining after the New Year"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@guji 还需要注意的是你 15 薪没写进合同那就不叫 15 薪，现在企业狗的很，你表现的稍微差点他们就能扣你年终奖",
          "en": "@guji Also, you need to pay attention to the fact that if the 15 months’ salary is not written in the contract then it isn't called 15 months’ salary. Now the companies are very cunning, if you perform a little bit worse, they can deduct your year-end bonus"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ooxx2123 公司方可太知道 base 的含金量了，写进合同的东西都是实打实的，千方百计摸候选人的底然后压 base ，打工人还是要多练谈判技巧，打算以后工作空闲没事就找找面试练练了，唉，太难了",
          "en": "@ooxx2123 The company knows too well the value of the base, and what's written in the contract is real. They try every means to probe the candidate's bottom line and then suppress the base. Workers still need to practice negotiation skills, and I plan to find some interviews to practice when I'm free, alas, it’s too difficult"
        }
      ],
      "type": "replies"
    }
  ]
}