{
  "id": 1019300,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "写一句话在这里，下一个 2 月 29 号来看（2028.02.29）",
          "en": "Write a sentence here and check back on the next February 29th (2028.02.29)"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "原始帖子： https://www.v2ex.com/t/648548\r\n\r\n四年前发了上面的旧帖，四年前约定今天不见不散",
          "en": "Original post: https://www.v2ex.com/t/648548\r\n\r\nI posted the above old post four years ago, and we agreed to meet today four years ago."
        },
        {
          "zh": "四年前，V 友设定了一些目标或期许，希望在未来几年内实现，不知道四年前 V 友对自己的期许是否已经达成，大家畅谈一下自己这四年的想法和经历",
          "en": "Four years ago, V2EX users set some goals or expectations, hoping to achieve them in the next few years. I don't know if the expectations that V2EX users had for themselves four years ago have been achieved. Let's talk about our thoughts and experiences in the past four years."
        },
        {
          "zh": "顺便展望一下未来四年的目标，给自己一段话，2028 年 2 月 29 日时候我们不见不散",
          "en": "By the way, let's look forward to the goals for the next four years and give ourselves a paragraph. We will meet again on February 29, 2028."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "家人健康，工作顺利，国泰民安，世界和平，他已退休。",
          "en": "Good health for the family, smooth work, prosperity of the country and peace for the people, world peace, and he has retired."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开银趴",
          "en": "Organize an orgy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那个时候立的目标是肉翻，我也是不满意现状但游不过没加盖太平洋的一员，但是怎么具体肉翻执行也没有想清楚，20 年初那个时候正经上班的我怎么也想不到 24 年的今天我确实是肉翻出来读书了。",
          "en": "The goal I set at that time was to 'roufan' (emigrate). I am also dissatisfied with the status quo but cannot swim across the unlidded Pacific Ocean. I didn't figure out how to execute 'roufan' specifically. At the beginning of 2020, when I was working a regular job, I couldn't have imagined that today in 2024, I would actually be 'roufan' and studying abroad."
        },
        {
          "zh": "甚至现在都没有讲肉翻这个词了，大家都说润。",
          "en": "Now even the word 'roufan' is rarely used, everyone says 'run'."
        },
        {
          "zh": "可偏偏就是这样的机会出现了，22 年十月底前女友出国读书，我一不做二不休索性直接辞职来陪读，那是我第一次出国，顺手推舟我被前女友 push 也去申请一个 Master 读一读，以前想过好多次留学，但总是被怎么用英语跟同学老师交流，怎么用英语点菜这种事情吓退，但后来一切似乎比想象中简单。",
          "en": "But it was just such an opportunity that emerged. At the end of October 2022, my ex-girlfriend went abroad to study. I decided to quit my job to accompany her. That was my first time abroad. Following the trend, my ex-girlfriend pushed me to apply for a Master's degree. I had thought about studying abroad many times before, but I was always scared off by how to communicate with classmates and teachers in English, and how to order food in English. But later, everything seemed simpler than I imagined."
        },
        {
          "zh": "下一个四年的目标是我希望具体一点，找一份澳洲的远程工作，往返于中国与澳洲之间，相近的时区，离中国也没有很远，不切断自己生长了二十多年土地的联系，也不想浪费这个水硕的头衔。",
          "en": "My goal for the next four years is to be more specific: find a remote job in Australia, travel back and forth between China and Australia, with similar time zones, not too far from China, without cutting off the connection with the land where I grew up for more than 20 years, and not waste this 'water Master' title."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "20 年 2 月 29 日，没看到 OP 的上一个帖子。",
          "en": "February 29, 2020, I didn't see OP's previous post."
        },
        {
          "zh": "翻了翻 nas 的照片，那天买了一台无人机，拍了第一张航拍图。",
          "en": "I flipped through the photos on my NAS and found that I bought a drone that day and took the first aerial photo."
        },
        {
          "zh": "4 年过去了，那台大疆也早已飞入湖中，也拥有了新的无人机，但是拍摄技术毫无长进。",
          "en": "Four years have passed, and that DJI drone has long flown into the lake. I also have a new drone, but my shooting skills have not improved at all."
        },
        {
          "zh": "那个阶段也许下了努力学习英语的目标，到现在也没能坚持下来。",
          "en": "During that period, I set a goal to work hard to learn English, but I haven't been able to stick to it until now."
        },
        {
          "zh": "同样的，还买了台电钢，同样没能坚持。",
          "en": "Similarly, I also bought an electric piano, but also failed to persist."
        },
        {
          "zh": "那会儿，疫情才刚开始，定了一台 model3 ，到现在也已经跑了 14w KM ，顺便说一句，Tesla 真好开！",
          "en": "At that time, the epidemic had just begun, and I ordered a Model 3, which has now run 140,000 KM. By the way, Tesla is really easy to drive!"
        },
        {
          "zh": "现在的我，正在准备自己的婚礼，女友很好，单纯善良不做作，希望能一直这样下去。",
          "en": "Now, I am preparing for my wedding. My girlfriend is very good, simple, kind and unpretentious. I hope it will continue like this."
        },
        {
          "zh": "现在的工作，新入行一个，目前有点起色，加油。",
          "en": "For my current job, I'm new to it, and it's starting to pick up a bit. Keep it up."
        },
        {
          "zh": "4 年后，希望，有一个健康宝宝，已经开始上幼儿园了。",
          "en": "In 4 years, I hope to have a healthy baby who has already started kindergarten."
        },
        {
          "zh": "希望，爸妈健康平安，安享退休生活。",
          "en": "I hope my parents are healthy and safe, and enjoy their retirement life."
        },
        {
          "zh": "希望，那时候已经把老宅建起来了。",
          "en": "I hope that by then, I will have built the old house."
        },
        {
          "zh": "希望，我特么已经没有房贷了！！！",
          "en": "I hope I don't have a mortgage anymore!!!"
        },
        {
          "zh": "希望，世界和平！",
          "en": "I hope for world peace!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实我都不知道写什么我也没有什么目标孤零零的一个人。。。",
          "en": "Actually, I don't even know what to write. I don't have any goals and I'm all alone..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚看到 op@我了，没想到 4 年就过去了。",
          "en": "Just saw that OP mentioned me. I didn't expect 4 years to have passed."
        },
        {
          "zh": "下一个 2 月 29 不再北漂了，回归老家。",
          "en": "Next February 29th, I will no longer be in Beijing, but will return to my hometown."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "谢邀，刚要睡觉直接给我整失眠了。",
          "en": "Thanks for the invitation, I was about to go to sleep but it made me sleepless."
        },
        {
          "zh": "四年前自己无意开的一枪终于贯穿了自己的胸膛，来不及反应便恍若隔世。",
          "en": "Four years ago, a shot that I fired unintentionally finally pierced my chest, and before I could react, it was like a lifetime away."
        },
        {
          "zh": "还是希望自己和家人身体健康，继续精进技术，见见更广阔的世界上岸，尽管已经不存在什么真正的岸了，但还是要努力脱单？",
          "en": "I still hope that myself and my family are healthy, continue to improve our skills, and see more of the world, although there is no real shore anymore, but should I still work hard to find a partner?"
        },
        {
          "zh": "那种事怎样都好，最低优先级热枕，热枕，还是热枕，路还很长，灵魂可别枯死等到老了再埋愿四年后的你纯粹又热烈。",
          "en": "That kind of thing is fine, lowest priority. Enthusiasm, enthusiasm, still enthusiasm. The road is still long, don't let the soul wither and die and be buried when you are old. May you be pure and passionate four years from now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2024.02.29 比特币$64000",
          "en": "2024.02.29 Bitcoin $64000"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "希望我能变的优秀、自律",
          "en": "I hope I can become excellent and self-disciplined."
        },
        {
          "zh": "希望经济好转，民生发展",
          "en": "I hope the economy improves and people's livelihood develops."
        },
        {
          "zh": "希望国家富强、民主自由",
          "en": "I hope the country is prosperous, democratic and free."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "20 年到现在发生的事情按照时间线.",
          "en": "Events that have happened from 2020 to now in chronological order."
        },
        {
          "zh": "20 培训 PHP 自学转行 JAVA报考自考本科结婚 爸爸确诊肝癌生娃  弟弟考上大学爸爸去世  行情太差 工作也只找得到外包。",
          "en": "20 Training in PHP, self-taught to switch to JAVA, enrolled in self-study undergraduate program, got married, Dad was diagnosed with liver cancer, had a baby, younger brother was admitted to university, Dad passed away, the market is too bad and I can only find outsourcing jobs."
        },
        {
          "zh": "---24 年以后希望工作稳定，职业寿命延长找到副业，能够支撑家庭妈妈身体健康弟弟以后顺利考上研究生家庭幸福，还清房贷车贷儿子健康成长",
          "en": "---After 2024, I hope to have a stable job, extend my career life, find a side job that can support the family, my mother is healthy, my younger brother can successfully pass the postgraduate entrance examination in the future, family happiness, pay off the mortgage and car loan, and my son grows up healthily."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "[好感动] 刚刚收到了楼主在之前帖子的 @，四年前的今天，我处于大四下半学期，疫情肆虐人心惶惶。",
          "en": "[So touched] I just received the @ from the host in the previous post. Four years ago today, I was in the second semester of my senior year, and people were panicking because of the epidemic."
        },
        {
          "zh": "那时候我在楼主的帖子里只写下了两个字“发财”，其实就是随手的网络回帖，没想到楼主真的在四年后兑现了承诺，那这四年我过的怎么样呢？",
          "en": "At that time, I only wrote two words in the host's post: 'Get rich'. It was actually just a casual online reply. I didn't expect the host to actually fulfill the promise four years later. So how have I been doing in these four years?"
        },
        {
          "zh": "我觉得事情没有朝着我的预期发展（我当时觉得现在的我要当上小管理层了），但也给了我新的生活。",
          "en": "I feel that things haven't developed as I expected (I thought I would be a junior manager now), but it has also given me a new life."
        },
        {
          "zh": "我确实能够过上不错的生活，经济独立，能靠自己吃得起贵价的餐厅，认识了不少的朋友，还有了一台新的电车。",
          "en": "I can indeed live a good life, be financially independent, be able to afford expensive restaurants on my own, have made a lot of friends, and have a new electric car."
        },
        {
          "zh": "我期望的生活没有如期望一般发展，却也觉得现在 not bad ，有喜有忧也有对生活的期望吧。",
          "en": "The life I expected hasn't developed as I expected, but I also feel that it's not bad now. There are joys and sorrows, and there are expectations for life."
        },
        {
          "zh": "下一个四年，我希望我变得更加成熟，希望完成结婚这件事情，不希望自己背上过重的财务负担也没有期望发大财，希望自己能有自己的生意，能够给自己发得起工资，我本质上还是一个喜欢生意的人啊。",
          "en": "In the next four years, I hope I will become more mature, I hope to complete the marriage, I don't want to bear too heavy a financial burden, and I don't expect to get rich. I hope I can have my own business and be able to pay myself a salary. I am essentially a person who likes business."
        },
        {
          "zh": "也祝楼主一切顺遂，下一个四年见。",
          "en": "I also wish the host all the best and see you in the next four years."
        },
        {
          "zh": "也许生活不会把我们带到我们本期望的地方，但希望我们能收获一片也还不错的风景。",
          "en": "Maybe life won't take us to the place we originally expected, but I hope we can reap a pretty good scenery."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "全仓了十个 eth ，希望将来买得起杭州的房子",
          "en": "Have invested all my money in ten ETH, hoping to be able to afford a house in Hangzhou in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这周的疯狂星期四将是 28 年一遇",
          "en": "This week's Crazy Thursday will be a once-in-28-years event."
        },
        {
          "zh": "下一个在 2 月 29 号的星期四要等到 2052 年",
          "en": "The next Thursday on February 29th will be in 2052."
        },
        {
          "zh": "有没有好心人在 28 年一遇的疯狂星期四 v 我 50[:/doge]",
          "en": "Are there any kind people who can give me 50 for this once-in-28-years Crazy Thursday[:/doge]"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 全家身体健康",
          "en": "1. Good health for the whole family."
        },
        {
          "zh": "2. 做更好的自己",
          "en": "2. Be a better version of myself."
        },
        {
          "zh": "3. 买车",
          "en": "3. Buy a car."
        },
        {
          "zh": "4. 找女朋友、结婚（？生子）",
          "en": "4. Find a girlfriend, get married (and have children?)."
        },
        {
          "zh": "5. 钢琴达到弹完整的曲子的阶段",
          "en": "5. Reach the stage of being able to play complete pieces on the piano."
        },
        {
          "zh": "6. 工作平稳",
          "en": "6. Stable job."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "希望有更多人可以润出去",
          "en": "Hope more people can 'run' (emigrate)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "时间过得真的很快，四年前，我还在学校，整天散漫无知，对未来没有想过要做些什么，现在想想那段时间真好啊，没课的时候，就和小伙伴打打闹闹，累了甚至可以床上摊一天，有大把的时间去学习一些新东西；以前老觉得学习累，学习苦，高中的时候没日没夜的学，虽然高考结果一般，但我很知足，我意识到自己就是一个普通人，不是动漫里的男主角，但我是自己的猪脚，自洽就可以了；大四的时候考研，虽然也没考上，不过我也很努力的去准备了；现在我依然很怀念那段时光，希望下一个四年，工作上✨：希望可以找到一个自己喜欢的工作，并且为之不断努力发展；学习上✨：希望学习巩固相关的知识，英语口语可以流利地对话，看油管无字幕没有任何压力；生活上 ：希望她还能留在我身边；其他愿景 ：希望身体不会出问题，腹肌胸肌重新练回来，保持住身材。",
          "en": "Time really flies. Four years ago, I was still in school, scattered and ignorant all day long, and didn't think about what to do in the future. Thinking about that time now, it was really good. When I didn't have class, I would play around with my friends, and when I was tired, I could even lie in bed all day, with plenty of time to learn new things. I used to feel that learning was tiring and difficult. I studied day and night in high school. Although the results of the college entrance examination were average, I was very satisfied. I realized that I am just an ordinary person, not the male protagonist in anime, but I am the protagonist of my own story, and self-consistency is enough. When I was a senior in college, I took the postgraduate entrance examination, although I didn't pass it, but I also worked hard to prepare for it. Now I still miss that time very much. I hope in the next four years, in terms of work ✨: I hope I can find a job I like and work hard to develop it continuously; in terms of learning ✨: I hope to learn and consolidate related knowledge, be able to have fluent conversations in spoken English, and watch YouTube without subtitles without any pressure; in life: I hope she can still stay by my side; other visions: I hope there will be no problems with my health, I will regain my abdominal muscles and chest muscles, and maintain my figure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也翻了一下相册，发现四年前的 2 月 24 号轮胎被扎，上周六 2 月 24 号轮胎也被扎。",
          "en": "I also flipped through my album and found that the tire was punctured on February 24th four years ago, and the tire was also punctured last Saturday, February 24th."
        },
        {
          "zh": "希望下一个四年轮胎别再被扎了",
          "en": "I hope the tires won't be punctured again in the next four years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2024 年发生了好多事",
          "en": "A lot of things happened in 2024."
        },
        {
          "zh": "1 、宝宝出生了。希望 4 年后健康快乐的长大；2 、妈妈做了肺手术。",
          "en": "1. The baby was born. I hope they grow up healthy and happy in 4 years; 2. Mom had lung surgery."
        },
        {
          "zh": "希望 4 年后妈妈身体健康的陪伴着我们；3 、希望 4 年后能换一辆好车。",
          "en": "I hope that in 4 years, Mom will be healthy and accompany us; 3. I hope to be able to change to a better car in 4 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "BTC 超过 30 万刀",
          "en": "BTC exceeds $300,000"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "0 活着",
          "en": "0. Be alive."
        },
        {
          "zh": "1 家人身体健康",
          "en": "1. Family members are healthy."
        },
        {
          "zh": "2 有时间多陪陪父母",
          "en": "2. Have more time to spend with parents."
        },
        {
          "zh": "3 工作顺利，找到一个合适的副业",
          "en": "3. Work smoothly and find a suitable side job."
        },
        {
          "zh": "4 找到对象",
          "en": "4. Find a partner."
        },
        {
          "zh": "5 热爱生活",
          "en": "5. Love life."
        },
        {
          "zh": "6 买车",
          "en": "6. Buy a car."
        },
        {
          "zh": "7 坚持学英语",
          "en": "7. Persist in learning English."
        }
      ],
      "type": "replies"
    }
  ]
}