{
  "id": 1014980,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "双休也能算福利？",
          "en": "Is a two-day weekend considered a benefit?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "公司强制要求上班到除夕夜，早上我和同事在讨论这个上班时间问题，同事突然来句公司福利还不错，起码有双休，我说这个双休本来就是应该得的啊，然后同事来句法律中并没有规定一定要双休啊而且其他公司也是单休，所以我们应该感谢公司，我当场就懵逼了。聊了一会儿我以为只有她这么想后来才明白原来全公司除我之外都这么想。",
          "en": "The company forced us to work until New Year's Eve. This morning, my colleagues and I were discussing the work hours issue. A colleague suddenly said that the company's benefits were not bad, at least there were two days off. I said that this two-day weekend should have been a given. Then, the colleague said that the law does not stipulate that there must be a two-day weekend, and other companies also have one day off, so we should thank the company. I was dumbfounded on the spot. After chatting for a while, I thought only she thought this way, but later I realized that everyone in the company except me thought so."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "当烂尾楼成为常态的时候，期房按时交房都是好楼盘了",
          "en": "When unfinished buildings become the norm, timely delivery of pre-sale houses are considered good projects."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也觉得很奇葩，但是大多数人被压榨惯了，已经不知道什么是正常了，还有，很多权利是需要自己争取的，但是很多人放弃了这个权利。",
          "en": "I also think it's weird, but most people are used to being exploited and no longer know what's normal. Also, many rights need to be fought for, but many people give up this right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@XIVN1987 #18 选 A 的蠢而已",
          "en": "@XIVN1987 #18 Just stupid to choose A."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "二三线城市就业环境都这个样子, 能双休给交全额社保的就是好公司, 而且相对来说企业文化也不是太尊重员工. 所以很多人宁愿忍受高生活成本, 也不愿意离开一线城市, 工作体验是很重要的影响因素之一.",
          "en": "The employment environment in second and third-tier cities is like this. Companies that offer two days off and pay full social insurance are already good companies, and the corporate culture is not that respectful of employees. Therefore, many people would rather endure the high cost of living than leave first-tier cities, and the work experience is one of the most important influencing factors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当人们接受了单休是常态的时候，再看双休，就成了福利。殊不知，双休才应该是常态。",
          "en": "When people accept one day off as the norm, then a two-day weekend becomes a benefit. Little do they know, a two-day weekend should be the norm."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "接上一条。第三就是，一般雇员在圣诞节，仲夏节前一天，雇员公司会放假，我们外包会上班，然后就有 2 天假，我们也可以申请休假，跟雇员一样。第四，每个月有大概一天的时间拿来考证，不用上班，考证的钱公司出。第五，每年公司会送一张运动相关的卡，里面有大概 3000RMB ，可以办游泳，买自行车都行。剩下的没周 40 小时，双休，这个是法律搞定的，不在公司的福利里面。产假男女一共 480 天，男方最少休假 90 天。宝宝四岁之前，我有 480 天的父母假，上次回国用了几天了。然后还有宝宝生病可以休假，只是超过三天还是几天需要有证明了，具体几天给忘了，假太多，记不清了。最后有一点吧，这边说的都是休假，而不是请假。休假是我的权利，我不需要跟公司说我为啥请假，我想在家睡觉都行，我只要有假，就可以休，",
          "en": "Following on from the previous one. The third is that generally, employees get a day off for Christmas and the day before Midsummer's Day, while we, the outsourcing staff, have to work, and then we have 2 days off, and we can also apply for leave, just like the employees. Fourth, there is about a day each month for taking exams, without having to go to work, and the company pays for the exam fees. Fifth, every year the company gives a sports-related card with about 3000 RMB in it, which can be used for swimming or buying a bicycle. The rest is 40 hours a week, with two days off, which is regulated by law and not included in the company's benefits. Maternity leave is a total of 480 days for both men and women, with a minimum of 90 days off for the father. Before the baby is four years old, I have 480 days of parental leave, and I used a few days during my last trip back to China. Then there's also leave for the baby's illness; it's just that if it exceeds three or a few days you need a proof, and I have forgotten the exact number of days, because there are too many holidays, I can't remember. Finally, one thing to note is that what is being referred to here is vacation, not asking for leave. Taking a vacation is my right; I don't need to tell the company why I'm taking leave; I can even sleep at home, and I can take a vacation as long as I have one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能上班都算福报，这不难理解呀",
          "en": "It's not hard to understand that being able to go to work is considered a blessing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zealer8 瞎说, 这里是上海人社局官网的原文, 放在下边:\"《中华人民共和国劳动法（ 2018 修正）》（以下简称《劳动法》）第 36 条规定：“国家实行劳动者每日工作时间不超过八小时、平均每周工作时间不超过四十四小时的工时制度。”《劳动法》第 38 条的规定：“用人单位应当保证劳动者每周至少休息一日。”　 每日工作 8 小时、每周工作 40 小时的工时制度被称为标准工作制，对应的是大部分单位实行的双休日制度，每日工作 8 小时，一周工作 5 天休息 2 天。对于一些因工作需要，每周只能安排员工休息 1 天的单位，那么就需要缩短每日的工作时间，使得每周 6 天工作的时间加起来不超过 40 小时。    如果每周工作时间超过 40 个小时，超出部分属于加班，用人单位需要按法律法规规定向劳动者支付加班费。\"单休就是违法的啊, 除非付加班费.一是就业市场不好, 二是很多人默认单休也可以接受.所以刚才我回复说只有一线城市正常一点, 毕竟机会多, 不双休的工作自然就没人去了",
          "en": "@zealer8 You're talking nonsense. Here's the original text from the Shanghai Human Resources and Social Security Bureau's official website, placed below:\"Article 36 of the 'Labor Law of the People's Republic of China (2018 Revision)' (hereinafter referred to as the 'Labor Law') stipulates: 'The state implements a working hour system where workers work no more than eight hours a day and an average of no more than forty-four hours a week.' Article 38 of the 'Labor Law' stipulates: 'Employers shall ensure that workers rest at least one day a week.' The working hour system of 8 hours per day and 40 hours per week is called the standard working system, corresponding to the two-day weekend system implemented by most units, with 8 hours of work per day and 5 days of work and 2 days of rest per week. For some units that can only arrange for employees to rest for one day a week due to work requirements, it is necessary to shorten the daily working hours so that the total working hours of 6 days a week do not exceed 40 hours.   If the working hours exceed 40 hours per week, the excess portion is overtime, and the employer needs to pay overtime pay to the workers in accordance with the laws and regulations.\" One day off a week is illegal, unless overtime pay is given. First, the job market is not good, and second, many people default that one day off a week is acceptable. That's why I just replied saying that only first-tier cities are a bit more normal, since there are more opportunities, and jobs without a two-day weekend will naturally have no one to take them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SephirothD #7 你绝对想不到违法成本有多高。因员工加班被罚三千，去哪儿网：征得同意，尊重处罚https://m.mp.oeeee.com/a/BAAFRD000020220221653946.html",
          "en": "@SephirothD #7 You definitely cannot imagine how high the cost of breaking the law is: a fine of three thousand yuan for employees' overtime, Qunar.com: obtained consent, respects the penalty https://m.mp.oeeee.com/a/BAAFRD000020220221653946.html"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人跟人差别巨大，很多人天生贱骨头。",
          "en": "There are huge differences between people; many people are born with a servile nature."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "权利就是这样一步步失去的，最后变成了福利。",
          "en": "This is how rights are lost step by step, and finally become benefits."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "逐渐过渡到老板不打人也是福利",
          "en": "Gradually transitioning to the boss not hitting people is also a benefit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kaiveyoung 好奇现在大厂是不是几乎都不明文 996 了，但是如果不主动 996 就会被优化",
          "en": "@kaiveyoung I'm curious if large companies are now almost all tacitly avoiding 996, but if you don't proactively work 996, you'll be laid off."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "假如有两份工作，，其他待遇完全一样，，但 A 公司单休，，B 公司双休，，你选择哪个公司？？如果你选择 A 公司，，那说明在你心里双休不是福利如果你选择 B 公司，，那说明在你心里双休就是福利",
          "en": "If there are two jobs, with all other benefits being exactly the same, but Company A has one day off a week, and Company B has a two-day weekend, which company would you choose?? If you choose Company A, that means in your mind, a two-day weekend is not a benefit. If you choose Company B, that means in your mind, a two-day weekend is a benefit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有些公司在招人时会把双休写到 JD 中的福利那一块。在他们看来，这应该算吧。个人认为，这样的公司能不去还是不去吧",
          "en": "Some companies will include two days off in the benefits section of their job descriptions. In their view, this should count. I personally think you shouldn't go to such a company if you can avoid it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kkkbbb 权利是需要公权力的保障的。但现在这个经济形式，塔一直是默许的态度",
          "en": "@kkkbbb Rights need to be protected by public power. But in the current economic situation, the authorities have always been tacitly permissive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当你体验过 没有不说话的权利 后，不说话的权利 就成福利了。",
          "en": "When you've experienced not having the right to speak, the right to remain silent becomes a benefit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "昨天刚好有个公司跟我谈福利了，可以跟 op 说说。第一，年假 25 天，标配。第二，有 4 天的 passion 假，就是自己想干什么都行，休假在家睡觉就行。第三，还有 2 天假（名字没听懂，瑞典语），意思就是雇员（我们是外包）",
          "en": "Yesterday a company talked to me about benefits, and I can share them with the OP. First, 25 days of annual leave, standard. Second, 4 days of passion leave, which means you can do anything you want, just take a vacation and sleep at home. Third, there are also 2 days of leave (didn't understand the name, Swedish), which means employees (we are outsourced)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是呀，这是 WTO 给我们的。要不是 WTO ，现在双休都没有",
          "en": "Yes, this is what the WTO gave us. If it weren't for the WTO, we wouldn't have two days off now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "除了《劳动法》规定的不超过 44 小时之外，1995 年国务院发布《国务院关于职工工作时间的规定》，明确规定每天 8 小时、每周 40 小时。虽然对于企业没有直说双休，但如果单休或大小周的话每天是不能满 8 小时的，否则超过 40 小时违规。https://zh.m.wikisource.org/wiki/%E5%9B%BD%E5%8A%A1%E9%99%A2%E5%85%B3%E4%BA%8E%E8%81%8C%E5%B7%A5%E5%B7%A5%E4%BD%9C%E6%97%B6%E9%97%B4%E7%9A%84%E8%A7%84%E5%AE%9A第三条　职工每日工作 8 小时、每周工作 40 小时。第四条　在特殊条件下从事劳动和有特殊情况，需要适当缩短工作时间的，按照国家有关规定执行。第五条　因工作性质或生产特点的限制，不能实行每日工作 8 小时、每周工作 40 小时标准工时制度的，按照国家有关规定，可以实行其他工作和休息办法。",
          "en": "In addition to the 'Labor Law' stipulating no more than 44 hours, the State Council issued the 'Regulations of the State Council on the Working Hours of Employees' in 1995, which explicitly stipulates 8 hours a day and 40 hours a week. Although it doesn't explicitly mention two days off for companies, if they have one day off or alternating work weeks, then the daily working hours cannot be 8 hours, otherwise it exceeds 40 hours, which is a violation. https://zh.m.wikisource.org/wiki/%E5%9B%BD%E5%8A%A1%E9%99%A2%E5%85%B3%E4%BA%8E%E8%81%8C%E5%B7%A5%E5%B7%A5%E4%BD%9C%E6%97%B6%E9%97%B4%E7%9A%84%E8%A7%84%E5%AE%9AArticle 3 Employees work 8 hours a day and 40 hours a week. Article 4 If employees engage in labor under special conditions and have special circumstances, and need to appropriately shorten working hours, they shall be implemented in accordance with relevant national regulations. Article 5 If due to the limitations of the nature of work or the characteristics of production, the standard working hour system of 8 hours of work per day and 40 hours of work per week cannot be implemented, other working and rest methods can be implemented in accordance with relevant national regulations."
        }
      ],
      "type": "replies"
    }
  ]
}