{
  "id": 1113702,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "朋友准备裸辞，劝了无用",
          "en": "My friend is preparing to quit her job without another lined up, and my劝劝劝勸劝劝劝劝劝劝劝勸劝勸劝劝劝劝勸劝劝劝劝劝勸勸劝劝勸劝劝勸劝劝勸劝劝劝劝劝劝劝劝advice was useless."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "朋友 98 年女生，某 211 大学毕业\r\n目前在某银行科技部工作，工作强度中规中矩，需要加班，但是压力不大，加班是氛围导致，朋友是有点技术追求的，但是银行的技术大家懂的都懂，虽然新的技术有，但旧的东西偏多。",
          "en": "My friend is a female born in 1998, graduated from a 211 university.\r\nCurrently working in the technology department of a bank, the work intensity is moderate, requiring overtime, but the pressure is not high. Overtime is due to the atmosphere. My friend has some technical aspirations, but everyone understands the technology of banks. Although there are new technologies, there are more old things."
        },
        {
          "zh": "目前总包在 30W 左右，但由于工作以来一直是边缘人角色，小透明，被分配的工作也不是非常重要，导致绩效一直被评差，今年还被降薪了 1W ，今年如果还被评差的话，就会被优化，于是心情倍受打击，此外朋友还提到不适应银行内的职场氛围，比如要学会主动表现自己，邀功之类的，遂考虑另寻高就。\r\n朋友面试过某互联网大厂外包，能在目前的流水上涨薪 30%，也能做更偏向技术相关的内容，而不是和银行一样做管理偏多的工作，所以很心动，打算裸辞，再备战备战一段时间，观望一下更好的去处。",
          "en": "The current total package is around 300,000 RMB, but because I have always been a marginal person and a small transparent figure since I started working, the work assigned is not very important, resulting in consistently poor performance. This year, I was also given a salary cut of 10,000 RMB. If I am rated poorly again this year, I will be optimized, so I am very discouraged. In addition, my friend also mentioned that she is not adapted to the workplace atmosphere in the bank, such as having to learn to actively express herself, claim credit, etc., so she is considering seeking a better job.\r\nMy friend interviewed for an outsourcing position at a major Internet company. She could get a 30% salary increase on the current revenue and do more technically related content, rather than doing mostly management-related work like in the bank, so she is very tempted and plans to quit her job without another lined up, prepare for a period of time, and wait and see a better place to go."
        },
        {
          "zh": "\r\n我劝阻了一下，觉得骑驴找马更合适。",
          "en": "\r\nI dissuaded her a bit, thinking that looking for a job while still employed is more suitable."
        },
        {
          "zh": "奈何朋友要追求自己的理想，所以没再多劝了。",
          "en": "However, my friend wants to pursue her ideals, so I didn't persuade her anymore."
        },
        {
          "zh": "元芳，你怎么看",
          "en": "Yuanfang, what do you think?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你不仅多事劝人家，还发网上谈论",
          "en": "You not only meddle and advise people, but also post it online to discuss."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你想劝他这个立场背后的原因和逻辑你是只字不提，爹味太重了",
          "en": "You didn't mention a word about the reasons and logic behind his position in trying to dissuade him, it's too patronizing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "尊重她人命运，放下助人情节。",
          "en": "Respect other people's fate, and let go of your savior complex."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "追",
          "en": "Pursue."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别说是朋友，就是女朋友你也不应该管别在网上看点啥就觉得自己老江湖啥都懂了，你做的决定一定比别人好？",
          "en": "Don't say it's just a friend, you shouldn't even interfere with your girlfriend. Don't think you understand everything just because you read something online. Is the decision you made definitely better than others'?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@belin520 #4 哈哈，不过从楼主的发帖履历来看，这个女朋友就是楼主她自己。",
          "en": "@belin520 #4 Haha, but judging from the poster's posting history, this girlfriend is actually the poster herself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赶紧找男朋友先结婚。28 岁女性在 2025 年裸辞找 IT 技术工作，这…",
          "en": "Quickly find a boyfriend and get married first. A 28-year-old woman quitting her job without another lined up to find an IT technical job in 2025, this..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "充分讲清利弊 尊重朋友选择",
          "en": "Fully explain the pros and cons and respect your friend's choice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有时候我们不在他人的位置，我们也理解不了他人的感受，也许有的人和事你的这位朋友就是接受不了，无法忍受。",
          "en": "Sometimes when we are not in other people's positions, we cannot understand their feelings. Perhaps there are people and things that your friend just cannot accept or endure."
        },
        {
          "zh": "咱们作为朋友只能尊重祝福，并在力所能及的范围内给予支持和帮助就可以了。",
          "en": "As friends, we can only respect and bless them, and provide support and assistance within our capabilities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "裸辞最大的问题不是钱，几个月的存粮不至于没有，尤其是对于几年没换工作的人，他们对于整个市场环境的认知可能还是几年前的，觉得还能随便换工作，跳槽必涨薪，此处不留爷，必有留爷处。",
          "en": "The biggest problem with quitting your job without another lined up is not money. A few months of savings shouldn't be a problem, especially for people who haven't changed jobs in a few years. Their understanding of the entire market environment may still be from a few years ago. They think they can change jobs easily, get a salary increase when they change jobs, and that if they're not wanted here, they'll be wanted elsewhere."
        },
        {
          "zh": "裸辞最大的问题就是：贸然把自己后路给断了！",
          "en": "The biggest problem with quitting your job without another lined up is: rashly cutting off your own escape route!"
        },
        {
          "zh": "这种人刚开始都是第一个月玩，第二个月投简历发现投简历回复寥寥无几，第三个月开始焦虑海投，然后不得已接受了一份，非正编，降薪，加班，通勤远的工作。",
          "en": "These people usually spend the first month playing, the second month applying for jobs and finding that there are very few responses, and the third month starting to anxiously mass apply, and then reluctantly accepting a job that is not permanent, with a salary cut, overtime, and a long commute."
        },
        {
          "zh": "如果你没钱你不得不去做这样的工作，如果你有钱，空窗半年也够呛。",
          "en": "If you don't have money, you have to take such a job. If you have money, being unemployed for half a year is also difficult."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SupperHobby #22 有对象了，关你什么事呢？",
          "en": "@SupperHobby #22 She has a partner, what's it to you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我 2020 年在某航天研究所想裸辞，听了我爸的劝没辞。",
          "en": "I wanted to quit my job without another lined up in 2020 at a certain aerospace research institute, but I didn't quit after listening to my dad's advice."
        },
        {
          "zh": "最后忍了一年 2021 年底还是辞了，主要原因和收入无关，是综合了工作内容、技术发展、人际关系等多方面原因，总之呆在这单位期间，持续性脱发、失眠、情绪抑郁。",
          "en": "In the end, I endured it for another year and still quit at the end of 2021. The main reason was not related to income, but a combination of factors such as work content, technical development, and interpersonal relationships. In short, during my time at this unit, I experienced continuous hair loss, insomnia, and emotional depression."
        },
        {
          "zh": "11 月走的，玩到过年后，这期间花钱交的社保，年后大概 2 月开始找工作，3 月份入职了新的公司，总包涨了四分之一左右，最不同的是人的心情好了不少，吃饭胃口都好了。",
          "en": "I left in November, played until after the New Year, paid for social security during this period, started looking for a job around February after the New Year, and joined a new company in March. The total package increased by about a quarter, and the biggest difference was that I felt much better and had a better appetite."
        },
        {
          "zh": "有一点上面都没人提，正因为市场是下行的，如果要走的话还不如早点走。",
          "en": "One thing no one has mentioned above is that because the market is declining, if you want to leave, it's better to leave sooner."
        },
        {
          "zh": "就算现在找工作难，也不是完全找不着，如果再过几年被优化出来，岂不是更难找？",
          "en": "Even if it's difficult to find a job now, it's not impossible to find one. If you are optimized out in a few years, wouldn't it be even more difficult to find one?"
        },
        {
          "zh": "楼主朋友总归是有被优化风险的，而且看起来还不小。",
          "en": "The poster's friend is likely to be optimized out, and it looks like it's not a small risk."
        },
        {
          "zh": "当然不管我听没听劝，我知道自己才是最终负责人，当时决定忍一年也是想看看在所里能不能有转机。",
          "en": "Of course, regardless of whether I listened to advice or not, I knew that I was ultimately responsible. The reason why I decided to endure it for a year was to see if there could be a turnaround in the institute."
        },
        {
          "zh": "但是偶尔也会觉得，如果自己当时更能看清现状 、更有魄力能够和家人据理力争，20 年就辞职出来，是不是不用白吃那一年苦、浪费一年时间，而且 20 年就业环境也更好点吧。",
          "en": "But sometimes I also feel that if I could have seen the situation more clearly at the time and had the courage to argue with my family, and quit in 2020, wouldn't I have had to suffer for that year and waste a year, and the employment environment in 2020 was also better?"
        },
        {
          "zh": "另外骑驴找马对有的人并不合适，本来上班就很累，下班那点时间再全部挤占，你去找工作的时候能是个什么好状态呢？",
          "en": "In addition, looking for a job while still employed is not suitable for everyone. It's already very tiring to work, and if you squeeze all the time after work, what kind of good state will you be in when you look for a job?"
        },
        {
          "zh": "当然不排除一些人就是有这个能力。",
          "en": "Of course, it is possible that some people do have this ability."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "银行正职不要 ，去大厂做外包，别吧。",
          "en": "Don't give up a permanent position in a bank to do outsourcing at a big factory, please don't."
        },
        {
          "zh": "我在银行干了多年，除非太挫，不然差会轮流背的，基本不会因为这个被优化。",
          "en": "I have worked in a bank for many years. Unless you are too bad, poor performance ratings will be rotated, and you will basically not be optimized because of this."
        },
        {
          "zh": "不过合同年的前一年的绩效要注意，比如马上要续合同，这时候年度绩效给你个差就可能要准备找工作了，不过也是小概率事件。",
          "en": "However, you should pay attention to the performance in the year before the contract year. For example, if you are about to renew the contract, if the annual performance gives you a poor rating at this time, you may have to prepare to look for a job, but it is also a small probability event."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jinksw 倒也没有很有钱，普通家庭吧",
          "en": "@jinksw It's not like she's very rich, just an average family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "尊重他人命运，别的人生轮得到你指点吗，作为朋友最多提一嘴建议，别人爱听不听。",
          "en": "Respect other people's fate, is it your turn to give guidance in other people's lives? As a friend, you can give a suggestion at most, and it's up to others whether they listen or not."
        },
        {
          "zh": "假设听你的建议让她损失了去大厂爬升到年薪 60 甚至 80 的机会，你负责吗？",
          "en": "Suppose listening to your advice caused her to lose the opportunity to go to a big factory and climb to a salary of 600,000 or even 800,000 per year, are you responsible?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你说的，，，你自己",
          "en": "You are talking about... yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "技术只是个工具，不用太过追求，工作多了就知道还是搞好关系重要，很少人能有好的技术学习环境，要有人指导的。",
          "en": "Technology is just a tool, don't pursue it too much. After working more, you will know that it is important to maintain good relationships. Few people can have a good technical learning environment and need someone to guide them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "尊重他人选择，为自己人生负责",
          "en": "Respect other people's choices and be responsible for your own life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "每个人有自己的命运  你管不着     别说普通朋友了，你亲老婆亲儿女亲爹妈，想干什么你都控制不了",
          "en": "Everyone has their own destiny, you can't control it. Don't mention ordinary friends, you can't control what your wife, children, parents want to do."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是你老婆就不用劝了，很多人都听不进去。",
          "en": "If she's not your wife, don't bother trying to persuade her, many people won't listen."
        }
      ],
      "type": "replies"
    }
  ]
}