{
  "id": 1110103,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "姐姐找我借钱投资我不想借",
          "en": "My sister asked to borrow money from me to invest, but I don't want to lend it."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "姐姐问我手上有多少存款，我说大概 20w ，她跟我说姐夫公司有个什么股份内购计划，一定级别的员工可以内购公司股份（非上市公司），每年可以结算收益，收益率可以达到百分之十，希望我能认购一万股大概 11w 块钱，我觉得投资有风险，很多上市公司的资深员工都被股权套牢，何况非上市公司，于是拒绝，于是她又转而问我能否借她 11w 她自己投资（他们的目标是凑 110w 即 10w 股），说实话我很不想借，我列一下我们的情况，大家帮忙看下，我怎样拒绝能把对我们关系的伤害降低到最低。\r\n\r\n1.我今年 25 周岁，毕业两年多，姐姐比我大九岁，父母都是普通工人，六十岁，即将退休。\r\n\r\n2.我不想借的原因主要有:\r\n(1)今年回家催婚催的严重，但是我现在除了一点存款还一无所有，而且 it 工作不算稳定，公司去年裁员一半，难说今年会不会裁到我，借出去 11w 的话，支付宝余额就只有个位数 W 了，21 年实习时没啥钱吃过相当长时间的自热米饭和美团十二块钱炒饭，存款不够没啥安全感 \r\n\r\n(2)姐姐毕竟比我大九岁，而且已婚有娃无贷，将心比心的话，我觉得如果我有一个这样的弟弟或者妹妹，我是不会找她借钱的，把风险转嫁给她，我自己不愿意做的事也不愿意发生在我身上\r\n\r\n(3)借钱投资、结婚、买房在我看来都是比较傻逼的行为。。这是个人偏见，但在我的脑子是根深蒂固的印象了，上杠杆搞这些东西，万一亏了就是害人害己\r\n\r\n(4)11w 实在太多了，5w 以下我还是可以接受的，毕竟一个占了我的资产超过一半，一个只有四分之一（没办法穷..,而且自我毕业之后姐姐就时不时问我工资和存款，现在联想起来让我有点不爽\r\n\r\n(5)我觉得他们的实力不足以支撑一百多万的投资计划，姐夫公司的具体经营情况我不清楚，但是投资需谨慎，他们这么玩胆子属实有点大了。在沟通上至少我姐没有跟我说如果不投资对姐夫在公司的事业和发展有什么负面影响\r\n\r\n3.我的顾虑有:\r\n(1)姐姐对我还算不错，未婚之前会给我买点东西，加在一起有大几千。而且我欠她一个大人情，我大学曾因抑郁休学一年，不敢回老家在她家住了大半年。但是与之相对的，我工作之后给我小侄女买了不少东西，杂七杂八的也有大几千了。同时我高二高三母亲曾来租房给我陪读，当时我姐未婚，从外地回老家发展和我们住一起，虽然是爸妈租的房，但是也算沾了我的光吧，这也是我休学时我妈说我不想回家可以去姐姐家住的原因，陪读时妈妈问我会会影响学习的话可以让姐姐出去住，我说一家人住一起挺好，不影响学习，没必要，后面就一起住了两年。\r\n\r\n(2)姐姐性格比较暴躁，好胜心强，我这次不借的话，大概率会影响我们的关系。\r\n\r\n说到底还是穷吧，如果我有一百万存款肯定借了..但难说那时候会不会找我借五十万，唉"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "姐姐问我手上有多少存款，我说大概 20w ，她跟我说姐夫公司有个什么股份内购计划，一定级别的员工可以内购公司股份（非上市公司），每年可以结算收益，收益率可以达到百分之十，希望我能认购一万股大概 11w 块钱，我觉得投资有风险，很多上市公司的资深员工都被股权套牢，何况非上市公司，于是拒绝，",
          "en": "My sister asked me how much savings I had, and I said about 200k. She told me that her brother-in-law's company has some kind of internal share purchase plan, where employees of a certain level can internally purchase company shares (not a listed company), and the profits can be settled every year, with a rate of return of up to 10%. She hopes that I can subscribe for 10,000 shares, which is about 110k yuan. I think investment is risky, and many senior employees of listed companies are trapped by equity, let alone non-listed companies, so I refused."
        },
        {
          "zh": "于是她又转而问我能否借她 11w 她自己投资（他们的目标是凑 110w 即 10w 股），说实话我很不想借，我列一下我们的情况，大家帮忙看下，我怎样拒绝能把对我们关系的伤害降低到最低。",
          "en": "So she turned around and asked if I could lend her 110k for her own investment (their goal is to raise 1.1 million, i.e., 100k shares). To be honest, I really don't want to lend it. I'll list our situation, and I hope everyone can help me see how I can refuse to minimize the damage to our relationship."
        },
        {
          "zh": "\r\n\r\n1.我今年 25 周岁，毕业两年多，姐姐比我大九岁，父母都是普通工人，六十岁，即将退休。",
          "en": "\n\n1. I am 25 years old this year, and I have graduated for more than two years. My sister is nine years older than me. My parents are ordinary workers, sixty years old, and are about to retire."
        },
        {
          "zh": "\r\n\r\n2.我不想借的原因主要有:",
          "en": "\n\n2. The main reasons why I don't want to lend are:"
        },
        {
          "zh": "\r\n(1)今年回家催婚催的严重，但是我现在除了一点存款还一无所有，而且 it 工作不算稳定，公司去年裁员一半，难说今年会不会裁到我，借出去 11w 的话，支付宝余额就只有个位数 W 了，21 年实习时没啥钱吃过相当长时间的自热米饭和美团十二块钱炒饭，存款不够没啥安全感",
          "en": "\n(1) The pressure to get married is severe this year, but I have nothing but a little savings. Moreover, my IT job is not stable. The company laid off half of its employees last year, and it is hard to say whether I will be laid off this year. If I lend out 110k, my Alipay balance will only have single-digit W. When I interned in 2021, I didn't have much money and ate self-heating rice and Meituan stir-fried rice for twelve yuan for a long time. I don't have enough savings and don't feel safe."
        },
        {
          "zh": "\r\n\r\n(2)姐姐毕竟比我大九岁，而且已婚有娃无贷，将心比心的话，我觉得如果我有一个这样的弟弟或者妹妹，我是不会找她借钱的，把风险转嫁给她，我自己不愿意做的事也不愿意发生在我身上",
          "en": "\n\n(2) After all, my sister is nine years older than me, and she is married with children and no loans. Putting myself in her shoes, I don't think I would borrow money from her if I had such a younger brother or sister, shifting the risk to her. I don't want things I'm unwilling to do to happen to me."
        },
        {
          "zh": "\r\n\r\n(3)借钱投资、结婚、买房在我看来都是比较傻逼的行为。。这是个人偏见，但在我的脑子是根深蒂固的印象了，上杠杆搞这些东西，万一亏了就是害人害己",
          "en": "\n\n(3) In my opinion, borrowing money for investment, marriage, and buying a house are all stupid behaviors. This is a personal prejudice, but it is a deeply rooted impression in my mind. If you use leverage to do these things, it will harm others and yourself if you lose."
        },
        {
          "zh": "\r\n\r\n(4)11w 实在太多了，5w 以下我还是可以接受的，毕竟一个占了我的资产超过一半，一个只有四分之一（没办法穷..,而且自我毕业之后姐姐就时不时问我工资和存款，现在联想起来让我有点不爽",
          "en": "\n\n(4) 110k is really too much. I can accept below 50k, after all, one accounts for more than half of my assets, and the other only a quarter (can't help being poor...). Moreover, since I graduated, my sister has occasionally asked me about my salary and savings, which makes me a little unhappy now that I think about it."
        },
        {
          "zh": "\r\n\r\n(5)我觉得他们的实力不足以支撑一百多万的投资计划，姐夫公司的具体经营情况我不清楚，但是投资需谨慎，他们这么玩胆子属实有点大了。在沟通上至少我姐没有跟我说如果不投资对姐夫在公司的事业和发展有什么负面影响",
          "en": "\n\n(5) I don't think their strength is enough to support an investment plan of more than one million. I don't know the specific business situation of my brother-in-law's company, but investment should be cautious. They are really too bold to play like this. At least in the communication, my sister didn't tell me what negative impact it would have on my brother-in-law's career and development in the company if I didn't invest."
        },
        {
          "zh": "\r\n\r\n3.我的顾虑有:",
          "en": "\n\n3. My concerns are:"
        },
        {
          "zh": "\r\n(1)姐姐对我还算不错，未婚之前会给我买点东西，加在一起有大几千。而且我欠她一个大人情，我大学曾因抑郁休学一年，不敢回老家在她家住了大半年。但是与之相对的，我工作之后给我小侄女买了不少东西，杂七杂八的也有大几千了。同时我高二高三母亲曾来租房给我陪读，当时我姐未婚，从外地回老家发展和我们住一起，虽然是爸妈租的房，但是也算沾了我的光吧，这也是我休学时我妈说我不想回家可以去姐姐家住的原因，陪读时妈妈问我会会影响学习的话可以让姐姐出去住，我说一家人住一起挺好，不影响学习，没必要，后面就一起住了两年。",
          "en": "\n(1) My sister was quite nice to me before she got married, and she would buy me things, adding up to several thousand. And I owe her a big favor. I dropped out of college for a year due to depression and lived in her house for more than half a year because I dared not go back to my hometown. But in contrast, after I started working, I bought a lot of things for my niece, and there are also several thousand odds and ends. At the same time, my mother came to rent a house to accompany me when I was in my second and third years of high school. At that time, my sister was unmarried. She returned to her hometown from other places to develop and live with us. Although it was a house rented by my parents, it was considered that I benefited from it. That's why my mother told me that I could go to my sister's house if I didn't want to go home when I dropped out of school. When accompanying me, my mother asked if it would affect my studies if my sister lived outside. I said it's good for the family to live together, it doesn't affect my studies, there's no need, and then we lived together for two years."
        },
        {
          "zh": "\r\n\r\n(2)姐姐性格比较暴躁，好胜心强，我这次不借的话，大概率会影响我们的关系。",
          "en": "\n\n(2) My sister has a relatively irritable personality and is very competitive. If I don't lend her this time, it will likely affect our relationship."
        },
        {
          "zh": "\r\n\r\n说到底还是穷吧，如果我有一百万存款肯定借了..但难说那时候会不会找我借五十万，唉",
          "en": "\n\nIn the end, it's because I'm poor. If I had one million in savings, I would definitely lend it... But it's hard to say whether she would ask me to borrow 500k at that time. Alas."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "别找借口和撒谎，直接坦白就行，就说自己已经不小了，为了未来的家庭做准备，最多能借多少多少，毕竟是亲姐，要是真撒谎了，以后过年啥的会很尴尬的，真诚就是必杀技，如果你都把真心拿出来了，你姐还不依不饶，那就不打感情牌，打理性牌，这时候你就把你的投资顾虑说出来，就说我也走出社会了，也有自己的世界观，自己也能做出一些判断，对于这份投资，在你这里最多值多少多少，反正就能拿出这么多，爱要不要，千万别让步就行。",
          "en": "Don't make excuses or lie, just be honest and say that you are not young anymore and are preparing for your future family. You can only lend a certain amount. After all, she is your own sister. If you really lie, it will be very embarrassing during the New Year. Sincerity is the ultimate weapon. If you have put your heart into it and your sister still doesn't give up, then don't play the emotional card, play the rational card. At this time, you can express your investment concerns and say that you have also entered society and have your own world view. You can also make some judgments. This investment is worth a certain amount at most to you. Anyway, you can only take out this much. Take it or leave it, but don't give in."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你就不该告诉她有多少钱。正确的回答：- 有多少钱？- 啊？哈哈，哈哈哈",
          "en": "You shouldn't have told her how much money you have. The correct answer: - How much money do you have? - Ah? Haha, hahaha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "问你姐借钱，“想这两年结婚。但对象要求有辆 B 级车、彩礼 28.8 万，压力有点大。”",
          "en": "Borrow money from your sister, \"I want to get married in the next two years. But my partner requires a B-class car and a bride price of 288k, which is a lot of pressure.\""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去调研一下公司的情况呀，质地好的话，也不一定不能投，万一上市了呢。现在看 11w 挺多，等多工作两年，11w 不算啥。",
          "en": "Go and investigate the company's situation. If it's of good quality, it's not necessarily impossible to invest. What if it goes public? 110k seems like a lot now, but after working for two more years, 110k is nothing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你主动出击，就说问过当警察的同学了，怀疑这是非法融资、卷钱跑路的计划，劝她千万不要往里面投钱，就是在赌。问她哪里来的肯定赚钱的把握（她肯定没有），做没做过风险评估收益评估（肯定也没有），问她这都没有怎么敢赌的。如果感觉还不够，就问她她家是不是她管钱，说她这样管钱容易出事，把钱给你，你给她存银行定期存起来。",
          "en": "Take the initiative and say that you have asked your classmates who are police officers and suspect that this is an illegal fundraising or money-laundering plan. Advise her not to invest in it, it's just a gamble. Ask her where she got the certainty of making money (she definitely doesn't have it), whether she has done a risk assessment and return assessment (she definitely hasn't), and ask her how she dares to gamble without this. If you feel it's not enough, ask her if she is in charge of the money in her family, and say that it's easy to have problems if she manages the money like this. Give the money to you, and you can deposit it in the bank for her."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "告诉她你只能借她 5W ，剩下的都在理财里，现在拿出来损失利息，投资到 10%的项目里相当于没赚",
          "en": "Tell her that you can only lend her 50k, and the rest is in financial management. Taking it out now will lose interest, and investing it in a 10% project is equivalent to not earning anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "重点：向普通人借钱做金融投资是不对的。有本事就向银行等机构贷款，那没问题。如果找普通人，可以谈合作，但不可以借。因为对于普通人来说，冒的是高风险，获得的却是极低回报（熟人借钱，利息极低或没利息），显然不公平。也就是说，你姐姐找你借钱做金融投资，她就已经在欺负你了（当然，也许她没想明白这个道理）。既然是她在欺负你，你现在想的不是 “帮不帮”，而是“忍不忍”、“反不反抗”。",
          "en": "Key point: It is wrong to borrow money from ordinary people for financial investment. If you have the ability, you can borrow from banks and other institutions, that's no problem. If you are looking for ordinary people, you can talk about cooperation, but you can't borrow. Because for ordinary people, they are taking high risks, but getting very low returns (borrowing money from acquaintances, the interest is very low or no interest), which is obviously unfair. In other words, your sister is already bullying you by asking you to borrow money for financial investment (of course, maybe she hasn't figured out this point). Since she is bullying you, what you are thinking about now is not \"to help or not\", but \"to tolerate or not\", \"to resist or not\"."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有风险，别借。不过 “同时我高二高三母亲曾来租房给我陪读，当时我姐未婚，从外地回老家发展和我们住一起，虽然是爸妈租的房，但是也算沾了我的光吧，这也是我休学时我妈说我不想回家可以去姐姐家住的原因，陪读时妈妈问我会会影响学习的话可以让姐姐出去住，我说一家人住一起挺好，不影响学习，没必要，后面就一起住了两年。” 这一段看楼主你是个斤斤计较的人，同时也没把姐姐当家里人看，那更不用借了。",
          "en": "It's risky, don't lend it. However, in the passage \"At the same time, my mother came to rent a house to accompany me when I was in my second and third years of high school. At that time, my sister was unmarried. She returned to her hometown from other places to develop and live with us. Although it was a house rented by my parents, it was considered that I benefited from it. That's why my mother told me that I could go to my sister's house if I didn't want to go home when I dropped out of school. When accompanying me, my mother asked if it would affect my studies if my sister lived outside. I said it's good for the family to live together, it doesn't affect my studies, there's no need, and then we lived together for two years.\", it can be seen that you are a petty person and don't regard your sister as family, so there is no need to lend it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果因为你不借钱就影响关系的，说明关系也就那样吧，从这个角度来说也能早点认清现实",
          "en": "If the relationship is affected because you don't lend money, it means that the relationship is just like that. From this perspective, you can recognize the reality earlier."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一点也不想借，那就告诉她，钱都是定期，取不出来；如果想借一点，那就告诉她，手头只有 2w ，其他都取不出来。借出去，就要做好她不会还的结果。而且她借 10w ，你只给 2w ，如果她心里有芥蒂，不但不会还，还会记你的仇，所以最好还是一分不借，反正借不借都会记仇。",
          "en": "If you don't want to lend it at all, then tell her that the money is all in a fixed deposit and cannot be withdrawn; if you want to lend a little, then tell her that you only have 20k on hand and the rest cannot be withdrawn. If you lend it out, you must be prepared for the result that she will not repay it. Moreover, if she borrows 100k and you only give 20k, if she has a grudge in her heart, not only will she not repay it, but she will also hold a grudge against you, so it's best not to lend a penny, because she will hold a grudge whether you lend it or not."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是我的话就借，不是为了投资 11w 能挣多少钱，而是为了看清亲姐这个人，毕竟有血缘关系日后还要相处，如果投资失败赔了亲姐立马翻脸不认人你也没必要客气，投资挣了的话看她怎么回报你你也不亏",
          "en": "If it were me, I would lend it, not for how much money I can make by investing 110k, but to see my own sister for who she is. After all, we have blood relationship and we will have to get along in the future. If the investment fails and my sister immediately turns against me, then you don't need to be polite. If the investment makes money, see how she repays you and you won't lose out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你姐这个，太熟悉了，老骗局了。要是我的话，我会告诉她，你要有困难我肯定借你。你要拿去投资，抱歉，这笔钱是给你投资被骗后，生活不起的时候借给你的。当然，委婉一点，你说你最近要买车、房等。",
          "en": "Your sister's situation is too familiar, it's an old scam. If it were me, I would tell her that if you have difficulties, I will definitely lend you money. If you want to use it for investment, I'm sorry, this money is for you to borrow when you can't afford to live after being scammed in the investment. Of course, to put it euphemistically, you can say that you want to buy a car, a house, etc. recently."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "永远不要借钱给人投资。更不要借钱给亲戚。原因有几个：1. 救急不救穷。他如果有急事，别说借钱，白送都可以。但是他现在没灾没难，只是想借钱赚钱，那不行。2. 投资一定有风险，无风险高收益的投资轮不到你或者你亲戚这种普通人的。既然有风险，那赔了怎么办？到时候你好意思去讨债吗？赚了归他，亏了归你？3. 除了上市大公司定期的员工打折买入股票的计划（国外真有）。普通公司搞员工持股计划极大概率就是临倒闭前最后从员工身上捞一波。这种黑心老板如果真有钱赚还不给自己或者给亲戚赚？会给员工让利？4. 楼上也说过。现代社会，金融机构这么多，融资渠道这么多，怎么可能借不到钱？金融机构都不敢借的钱，你敢？！5. 借钱的时候你当他是亲戚，讨债的时候他可不当你是亲戚。借钱给亲戚，大概率连亲戚都做不成了。朋友同理。以上每一条，几年前我都和我妈说过。但是我妈当时已经把钱借给我表姐了。也是因为员工持股。后来果然，公司倒闭了，表姐失业了，钱也一直没还。表姐夫其实有收入，但是一出事就和表姐切割。不承认这件投资，也不帮忙还钱。我妈也没努力催债，只是隔几个月问一下。问了几次以后微信被拉黑了。钱不多，就几万块钱。我家也不缺这点钱。但就因为这点钱，我家和我舅家就闹翻了。我也想过，如果我把钱还了，就当是我送给表姐的算了，就当这事没发生过。但是想想也没用，毕竟我妈和我舅都忘不了这件事。",
          "en": "Never lend money to people for investment. And don't lend money to relatives. There are several reasons: 1. Help in an emergency, but don't help the poor. If he has an emergency, let alone lending money, you can give it away. But he has no disaster now, he just wants to borrow money to make money, that's not okay. 2. Investment is definitely risky, and risk-free, high-yield investments are not for ordinary people like you or your relatives. Since there is risk, what if you lose? Will you be embarrassed to collect debts then? He gets the profit, and you get the loss? 3. Except for the regular employee discount purchase of stocks by large listed companies (which really exists abroad). Ordinary companies engaging in employee stock ownership plans are very likely to be scraping the last bit of money from employees before going bankrupt. If this kind of black-hearted boss really has money to make, wouldn't he make it for himself or his relatives? Will he give profits to employees? 4. As mentioned above. In modern society, there are so many financial institutions and so many financing channels, how is it possible not to borrow money? You dare to invest in money that financial institutions don't dare to lend?! 5. When you lend money, you treat him as a relative, but when you collect debts, he doesn't treat you as a relative. Lending money to relatives will likely ruin even the relationship. The same is true for friends. I told my mother all of the above a few years ago. But my mother had already lent money to my cousin at that time. Also because of employee stock ownership. Later, as expected, the company went bankrupt, my cousin lost her job, and the money was never returned. My cousin-in-law actually has income, but he cut ties with my cousin as soon as something happened. He did not admit to this investment nor help to repay the money. My mother didn't try to collect the debt, she just asked every few months. After asking a few times, she was blacklisted on WeChat. The money is not much, just tens of thousands of yuan. My family is not short of that money either. But because of this money, my family and my uncle's family fell out. I also thought about it, if I paid back the money, I would just treat it as a gift to my cousin and pretend that this never happened. But thinking about it is useless, after all, my mother and my uncle can't forget this."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从后文来看，确实姐弟两之前关系也好，互相抱团取暖，况且毕竟是亲姐弟啊。我觉得可以真心换真心（也许是我太年轻）。1. 你就直接说家人催婚（催婚的包括你姐吗），这些存款是准备结婚彩礼用的。而且自己确实穷，给了就没存款了。2. 直接和他们说，10% 的收益率，公司难道是傻的，不直接找银行融资？现在银行都放贷不出去，真的优秀公司肯定能融资到的。这种实话说坑钱的概率挺大的。他们图收益，公司图的是本金。楼上的真实案例也可以和你姐说一下。再说了，你姐他们敢借消费贷投资吗，现在消费贷也就 3 个点左右，不敢的话他们实际上也没有底气。3. 借出去的钱默认扔到水里了。真要借的话，要评估自己最多能损失多少（几千？一万？），意思意思支持一下你姐，就当是买年货拜年了。你还年轻，之后工作钱还会更多的。当然这里一定要死守底线，把钱当作扔掉了（不要抱有期待），再多的不要给。4. 沟通的时候当面聊，且最好避开姐夫。",
          "en": "Judging from the following text, the relationship between the siblings was indeed good before, and they helped each other through hard times. Besides, they are siblings after all. I think you can exchange sincerity for sincerity (maybe I'm too young). 1. Just say directly that your family is urging you to get married (does the urging to get married include your sister?), and these savings are for the wedding gift. And you are really poor, if you give it, you will have no savings. 2. Tell them directly, with a 10% rate of return, is the company stupid, why not directly seek bank financing? Now the banks can't lend out money, and really excellent companies can definitely get financing. To be honest, the probability of this being a scam is quite high. They are after the returns, and the company is after the principal. You can also tell your sister about the real cases upstairs. Besides, would your sister dare to borrow consumer loans for investment? Now consumer loans are only about 3%, and if they don't dare, they actually have no confidence. 3. The money lent out is assumed to be thrown into the water. If you really want to lend, you have to assess how much you can lose at most (a few thousand? Ten thousand?), just to support your sister as a gesture, just treat it as buying New Year's goods and paying New Year's greetings. You are still young, and you will have more money in your job later. Of course, you must stick to the bottom line here and treat the money as thrown away (don't have any expectations), and don't give more. 4. Talk face-to-face when communicating, and it is best to avoid your brother-in-law."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Sirius8 冒那么大风险 全部身家 就为了轻飘飘一句 \"为了看清亲姐这个人\" ，说真的看清了又怎么样",
          "en": "@Sirius8 Taking such a big risk with all your wealth just for the flippant sentence \"to see my own sister for who she is\", honestly, what does it matter if you see her clearly?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人到中年，个人观点是：这 11 万最好借给你姐。同时明确告知你姐、你姐夫、你爸妈，你觉得这项投资风险很高、不应该高，但出于对亲姐的感情同意了。以后投资失败，就不再信任她的重大决策。这样哪怕你损失 11 万，你能拿到家庭未来的主导权。",
          "en": "In middle age, my personal opinion is: it is best to lend this 110k to your sister. At the same time, clearly inform your sister, your brother-in-law, and your parents that you think this investment is very risky and shouldn't be high, but you agreed out of affection for your sister. If the investment fails in the future, you will no longer trust her major decisions. This way, even if you lose 110k, you can gain control of the future of the family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果是我，我就借 5 万，如果这笔钱没了，以后再也不要有经济来往。",
          "en": "If it were me, I would lend 50k, and if the money is gone, I would never have any economic dealings again."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Aalen 粗略了解了，六百人公司，上市可能性不大，半导体行业，我感觉没啥搞头",
          "en": "@Aalen I have a rough understanding. It is a company of 600 people, and the possibility of listing is not high. It is in the semiconductor industry, and I feel that there is nothing to be gained."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找个对象吧，没有的话可以“无中生有”，彩礼啥的也是很合适的理由，虽然比较生硬的，但是应该是比较轻是伤害方法了。自己把握了。不想借，又想伤害轻的话，只能找个理由把这个钱合理的“花”出去了。",
          "en": "Find a partner, if you don't have one, you can \"create one from nothing\". The bride price is also a very suitable reason, although it is relatively stiff, but it should be a relatively less harmful method. It's up to you. If you don't want to borrow and want to minimize the harm, you can only find a reason to reasonably \"spend\" the money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@andytao 前几年不管是她失业低谷还是我抑郁休学，大家确实是一起抱团的。主要他们现在房贷车贷还完了，还准备生二胎，搞这个投资完全就是贪了，而且我还啥都没有，说句可能会挨人骂的心里话，我觉着我没有且不准备找他们借钱就已经够意思了...",
          "en": "@andytao In the past few years, whether it was her low point of unemployment or my depression and suspension from school, everyone did indeed support each other. The main reason is that they have now paid off their mortgage and car loans, and they are also preparing to have a second child. Doing this investment is completely greedy, and I have nothing yet. To say something that may be scolded, I think it is already enough that I have not and am not prepared to borrow money from them..."
        }
      ],
      "type": "replies"
    }
  ]
}