{
  "id": 1110817,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "某东 Mac mini 4 丐版放开买了？",
          "en": "Is the base model of Mac mini 4 available for purchase on JD.com?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "早上看有货随手下了一台，3599 ，目前还没有使用场景。。\r\n家里是 amd R7 5800x++B550+2070 显卡，玩游戏够了，就是系统总不稳定，偶尔卡死",
          "en": "I saw it was in stock this morning and bought one without thinking, for 3599. I don't have a use case for it yet...\r\nMy home setup is an AMD R7 5800x++B550+2070 graphics card, which is enough for gaming, but the system is always unstable and occasionally crashes."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "系统不稳定，那就重装系统……",
          "en": "If the system is unstable, just reinstall it..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Yiki888 https://makerworld.com.cn/zh/models/609994",
          "en": "@Yiki888 https://makerworld.com.cn/zh/models/609994"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Flobit 体验就买丐版",
          "en": "@Flobit Just buy the base model for the experience."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不能再买了，已经有 5 台电脑",
          "en": "I can't buy any more, I already have 5 computers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@leeggco #44同好几台设备，下单又退了原本的想法是搞个废土风组合，新 mini 搭配老款 MBP 的上盖，就是把 MPB 的 C 盖改成显示器。当我下单快送到时，发现之前卖驱动板的淘宝店关了，虽作废mini 很难配显示器，imac 大下巴，超过 24 寸就太占空间，老 LG ultrafine 没货",
          "en": "@leeggco #44 Same here, I have several devices, I placed an order then cancelled it. My original idea was to create a wasteland-style setup, with the new Mini paired with the top cover of an old MBP, basically turning the MBP's C cover into a monitor.\r\nWhen my order was about to arrive, I found that the Taobao store that sold driver boards had closed down. Although it's difficult to pair a display with a useless Mini, the iMac has a big chin, and anything larger than 24 inches takes up too much space, and the old LG Ultrafine is out of stock."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好买个锤子，每次提交订单都提示 活动太火爆",
          "en": "Easy to buy my ass, every time I submit an order it says the event is too popular."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@5261 这个感觉是号的问题，我之前也这样，用别人号就能下单。。。",
          "en": "@5261 I feel like it's a problem with your account. I had the same issue before, and I was able to place an order using someone else's account..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我买了，用来替换八代 i5 的主机，在家办公用，总体使用很流畅，即便跑最新版 ps 也很流程。m4cpu 还是很猛的，唯一的短板是内存太小，跑 ds r1 14b 大模型，内存爆掉，cpu 毫无波澜。",
          "en": "I bought it to replace my 8th-generation i5 host for home office use. Overall, it runs very smoothly, even the latest version of PS runs well. The M4 CPU is still very powerful. The only drawback is that the memory is too small. When running the ds r1 14b large model, the memory runs out, but the CPU is unfazed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "嗯，很好买",
          "en": "Yeah, it's easy to buy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也想换，目前是 9700k + 6900xt 的 Hackintosh ，换丐版不知道是升级还是降级",
          "en": "I also want to switch. I currently have a 9700k + 6900xt Hackintosh. I don't know if switching to the base model would be an upgrade or a downgrade."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "昨天用了一天 香爆了 32G 内存目前撑死用到 27G 没有噪音 没有发热  后悔没早点买",
          "en": "Used it for a day yesterday and it's amazing. The 32G memory is currently using up to 27G at most. No noise and no heat. I regret not buying it sooner."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都发售小半年了，热度早过去了，还要抢哪说得过去@wangxiang 升级，早点换了",
          "en": "It's been on sale for almost half a year, the hype has long passed. It's unreasonable to still have to snatch it. @wangxiang Upgrade, switch sooner rather than later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@66da 32g  mbp 用了一年了 大内存还是爽歪歪",
          "en": "@66da I've used the 32g MBP for a year, and the large memory is still amazing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "随便买了，不知道国补持续到什么时候",
          "en": "Bought it casually, I don't know how long the national subsidy will last."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "蛮久之前就可以随便买了，不过没啥使用场景！",
          "en": "It's been available for purchase for quite a while, but I don't have much of a use case for it!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我看到怎么是 4499 。能截图看看你的吗",
          "en": "I see it for 4499. Can you post a screenshot of yours?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wangxiang 我是 99900k+3080 双系统，写代码是巨大升级，打游戏巨大降级。",
          "en": "@wangxiang I have a 99900k+3080 dual system. It's a huge upgrade for coding, but a huge downgrade for gaming."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首发入的，现在是主力办公机，简直不要太爽。",
          "en": "Bought it when it was first released, and now it's my main office machine. It's just too good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zzzbbb 国补价格支付的时候才看得到吧？",
          "en": "@zzzbbb The national subsidy price is only visible at the time of payment, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@iOCZS 试了下确实是。不过他妈的没货。",
          "en": "@iOCZS Tried it and it's true. But damn it, it's out of stock."
        }
      ],
      "type": "replies"
    }
  ]
}