{
  "id": 1109056,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "今年准备入手一辆车，预算 15w-20w 左右，打算买燃油车，各位友友有推荐不",
          "en": "I'm planning to buy a car this year with a budget of around 150,000 to 200,000 yuan. I plan to buy a gasoline car. Any recommendations from you guys?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "需求：\r\n1：长途主要是 上海-杭州 来回，估计 2 周一次左右；\r\n2：平时上下班基本不用车；\r\n3：希望要求 安全性，舒适性，稳定性好点的；",
          "en": "Requirements:\r\n1: Long trips are mainly round trips between Shanghai and Hangzhou, estimated about once every 2 weeks;\r\n2: I basically don't use the car for commuting to and from work;\r\n3: I hope it's safe, comfortable, and stable;"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@jackwang123 别听他们瞎 BB ，国家元首目前还坐燃油车呢",
          "en": "@jackwang123 Don't listen to their nonsense. Even the head of state still rides in gasoline cars."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议不买",
          "en": "I suggest not buying one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "迈腾 B9",
          "en": "Magotan B9"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "支持纯油。开得不是非常多的用电车就是 NT",
          "en": "I support pure gasoline cars. Using electric cars when you don't drive very much is just stupid."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "星越 L ，但还是首推纯电车。",
          "en": "Xingyue L, but I still recommend pure electric cars."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果自己一个人的话，这需求不如不买。杭州上海来回高铁+打车就好了。",
          "en": "If you are alone, it's better not to buy with these requirements. Taking the high-speed train + taxi between Hangzhou and Shanghai is better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "特斯拉 30 万的车, 首付 5 万, 还 5 年, 每个月不到 4000 块, 多好",
          "en": "A Tesla costing 300,000 yuan, with a down payment of 50,000, and a 5-year repayment plan, is less than 4,000 yuan per month. How great is that?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liuzhaowei55 我买车的时候主要的场景也是江苏上海两边跑，使用频率还没有楼主高，计划是一个月一次，买了之后发现开车成本低，而且驾驶体验也好，于是相同的价格 租房到了居住环境更好停车更方便停车费更便宜的小区 之前靠近地铁，而且每年开 3 万公里左右，一放假以前是天天在家里宅着，后来就开车出去玩，反正成本很低。",
          "en": "@liuzhaowei55 When I bought my car, the main scenario was also running between Jiangsu and Shanghai. The frequency of use was not as high as the original poster's. I planned to use it once a month. After buying it, I found that the cost of driving was low and the driving experience was good. So, at the same price, I rented a house in a community with a better living environment, more convenient parking, and cheaper parking fees, which used to be close to the subway. I drive about 30,000 kilometers a year. Before, I used to stay at home every day during the holidays, but later I drove out to play. Anyway, the cost is very low."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "迈腾 380 ，到老丈人家先动筷，嘎嘎以嘎斯！",
          "en": "Magotan 380, start eating before anyone else at your father-in-law's house!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "迈腾真的在这个价位区间产品力没啥问题。",
          "en": "The Magotan really has no problems with its product power in this price range."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开的太少了，不建议买车，用的时候租一辆也好，买了车后续的开销非常非常多",
          "en": "You drive too little, I don't recommend buying a car. It's better to rent one when you need it. There are very, very many subsequent expenses after buying a car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今年春节调整上看到不少电动车，似乎充电问题有了明显改善我的车已经开了 12 年了，也考虑换车，纠结继续使用油车还是听劝换电车电车有里程焦虑（最大顾虑，怕麻烦）、电池寿命及其更换成本，油车相对成本高（但已经习惯）、不智能",
          "en": "I saw a lot of electric cars during the Spring Festival holiday this year, and it seems that the charging problem has improved significantly. I have been driving my car for 12 years and am also considering changing it. I'm struggling whether to continue using a gasoline car or listen to advice and switch to an electric car. Electric cars have range anxiety (the biggest concern, afraid of trouble), battery life, and replacement costs. Gasoline cars are relatively expensive (but I'm already used to it) and not smart."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议看看混动凯美瑞，丰田的 L2 还是很好用的。\r\n混动油耗不高，没有里程焦虑，安全系数还可以，保有量大，故障率低，养车成本低。高速行驶不存在堵颗粒捕捉器的问题。",
          "en": "I suggest looking at the hybrid Camry. Toyota's L2 is still very useful.\r\nHybrid fuel consumption is not high, there is no range anxiety, the safety factor is okay, the stock is large, the failure rate is low, and the cost of car maintenance is low. There is no problem of clogging the particulate trap when driving at high speed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用车频率这么低。建议直接买个三四万左右五六年车龄的二手燃油车   后续用车多。有新需求再上新车。 也能先练练技术",
          "en": "The frequency of car use is so low. I suggest directly buying a used gasoline car with a car age of five or six years for about 30,000 to 40,000 yuan. If you use the car more in the future, and there are new needs, then buy a new car. You can also practice your skills first."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1：长途主要是 上海-杭州 来回，估计 2 周一次左右；——如果是这个，建议不买车，建议 2 头打车，中间高铁。好处是既省钱，又轻松。2：平时上下班基本不用车；——这个就是不要买电车，因为电车放着不好。 3：希望要求 安全性，舒适性，稳定性好点的；——这个要求 B 级车以上，稳定性好要求轿车高速稳定性好，舒适性安全性配置可以考虑带智能驾驶（高速公路）功能项，比如丰田凯美瑞的智能领航，帕萨特的 Pilot 智能辅助驾驶系统，等等。结论：1. 最好不买车。2.一定要买车，买带部分智能驾驶功能的 B 级汽油车，混动也行，不买电车。",
          "en": "1: Long trips are mainly round trips between Shanghai and Hangzhou, estimated about once every 2 weeks; -- If this is the case, it is recommended not to buy a car, and it is recommended to take a taxi at both ends and a high-speed train in the middle. The advantage is that it saves money and is easy. 2: I usually don't use the car for commuting to and from work; -- This means don't buy an electric car, because it's not good to leave an electric car sitting. 3: I hope the requirements are safety, comfort, and stability; -- This requires a B-class car or higher, good stability requires a car with good high-speed stability, and comfort and safety configurations can consider intelligent driving (highway) functions, such as Toyota Camry's intelligent navigation, Passat's Pilot intelligent assisted driving system, and so on. Conclusion: 1. It is best not to buy a car. 2. If you must buy a car, buy a B-class gasoline car with partial intelligent driving functions, hybrid is also ok, do not buy an electric car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "合适的纯电车的使用成本会让你改变第一条和第二条，一个东西方便了以后的使用频率是会大大提高的，而不是像使用燃油车那样扣扣搜搜。",
          "en": "The cost of using a suitable pure electric car will make you change the first and second points. The frequency of use of something convenient will be greatly increased in the future, instead of being stingy like using a gasoline car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上海到杭州 200km 左右。 建议买纯电，来回一趟路上都不用充 激进点电都够用。相比燃油车同价位舒适性更好，你要是想要顿挫、操作感、超过 400km 的单程驾驶才会推荐你燃油车，稳定性 这价位的车放心开",
          "en": "Shanghai to Hangzhou is about 200km. It is recommended to buy a pure electric car. You don't even need to charge on the way back and forth. The electricity is enough if you are more aggressive. Compared with gasoline cars, the comfort is better at the same price. If you want frustration, handling, or more than 400km of one-way driving, I would recommend a gasoline car. The stability of cars at this price range can be driven with confidence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yvyvyv 纯电平时不开说是有损耗，想着买个家用车，估计 7 到 8 年都不要太操心，充电，续航一些问题，想想油车比较省心",
          "en": "@yvyvyv It is said that pure electric vehicles will have losses if they are not driven. I am thinking of buying a family car. It is estimated that I don't want to worry too much about charging and battery life issues for 7 to 8 years. Thinking about it, gasoline cars are more worry-free."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去试试插混车吧，先看看",
          "en": "Go try a plug-in hybrid car, take a look first."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fredweili 为啥不推荐存燃油，现在都放弃燃油了吗 哈哈哈",
          "en": "@fredweili Why not recommend stocking up on gasoline? Has everyone given up on gasoline cars now? Haha"
        }
      ],
      "type": "replies"
    }
  ]
}