{
  "id": 1113724,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "关于一次吵架产生的夫妻两个人谁控制大部分财产和遇到事情互相信任的问题",
          "en": "About the issue of which of the two spouses controls most of the property and mutual trust when encountering problems, arising from an argument."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "现在有很多家庭，大部分存款基本都是存在其中一个人的名下.\r\n可能当初约定的时候是基于无条件的信任，但是相处久了矛盾不可避免的会增加很多，当前的离婚率也能说明夫妻之间很难存在完全信任，毕竟那么多人说离也就离了。\r\n当初两个人把全部身家绑在一个家庭里，对方都要占有一半，甚至很多家庭是一个人独自管理绝大部分财产。\r\n一方面是浮躁的夫妻关系产生的越来越多的信任危机，一方面是对方对自己财产的占有现状，就像在走钢丝，一旦对方有了异心，你的财产不可避免的蒙受巨大损失，这种不安全感怎么平衡呢？",
          "en": "Nowadays, in many families, most of the savings are basically in the name of one person.\r\nPerhaps the initial agreement was based on unconditional trust, but as they live together longer, conflicts will inevitably increase. The current divorce rate also shows that it is difficult for complete trust to exist between husband and wife, after all, so many people say they will divorce and then they do.\r\nInitially, the two people tied all their assets to one family, and the other party would own half of it. In many families, one person manages most of the property alone.\r\nOn one hand, the increasingly fragile marital relationship creates more and more trust crises, and on the other hand, the current state of the other party's possession of their property is like walking a tightrope. Once the other party has a different heart, your property will inevitably suffer huge losses. How to balance this insecurity?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@gjw8u8 你被洗脑洗的很彻底 什么叫给你生儿育女？儿女 不是女方的孩子吗 你怎么知道女方不想要个孩子呢？",
          "en": "@gjw8u8 You have been completely brainwashed. What do you mean by giving birth to children for you? Aren't children also the woman's children? How do you know that the woman doesn't want children?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们是通过每月对账+平账来解决的首先是原则：1 财务消费完全透明，双方随时有权查看对方各种消费记录银行流水（但通常不会看，难得糊涂）2 大于 1000 的消费需要两人同意，小额直接花就行。",
          "en": "We solve it through monthly reconciliation + balancing. First, the principle: 1. Financial consumption is completely transparent, and both parties have the right to check each other's consumption records and bank statements at any time (but usually they don't look, it's rare to be confused). 2. Consumption greater than 1000 requires the consent of both parties, and small amounts can be spent directly."
        },
        {
          "zh": "3 婚后收入是夫妻共同财产，不是说多赚多花。",
          "en": "3. Income after marriage is the joint property of husband and wife, it doesn't mean you can spend more if you earn more."
        },
        {
          "zh": "4 财产共同保管，每人手里都有钱。",
          "en": "4. Property is jointly kept, and everyone has money in their hands."
        },
        {
          "zh": "操作层面：1 每月工资日后对账，得到家庭总资金，男方女方各自手里有多少，计算差额转账给对方，完成后二人手中的金额总是相等的。",
          "en": "Operational level: 1. Reconcile accounts after the monthly salary day to get the total family funds, how much the man and woman each have, calculate the difference and transfer it to the other party, and the amount in the hands of the two people is always equal after the completion."
        },
        {
          "zh": "每月开销可以从两月总资产差减去当月收入得到这样所有开支总是二人共同负担，公平。",
          "en": "Monthly expenses can be obtained by subtracting the monthly income from the difference in total assets in two months, so all expenses are always borne jointly by the two people, which is fair."
        },
        {
          "zh": "每人手里都有钱，平时花销方便。",
          "en": "Everyone has money in their hands, which is convenient for daily expenses."
        },
        {
          "zh": "每月对账保证每月大额花销立刻能发现，没有隐瞒空间。",
          "en": "Monthly reconciliation ensures that large expenses can be discovered immediately every month, and there is no room for concealment."
        },
        {
          "zh": "对于一些专项款项另立账户不参与上述计算，比如养娃买房基金婚前财产什么的# 平账模式的意义首先是原则：我认为，一个家庭，是家庭成员共同努力下构建的，每个人都对家庭有责任付出，贡献，同时也有权利保护自己的权益。",
          "en": "Some special funds are set up in separate accounts and do not participate in the above calculations, such as raising children, buying houses, funds, pre-marital property, etc. # The meaning of the balanced account model. First of all, the principle: I believe that a family is built by the joint efforts of family members, and everyone has the responsibility to pay and contribute to the family, and at the same time has the right to protect their rights."
        },
        {
          "zh": "并且，从人人平等角度，每个人都应该拥有 50%的权利和义务以这个基本原则出发，可以得到以下推论：挣钱应该平分（一起挣一起花，不管是道德还是法律，都应该这样）花钱应该各自有相同话语权（夫妻对家庭财产有平等的权利，所以理应有相同话语权）为了实现上述目标，平账是一个可靠，有效的解决方案：1 每月平账，确保收入平分收入自然共享，不会有某人每月向对方要钱影响自尊的行为2 每月平账，确保支出共同承担平时谁掏钱都一样异常大额每个月会立刻发现3 每人持有 50%资产，那么至少对于经济问题，可以确保每个人有平等话语权防止一方乱来的极端情况确保大额开销必须双方同意# 总结而平账系统就是为了解决上述矛盾，这个体系下，可以确保家庭收入永远共享，家庭支持永远共同承担，每个人都是有平等权利互相尊重平等的家庭成员。",
          "en": "Moreover, from the perspective of equality for all, everyone should have 50% of the rights and obligations. Starting from this basic principle, the following conclusions can be drawn: Earning money should be split equally (earn and spend together, whether it is moral or legal, it should be like this). Spending money should be have the same say (husband and wife have equal rights to family property, so they should have the same say). In order to achieve the above goals, balanced accounts are a reliable and effective solution: 1 Monthly balanced accounts ensure that income is split equally. Income is naturally shared, and there will be no behavior of someone asking the other party for money every month that affects self-esteem. 2 Monthly balanced accounts ensure that expenses are shared. It doesn't matter who pays for it usually. Unusually large amounts will be discovered immediately every month. 3 Each person holds 50% of the assets, so at least for economic problems, it can be ensured that everyone has equal say to prevent extreme situations where one party messes around and ensures that large expenses must be agreed upon by both parties. # Summary. The balanced account system is to solve the above contradictions. Under this system, it can be ensured that family income is always shared, family support is always jointly borne, and everyone is an equal family member with equal rights and mutual respect."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一但不信任就做不了夫妻了",
          "en": "Once there is no trust, you can't be husband and wife."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.不结婚，看透婚姻是现代制度高级包装下的买卖。",
          "en": "1. Don't get married, see through marriage as a transaction under the advanced packaging of the modern system."
        },
        {
          "zh": "2.如果买卖稀里糊涂做成了，中途发现亏损极大，及时止损，愿赌服输割肉离场。",
          "en": "2. If the transaction is confused, and you find that the loss is huge in the middle, stop the loss in time, be willing to bet and lose, and cut the meat to leave."
        },
        {
          "zh": "3.忍着，既然吃不了理性思考和决策的苦，抱怨而不解决，征求意见而不执行，那就继续忍受买卖的苦。",
          "en": "3. Endure it. Since you can't bear the suffering of rational thinking and decision-making, complain without solving, solicit opinions without implementing, then continue to endure the suffering of the transaction."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gjw8u8 #8  徐律师的含金量还在上升",
          "en": "@gjw8u8 #8 Lawyer Xu's gold content is still rising."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "燕冬萍的影响还在持续",
          "en": "Yan Dongping's influence is still continuing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我女我也讨厌要求男方工资上交的寄生虫，社会主义婚姻>封建主义婚姻>资本主义婚姻",
          "en": "As a woman, I also hate parasites who demand that men hand over their wages. Socialist marriage > feudal marriage > capitalist marriage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这种无条件信任的模式不行的。",
          "en": "This unconditional trust model won't work."
        },
        {
          "zh": "试试重新划定模式，罗列一下家庭的支出，彼此承担一部分，收入各管各的。",
          "en": "Try redefining the model, list the family's expenses, and each bear part of it, and manage your own income."
        },
        {
          "zh": "收入多的一方，可以稍微多承担点。",
          "en": "The party with more income can bear a little more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所有存款，房子全部在另一半名下，女人打算嫁给你，给你生儿育女，这个付出和牺牲是很大的，善待自己善待另一半，无原则性问题都不是事",
          "en": "All the savings and the house are in the name of the other half. If a woman plans to marry you and give birth to children for you, this is a great contribution and sacrifice. Treat yourself and treat the other half well. Non-principled issues are not a big deal."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gjw8u8 这种做法是赌对方不会出问题，一旦出了问题，瞬间人财两空",
          "en": "@gjw8u8 This approach is gambling that the other party will not have problems. Once a problem occurs, you will instantly lose both the person and the money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@tool2dx 法律不是绝对公平的，这里面可操作空间太大了",
          "en": "@tool2dx The law is not absolutely fair, and there is too much room for manipulation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "越穷的地方越笨的人，越喜欢互害，因为别个身上掉下来的就是自己口里的食量。",
          "en": "The poorer the place, the dumber the people, the more they like to harm each other, because what falls from others is the amount of food in their own mouths."
        },
        {
          "zh": "哈哈",
          "en": "Haha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在很多婚姻和家庭都是因果倒置：1 ，我因为信任你/爱你/和你过一生，所以愿意把钱给你/我作为家庭经济基础管理。",
          "en": "Many marriages and families are now reversing cause and effect: 1. Because I trust you/love you/spend my life with you, I am willing to give you the money/manage it as the economic foundation of the family."
        },
        {
          "zh": "2 ，我必须要把钱给你作为担保金，换取你信任我/爱我/和我过一生。",
          "en": "2. I must give you the money as a deposit in exchange for your trust/love/spending my life with me."
        },
        {
          "zh": "是 1 ，夫妻关系就很和谐，压根不会提这样的问题。",
          "en": "If it is 1, the relationship between husband and wife will be very harmonious, and such questions will not be raised at all."
        },
        {
          "zh": "是 2 ，这和谁管钱有个 P 关系，明明是感情与信任问题。",
          "en": "If it is 2, it has nothing to do with who manages the money. It is clearly a matter of emotions and trust."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yinmin 为什么默认女方不可能比男方赚得多？某些男这么恶臭吗",
          "en": "@yinmin Why is it assumed that women can't earn more than men? Are some men so disgusting?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yiroonli 这思想有点逆天",
          "en": "@yiroonli This idea is a bit rebellious."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yiroonli #28 相当一部分女的，就是你说的这种思维模式",
          "en": "@yiroonli #28 A considerable number of women have the mindset you described."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@K8dcnPEZ6V8b8Z6 不要嘴硬，绝大多数家庭都是男人赚的比女人多。",
          "en": "@K8dcnPEZ6V8b8Z6 Don't be stubborn, in most families, men earn more than women."
        },
        {
          "zh": "实事求是也是恶臭的话，请转小红书。",
          "en": "If being realistic is also disgusting, please go to Xiaohongshu."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "来了来了，v2 日常恐婚 1/1",
          "en": "Here it comes, v2 daily fear of marriage 1/1."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yiroonli #28 建议不要评价，直接逃离。",
          "en": "@yiroonli #28 It is recommended not to evaluate, just escape."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "收入各管各的，关于公共支出，支付宝小荷包设置了个家庭基金，两人每月各往里面转 4000 块，房租、房贷、柴米油盐等都从这里面出，偶尔出去搓一顿谁忘了用家庭基金支出，双方也不计较。",
          "en": "We manage our own income. For public expenses, Alipay Xiaobao set up a family fund, and both of us transfer 4000 yuan into it every month. Rent, mortgage, firewood, rice, oil, salt, etc. are all paid from this fund. Occasionally, if someone forgets to use the family fund to pay for a meal out, both parties don't mind."
        },
        {
          "zh": "有一些囫囵两可的支出，我就自己掏钱付了，我挣的比她多一点，多付出一点也是应该，更何况后面有小宝宝之后她的重心要转移到家庭上来。",
          "en": "For some ambiguous expenses, I paid for it myself. I earn a little more than her, so it's right to contribute a little more, not to mention that after the little baby comes along, her focus will shift to the family."
        }
      ],
      "type": "replies"
    }
  ]
}