{
  "id": 1109274,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "女友 23 岁民办三本钢琴专业毕业，希望能在北京找到一份对口专业工作，希望大家能给点建议",
          "en": "My girlfriend is 23 years old, graduated from a private tier-3 university with a piano major. She hopes to find a job in Beijing that matches her major. I hope everyone can give some advice."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "1 、b 站小圈比较知名的垂类知识 up 主，大概有不到 10w 粉丝，领域相对垂直，目前线上接了 2 个学生，大概每周有 300 左右的收入，但是收入必然是不稳定的。\r\n2 、考研某京 985 院校，还没出成绩，但是大概率凉了，楼主没想到女友部分抽象知识点的理解能力非常差，比如 主观/客观 这种基本名词都不能很轻松的理解，还有英语等文化课问题。\r\n3 、我自己目前对某一方面的业务知识相对比较了解，帮助她找了一些用增相关的运营实习工作，现在她已经有一段大厂工作经历+中厂工作经历。但是秋招颗粒无收，目前准备全力备战春招，希望大家能给些建议，是继续走 运营还是看看琴行这样的机会",
          "en": "1. She's a relatively well-known knowledge-based content creator (UP主) in a niche community on Bilibili (b 站), with a little under 100,000 followers. The field is relatively focused. She currently has 2 students online, with an income of about 300 RMB per week, but the income is definitely unstable.\r\n2. She took the postgraduate entrance exam for a 985 university in Beijing, but the results haven't been released yet. However, it's likely she didn't pass. I didn't expect my girlfriend to have a very poor understanding of some abstract knowledge points, such as basic nouns like 'subjective/objective,' and there are also problems with English and other academic subjects.\r\n3. I have a relatively good understanding of business knowledge in a certain area, and I helped her find some user growth-related operations internship opportunities. She now has a large company work experience + mid-sized company work experience. However, she didn't receive any offers in the autumn recruitment season. She's currently preparing for the spring recruitment season. I hope everyone can give some advice on whether to continue with operations or look at opportunities like piano shops."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "穿涼快點直播彈鋼琴",
          "en": "Wear something cool and livestream playing the piano."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "10w 粉丝不是很有搞头吗",
          "en": "Isn't 100,000 followers a good start?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不如直接开直播吧",
          "en": "Why not just start livestreaming?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "三本，大概率不是演奏，可能是音教之类的。一般这种专业不是培训班就是幼儿园小学老师。",
          "en": "Tier-3 university, most likely not performance-focused, probably music education or something similar. Generally, graduates of this major work in training institutions or as kindergarten/elementary school teachers."
        },
        {
          "zh": "但公办学校太卷，就算是音乐老师分分钟都是个音乐学院研究生毕业的。",
          "en": "However, public schools are very competitive; even music teachers are often graduates with master's degrees from music academies."
        },
        {
          "zh": "那就考虑教培机构，如果自己有房子了，小区里开个私家课招学生，个体户或者干脆私下转账收款，一般税务工商也查不到你头上，时间也比较自由。",
          "en": "Then consider private tutoring institutions. If you have your own house, you can start private lessons in the community, recruiting students as a self-employed individual, or simply receive payments privately via transfer. Generally, the tax and industry authorities won't be able to track you, and the time is relatively flexible."
        },
        {
          "zh": "店面或者连锁机构的话要求会高一些，工资也没多少，我家楼下有个几个毕业生合伙开的琴房，一周大概也就能排 20 个小朋友 x2 小时左右，他们都下午才上班，晚上就关门。",
          "en": "Brick & mortar or chained institutions have higher requirements, and the salary isn't much. Downstairs from my house, there are a few graduates who jointly opened a piano studio, and they can schedule about 20 children x 2 hours per week. They only start work in the afternoon and close in the evening."
        },
        {
          "zh": "灵活就业补贴生活还挺香的，但如果还无车无房要打拼未来的这点钱恐怕不够。",
          "en": "The flexible employment subsidy is quite appealing, but if you don't have a car or a house and want to build a future, this money probably won't be enough."
        },
        {
          "zh": "音乐专业的学历比互联网可重要太多了，如果能考无论如何也要考到个研究生以上。",
          "en": "A degree in a music major is much more important than in the internet industry. If possible, you must obtain a master's degree or higher."
        },
        {
          "zh": "音专的鄙视链是  音乐学院附小>央音上音>附中>星海浙音等音乐学院>硕士研究生>综合大学>其它本科。",
          "en": "The hierarchy of music majors is: Primary School affiliated with Music Academy > Central Conservatory of Music, Shanghai Conservatory of Music > Middle School affiliated with Music Academy > Xinghai Conservatory of Music, Zhejiang Conservatory of Music, etc. > Master's Degree > Comprehensive University > Other Bachelor's Degrees."
        },
        {
          "zh": "如果不提升一下，音乐专业路线是看不上的，那跨行业的话，说难听点艺考生高中都不咋学文化课，估计也就初中水平，直接否定了近 10 年的学习成果，也是不可取的。",
          "en": "If you don't improve yourself, the music major path won't be viable. Then, if you switch industries, to put it bluntly, art students don't study much academic subjects in high school, probably only at the junior high level. Directly negating nearly 10 years of learning results is also not advisable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@leena  如果我女朋友是愿意用身体换钱的话 不在我的择偶范围里面，类似的建议可以不用再说了。",
          "en": "@leena If my girlfriend is willing to use her body to exchange for money, that's not within my selection criteria. Please don't offer similar suggestions anymore."
        },
        {
          "zh": "三本并非就一无是处了，少些滤镜少些偏见吧",
          "en": "A tier-3 university doesn't mean it's completely useless. Less filters and less prejudice, please."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Danswerme 过去的辉煌和当下的困境无关",
          "en": "@Danswerme Past glory is irrelevant to the current predicament."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我很欣赏楼主对于女朋友的态度,没有遇到问题就放弃,会想着一起解决,伴侣不就是应该如此吗.虽然不能帮什么忙,还是想留下言.",
          "en": "I admire the poster's attitude towards his girlfriend. He doesn't give up when encountering problems but thinks about solving them together. Isn't that what a partner should do? Although I can't help much, I still want to leave a comment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作，不擦边的那种，教培是个还行的选择，网易 6000 ，其他 k12 教培机构 5500-6500 ，也可以开到 7000 ，就看面试怎么聊的，这都是底薪，擦边的话，很容易被炸号，如果用身体换钱，你得想好得病了怎么办，上瘾了以后正经的工作肯定是做不来了，洗白上岸结婚生子都不是太容易，在这个背景下，文科生和艺术生其实选择并不多，做油管现在也蛮卷的，不是太容易，抖音主播做的好不少，做的一般或者不好的更是大多数，顶部与底部差距很大，不过可以试试，毕竟年龄不大有试错机会",
          "en": "For work, something that doesn't involve suggestive content, the education and training industry is a decent option. NetEase pays 6000, other K12 education and training institutions pay 5500-6500, and some can offer up to 7000, depending on how the interview goes. This is all base salary. If you do suggestive content, it's easy to get your account banned. If you use your body to exchange for money, you have to think about what happens if you get sick. Once you get addicted, you definitely won't be able to do a proper job. It's not easy to get clean, get married, and have children. In this context, there aren't many choices for liberal arts and art students. Making content on YouTube is also very competitive and not easy. There are many Douyin (TikTok) hosts who do well, but there are even more who do average or poorly. The gap between the top and bottom is huge, but you can try it since you're still young and have room for trial and error."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉教培行业挺好的，天然是轻资产、高毛利的模式。",
          "en": "I feel that the education and training industry is quite good. It's naturally a light-asset, high-profit margin model."
        },
        {
          "zh": "轻资产模式也非常适合老师单干乃至做个人品牌，大机构也不敢把薪酬压价太狠。",
          "en": "The light-asset model is also very suitable for teachers to work independently or even build a personal brand. Large institutions don't dare to lower salaries too much."
        },
        {
          "zh": "教培雇员不仅是企业的劳动力，更是机构的资产。",
          "en": "Education and training employees are not only the company's labor force, but also the institution's assets."
        },
        {
          "zh": "相当于这个行业的核心雇员，在劳资谈判中天然具备双重优势。",
          "en": "It's equivalent to the core employees in this industry naturally having a double advantage in labor-management negotiations."
        },
        {
          "zh": "能在劳资谈判如此倾向于劳动者，其他任何行业很难比得上教培。",
          "en": "It's difficult for any other industry to compare with education and training in terms of labor-management negotiations being so inclined towards workers."
        },
        {
          "zh": "从家长的角度，这是有十万粉丝作为能力和信誉的背书，吸引力和竞争力都不错。",
          "en": "From the parents' perspective, having 100,000 followers as an endorsement of ability and credibility is a good attraction and competitive advantage."
        },
        {
          "zh": "从机构的角度，这是正经有大几年工作经验的应届生。",
          "en": "From the institution's perspective, this is a fresh graduate with several years of legitimate work experience."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有大型商演、国际赛事、留学经历，很难吸引想走专业路线的客户，它们的用户粘性非常高，也算是稳定收入了，但是可能不高，至少不会比 op 的月薪高。",
          "en": "Without large commercial performances, international competitions, or study abroad experience, it is difficult to attract customers who want to pursue a professional path. They have very high user stickiness, which can be considered stable income, but it may not be high, at least not higher than OP's monthly salary."
        },
        {
          "zh": "同样条件下，可以努力尝试留在高校，或者考证考中学。",
          "en": "Under the same conditions, you can try to stay in universities or take exams to become a middle school teacher."
        },
        {
          "zh": "但是目前条件不满足，跳过。",
          "en": "But the current conditions are not met, so skip it."
        },
        {
          "zh": "这其实是最理想的情况。",
          "en": "This is actually the ideal situation."
        },
        {
          "zh": "> b 站小圈比较知名的垂类知识 up 主...收入必然是不稳定的...有运营实习经验...目前准备全力备战春招重新整理了一下，更乐观的情况是，春招拿下中厂 offer ，这是主业，up 主继续做着，蹭风头更新曲目演奏提供谱子和相关的分析，抄一下其他垂直领域头部 up 是怎么带货（自己的课），算是在副业实践主业学到的部分内容。",
          "en": "> Relatively well-known vertical knowledge UP on station b...Income is bound to be unstable...Has operational internship experience...Currently preparing for the spring recruitment, sorting it out again, a more optimistic situation is that the spring recruitment will win the offer from the mid-size factory, which is the main business, and the UP will continue to do it, taking advantage of the trend to update the repertoire and provide the score and related analysis, and copy how the top UP owners in other vertical fields bring goods (their own classes), which is considered a subsidiary Business practice part of the content learned in the main business."
        },
        {
          "zh": "总之先考着等着吧，这都不是唯一的出路。",
          "en": "In short, take the exam and wait first, this is not the only way out."
        },
        {
          "zh": "> 不到 10w 粉丝...还是看看琴行这样的机会别。",
          "en": "> Less than 10w fans...Don't even look at opportunities like piano stores."
        },
        {
          "zh": "有中型 up 主这样的身份，更应该尝试靠自己去打开人脉和客户。",
          "en": "With the identity of a medium-sized up owner, you should try to open up contacts and customers on your own."
        },
        {
          "zh": "其他补充，如果圈子里有小型商演，op 对象能参与是最好，你本人也能出发见证瞬间维持感情，一举两得。",
          "en": "Other supplements, if there are small commercial performances in the circle, it is best for op objects to participate, and you can also set off to witness the moment and maintain the relationship, killing two birds with one stone."
        },
        {
          "zh": "蹲机会把握机会保持乐观就完事儿了 :)",
          "en": "Just squat for opportunities, seize the opportunities, and stay optimistic :)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你在这种男性为主的社区能问出来啥有价值的信息，他们想的就是多一个能白嫖的打飞机工具而已",
          "en": "What valuable information can you get from a predominantly male community like this? They're just thinking about another tool they can use to jerk off for free."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@GeruzoniAnsasu 感谢，是钢琴专业，之前和她聊过，离浙音进复试就差了 1 个名次，不过不管咋说都是技不如人吧。",
          "en": "@GeruzoniAnsasu Thank you, is the piano major, talked to her before, only 1 place away from the re-examination for Zhejiang Conservatory of Music, but no matter what, the skills are not as good as others."
        },
        {
          "zh": "二战这个事情我目前还是能够接受的，（老家那边基本上女性很多都居家带娃，所以我接受程度相对较高），但是她本人有些不能接受....",
          "en": "I am still able to accept the 2nd battle (many women in my hometown basically stay at home with their babies, so my acceptance is relatively high), but she herself cannot accept it...."
        },
        {
          "zh": "房子车子确实没有，这个还得再想想，不行后面就租个一室一厅的房子，开个私家课看看吧，再次感谢",
          "en": "I really don’t have a house or a car. I have to think about it again. If not, I’ll rent a one-bedroom apartment later and open a private class to see, thank you again."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "十万粉丝的话再养养号，能做成全职的",
          "en": "With 100,000 followers, if you nurture the account a bit more, you can make it a full-time job."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Tink 已经一年不更新了，现在每个月还有几百的收益，这个也是一个考虑的路子 感谢",
          "en": "@Tink It hasn't been updated for a year, and there are still hundreds of dollars in revenue every month, so this is also a route to consider. Thanks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://www.bilibili.com/video/BV1QoFbe4E95/?spm_id_from=333.337.search-card.all.click&vd_source=731899a64cb0892bf8c0da4113ff1f07擦边考虑吗？",
          "en": "https://www.bilibili.com/video/BV1QoFbe4E95/?spm_id_from=333.337.search-card.all.click&vd_source=731899a64cb0892bf8c0da4113ff1f07 Consider suggestive content?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wukaige 接受的朴素的价值观，暂时不支持我们做这种事情，也还没到这个地步。",
          "en": "@wukaige The simple values we accept don't currently support us doing this kind of thing, and it's not gotten to that point yet."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "10w 粉为什么不继续经营账号呢",
          "en": "Why not continue managing the account with 100k followers?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "做点课程卖线上课，线上线下一把抓",
          "en": "Create some courses and sell online classes. Do both online and offline."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "培训机构考虑吗，我前同事他对象自己开的培训机构",
          "en": "Are you considering training institutions? My former colleague's partner opened their own training institution."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同样运营试试油管呗，能随便搞 10w 粉，估计颜值跟水平都够，还不如好好经营下油管",
          "en": "Why not try running a YouTube channel with the same operations? If you can easily get 100,000 followers, your looks and skills are probably good enough. It's better to manage YouTube properly."
        }
      ],
      "type": "replies"
    }
  ]
}