{
  "id": 1111636,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "坐标杭州，想辞职转全职自媒体，顺带探索下其他行业，可行吗？",
          "en": "Located in Hangzhou, is it feasible to resign and switch to full-time self-media, and explore other industries along the way?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "想换个行业的原因是，我受够了这个行业的工作压力（需求、填坑、生产事故、deadline 、大小周 996 ），当我的精力被工作占掉 90%后，根本没心思做任何事，就连周末都在想下周的排期和技术方案，以及要填哪些坑，再加上所在公司的项目都非常复杂，脑子都要被干报废了，最近一直失眠，头发也开始脱落了。。",
          "en": "The reason I want to change industries is that I'm fed up with the work pressure of this industry (requirements, filling holes, production accidents, deadlines, big/small weeks 996). When 90% of my energy is taken up by work, I have no energy to do anything, and even on weekends I'm thinking about next week's schedule and technical solutions, and which holes to fill. In addition, the projects of the company I'm in are very complex, and my brain is about to be scrapped. I've been having insomnia lately, and my hair is starting to fall out.."
        },
        {
          "zh": "\r\n\r\n**为什么要选自媒体？**",
          "en": "\r\n\r\n**Why choose self-media?**"
        },
        {
          "zh": "\r\n之前做过自媒体，积累了 5w+粉丝，主要我想提高自己的影响力，未来影响力大的人肯定只有好处没坏处；",
          "en": "\r\nI have worked in self-media before and accumulated 50k+ fans. Mainly, I want to improve my influence. People with great influence in the future will definitely only have advantages and no disadvantages;"
        },
        {
          "zh": "\r\n另外我炒股亏了十几万，我觉得自己认知水平很差，想多读书修炼自己，至少要把认知提高一个度。",
          "en": "\r\nIn addition, I lost more than 100,000 in stock trading. I think my cognitive level is very poor. I want to read more books to cultivate myself and at least improve my cognition by one degree."
        },
        {
          "zh": "\r\n内容我想做计算机知识/历史民俗类科普，之前账号也是做这个的，出了几个爆款视频（播放量百万），现在想继续盘活那个账号。",
          "en": "\r\nI want to do popular science on computer knowledge/historical folklore. The previous account also did this, and several popular videos (millions of views) were produced. Now I want to continue to revive that account."
        },
        {
          "zh": "此外，自媒体是很自由的，而且产出的东西都是自己的",
          "en": "In addition, self-media is very free, and the content produced is your own."
        },
        {
          "zh": "\r\n\r\n**现状：**",
          "en": "\r\n\r\n**Current situation:**"
        },
        {
          "zh": "\r\n在家人的帮助下还完了房贷，手里还剩 5w （目前年入 40 ），房子租出去了，租金 6000/月（脱产后唯一的收入来源），未婚（其实我也不打算结婚了，已经上了买房的贼船，不想再上杠杆了）",
          "en": "\r\nWith the help of my family, I have paid off the mortgage. I have 50k left in my hand (currently an annual income of 40). The house is rented out, and the rent is 6000/month (the only source of income after leaving work). I am unmarried (in fact, I don't plan to get married anymore. I am already on the pirate ship of buying a house and don't want to add leverage)."
        },
        {
          "zh": "\r\n老家父母手里应该还有个 80w 左右，养老用，俩人都 55 岁，身体健康，父亲年收入 15~20w ，母亲没工作，农村户口无养老金，父母这边没啥需要我照顾的，甚至他们还一直在照顾我，时不时给我邮点老家的特产",
          "en": "\r\nMy parents in my hometown should still have about 800,000, for their retirement. They are both 55 years old and in good health. My father's annual income is 150,000 to 200,000, and my mother has no job, rural household registration and no pension. My parents don't need me to take care of them. They have even been taking care of me and occasionally send me some local specialties."
        },
        {
          "zh": "\r\n\r\n我这种情况和这种想法的可行性大吗？",
          "en": "\r\n\r\nIs my situation and this idea feasible?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "自媒体现在很难赚钱，现在工作的太累，可以先尝试混起来，混不了再换份轻松点的工作，同时业余时间再去把账号拾起来，看能不能做的起来，不建议直接全职去做。",
          "en": "It's difficult to make money with self-media now. If your current job is too tiring, you can try muddling through first. If you can't, then change to a more relaxed job. At the same time, pick up your account again in your spare time to see if you can make it work. I don't recommend going full-time directly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@meekBSD 收入高都是有代价的，我觉得工作时间长倒没啥，我们公司保洁一天工作 10 小时，但至少一半时间都在摸鱼，工作也并不复杂，并不会消耗掉一个人太多精力，但程序员不一样，高强度脑力劳动，真的吃不消，这是我越发想逃离的原因",
          "en": "@meekBSD High income always comes at a price. I don't think long working hours are a big deal. The cleaners in our company work 10 hours a day, but they loaf around for at least half the time. The work is not complicated and does not consume too much energy. But programmers are different. High-intensity mental work is really unbearable. This is the reason why I want to escape more and more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主又没什么经济负担，尝试一下有什么问题先把粉丝量搞起来再谈收入吧",
          "en": "The original poster has no financial burden, what's the problem with trying? Get the number of fans up first before talking about income."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这毫无负担，完全可以闯一闯。",
          "en": "You have no burden and can completely venture out."
        },
        {
          "zh": "我现在一把年纪，有家有口的，也在尝试玩一玩新媒体，对咱们这种手艺人来说，有一定的粉丝量，针对粉丝群体做点产品，形成良性循环，比一年一年做项目搞验收回款舒服多了。",
          "en": "I am old and have a family, and I am also trying to play with new media. For craftsmen like us, having a certain number of fans and making some products for the fan base to form a virtuous circle is much more comfortable than doing projects for acceptance and payment year after year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@n18255447846 他还余额不足呀, 这条件吊打 9 成 V2EX 不是问题吧",
          "en": "@n18255447846 He still has insufficient balance, isn't it no problem for this condition to beat 90% of V2EX?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "手里才 5 万，我觉得再工作两年，手里就有 80 万了",
          "en": "With only 50,000 in hand, I think you will have 800,000 in hand if you work for another two years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年入 40 ，手里只有 5 万，建议再干 2 年攒点本钱，好创业。",
          "en": "An annual income of 40, and only 50,000 in hand, it is recommended to work for another 2 years to save some capital for entrepreneurship."
        },
        {
          "zh": "工作丢了再找年入 48 万的工作可能不好找……",
          "en": "It may be difficult to find a job with an annual income of 480,000 after losing your job..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自媒体也得投入很多时间去把内容做好，只有一些头部能有较大收入， 主要看你需要的生活质量需要靠哪种收入维持。",
          "en": "Self-media also requires a lot of time to make the content well. Only some top players can have larger incomes. It mainly depends on what kind of income you need to maintain your quality of life."
        },
        {
          "zh": "如果现有工作真的消耗了你特别大精力，让你没法做自媒体，那是可以辞掉工作。",
          "en": "If your current job really consumes a lot of your energy and prevents you from doing self-media, then you can quit your job."
        },
        {
          "zh": "我觉得你现在的工作给你的收入其实还算高的。",
          "en": "I think the income from your current job is actually quite high."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有什么收入压力呀    加油",
          "en": "There is no income pressure, come on"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自媒体，没有专业团队的话，淘汰率很快的。",
          "en": "Self-media, without a professional team, the elimination rate is very fast."
        },
        {
          "zh": "能挣大钱的就头部一些大 V ！",
          "en": "Only some top KOLs can make big money!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想全职转自媒体的前提是在兼职自媒体的情况下能够有持续可观测的稳定的收入, 甚至能持平你当前的全职收入",
          "en": "The prerequisite for switching to full-time self-media is to have a continuous, observable, and stable income in the case of part-time self-media, and even be able to match your current full-time income"
        },
        {
          "zh": "你这个想法算是逃避啊, 自媒体也赚不了什么钱的, 都被头部拿走了",
          "en": "This idea of yours is an escape. Self-media can't make much money, it's all taken away by the top players."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可行的。 家里也不是没这条件。",
          "en": "Feasible. It's not like your family doesn't have the means."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可能需要考虑一下自己的内容的商业价值像楼主说的“历史民俗类科普”，可能比较难变现",
          "en": "You may need to consider the commercial value of your content. As the original poster said, \"popular science on historical folklore\" may be difficult to monetize."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就这条件，想做点啥，就做，加油吧",
          "en": "With these conditions, do whatever you want, come on"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主是想探索新方向，同时决定现在工作很消耗体力，脑力。",
          "en": "The original poster wants to explore new directions and also decided that the current job is very physically and mentally exhausting."
        },
        {
          "zh": "我觉得如果尝试学习用大模型或 AI 帮你解决问题，并从中摸索出一条让自己能更轻松且高效完成工作的方式，也是在探索，说不定也能成为你未来自媒体的素材。",
          "en": "I think if you try to learn to use large models or AI to help you solve problems, and explore a way to make your work easier and more efficient, it is also an exploration, and it may also become the material for your future self-media."
        },
        {
          "zh": "或者你可以把你现在的业务内容大致罗列出来， 让 AI 给你拆解一下，找出让你轻松起来的工具。",
          "en": "Or you can roughly list your current business content and let AI break it down for you and find the tools that can make you relaxed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这个完全可行啊，条件不差也不打算结婚，活着还是得追求舒服，要是都被牛马工作占满了还活着干啥。",
          "en": "This is completely feasible for you. Your conditions are not bad and you don't plan to get married. You still have to pursue comfort in life. If you are occupied by cow-and-horse work, what's the point of living."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自媒体是自由的这一点可能要调整下认知",
          "en": "The idea that self-media is free may need to be adjusted"
        },
        {
          "zh": "因为一旦全职自媒体，你就要保证更新频次",
          "en": "Because once you are a full-time self-media, you have to ensure the frequency of updates"
        },
        {
          "zh": "因为一停更，什么数据都没了，收入也没了",
          "en": "Because once you stop updating, all the data is gone, and the income is gone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "身体最重要！",
          "en": "Health is the most important thing!"
        },
        {
          "zh": "电视经常说最怕有钱无命享，40w 的年收入，压力肯定不会小。",
          "en": "The TV often says that the most fearful thing is having money but no life to enjoy. An annual income of 400,000 will definitely not be without pressure."
        },
        {
          "zh": "op 能有这收入，各种道理肯定都懂的，难的是迈出那一步。",
          "en": "The OP can have this income, so he must understand all kinds of truths, but the difficult thing is to take that step."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "余额不足，建议咬咬牙坚持下边看机会，先兼职一下再转全职",
          "en": "Insufficient balance, it is recommended to grit your teeth and persevere while looking for opportunities, first work part-time and then switch to full-time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉你的情况里面，自媒体确实是 成本最低的转型方式了，希望你能做出产品。",
          "en": "I feel that in your situation, self-media is indeed the lowest-cost way to transform, and I hope you can make a product."
        }
      ],
      "type": "replies"
    }
  ]
}