{
  "id": 1110189,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "业余时间学日语还是英语？",
          "en": "Should I learn Japanese or English in my spare time?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "V 友们，业余时间学点日语好，还是英语好？",
          "en": "V friends, is it better to learn some Japanese or English in my spare time?"
        },
        {
          "zh": "\r\n\r\n国内日企也挺多，但是英语用途更广泛",
          "en": "There are quite a few Japanese companies in China, but English is more widely used."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "绝对是英语，英语的广泛性秒杀日语",
          "en": "Definitely English. The versatility of English surpasses Japanese by far."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "英语大学已经学完了，干嘛继续学，除非你是外企，否则一辈子遇不到几个外国人，如果是外国人在中国就让他说中文好了",
          "en": "I've already finished learning English in university, why continue? Unless you work for a foreign company, you won't encounter many foreigners in your life. If a foreigner is in China, they should just speak Chinese."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看行业，IT 行业学英语。日企？你日语好，日本人认为你忠诚，但你英语好，日本人会崇拜你。",
          "en": "It depends on the industry. Learn English in the IT industry. Japanese companies? If your Japanese is good, the Japanese will think you're loyal, but if your English is good, they'll admire you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "学日语去日本玩能找日本小妹妹玩，体验不用文化，是一种玩乐使用的",
          "en": "Learning Japanese to go to Japan to play can let you find Japanese girls to play with and experience the unique culture. It's a fun and entertaining use."
        },
        {
          "zh": "学英语是为了去欧美赚高工资，赚钱用的",
          "en": "Learning English is for earning high salaries in Europe and America, which is for making money."
        },
        {
          "zh": "交叉学更好",
          "en": "Learning both in parallel would be best."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "润日本比润欧美容易",
          "en": "It's easier to move to Japan than to move to Europe and America."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你在哪，所在地日企多不多。",
          "en": "It depends on where you are and how many Japanese companies there are in your location."
        },
        {
          "zh": "还有未来规划，想不想去日本。",
          "en": "And your future plans, whether you want to go to Japan."
        },
        {
          "zh": "如果都没有就英语被，英语上学都学，会的人太多了。",
          "en": "If neither, then English. English is learned at school, and too many people know it."
        },
        {
          "zh": "不考个雅思、剑桥什么的根本凸显不了你的额外付出。",
          "en": "Without taking IELTS, Cambridge, or something similar, your extra effort won't stand out at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是日语吧，看片的时候用的到，会更爽",
          "en": "Probably Japanese, you can use it when watching movies, it will be more enjoyable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都在学，交叉着学不会枯燥",
          "en": "Learning both, learning them in parallel is not boring."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你英语底子咋样，有个基本的看英文新闻不太需要翻译的水平，那就差不多够用了。",
          "en": "It depends on your English foundation. If you have a basic level where you don't need to translate when reading English news, then that's good enough."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要知道欧洲的企业也是英语为主，加起来对比日企是数量级的多，英语才是搞钱之路",
          "en": "You should know that European companies are also mainly English-speaking. Compared to Japanese companies, there are orders of magnitude more of them. English is the way to make money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "日企正在撤退，前一阵好像看到新闻说在华日本人好像只有 XX 万了，降到多少年新低。",
          "en": "Japanese companies are retreating. I seem to have seen news recently that there were only XX0,000 Japanese people in China, a new low in many years."
        },
        {
          "zh": "如果在国内工作，不去日本工作学习，不特定做日本企业方向的话英语通用性应该更好。",
          "en": "If you work in China, don't go to Japan for work or study, and aren't specifically targeting Japanese companies, then English's versatility should be better."
        },
        {
          "zh": "另外日本人英文普遍还不错（虽然发音普通很差），遇上机会了和日本人交流大概率用英语也是可以简单交流的。",
          "en": "In addition, Japanese people's English is generally not bad (although the pronunciation is generally very poor). If you have the opportunity to communicate with Japanese people, you can probably communicate simply in English."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "英语，因为很多日企你说英语也是可以的",
          "en": "English, because you can speak English in many Japanese companies."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议都学，但优先级的话，没有工作需要就看兴趣爱好，语言这玩意需要大量的输入输出，如果没有兴趣或者工作作为支撑，等于没有应用的地方，永远没法学好",
          "en": "I suggest learning both, but for prioritization, if there's no work need, look at your interests and hobbies. This kind of language thing needs a lot of input and output. Without interest or work as support, there's no place to apply it, and you'll never learn it well."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你觉得什么有用就学什么呗，用不上的语言，一旦停止学习忘的也快。",
          "en": "Learn whatever you think is useful. If you don't use a language, you'll forget it quickly once you stop learning."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既然你说面向企业用途，那肯定是学英语啊。。。除非你更喜欢日语。",
          "en": "Since you said it's for business purposes, then it's definitely learning English... unless you like Japanese more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@murmur 口语这些还不熟练，达不到和外国人交流的阶段，我的问题写歧义了....",
          "en": "@murmur My spoken language skills are not yet proficient, and I haven't reached the stage of communicating with foreigners.  My question was ambiguously written...."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@luffy2u 大佬厉害",
          "en": "@luffy2u, you are awesome."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SakuraYuki 这个是的，立本算最容易的发达国家了(对普通人而言)",
          "en": "@SakuraYuki Yes, Japan is considered the easiest developed country (for ordinary people)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "除非经常有日语方面的沟通，或者有长期待那的打算，不然英语更划算，更广泛吧，短期去日本之类的也能用英语",
          "en": "Unless you have frequent Japanese communication, or plan to stay there for a long time, otherwise English is more cost-effective and widespread. You can also use English for short trips to Japan, etc."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "两手抓",
          "en": "Do both."
        }
      ],
      "type": "replies"
    }
  ]
}