{
  "id": 1110274,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "结束北漂 112 天了，定居在大理，关于之前与当下的一些随想",
          "en": "Ended my 112 days of living in Beijing, settled in Dali, some thoughts about the past and present."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "## 结局\r\n\r\n毕业 10 年，北京工作 8 年，期间换过 3 份工作，于 2024 年 10 月 18 日正式从前司拿礼包离职，2024 年 10 月 22 日，乘坐 8 点大兴直飞大理的飞机，彻底离开了这座工作过的城市。\r\n\r\n## 为什么是大理呢？\r\n\r\n女儿 19 年出生，之后我与妻、女、父母就住在廊坊香河的房子（妻子嫁妆，无贷款）里，自己北京租住合租单间，周末回家与家人相聚。22 年女儿上幼儿园后，我与妻子经常就家庭未来生活及孩子上学问题沟通，我们梳理出几个选项：\r\n\r\n- 1 、保持现状，北京上班，香河生活，将来孩子香河上私立小学\r\n- 2 、房子置换到天津，北京上班，天津生活，将来孩子在天津上学\r\n- 3 、妻子与孩子随父母回到老家保定下的县城生活与上学，我继续北京工作（妻子与我老家同是一个县城，父母在老家有一套房子足够全家使用）\r\n- 4 、举家移居大理，尝试在大理生活及上学，为了经济保障我还是先继续在北京上班（大理有一套小 2 居房子，18 年结婚时，妻子用彩礼和我们收到的份子钱加上我们的一点存款首付购买的，当作投资用的，已装修，可拎包入住，贷款后来已提前还清）\r\n\r\n做出第 4 项选择的理由我想很简单，我们厌倦了在北京的工作，不想卷了，也卷不动了，1 、2 、3 的未来可以望得见。第 4 项风险当然也最大，我们能适应那边的生活吗？一切都是未知，但可能也恰恰是风险与未知促使我们选择了它。\r\n\r\n## 付诸行动\r\n\r\n2023 年 6 月份，我们开始了迁移计划，打包行李，快递寄送，拜别亲友。我请了几天假陪着妻女父母以旅游的方式，途径太原、壶口瀑布到达西安。在西安分别自己坐上回北京的高铁的时候内心当然是五味杂陈的，望着高铁窗外夜幕下的北京城市森林，感受到的是巨大的疏离感。\r\n\r\n所幸，家人在大理的生活适应的比想象中的好，也快。女儿顺利上了小区周边幼儿园，和小区的小朋友们也交到了新朋友。妻子找到一家民宿管家的工作，还算满意。父母除了除了饮食还是有些许不习惯，其他都还算顺心，或许是归功于大理的空气，咳嗽的老毛病也减轻了。\r\n\r\n总的来说还算不错的开始，除了我与家人相隔的更远，陪伴的时间更少……\r\n\r\n## 契机的到来\r\n\r\n我是在 2024 年 10 月 10 日回北京的飞机上知道裁员的消息的。飞机起飞之前，我们组内的微信群里看到了同事聊天的信息，裁员范围很大，只留两个同事收尾，其他都走。同事们开玩笑说，我再不到公司，就再也不用去了。\r\n\r\n我想这可能真的是最后一次去北京了（至少是最近很长一段时间）。很早就知道这一刻早晚都会来到，我清楚知道我不属于那里，那个地方没有任何我所留恋的。我所失落和迷茫的，是对未来我在大理的工作以及我能否承担我对这个家庭的责任。\r\n\r\n公司的赔偿方案符合预期，N+1 （ 6 个月），10 月 18 日 last day ，10 月社保正常交，赔偿款税公司交。10 月 11 日到公司签赔偿协议，在北京的最后几天，和同事们聊聊天，告告别。处理自己的行李，退租等等等等。\r\n\r\n10 月 22 日，凌晨 5 点起床，拎着孤零零的行李箱，最后一次经过还未清醒的北京的街头。乘坐 8 点大兴直飞大理的飞机，彻底离开了这座工作过 8 年的城市。在这里我和妻子相识，在这里我的女儿出生，在这里我好像也曾奋斗过（哭笑）……\r\n\r\n## 现在\r\n\r\n到大理已经 3 个多月了，妻子多次问我是否习惯了大理的生活，我总是说好像还是有些迷迷糊糊的，不真实。一天一天总感觉浑浑噩噩，没实感，好像缺少了活生生的感觉，缺少了一种叫做“生命力”的东西。\r\n\r\n从上学到工作，从毕业到失业，10 多年了，我学会了一些，也忘了一些。我好像忘了该如何生活，踏踏实实的生活，每天与家人不分开的生活。更重要的是，充满生命张力的作为独立生命个体的活。\r\n\r\n2025 年 1 月 13 日入职了一家集团直营物流中心的 IT 运维岗，在大理这个地方，我对这份工作岗位还算满意，通勤时间开车 10 分钟。（薪资方面，我对妻子自我调侃说，还没我北京一个月的公积金多。）\r\n\r\n我还在适应的路上，对未来我仍然没有完全的信心，自己的心态还需要调整，落差还要去习惯。\r\n\r\n最后，我想对自己说：“向内，向上，努力去生活。”",
          "en": "## Ending\r\n\r\n10 years after graduation, 8 years working in Beijing, during which I changed 3 jobs. On October 18, 2024, I officially left my previous company with a severance package. On October 22, 2024, I took an 8 o'clock flight from Daxing directly to Dali, completely leaving the city where I used to work.\r\n\r\n## Why Dali?\r\n\r\nMy daughter was born in 2019. After that, my wife, daughter, and parents lived in a house in Xianghe, Langfang (my wife's dowry, no loan). I rented a shared single room in Beijing and went home on weekends to reunite with my family. After my daughter started kindergarten in 2022, my wife and I often communicated about the future life of the family and the issue of schooling for the child. We sorted out several options:\r\n\r\n- 1. Maintain the status quo, work in Beijing, live in Xianghe, and send the child to a private primary school in Xianghe in the future.\r\n- 2. Exchange the house for one in Tianjin, work in Beijing, live in Tianjin, and send the child to school in Tianjin in the future.\r\n- 3. The wife and child return to the county town under Baoding, the hometown of my parents, to live and study, and I continue to work in Beijing (my wife and I are from the same county, and my parents have a house in their hometown that is sufficient for the whole family).\r\n- 4. Move the whole family to Dali and try to live and study in Dali. For economic security, I will continue to work in Beijing first (there is a small two-bedroom house in Dali, which my wife bought with the bride price and the money we received as gifts when we got married in 2018, plus some of our savings as a down payment for investment purposes. It has been renovated, and we can move in with our bags. The loan has been paid off in advance).\r\n\r\nThe reason for making the fourth choice, I think, is very simple. We are tired of working in Beijing, we don't want to compete anymore, and we can't compete anymore. The future of 1, 2, and 3 is foreseeable. The risk of the fourth option is of course the greatest. Can we adapt to life there? Everything is unknown, but it may be precisely the risk and uncertainty that prompted us to choose it.\r\n\r\n## Taking action\r\n\r\nIn June 2023, we started the relocation plan, packing luggage, sending express delivery, and saying goodbye to relatives and friends. I took a few days off to accompany my wife, daughter, and parents on a trip, passing through Taiyuan and Hukou Waterfall to Xi'an. When I took the high-speed train back to Beijing from Xi'an, my heart was filled with mixed feelings. Looking at the urban forest of Beijing under the night sky outside the window of the high-speed train, I felt a huge sense of alienation.\r\n\r\nFortunately, my family has adapted to life in Dali better and faster than I imagined. My daughter successfully entered a kindergarten near the community and made new friends with the children in the community. My wife found a job as a housekeeper in a B&B, which is quite satisfactory. Except for some dietary unaccustomedness, my parents are doing well, perhaps thanks to the air in Dali, and the old problem of coughing has also been reduced.\r\n\r\nOverall, it was a good start, except that I am further away from my family and have less time to spend with them...\r\n\r\n## The arrival of opportunity\r\n\r\nI learned about the layoff news on the plane back to Beijing on October 10, 2024. Before the plane took off, I saw information from colleagues chatting in our group's WeChat group. The scope of the layoffs was very large, leaving only two colleagues to finish up, and everyone else was leaving. My colleagues joked that if I didn't go to the company again, I wouldn't have to go anymore.\r\n\r\nI think this may really be the last time I go to Beijing (at least for a very long time). I knew this moment would come sooner or later. I knew clearly that I didn't belong there, and there was nothing I missed about that place. What I lost and was confused about was my future job in Dali and whether I could bear my responsibility to this family.\r\n\r\nThe company's compensation plan met expectations, N+1 (6 months), October 18 last day, October social security was paid normally, and the company paid the compensation tax. I went to the company on October 11 to sign the compensation agreement. In the last few days in Beijing, I chatted with my colleagues and said goodbye. Handling my luggage, canceling the lease, etc., etc.\r\n\r\nOn October 22, I got up at 5 am, carrying a lonely suitcase, passing through the streets of Beijing for the last time before they woke up. I took an 8 o'clock flight from Daxing directly to Dali, completely leaving the city where I had worked for 8 years. Here I met my wife, here my daughter was born, and here I seemed to have struggled (laughing and crying)...\r\n\r\n## Now\r\n\r\nIt's been more than 3 months since I arrived in Dali. My wife has asked me many times if I am used to living in Dali. I always say that I still feel a little confused and unreal. Day after day, I feel confused, without a sense of reality, as if I lack a vivid feeling, lacking something called \"vitality.\"\r\n\r\nFrom school to work, from graduation to unemployment, for more than 10 years, I have learned some things and forgotten some things. I seem to have forgotten how to live, to live steadily, to live with my family every day. More importantly, to live as an independent individual full of life.\r\n\r\nOn January 13, 2025, I joined the IT operation and maintenance post of a group's directly-operated logistics center. In Dali, I am quite satisfied with this job position, and the commute is 10 minutes by car. (In terms of salary, I jokingly said to my wife that it is not as much as my housing provident fund in Beijing for a month.)\r\n\r\nI am still on the road to adaptation. I still don't have complete confidence in the future. I need to adjust my mentality, and I still need to get used to the gap.\r\n\r\nFinally, I want to say to myself: \"Inward, upward, and strive to live.\""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@linxb @Arainc 是的，我有我的人生，她有她的人生，我会是她生活的见证者，不是决策者。当然家庭的影响是很大的。如果将来她长大成人问我为什么没有给她更好的条件，我如果能堂堂正正对她说一句：“抱歉，可是爸爸也已经尽力活好自己的一生了。”我觉得我就非常了不起了。",
          "en": "@linxb @Arainc Yes, I have my life, and she has her life. I will be a witness to her life, not a decision-maker. Of course, the influence of the family is great. If she asks me why I didn't give her better conditions when she grows up, if I can tell her frankly, \"I'm sorry, but Dad has tried his best to live his own life well,\" I think I would be amazing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liu731 把小孩好好抚养成人，我们的义务也就尽到了，后边怎么活，是她的人生，我只能做到尽我所能的支持她，当她受伤，我们的家绝对是她的港湾",
          "en": "@liu731 Fulfilling our obligation is to raise our children well. How she lives after that is her life. I can only do my best to support her. When she is hurt, our home is definitely her haven."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你最大的优势其实是一直在支持你的妻子和她的家人，说实话这种支持力度一般人或者一般的家庭真没有，我想你应该对这个感到庆幸。真的很羡慕你们这些过的幸福的人类！",
          "en": "Your biggest advantage is that you have always supported your wife and her family. To be honest, this kind of support is not common among ordinary people or families. I think you should be grateful for that. I really envy you happy humans!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挺好的。北京没啥好留恋的，外地打工的都是 N 等公民，没有尊严，作为燃料耗尽了青春可得到些什么呢。",
          "en": "Very good. There is nothing to miss about Beijing. Migrant workers are Nth-class citizens, with no dignity. What can you get by using up your youth as fuel?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Respect ～。冒昧提问：OP 逃离了北京（一线），可是你的孩子将来可能还要走一遭，如何看待？",
          "en": "Respect～. A presumptuous question: OP has escaped from Beijing (a first-tier city), but your child may have to go through it in the future. What do you think?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liu731 这话说的，不在北上广深落户的都有罪？",
          "en": "@liu731 Are you saying that everyone who doesn't settle in Beijing, Shanghai, Guangzhou, or Shenzhen is guilty?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "非常牛逼，可以考虑搞个小红书记录一下生活，拍下来以后就算小红书倒闭了，也可以给孩子看",
          "en": "Very awesome, you can consider creating a Xiaohongshu account to record your life. Even if Xiaohongshu goes bankrupt after you film it, your child can still watch it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liu731 孩子有孩子的活法，op 自己可以逃离一线，为什么孩子不可以呢",
          "en": "@liu731 Children have their own way of life. OP can escape from first-tier cities, why can't children?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有舍才有得。OP 如果老想“大理得工资都没我在北京一个月公积金多”，在大理的生活可能也会放大很多烦恼。多想想“家人团聚”，“环境优美”，“工作轻松”等等，很多问题就迎刃而解了",
          "en": "You have to give up something to gain something. If OP always thinks, \"The salary in Dali is not as much as my housing provident fund in Beijing for a month\", life in Dali may also amplify many troubles. Think more about \"family reunion\", \"beautiful environment\", \"easy work\", etc., and many problems will be solved."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从 op 的描述中，我看到一个情绪稳定，遇到事情冷静分析、有想法有计划的妻子\r\n我想无论你在哪，赚多少钱，你以后都不会差。",
          "en": "From OP's description, I see a wife who is emotionally stable, calmly analyzes things when she encounters them, and has ideas and plans. I think no matter where you are or how much money you make, you will not be bad in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@imxiaoi 一生紧绷的中国人，恢复到略微正常一点的生活节奏会焦虑",
          "en": "@imxiaoi Chinese people who are tense all their lives will be anxious when they return to a slightly normal pace of life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "听到过外国人对中国人的评价，就是“拼命挣钱，不懂的为自己而活”。这句话虽然对我有所触动，但是总感觉自己不是很理解！中国人的骨子里有一种家的观念，我们所做的一切努力都是为了家里人，缺少对自我的关心。从小立志好好学习让父母有面子，长大立志要好好挣钱让孩子能过上好日子。如果不让我为了家人，从现在开始为了自己去生活，难道我应该闲下来？肯定不是闲下来，我也没有什么爱好呀，不抽烟喝酒烫头，也没有什么人生理想跟抱负，开上法拉利，迎娶白富美。如果我不努力工作，我的人生还有什么意思呢？我如果躺平，家里人可能就不需要我了，那我岂不就成了废人？ 所以我很疑惑，中国的男人们，除了责任与担当去拼命的挣钱，奋斗，到底什么才是正确的价值观，活出个自己喜欢的模样",
          "en": "I have heard foreigners' evaluation of Chinese people, which is \"desperately making money, not knowing how to live for themselves.\" Although this sentence touched me, I always feel that I don't quite understand it! Chinese people have a concept of family in their bones. All our efforts are for our family, and we lack self-care. From a young age, we are determined to study hard to make our parents proud. When we grow up, we are determined to make money to give our children a good life. If I am not for my family, and I start to live for myself from now on, should I be idle? Definitely not idle, and I have no hobbies, no smoking, drinking, or perming my hair, and I have no life ideals or ambitions, driving a Ferrari, and marrying a rich and beautiful woman. If I don't work hard, what is the point of my life? If I lie flat, my family may not need me, wouldn't I become a useless person? So I am very confused. For Chinese men, apart from responsibility and responsibility to desperately make money and struggle, what is the correct value, and how can we live the way we like?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不停地工作让人变得麻木，像个机器，很多人都得了“空心病”，找不到活着的意义和乐趣。很高兴看到你勇敢地迈出一大步，追求更有生命力的活法，祝好",
          "en": "Working non-stop makes people numb, like a machine. Many people have \"empty heart disease\" and cannot find the meaning and joy of living. I am very happy to see you bravely taking a big step to pursue a more vital way of life. I wish you all the best."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉不算怎么好的选择\r\n当然楼主本来就在那里有房子，孩子也小，试错成本也不大",
          "en": "It doesn't feel like a good choice. Of course, the poster already has a house there, and the child is young, so the cost of trial and error is not high."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "环境的本质是心境\r\n心换了，环境就换了\r\n当然，环境换了，心境也会换一些，但彻底的变换，可能是被动和痛苦的\r\nPS:我老家也是保定的",
          "en": "The essence of the environment is the mood. If the heart changes, the environment changes. Of course, if the environment changes, the mood will also change a bit, but the complete change may be passive and painful. PS: My hometown is also Baoding."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得大城市才是没有生命力..",
          "en": "I think big cities are lifeless.."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很勇敢，我放不下也习惯了大城市的生活，有时候光想想找个小城市安度余生就觉得恐慌",
          "en": "Very brave, I can't let go and I'm used to the life in big cities. Sometimes I feel panicked just thinking about finding a small city to live out my life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "等发现想吃的当地没有，想买的要等一周，看病医生不会，小孩啥都不学就老实了",
          "en": "Wait until you find that there is no local food you want to eat, you have to wait a week to buy what you want, the doctor doesn't know how to treat you, and the child becomes honest without learning anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@K8dcnPEZ6V8b8Z6 OP 说了为自己而活，说到做到，已经很伟大了。很多人拿着在大城市里拿高薪，收入一大半全拿来卖房，过几年失业和干电池也没啥区别。为别人活，不如为自己活。",
          "en": "@K8dcnPEZ6V8b8Z6 OP said he would live for himself, and he did what he said, which is already great. Many people take high salaries in big cities, and use most of their income to buy houses. After a few years, there is no difference between being unemployed and being a dry cell battery. It's better to live for yourself than to live for others."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 有善解人意的老婆 不惹事的父母 听话的小孩 op 很幸福  祝一家人健康幸福 天天开心",
          "en": "OP has an understanding wife, parents who don't cause trouble, and an obedient child. OP is very happy. I wish your family good health, happiness, and joy every day."
        }
      ],
      "type": "replies"
    }
  ]
}