{
  "id": 1109255,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "刚毕业就被上强度",
          "en": "Just graduated and already being put through the wringer"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "先介绍下背景吧，本人普本软工毕业，24 应届进了个杭州中厂(500 多人应该能算吧），后端开发，目前到手 9k 。父母都是职工。\r\n今年春节回家，父母突然跟我说要上交全部工资，我爹赌博欠了 30 多个没还，加上今年房子跌了，还想买房子，想让我去背房贷，因为他本人征信黑了。\r\n其实早就预料他们要我工资了，但是没想到说出来还是难以接受，除了生活费，剩下全得上交，吓得我直接把刚买的显示器和耳机全退了。本来开开心心过年的，听到以后要爆金币了，实在没有心情了，初二我就直接回杭州了。\r\n再说下工作的事吧，公司的效益就挺拉跨的，我一进来就降薪 15%，到手少了快 2k ，裁员+离职有 100 多人，感觉这公司没有前景，还干不过同行。但是领导还挺器重我的，对我的工作评价还行，绩效也给我打的优。朋友劝我跳槽，但我知道这根本不可能，现在环境不好，加上我应届变社招，没经验更是难于登天。\r\n毕业半年，实在是没存什么钱。以后得勒紧裤腰带过了，还好本人比较摆，没对象，对结婚生子没要求，他们还催我找对象，我只能呵呵了。\r\n感觉今后没有自由了，就像是我欠债了一样，不知道这种还钱的日子啥时候是个头。",
          "en": "Let me introduce the background first. I graduated from an ordinary undergraduate software engineering program in 2024 and joined a mid-sized factory in Hangzhou (500+ people, I guess), working as a backend developer, currently taking home 9k. Both my parents are workers.\r\nThis year when I went home for the Spring Festival, my parents suddenly told me to hand in all my salary. My dad owes more than 300,000 from gambling, plus the house price has dropped this year, and they still want to buy a house, wanting me to take out a mortgage because his credit is blacklisted.\r\nActually, I had expected them to ask for my salary, but I didn't expect it to be so unacceptable when they said it. Except for living expenses, the rest has to be handed in, which scared me so much that I returned all the display and headphones I just bought. I was originally happy to celebrate the New Year, but after hearing that I would have to 'explode gold coins' later, I really didn't have the mood, and I went directly back to Hangzhou on the second day of the new year.\r\nLet's talk about the work. The company's performance is quite poor. As soon as I joined, my salary was reduced by 15%, and my take-home pay was almost 2k less. More than 100 people have been laid off or resigned. I feel that this company has no prospects and cannot beat its peers. However, the leader still values me very much and the feedback on my work is okay, and my performance is rated as excellent. Friends advised me to change jobs, but I know this is impossible. The environment is not good now, and coupled with the fact that I have changed from a fresh graduate to social recruitment, it is even more difficult to reach the sky without experience.\r\nI really haven't saved much money after graduating for half a year. I have to tighten my belt in the future. Fortunately, I'm relatively laid-back, have no partner, and have no requirements for marriage and childbirth. They still urge me to find a partner, I can only say 'hehe'.\r\nI feel that I have no freedom in the future, as if I owe debts. I don't know when will this day of paying back the money end."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "切割你爹",
          "en": "Cut off your dad"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌狗的话一句都信不得，跑远点儿，不上交。 如果差生活物资可以帮着买，别的免谈",
          "en": "Don't believe a word a gambling addict says, run away, don't hand it over. If you need living supplies, I can help you buy them, but nothing else."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没必要把钱交给一个赌徒",
          "en": "There's no need to give money to a gambler."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你年轻，所以社会经验不多，从你的 append 的那一条来看，评论区的朋友说的话可能你也不会听，但是还是想劝一劝。赌博的爹：我是不相信赌狗的话的，所谓变好了不可信。见过赌博的男的，本身家庭条件很好，最后被弄的差不多家破人亡，问题是这个赌狗知道自己被做局了，他没有醒悟，而是也去学习怎么做局，怎么利用“高科技” 继续赌钱，期望一把回本。这几乎就是所有赌狗的共性。拎不清的妈：可以看出来，你妈也是管不住你爸的，没有自己的主见，被你爸忽悠几句就统一阵线了。自己男人这么靠不住，还要把自己的娃拉下水继续填坑吗？傻缺的你：工作方面，你别管公司效益怎么样，就是好好工作，好好锻炼技能，时刻准备着，也别放弃看其他的工作机会，你管公司倒闭不倒闭呢，这个不是我们打工仔可以决定的事情，你要做的就是“时刻准备着”，就算是被裁，也能有底气快速找到下家，你过硬的职业素养就是你唯一的底气。家庭方面，钱自己存。这个和你家里说好，钱你自己存，年底还债你去办这些事，只还银行的现在欠的债，后续增加的新债你一律不认（默认都是赌债），可以预想到你这样说，会迎来父母的暴怒和最恶毒的诅咒，但是你要明白小伙子，从你爸成为“赌狗”的那一刻起，你就是你们家新的顶梁柱了，他不配了（如果真的改过自新，先观察 5 年时间，把债还完，重新积累家业，让你看到改变再说，虽然我认为概率不大），年纪轻轻就接过这么大的责任，是没办法的。买房，都天崩开局了，还买个屁房。脑子清醒点。让老头先把债还完，积累一点积蓄再说吧。现在没地方住就租房子，如果真的痛改前非，一定会变好。不急一时。",
          "en": "You are young, so you don't have much social experience. Judging from the line you appended, you may not listen to what the friends in the comment area say, but I still want to persuade you. Gambling dad: I don't believe in the words of gambling addicts, the so-called getting better is not credible. I have seen men who gamble, whose family conditions were very good, and in the end the family was almost ruined. The problem is that this gambling addict knew that he was being framed, but he did not wake up, but instead learned how to set up a frame, how to use 'high technology' to continue gambling, hoping to make a comeback in one go. This is almost the commonality of all gambling addicts. Unclear mother: It can be seen that your mother can't control your father either, she has no opinion of her own, and she will unite with your father after being fooled by a few words. Your own man is so unreliable, and you still want to pull your own child into the water to continue filling the pit?\r\nStupid you: In terms of work, don't care how the company's performance is, just work hard, practice your skills well, be prepared at all times, and don't give up looking at other job opportunities. What do you care about whether the company goes bankrupt or not? This is not something that we wage earners can decide. What you have to do is 'be prepared at all times', even if you are laid off, you can have the confidence to quickly find another job. Your excellent professional skills are your only confidence. In terms of family, save your own money. Make it clear to your family that you save the money yourself, and you can take care of repaying the debts at the end of the year. Only repay the bank's current debts, and you will not recognize any new debts that are added later (defaulting to gambling debts). I can foresee that saying this will bring about your parents' rage and the most vicious curses, but you have to understand, young man, from the moment your father became a 'gambling addict', you are the new pillar of your family, he is not worthy (if he really repents and starts anew, observe for 5 years, repay the debts, and reaccumulate the family business, let you see the change before saying), it is impossible to take on such a big responsibility at a young age. Buying a house, it's already a disastrous start, why still buy a house? Be clear-headed. Let the old man repay the debts first and accumulate some savings. If you don't have a place to live now, rent a house. If you really repent, it will get better. Don't rush."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你年轻，所以社会经验不多，",
          "en": "You are young, so you don't have much social experience,"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从你的 append 的那一条来看，评论区的朋友说的话可能你也不会听，但是还是想劝一劝。",
          "en": "Judging from the line you appended, you may not listen to what the friends in the comment area say, but I still want to persuade you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌博的爹：我是不相信赌狗的话的，所谓变好了不可信。",
          "en": "Gambling dad: I don't believe in the words of gambling addicts, the so-called getting better is not credible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "见过赌博的男的，本身家庭条件很好，最后被弄的差不多家破人亡，",
          "en": "I have seen men who gamble, whose family conditions were very good, and in the end the family was almost ruined."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "问题是这个赌狗知道自己被做局了，他没有醒悟，而是也去学习怎么做局，怎么利用“高科技” 继续赌钱，期望一把回本。",
          "en": "The problem is that this gambling addict knew that he was being framed, but he did not wake up, but instead learned how to set up a frame, how to use 'high technology' to continue gambling, hoping to make a comeback in one go."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这几乎就是所有赌狗的共性。",
          "en": "This is almost the commonality of all gambling addicts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拎不清的妈：可以看出来，你妈也是管不住你爸的，没有自己的主见，被你爸忽悠几句就统一阵线了。",
          "en": "Unclear mother: It can be seen that your mother can't control your father either, she has no opinion of her own, and she will unite with your father after being fooled by a few words."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己男人这么靠不住，还要把自己的娃拉下水继续填坑吗？",
          "en": "Your own man is so unreliable, and you still want to pull your own child into the water to continue filling the pit?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "傻缺的你：工作方面，你别管公司效益怎么样，就是好好工作，好好锻炼技能，时刻准备着，也别放弃看其他的工作机会，你管公司倒闭不倒闭呢，这个不是我们打工仔可以决定的事情，你要做的就是“时刻准备着”，就算是被裁，也能有底气快速找到下家，你过硬的职业素养就是你唯一的底气。",
          "en": "Stupid you: In terms of work, don't care how the company's performance is, just work hard, practice your skills well, be prepared at all times, and don't give up looking at other job opportunities. What do you care about whether the company goes bankrupt or not? This is not something that we wage earners can decide. What you have to do is 'be prepared at all times', even if you are laid off, you can have the confidence to quickly find another job. Your excellent professional skills are your only confidence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "家庭方面，钱自己存。",
          "en": "In terms of family, save your own money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个和你家里说好，钱你自己存，年底还债你去办这些事，只还银行的现在欠的债，后续增加的新债你一律不认（默认都是赌债），可以预想到你这样说，会迎来父母的暴怒和最恶毒的诅咒，但是你要明白小伙子，从你爸成为“赌狗”的那一刻起，你就是你们家新的顶梁柱了，他不配了（如果真的改过自新，先观察 5 年时间，把债还完，重新积累家业，让你看到改变再说，虽然我认为概率不大），年纪轻轻就接过这么大的责任，是没办法的。",
          "en": "Make it clear to your family that you save the money yourself, and you can take care of repaying the debts at the end of the year. Only repay the bank's current debts, and you will not recognize any new debts that are added later (defaulting to gambling debts). I can foresee that saying this will bring about your parents' rage and the most vicious curses, but you have to understand, young man, from the moment your father became a 'gambling addict', you are the new pillar of your family, he is not worthy (if he really repents and starts anew, observe for 5 years, repay the debts, and reaccumulate the family business, let you see the change before saying), it is impossible to take on such a big responsibility at a young age."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买房，都天崩开局了，还买个屁房。",
          "en": "Buying a house, it's already a disastrous start, why still buy a house?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "脑子清醒点。",
          "en": "Be clear-headed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让老头先把债还完，积累一点积蓄再说吧。",
          "en": "Let the old man repay the debts first and accumulate some savings."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在没地方住就租房子，如果真的痛改前非，一定会变好。",
          "en": "If you don't have a place to live now, rent a house. If you really repent, it will get better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不急一时。",
          "en": "Don't rush."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你爹是个无底洞，亲爹娘难以切割，但也有办法。少回家，多哭穷。不能说工资实数。就说自己找不到工作，送外卖养活自己很难，杭州生活成本高，最近又流感了，去趟医院 2000 多没了，一直编。你爸看形式不行自己会想办法的，赌狗自身自灭吧，你也做个长期打算，一直独立，家里靠不住，不可能给你买房，你也装穷别管赌债。",
          "en": "Your dad is a bottomless pit, it's hard to cut off from your own parents, but there are ways. Go home less often, and complain about being poor more often. Don't tell the real amount of your salary. Just say that you can't find a job, it's hard to support yourself by delivering food, the cost of living in Hangzhou is high, and there's a flu recently, a trip to the hospital costs more than 2000, just keep making it up. If your dad sees that the situation is not good, he will find his own way. Gambling addicts will self-destruct, you should also make a long-term plan, stay independent, your family is unreliable, they won't be able to buy you a house, you pretend to be poor and don't care about gambling debts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关于恋爱，你有年龄优势，你现在一个月花 4000 元，5000 给你父母，你爸妈自己在去赚点钱，估计 2 年多就还完了.恋爱的话，打扮打扮自己，多去逛一逛，找女人其实不需要钱太多钱的，反而靠钱找的女人都是垃圾。",
          "en": "Regarding love, you have an age advantage. You spend 4000 yuan a month now, and give 5000 to your parents. Your parents will have to earn some money themselves, and it is estimated that they will be paid off in more than 2 years. For love, dress yourself up, go out and wander around more. Finding a woman doesn't actually require too much money. On the contrary, women found with money are trash."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跟我刚毕业一样, 天崩开局, 那几年过年回去都有人上门要账, 历历在目我当时做法可以参考下: 就是绝不上交, 没得商量, 生活费可以隔一段打几百几千我自己这些年攒了点还支援家里还了十几个; 如果上交, 可能不仅债没还, 一分也攒不下赌徒的话一句也别信",
          "en": "Same as when I just graduated, a disastrous start. In those years, people came to the door to collect debts during the New Year. I still remember it vividly. You can refer to my approach at that time: that is, absolutely do not hand it over, there is no discussion. I give a few hundred or a few thousand for living expenses from time to time. I have saved a little bit over the years to support my family and repay a dozen. If you hand it over, not only will the debt not be repaid, you won't be able to save a penny. Don't believe a word a gambler says."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拒绝啊，这经济环境下，大额欠债还想买房子，纯属脑子被门夹了。你是成年人了，需要有自己的规划，自己的决策，怎么可能无脑为别人的不理智决策买单，哪怕这个别人是你父母。你先想想，你的收入凭什么上缴？你父亲欠赌债让他自己想办法，别掺和，赌狗不可能回头的，小心自己也被拉入泥潭。你独善其身，你的赌狗父亲走投无路的时候，你还能给他口吃的，让他能有基本的生存保障。建议做好你自己的事，别管他们。自己的钱自己存着，自己规划。",
          "en": "Refuse, in this economic environment, wanting to buy a house with a large debt is purely idiotic. You are an adult, you need to have your own plans, your own decisions, how can you blindly pay for other people's irrational decisions, even if that other person is your parents. Think about it first, why should your income be handed over? If your father owes gambling debts, let him find his own way, don't get involved. A gambling addict will never turn back, be careful not to be dragged into the mud. Take care of yourself, when your gambling father has no way out, you can still give him something to eat, so that he can have basic living security. It is recommended to do your own thing, don't care about them. Save your own money, plan your own life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@biglee0304 能赌博欠 30w 的赌狗，你指望 ta 家里人会奋斗？",
          "en": "@biglee0304 A gambling addict who owes 300k from gambling, do you expect their family to work hard?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "打不过就加入，说自己也赌，欠了 20 多个哈哈哈哈",
          "en": "If you can't beat them, join them, say you also gamble and owe more than 200k hahaha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一般来说，儿子 没有法律义务 代替父亲偿还赌博欠下的债务，除非存在以下几种特殊情况：债务是父子共同承担的如果儿子作为共同借款人、担保人，或者共同签署了债务合同，那他可能需要承担责任。遗产继承的情况下如果父亲去世，儿子作为继承人 接受遗产，那么在遗产范围内需要清偿父亲的合法债务。但如果遗产不足或儿子放弃继承，则无须承担债务。赌博债务是否合法？ 根据不同国家和地区的法律，赌博债务可能不受法律保护，比如非法赌博的债务可能不会被法院支持。债务涉及恶意转移财产如果父亲为了逃避债务，将财产转移给儿子（如赠与房产、存款等），债权人可以申请撤销转移，要求儿子返还财产用于偿还债务。如何保护自己？不做共同借款人或担保人，避免承担责任。注意父亲是否有恶意转移财产，避免被债权人追溯。遗产继承时谨慎选择，如果债务超过遗产，考虑放弃继承。",
          "en": "Generally speaking, sons have no legal obligation to repay debts incurred by their father's gambling, unless there are the following special circumstances: The debt is jointly borne by the father and son. If the son is a joint borrower, guarantor, or jointly signed the debt contract, then he may need to be responsible. In the case of inheritance, if the father dies and the son accepts the inheritance as the heir, then the legal debts of the father must be cleared within the scope of the inheritance. But if the inheritance is insufficient or the son gives up the inheritance, he does not need to bear the debt. Is gambling debt legal? According to the laws of different countries and regions, gambling debts may not be protected by law, such as debts from illegal gambling may not be supported by the court. Debt involves malicious transfer of property If the father transfers property to his son (such as donating real estate, deposits, etc.) in order to evade debt, the creditor can apply to revoke the transfer and require the son to return the property to repay the debt. How to protect yourself? Do not be a joint borrower or guarantor to avoid liability. Pay attention to whether the father has maliciously transferred property to avoid being traced by creditors. Choose carefully when inheriting the estate. If the debt exceeds the estate, consider giving up the inheritance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接和原生家庭切割吧，不过看你的性格，没那么强势，比较顺从父母，那真无解了。希望多年后你再回看这个帖子",
          "en": "Just cut ties with your original family, but judging from your personality, you are not that strong and more obedient to your parents, so there is really no solution. I hope you will look back at this post many years later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌博的人是不会改的。这次 30w 下次就是 60w 。我家是直接离了。而且条件是帮他把之前欠的还了。离了之后就别联系。",
          "en": "Gamblers will not change. This time it's 300k, next time it will be 600k. My family divorced directly. And the condition was to help him repay what he owed before. Don't contact him after the divorce."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "财政大权才是话语权，钱还是握在自己手里吧，至少不会陷入被动",
          "en": "Financial power is the power to speak, keep the money in your own hands, at least you won't be in a passive position."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@HL8 31 楼正解，处事老道，OP 参考一下。@kz3ebr 欠谁的钱不是关键，关键是因何而欠。你把你爸的钱还清了，你放心，赌狗还有再欠的一天。让他自己还是最优解，赌桌下的苦多感受一下还容易完全戒赌。",
          "en": "@HL8 31st floor is the correct answer, experienced in dealing with things, OP should refer to it. @kz3ebr The key is not who you owe the money to, but why you owe it. Even if you pay off your dad's money, rest assured, the gambling addict will still owe it one day. Letting him do it himself is still the best solution. Experiencing the suffering under the gambling table a little more will make it easier to quit gambling completely."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "害，第一次发这么长的，为什么换行没有了",
          "en": "Ah, this is the first time I've posted something so long, why are there no line breaks?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "三十万不多，家里一起奋斗几年就好了，主要是看父母的态度，如果是生硬强制的要钱，说明父母有很大问题，考虑把话挑明，让他们知道你不是好拿捏的，说句难听的，这年头欠钱的人多了，何况是赌资，看看他们敢不敢告吧。如果父母真的悔过自新不再赌钱了，而且欠的还是家乡亲戚朋友，这种最好还是还掉吧，不然家乡都呆不下去了，一定不能再赌了，不然赌博这个事情是无底洞，可能还了三十万还有源源不断的三十万要还。。。",
          "en": "300,000 is not a lot, the family can work together for a few years and it will be fine, the main thing is to look at the parents' attitude. If they are stiff and force you to ask for money, it means that the parents have a big problem. Consider making it clear to them and let them know that you are not easy to manipulate. To put it bluntly, there are many people who owe money these days, let alone gambling debts. See if they dare to sue. If your parents really repent and no longer gamble, and they owe money to relatives and friends in their hometown, it is best to pay it back, otherwise they will not be able to stay in their hometown. They must not gamble again, otherwise gambling is a bottomless pit, and after paying 300,000, there may be a constant stream of 300,000 to pay back..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“我爹赌博欠了 30 多个没还”展开说说",
          "en": "'My dad owes more than 300k from gambling and hasn't paid it back' Tell us more about it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kz3ebr 如果手里有些钱，可以考虑买房，不过刚毕业买房根本不着急；反而工作，公司持续效益不好，后边会持续裁员的，上交工资就算了吧...",
          "en": "@kz3ebr If you have some money in hand, you can consider buying a house, but there is no rush to buy a house just after graduation; on the contrary, the company's continued poor performance will lead to continuous layoffs later, so just forget about handing over your salary..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌博 30 个，还要买房子。楼主仔细想想",
          "en": "Gambling debts of 300k, and still want to buy a house. Think carefully, OP."
        }
      ],
      "type": "replies"
    }
  ]
}