{
  "id": 1110071,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大学没有独立卫浴这件事？",
          "en": "The matter of universities not having private bathrooms?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "虽然已经毕业了好几年，但是回忆起大学四年还是非常痛苦。\r\n\r\n当年在山东上大学，没有独立卫浴也没有空调。\r\n\r\n夏天一到，一晚上不停地出汗，然后早上 8 点去上课，特别害怕自己身上有汗味。\r\n\r\n再加上我个人不愿意去大澡堂，于是我每天都要坐公交车 3 站，去有隔间的健身房洗澡。\r\n\r\n说实话，不知道自己怎么熬过来的。",
          "en": "Although I graduated several years ago, recalling my four years of university is still very painful.\r\n\r\nI went to university in Shandong back then, and there were no private bathrooms or air conditioning.\r\n\r\nWhen summer came, I would sweat all night long, and then go to class at 8 am, and I was especially afraid that I would smell of sweat.\r\n\r\nPlus, I personally didn't want to go to the public bathhouse, so every day I had to take the bus 3 stops to the gym with cubicles to take a shower.\r\n\r\nTo be honest, I don't know how I got through it."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "别听上面那些说什么发展中国家之类的 p 话。",
          "en": "Don't listen to the nonsense about developing countries and the like."
        },
        {
          "zh": "就是校方不把学生当人看，建独立卫浴，装空调这些事和学校每年挥霍出去的钱相比都是毛毛细雨 ...",
          "en": "It's just that the school doesn't treat students as human beings. Building private bathrooms and installing air conditioners are just a drop in the bucket compared to the money the school squanders every year..."
        },
        {
          "zh": "有些人可能觉得我也是大澡堂，也是 6/8 人间宿舍这么过来的，怎么轮到你就要叫苦！",
          "en": "Some people may think that I also came from a public bathhouse, and a 6/8 person dormitory. Why are you complaining now!"
        },
        {
          "zh": "我只能说你活该一辈子受虐...",
          "en": "I can only say that you deserve to be abused for the rest of your life..."
        },
        {
          "zh": "所谓\"从来如此，便对么？\"",
          "en": "So-called, 'Is it right just because it has always been like this?'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@trungdieu031 #15 一看就是粪清言论。",
          "en": "@trungdieu031 #15 It's obviously a粪清opinion."
        },
        {
          "zh": "国内住宿费千元左右一年，你对比下国外的。",
          "en": "Domestic accommodation fees are about 1,000 yuan a year. Compare it with foreign countries."
        },
        {
          "zh": "另外你就看到撒钱了，没看到赚的么？",
          "en": "Besides, you only see the money being spent, but don't you see the money being earned?"
        },
        {
          "zh": "这部分不好说就是了。",
          "en": "It's hard to say about this part."
        },
        {
          "zh": "不懂的话，想想平时礼尚往来的事，就懂了",
          "en": "If you don't understand, think about the usual exchanges of gifts, and you will understand."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "留学生宿舍有，价格跟普通宿舍还差不多。",
          "en": "Dormitories for international students are available, and the price is about the same as ordinary dormitories."
        },
        {
          "zh": "就是不舍得给韭菜花钱。",
          "en": "They just don't want to spend money on韭菜(students)."
        },
        {
          "zh": "福利缺失就是还在发展，收__时就跟国际接轨。",
          "en": "The lack of welfare means it is still developing, but it is in line with international standards when collecting (fees)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@duli950523 建卫浴的钱肯定有的，但是建新楼的钱真未必有，其实大学和很多地方政府是一样的，都是欠了大量外债的，这种情况不能简单用穷富来定义。",
          "en": "@duli950523 There must be money to build bathrooms, but there may not be money to build new buildings. In fact, universities are the same as many local governments. They all owe a lot of foreign debts, so this situation cannot be simply defined by rich or poor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "山东作为 gdp 排行前列的大省高校宿舍条件之差，令人怀疑 gdp 注水程度。",
          "en": "The poor dormitory conditions of universities in Shandong, a major province with a high GDP ranking, make people suspect the degree of GDP inflation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你知道农村养狗吗?",
          "en": "Do you know how dogs are raised in rural areas?"
        },
        {
          "zh": "农村养狗就是想起来就喂一下,想不起来就不用管.",
          "en": "Raising dogs in rural areas means feeding them when you remember, and you don't have to worry about them when you don't remember."
        },
        {
          "zh": "北方基建就是差劲.",
          "en": "The infrastructure in the north is just poor."
        },
        {
          "zh": "你到南方广东 看下, 四人间寝室,上床下桌,空调 + 独立卫生间(洗澡可以用)",
          "en": "If you go to Guangdong in the south, you will see four-person dormitories, bunk beds with desks underneath, air conditioning + private bathroom (you can take a shower)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@WilliamColton #69我没有冷嘲热讽。",
          "en": "@WilliamColton #69 I am not being sarcastic."
        },
        {
          "zh": "基建是一个烧钱的工作，而且当今财政困难。",
          "en": "Infrastructure is a money-burning job, and the finances are difficult today."
        },
        {
          "zh": "高校的拨款是从好高校到差高校、从经济发达地区到不发达地区，挨个递减的。",
          "en": "The appropriations for universities decrease one by one from good universities to poor universities, and from economically developed areas to underdeveloped areas."
        },
        {
          "zh": "而且一般来讲好学校的本科生是能够享受到独立卫浴的。",
          "en": "And generally speaking, undergraduates from good schools can enjoy private bathrooms."
        },
        {
          "zh": "你说为啥经济落后、差高校的学生，或者说高年级/研究生不配享受独立卫浴么？",
          "en": "Why do you say that students from economically backward or poor universities, or senior/graduate students, are not worthy of enjoying private bathrooms?"
        },
        {
          "zh": "教育拨款就那么点，住宿费就那么点，钱从哪来？",
          "en": "There is so little education funding, so little accommodation fees, where does the money come from?"
        },
        {
          "zh": "赤字搞么？",
          "en": "Run a deficit?"
        },
        {
          "zh": "过去十年赤字搞基建不是搞成了这样子了么？",
          "en": "Hasn't running a deficit to build infrastructure in the past ten years resulted in this?"
        },
        {
          "zh": "与其喷高校没有独立卫浴，不如老实承认：舍不得掏钱租房，想白嫖又嫖不到。",
          "en": "Instead of complaining that universities don't have private bathrooms, you should honestly admit that you are reluctant to pay to rent a house, and you want to get something for free but can't get it."
        },
        {
          "zh": "你看现在读研，一些地方的高校已经撑不下学生了，补贴学生租房住，不是还有很多埋怨贵么？",
          "en": "Look at graduate studies now. Some local universities can't support students anymore and subsidize students to rent houses, but aren't there still many complaints about the high prices?"
        },
        {
          "zh": "至于说国外为什么可以？",
          "en": "As for why foreign countries can?"
        },
        {
          "zh": "比下住宿费吧，要不就比高校的住宿费与周边市场化的房子租金，这样公平些。",
          "en": "Compare the accommodation fees, or compare the accommodation fees of universities with the rents of surrounding market-oriented houses, which is more fair."
        },
        {
          "zh": "对了，你可能也不知道，高校的水电费、医保、食堂也是有补贴的。",
          "en": "By the way, you may not know that universities also subsidize water and electricity fees, medical insurance, and cafeterias."
        },
        {
          "zh": "这些，统统都要钱。",
          "en": "All of these cost money."
        },
        {
          "zh": "你要说，我怎么感受不到？",
          "en": "You may say, how can I not feel it?"
        },
        {
          "zh": "因为总量看也不多，资金的效率也不高。",
          "en": "Because the total amount is not much, and the efficiency of the funds is not high."
        },
        {
          "zh": "但这钱是实实在在的掏出来了。",
          "en": "But this money is really taken out."
        },
        {
          "zh": "你要说，为什么留学生宿舍这么好？",
          "en": "You may ask, why are the dormitories for international students so good?"
        },
        {
          "zh": "一方面政策倾斜，另一方面留学生才多少人，一万人的开销跟一百人的开销总量能一样么？",
          "en": "On the one hand, there is policy inclination, and on the other hand, how many international students are there? Can the total expenses of 10,000 people be the same as the expenses of 100 people?"
        },
        {
          "zh": "你要说，我不管，中国高校住宿条件就是烂，贪污腐败，渣渣。",
          "en": "You may say, I don't care, the accommodation conditions in Chinese universities are just bad, corruption, scum."
        },
        {
          "zh": "或许终究有一天高校会鼓励学生租房住吧。",
          "en": "Perhaps one day universities will encourage students to rent houses."
        },
        {
          "zh": "发泄情绪并没用，实事求是看问题，看自己想的那种是不是能解决问题。",
          "en": "Venting emotions is useless. Look at the problem realistically and see if what you want can solve the problem."
        },
        {
          "zh": "我才不偏袒高校，我只是厌恶既要又要的人",
          "en": "I don't favor universities, I just hate people who want everything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也讨厌出汗和汗味，所以我能理解楼主的难受，但是我认为楼主也能理解到这种难受是出于个人习惯。",
          "en": "I also hate sweating and the smell of sweat, so I can understand the poster's discomfort, but I think the poster can also understand that this discomfort is due to personal habits."
        },
        {
          "zh": "一个发展中国家，大学没有独立卫浴，并不是什么难以理解或者需要讨论的事吧。",
          "en": "In a developing country, it is not difficult to understand or discuss the fact that universities do not have private bathrooms."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan 这个跟发展中有什么关系啊？",
          "en": "@coderluan What does this have to do with being developing?"
        },
        {
          "zh": "南方大学都有独立卫浴啊。",
          "en": "Universities in the South all have private bathrooms."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "\"再加上我个人不愿意去大澡堂\"，这才是关键吧，本来去澡堂就行，入乡随俗。",
          "en": "'Plus, I personally don't want to go to the public bathhouse,' this is the key. Originally, going to the bathhouse would be fine, when in Rome, do as the Romans do."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跟南北穷不穷没关系，看学校愿不愿意给学生花钱。",
          "en": "It has nothing to do with whether the North and South are poor or not, it depends on whether the school is willing to spend money on students."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@duli950523 钱肯定是有的， 但是不能用来建卫浴。",
          "en": "@duli950523 There is definitely money, but it cannot be used to build bathrooms."
        },
        {
          "zh": "从利益驱动的角度来看，改善普通学生的住宿环境，不能给各级领导带来任何政绩。",
          "en": "From the perspective of profit-driven, improving the living environment of ordinary students cannot bring any political achievements to leaders at all levels."
        },
        {
          "zh": "如果现在要新建， 那肯定要按现代的设计。",
          "en": "If it is to be newly built now, it must be designed according to modern standards."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "杠精很多。",
          "en": "There are many trolls."
        },
        {
          "zh": "承认住宿条件差有这么难吗？",
          "en": "Is it so difficult to admit that the accommodation conditions are poor?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "什么大学",
          "en": "What university?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "二十多年前，南方某发达省份城市，某 985 大学，有的宿舍有独立卫浴有的没有，但都没有空调。",
          "en": "More than 20 years ago, in a developed province in the South, a certain 985 university, some dormitories had private bathrooms and some did not, but none had air conditioning."
        },
        {
          "zh": "留学生宿舍除外。",
          "en": "Except for the dormitories for international students."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想起我大学洗澡时，怀里夹个脸盆放上洗漱用品后，每个寝室踢门进去问有没有要去洗澡的，最后呼啦啦一群人跑去洗澡，洗完一起吃饭，洗澡的时候吹吹牛逼，感觉挺好的。",
          "en": "I remember when I took a shower in college, I put toiletries in a washbasin in my arms, kicked the door of each dormitory and asked if anyone wanted to take a shower. In the end, a group of people ran to take a shower, ate together after washing, and boasted during the shower. It felt pretty good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我大学时只有澡堂子，天冷才去。",
          "en": "When I was in college, there was only a bathhouse, and I only went there when it was cold."
        },
        {
          "zh": "洗澡都是拿个盆在厕所，两排水龙头，天热每晚都是这么洗的。",
          "en": "I took a basin in the toilet to take a shower, with two rows of faucets. I took a bath like this every night when it was hot."
        },
        {
          "zh": "也没空调，拿个席子铺地上睡",
          "en": "There was no air conditioning, so I put a mat on the ground to sleep."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个不是和经济发展，当地习俗之类的有关？",
          "en": "Isn't this related to economic development and local customs?"
        },
        {
          "zh": "如果是外地人，遇到这事是失算了。",
          "en": "If you are from another place and encounter this situation, you have miscalculated."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@seafog 在全国经济占比中，南方大概是北方的两倍呀，所以南方一些较差的大学也是没有独立卫浴的啊。",
          "en": "@seafog The South accounts for about twice the share of the national economy as the North, so some of the poorer universities in the South do not have private bathrooms."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就是生活习惯问题，北方大多数情况下洗澡次数就是比南方少，且水资源不丰沛，所以独立卫浴显得不那么经济，当然也和北方的澡堂文化相关。",
          "en": "It's a matter of living habits. In most cases, people in the north take baths less often than people in the south, and water resources are not abundant, so private bathrooms seem less economical. Of course, it is also related to the bathhouse culture in the north."
        },
        {
          "zh": "不过现在也与时俱进了，很多学生也把独立卫浴纳入择校考察，北方现在也有学校同时提供单独洗浴与公共洗浴相结合的了，一个个小单间这样。",
          "en": "However, it has also kept pace with the times. Many students have also included private bathrooms in their school selection considerations. Some schools in the north now also provide a combination of separate bathing and public bathing, with individual small rooms."
        }
      ],
      "type": "replies"
    }
  ]
}