{
  "id": 1108942,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "高速上保持安全车距也会被称为龟速车么...",
          "en": "Is maintaining a safe distance on the highway also called driving too slowly..."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "过完年开高速,依然是各种牛鬼蛇神,有左右穿插的,有走应急车道的,有紧跟前车屁股对刹车信心爆棚的.",
          "en": "After the New Year, driving on the highway still presents all sorts of problems; some vehicles weave left and right, some use the emergency lane, and some tailgate with excessive confidence in their brakes."
        },
        {
          "zh": "与之不同的是这次副驾坐了个'老司机',一路辩论下来不吐不快.",
          "en": "What's different this time is that the passenger seat was occupied by an 'old driver', and after a debate along the way, I have to vent."
        },
        {
          "zh": "#### 先说我的开车风格:",
          "en": "#### First, let me talk about my driving style:"
        },
        {
          "zh": "1. 前面没车时,最左侧保持上限+5%行驶.",
          "en": "1. When there are no cars in front, I drive in the leftmost lane at the speed limit + 5%."
        },
        {
          "zh": "1. 车流量一般时,最左侧保持前车车距 30-50m.速度视前车而定.",
          "en": "2. When traffic flow is moderate, I maintain a distance of 30-50m from the car in front in the leftmost lane. Speed depends on the car in front."
        },
        {
          "zh": "1. 车流量大时,中间车道(3 车道)或者右车道(2 车道)行驶,保持车距 30m.速度视前车而定.",
          "en": "3. When traffic flow is heavy, I drive in the middle lane (3-lane) or the right lane (2-lane), maintaining a distance of 30m. Speed depends on the car in front."
        },
        {
          "zh": "就这样,我被各种插队.",
          "en": "Even with this, I'm still cut off by other drivers frequently."
        },
        {
          "zh": "有时候插队车辆实在太过极限,忍不住骂几句.",
          "en": "Sometimes when the vehicles cutting me off are too extreme, I can't help but curse a few times."
        },
        {
          "zh": "然后老司机说:活该,谁叫你开这么慢.",
          "en": "Then the old driver would say: 'Serves you right, who told you to drive so slowly?'"
        },
        {
          "zh": "## **大哥,不是我开车慢,是 tm 前面有车啊,安全车距是吃 S 的?**",
          "en": "## **Dude, it's not that I'm driving slowly, it's because there are cars in front, are safe distances just for show?**"
        },
        {
          "zh": "说白了,路上很多车跟那么近,大概 10m 左右?",
          "en": "To put it bluntly, many cars on the road follow at such a close distance, about 10m?"
        },
        {
          "zh": "前车一旦急刹,是 100%追尾的.",
          "en": "If the car in front suddenly brakes, it’s 100% a rear-end collision."
        },
        {
          "zh": "100-0 刹车距离 40m 以内都是相当优秀了的车了.",
          "en": "A braking distance of within 40m from 100-0 is considered quite excellent."
        },
        {
          "zh": "你跟个 10m,这是对自己反应速度和刹车有多自信?",
          "en": "Following at 10m, how confident are you in your reaction speed and braking?"
        },
        {
          "zh": "说白了,我是真不想出事故,结合我的工作情况,我觉得我的时间很值钱.",
          "en": "To be honest, I really don't want to have an accident, and considering my work situation, I think my time is very valuable."
        },
        {
          "zh": "另外我是真怕死.",
          "en": "Also, I'm really afraid of dying."
        },
        {
          "zh": "所以我要为那些被骂成龟速车的说句话,**大部分情况下真不是不想开快,是前面有车啊...**",
          "en": "So, I want to speak up for those who are called slow drivers, **in most cases it's really not that we don't want to drive fast, it's because there are cars in front...**"
        },
        {
          "zh": "ps:前面一眼望不到车,还开不到上限的,这种换我遇到我也骂!",
          "en": "ps: If there are no cars in sight, and you still can't drive at the speed limit, I'd curse too if I encountered that!"
        },
        {
          "zh": "ps2:高速 200m 车距说实话非常不现实,但是 30m 都做不到的,早晚得出事.",
          "en": "ps2: Maintaining a 200m distance on the highway is honestly unrealistic, but if you can't even do 30m, you'll get into trouble sooner or later."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "为什么前面有车？",
          "en": "Why are there cars in front?"
        },
        {
          "zh": "就是因为你这种长期占用最左车道的人。",
          "en": "It's because of people like you who occupy the leftmost lane for a long time."
        },
        {
          "zh": "如果我在最左车道，只要后面有车靠近就会尽量提速或者变线让开。",
          "en": "If I'm in the leftmost lane, I'll try to speed up or change lanes to give way as soon as a car approaches from behind."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那是老子留的安全车距，不是狗洞",
          "en": "That's the safe distance I'm keeping, not a dog hole"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "限速 120 ，前车 80 ，然后你跟着前车保持 80 ，还在左车道，那不是乌龟车是啥啊...",
          "en": "Speed limit is 120, the car in front is going 80, and you follow the car in front at 80, still in the left lane, what else can we call that but a slowpoke..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那当然，老司机眼里没有摄像头就要干 240 ，低于这个速度都是乌龟",
          "en": "Of course, in the eyes of old drivers, if there's no camera, they'll go 240, anything slower is a turtle"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ERvISTyP #9 哥.2025 年了...已经没有超车道这一说了.",
          "en": "@ERvISTyP #9 Dude. It's 2025... There's no such thing as an overtaking lane anymore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "路上都是超你的 大概率是你开慢了",
          "en": "If everyone on the road is overtaking you, you're likely driving slowly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最左侧车道一般是超车道，你不超车占着超车道干啥？",
          "en": "The leftmost lane is generally for overtaking, if you're not overtaking, what are you doing occupying the overtaking lane?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老司机开车都不喜欢前后左右有车。",
          "en": "Old drivers don't like having cars in front, behind, or on either side."
        },
        {
          "zh": "懂的都懂。",
          "en": "You know what I mean."
        },
        {
          "zh": "如果有多辆车超越你，应该反思下是不是自己开的“太慢”了，无论是否超速，你都应该避开车流。",
          "en": "If multiple cars overtake you, you should reflect on whether you're driving 'too slowly', regardless of whether you're speeding, you should avoid the traffic flow."
        },
        {
          "zh": "不要并行，勇敢给油。",
          "en": "Don't drive parallel, be brave and hit the gas."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼上这群人，春节有开过车吗？",
          "en": "Have those people above driven during the Spring Festival?"
        },
        {
          "zh": "春节的高速，连续几十公里都是密密麻麻的车流，你能超到哪去啊。",
          "en": "On the highway during Spring Festival, there's dense traffic for dozens of kilometers, where can you overtake?"
        },
        {
          "zh": "你在车流里面变来变去，不就是最讨厌的那群人吗。",
          "en": "Changing lanes in the traffic is exactly what the most annoying people do, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "虽然导致车速慢的根因不是你，但你没有催促前车加速或变道超车，这种情况对后面所有的车包括你自己都会形成安全隐患",
          "en": "Although the root cause of the slow speed isn't you, but you haven't urged the car in front to speed up or change lanes to overtake. This situation creates a safety hazard for all the cars behind, including yourself"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@whathappen #8 你前面有车,提个锤子速啊.撞上去?",
          "en": "@whathappen #8 There's a car in front of you, what speed are you going to raise? Crash into it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "理想的情况：内道卡着限速至上浮 20%以内动态速度，大家保持好车距，浮动速度主要是为了不与第二车道并排，更讲究点的看到后视镜有抽象速度上来的会并线让行大哥你先走别撞上我（德国风格）现实的情况：内侧一车道 3 成上述规矩老司机，6 成龟速牛鬼蛇神，1 成不打灯变道刀片哥中间车道 60kph 抱着方向盘/打电话说笑五五开最外侧车最少能开的最快，但是到了出入口八成概率碰到怠着速就从匝道直接并入的怪物/横跨三条车道下高速。",
          "en": "Ideal scenario: The inner lane sticks to the speed limit, fluctuating within 20%, everyone maintains a good distance, floating speeds are primarily to avoid driving parallel in the second lane. Those who are more particular will see from the rearview mirror that a car is approaching fast and will merge to let it pass, 'Brother, you go first, don't hit me' (German style). Realistic scenario: 30% of the rules-abiding old drivers in the inner lane, 60% slowpokes and weirdos, 10% lane-changing maniacs without signaling. The middle lane is 60kph, holding the steering wheel / talking and laughing at 50/50. The outermost lane can drive the fastest, but at entrances and exits there is an 80% probability of encountering monsters who enter directly from the ramp without accelerating / cross three lanes to exit the highway. "
        },
        {
          "zh": "SSR：横跨三条车道 45 度斜插下高速到路口发现下早了几个急刹车后怠速并线回到中间内侧车道",
          "en": "SSR: Cross three lanes at a 45-degree angle to exit the highway, realize you exited too early at the intersection and after a few hard brakings, merge back to the middle inner lane at idling speed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人经验，高速上别呆在车团里，每一分钟都很危险。",
          "en": "Personal experience, don't stay in a car group on the highway, every minute is dangerous."
        },
        {
          "zh": "只要一辆车出错，基本都逃不掉。",
          "en": "If one car makes a mistake, you basically can't escape."
        },
        {
          "zh": "我一般开快车，不喜欢车团，有条件我就超；没条件就跟车走，看情况保持车距，都走不了的情况就不给后车变道空间，有条件变道往前走。",
          "en": "I usually drive fast, I don't like car groups, if conditions allow, I'll overtake; if not, I'll follow the car, maintain a safe distance depending on the situation, and in situations where we can't move, I won't provide space for the car behind to change lanes, but when conditions allows, I'll change lanes and move forward."
        },
        {
          "zh": "我的原因慢的话，我会保持前后左右的车距，给后车变道空间和主动避让。",
          "en": "If the reason for my slowness is related to me, I will maintain a distance from the cars ahead, behind, and on either side, giving the following car space to change lanes and actively avoid them."
        },
        {
          "zh": "形成车团原因是前面有慢车。",
          "en": "The reason for forming a car group is that there's a slow car in front."
        },
        {
          "zh": "两车道下，最前面一个慢车，另外一个车道也会有个速度差不太多的车，左右车距也少。",
          "en": "Under two lanes, if there's a slow car in front, the other lane will also have a car with a similar speed difference, with a short distance from either side."
        },
        {
          "zh": "后面的几辆车不超车，或者就变个道，又压缩了前后车距。",
          "en": "The following cars don't overtake, or just change lanes, which compresses the distance."
        },
        {
          "zh": "所以很多车就不得不连续变道，刀片超车。",
          "en": "Therefore, many cars have to change lanes continuously, passing like blades."
        },
        {
          "zh": "连续变几个超过去，前面几公里都是空的，干嘛要呆在这团危险里面。",
          "en": "After changing lanes for a few overtakes, the next few kilometers will be empty, why bother staying in this group of danger?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xubingok #22 超前车啊。。",
          "en": "@xubingok #22 Overtake the car in front.."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ERvISTyP #12 啊.左车道现在不能巡航了么...",
          "en": "@ERvISTyP #12 Ah. Can't cruise in the left lane anymore..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不想超车只想跟车的话，尽量把左侧车道留出来。",
          "en": "If you don't want to overtake and just want to follow the cars, try to leave the left lane clear."
        },
        {
          "zh": "如果大部分人都能做到这点的话，你说的左右穿插之类的现象也会减少。",
          "en": "If most people can do this, the phenomenon of weaving left and right that you mentioned will also decrease."
        },
        {
          "zh": "也是对自己安全的一种保障。",
          "en": "It's also a guarantee of your own safety."
        },
        {
          "zh": "右侧车道遇到前面比自己慢的，自己也方便超车，超完车再变回右侧（或者中间）车道。",
          "en": "When you encounter a car in the right lane that's slower than you, it's also easier for you to overtake, and then change back to the right (or middle) lane after overtaking."
        },
        {
          "zh": "这样子大家通行效率都会提高。",
          "en": "This way, everyone's traffic efficiency will be improved."
        },
        {
          "zh": "而不是左侧前面一个龟车，自己也跟着一路巡航~",
          "en": "Instead of having a slow car in front in the left lane, and following it along all the way~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "主要是并排吧， 不怕你慢，就怕你并排走，最怕你和大车一块并排，这个是真的烦",
          "en": "It’s mainly about driving side by side, I'm not afraid of you being slow, I'm afraid of you driving side by side. I'm most afraid of driving side by side with large vehicles, that's really annoying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ERvISTyP  国内没有超车道，上世纪老司机口口相传知识该更新了。",
          "en": "@ERvISTyP There are no overtaking lanes in China, the knowledge passed down by old drivers from the last century needs to be updated."
        },
        {
          "zh": "最左限速 120 ，人家顶着上限 + 5% 跑，你还要超他你就超速了。",
          "en": "Speed limit is 120, and they are running at the upper limit + 5%, if you still want to overtake them, you're speeding."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有时候会在高速上进入一种状态：1. 与前车车距太小，于是我降低车速2. 后车看到我降低车速，于是觉得我慢，选择超我车3. 后车超车后，我与前车的车距进一步降低，于是我选择更慢以保持车距循环 2 、3…………------------------而且，因为慢了，这个时候会发现：1. 左右车道大家都很快，很难变道2. 自己车道后面的所有车都在超自己------------------我觉得这个时候就得提速跳出循环了",
          "en": "Sometimes on the highway, you enter a state: 1. The distance to the car in front is too small, so I reduce my speed. 2. The car behind sees me reducing my speed, so they think I'm slow and choose to overtake me. 3. After the car behind overtakes, the distance to the car in front decreases further, so I choose to drive even slower to maintain the distance. Repeat step 2 and 3...------------------And, because I'm slow, at this time I'll find: 1. Everyone in the left and right lanes is very fast, it's hard to change lanes. 2. All the cars behind me in my lane are overtaking me.------------------I think it's time to speed up and break out of the loop at this point."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看了所有评论，51 楼总结的很好啊，也是我自己开车几年下来的经历，到最后就是安全第一，即使驾驶技术越来越好，看过各种事故新闻后结合每个人自身的不同经历就知道，生命绝对是第一。",
          "en": "I've read all the comments, and the summary on the 51st floor is very good, it’s also my experience in driving for several years, and in the end, safety is the first priority, even if my driving skills are getting better and better, after seeing various accident news combined with everyone's different experiences, you know that life is definitely number one."
        },
        {
          "zh": "所以大概看了 OP 的描述和回复，还是很赞同 OP 的驾驶风格，安全第一，安全距离同等重要，因为路上每个人风格完全不一样，选择一个最保险的策略没有问题。",
          "en": "So, I generally examined OP's description and replies, and I still very much agree with OP's driving style, safety comes first, and a safe distance is equally important, because everyone on the road has a completely different style, so choosing the safest strategy is right."
        },
        {
          "zh": "就好比有些人非要抢红绿灯的最后一秒，正确做法是每个路口即便是绿灯都要减速观察，防的就是一万种情况下碰到的那一次。",
          "en": "It's like some people have to rush the last second of the traffic light, the correct approach is to slow down and observe at every intersection, even if it's a green light, just to prevent that one time out of ten thousand."
        },
        {
          "zh": "开车有几年，个人见解：0. 开车需要思考，即便是每天开的路，也能总结规律得出经验，并且可以运用到以后到不同地区的开车经验1. 平时开车时，判断路上车流慢是否因为有龟速车，选择安全地超过这一团车流即可2. 平时开车时，判断路上车流慢是否因为真的堵车，根据路况选择对应车道，同时根据车况保持对应安全距离；如果是高速堵车，因为速度较快，根据前方距离和刹车灯亮起范围提前准备减速+双闪（或雾灯）3. 让速不让道，错位开车，四面八方都要随时观察，灵机应变4. 和其他车在某个区间内匀速行驶时，随时观察他们的轮胎和车道是否保持平行，如果有变道趋势，及时躲开5. 不同地区开车风格不一，不同路段开车风格也不一，不论怎么开，保证自己安全是第一6. 心态要稳，不轻易动怒，冷静开车，不要分神7. 长时间驾驶，提前睡好休息好，不要等到感觉犯困了再找服务区我碰到的路况：1. 高速最左侧龟速车，一堆车 120 开个 100 不到，非常离谱，基本上都是 2 道右侧超车再看情况回左侧，真的左侧很多情况都是龟速车而他们不自知2. 高速碰到并排龟速，保证安全距离情况下选择其他道超车，或者等它们其中一辆悠哉游哉过去了再超，实在不行就按喇叭3. 碰到过正常行驶但右侧匝道入车，居然直接变道两条，幸亏提前判断再向左变道丝滑躲开4. 有些开车的连保持正中间开车也不会，开着开着就变过来了，碰到这种的离他远点，早点超车离开5. 最重要的就是总结规律和经验，随机应变，冷静果断，保持注意力，保持精神状态，安全第一。",
          "en": "Driving for a few years, my personal insights: 0. Driving requires thinking, even on the roads you drive every day, you can summarize the rules and gain experience that can be applied to your future driving experience in different areas. 1. When driving, judge whether the slow traffic is because of slow cars, and choose to safely overtake this group of cars. 2. When driving, judge whether the slow traffic is really due to a traffic jam, choose the corresponding lane according to the road conditions, and keep the corresponding safe distance according to the vehicle conditions; if it's a highway traffic jam, because the speed is fast, prepare to slow down + hazard lights (or fog lights) in advance according to the distance in front and the range of the brake lights. 3. Yield speed, don't yield lanes, drive staggered positions, observe from all directions at any time, and adapt to the situation. 4. When driving at a constant speed with other cars within a certain range, always observe whether their tires and lanes are parallel, and if there is a tendency to change lanes, avoid them in time. 5. Driving styles vary in different regions, and driving styles also vary on different road sections, no matter how you drive, ensuring your own safety is the first priority. 6. Be mentally stable, don't get angry easily, drive calmly, and don't be distracted. 7. For long drives, get enough sleep and rest in advance, don't wait until you feel sleepy before looking for a service area. What I've encountered: 1. Slow cars in the leftmost lane of the highway, a bunch of cars driving at less than 100 when the speed limit is 120, it's ridiculous, basically overtaking from the right side in the 2nd lane and returning to the left depending on the situation, in many cases the left lane has slow cars and they don't know it. 2. When encountering parallel slow cars on the highway, choose to overtake in other lanes while ensuring a safe distance, or wait for one of them to leisurely pass before overtaking, use the horn if it doesn't work. 3. I've encountered a situation where a car entering from the right ramp, changed two lanes directly, fortunately I judged in advance and smoothly avoided it by changing lanes to the left. 4. Some drivers can't even drive in the middle of the lane, and they just swerve around while driving, stay away from them, overtake and leave early if you encounter them. 5. The most important thing is to summarize the rules and experience, adapt to the situation, be calm and decisive, maintain concentration, maintain your mental state, and safety first."
        }
      ],
      "type": "replies"
    }
  ]
}