{
  "id": 1108798,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "最近打算换个显示器，预算 2500 以内，在 2K 高刷和 4K 高刷之间纠结",
          "en": "I'm planning to buy a new monitor recently, with a budget of within 2500, and I'm torn between 2K high refresh rate and 4K high refresh rate."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "其实内心是想要 4K 高刷的，但是目前看 4K 高刷这个价位选择很少，不知道 V 友还有啥推荐吗。",
          "en": "Actually, I want 4K high refresh rate, but currently there are few choices for 4K high refresh rate at this price point. I wonder if V friends have any recommendations."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "用途是打游戏还是其他？",
          "en": "Is the purpose for gaming or something else?"
        },
        {
          "zh": "打游戏的话你的电脑能带动 4K 高刷吗？",
          "en": "If it's for gaming, can your computer handle 4K high refresh rate?"
        },
        {
          "zh": "其他工作的话是啥系统？",
          "en": "What system do you use for other work?"
        },
        {
          "zh": "Mac 不推荐 2K",
          "en": "2K is not recommended for Mac."
        },
        {
          "zh": "其他工作是否注重显示的色彩正确性？",
          "en": "For other work, do you pay attention to the color accuracy of the display?"
        },
        {
          "zh": "这个价格高刷的话颜色处理就那样了& 这个价格不要高刷应该是有不错的 4K 显示器的",
          "en": "The color processing is just so-so if you want high refresh rate at this price point. If you don't want high refresh rate at this price, there should be good 4K monitors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一个月前 从用了三年的 LG 850UP 升级到雷鸟 U8 27 4k160hz ，国补到手 2400 （不算二手折掉的价格miniled ，目前使用下来打游戏是蛮爽的，就是色彩感觉比 lg 差不少（观感有点点奇怪 不过一两天就适应了",
          "en": "A month ago, I upgraded from the LG 850UP, which I had used for three years, to the Thunder U8 27 4k160hz. The national subsidy brought it to 2400 (not counting the price of the second-hand discount miniled. Currently, gaming is quite enjoyable, but the color feels much worse than the LG (the look and feel is a bit strange, but I got used to it in a day or two."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你的显卡支持吗？",
          "en": "Does your graphics card support it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "选 4k ，就算显卡带不动 4k 高刷，也可以用 4k 低刷。",
          "en": "Choose 4k. Even if the graphics card can't handle 4k high refresh rate, you can use 4k low refresh rate."
        },
        {
          "zh": "4k 是真好看。",
          "en": "4k is really good-looking."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MacsedProtoss 我用途以敲代码为主，玩 CS2 为辅，其他游戏很少玩",
          "en": "@MacsedProtoss I mainly use it for coding and playing CS2 as a supplement. I rarely play other games."
        },
        {
          "zh": "工作对色彩不是很敏感，但是也不能太差就是。",
          "en": "I am not very sensitive to color at work, but it can't be too bad."
        },
        {
          "zh": "然后我主要使用 windows ，其实考虑 4K 还有一方面因素是为了考虑外接 macbook ，因为现在家里 2K 和 1080P 的显示器接 MAC 感觉好糊。",
          "en": "Then I mainly use Windows. Actually, one of the reasons for considering 4K is to consider connecting a Macbook, because the 2K and 1080P monitors at home feel blurry when connected to a MAC."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@luojiyin87 我是 RX6600 ，如果正常办公为主的话，能带动吗",
          "en": "@luojiyin87 I have an RX6600. If it's mainly for normal office work, can it handle it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前也是选了好久，最后买了 XV272K V3 效果不错。",
          "en": "I also chose for a long time before I bought the XV272K V3, the effect is good."
        },
        {
          "zh": "按钮设置一般。",
          "en": "Button settings are average."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "京东根据分辨率、刷新率、尺寸、价格筛选下，几十个选择有的吧，怎么叫选择很少？",
          "en": "If you filter on Jingdong according to resolution, refresh rate, size, and price, there should be dozens of choices, right? Why do you say there are few choices?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Varsion13 看了下雷鸟这个，感觉还不错，雷鸟我记得是 TCL 的子品牌是吧",
          "en": "@Varsion13 I looked at the Thunder Bird, it feels pretty good. I remember Thunder Bird is a sub-brand of TCL, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "敲敲代码挺好的，但是你这显卡就别想 4k 玩得好（高刷）了",
          "en": "It's good for coding, but with your graphics card, don't even think about playing games well in 4k (high refresh rate)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@november 我主要也是想体验下大佬们讲的 4K 有多惊艳",
          "en": "@november I mainly want to experience how amazing the 4K that the masters talk about is."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yjd 我去瞅瞅",
          "en": "@yjd I'll go take a look."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@greenskinmonster 可能还是我比较纠结，想看看大佬们怎么推荐",
          "en": "@greenskinmonster Maybe I'm still more tangled. I want to see how the masters recommend."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@arischow 其实我也基本上不打游戏，偶尔会打 CS2 ，不过也是调成低分辨率的",
          "en": "@arischow I basically don't play games either. I occasionally play CS2, but I also turn it to a low resolution."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "日常用 4k 高刷，游戏带不动可以降分辨率玩儿，我现在就后悔没上 4k 高刷",
          "en": "Use 4k high refresh rate for daily use. If games can't handle it, you can lower the resolution to play. I regret not getting 4k high refresh rate now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当时买了 8 台来看，最后选的宏碁。",
          "en": "I bought 8 units to look at and finally chose Acer."
        },
        {
          "zh": "lg 别选跟护眼不沾边，特别写代码的更不能选。",
          "en": "Don't choose LG, it has nothing to do with eye protection, especially those who write code should not choose it."
        },
        {
          "zh": "27 4k 开 200 放大还是偏大一些，32 应该是刚好。",
          "en": "27 4k with 200 magnification is still a bit too big, 32 should be just right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "rog",
          "en": "rog"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不用纠结，4k 高刷别想了，这个预算很难获得好的体验。",
          "en": "Don't worry, forget about 4k high refresh rate, it is difficult to get a good experience with this budget."
        },
        {
          "zh": "不如这样，一个 2k 高刷+一个 4k 27 寸，如果闲鱼淘的话，2500 还得剩下一些。",
          "en": "Why not get a 2k high refresh rate + a 4k 27 inch? If you buy it on Xianyu, you will still have some left over from 2500."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "玩游戏吗？",
          "en": "Do you play games?"
        },
        {
          "zh": "玩游戏 4K 得很好得显卡 不玩得话无脑 4K",
          "en": "If you play games, 4K requires a very good graphics card. If you don't play games, just go for 4K."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "4k ，看视频会好很多，玩游戏看显卡了。",
          "en": "4k, watching videos will be much better, playing games depends on the graphics card."
        }
      ],
      "type": "replies"
    }
  ]
}