{
  "id": 1114559,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "电子 ED 了，有什么游戏能重拾热情",
          "en": "I'm experiencing gaming ED, what games can rekindle my passion?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "玩过的游戏挺杂的：\r\n（排名不分先后，想到什么写什么）\r\n法环\r\n黑猴\r\n只狼\r\n仁王\r\n卧龙\r\n黑魂\r\n空洞骑士\r\n渎神\r\n奥日\r\n异星工厂\r\n纪元 1800\r\n雀魂\r\n骑砍\r\n双人成行\r\n失落城堡\r\n杀戮尖塔\r\n小丑牌\r\n吸血鬼幸存者\r\n土豆兄弟\r\n文字密室逃脱\r\n疑案追声\r\n传送门\r\n赛博朋克 2077\r\n巫师 3\r\nBeholder\r\n暗黑地牢\r\n怪物火车\r\n古墓丽影\r\n最后的咒语\r\n暂时想到这么多。。。",
          "en": "I've played a pretty wide variety of games:\r\n(No particular order, just writing down what comes to mind)\r\nElden Ring\r\nBlack Myth: Wukong\r\nSekiro\r\nNioh\r\nWolong\r\nDark Souls\r\nHollow Knight\r\nBlasphemous\r\nOri\r\nFactorio\r\nAnno 1800\r\nMahjong Soul\r\nMount & Blade\r\nIt Takes Two\r\nLost Castle\r\nSlay the Spire\r\nBalatro\r\nVampire Survivors\r\nBrotato\r\nText-based escape rooms\r\nUnheard\r\nPuzzle\r\nCyberpunk 2077\r\nThe Witcher 3\r\nBeholder\r\nDarkest Dungeon\r\nMonster Train\r\nTomb Raider\r\nThe Last Spell\r\nThat's all I can think of for now..."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "以为是电子 ED ，可能是身子 ED 。我推荐：健身环大冒险，让你重新支棱起来。",
          "en": "Thought it was gaming ED, maybe it's body ED. I recommend: Ring Fit Adventure, to get you back on your feet."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这那是 ed. 是纵欲过度了",
          "en": "That's not ED. It's overindulgence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "另外虽然盗版不好，但你可以在 PC 模拟器上试试荒野之息这真的是我三十年游戏生涯以来玩的最舒服的游戏",
          "en": "Also, although piracy is bad, you can try Breath of the Wild on a PC emulator. It's truly the most enjoyable game I've played in my thirty years of gaming."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只有碎片时间的话，只能玩玩快节奏的 fps 或者肉鸽类游戏。",
          "en": "If you only have fragmented time, you can only play fast-paced FPS or roguelike games."
        },
        {
          "zh": "空闲时间较多才能又精力玩 3A ，推荐死亡搁浅，慢慢送快递，伴随着突然的 BGM 还是很治愈的。",
          "en": "Only when you have more free time and energy can you play AAA games. I recommend Death Stranding, slowly delivering packages, accompanied by sudden BGM, it is still very healing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这几年的大作我都玩了，不是不喜欢。",
          "en": "I've played all the big titles in recent years, it's not that I don't like them."
        },
        {
          "zh": "是太喜欢了，沉迷进去后不舍得通关，很多游戏玩到后期感觉要通关了就放哪儿了，渐渐的我也就 ED 了。",
          "en": "It's that I like them too much, I'm reluctant to finish them after getting hooked. Many games I feel like I'm about to finish them in the late stage, so I put them aside, and gradually I got ED."
        },
        {
          "zh": "就像谈了一场又一场终要结束的恋爱，因为害怕结束，所以也害怕开始。",
          "en": "It's like being in love again and again that will eventually end, because I'm afraid of the end, so I'm also afraid to start."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "电子 ED 最近一段时间也有点体会，因为之前玩的游戏视听玩法等感受越来越刺激，导致每玩一个新游戏之后都不达我的预期，这样的状况我有两种解决方案。",
          "en": "I've also felt gaming ED recently. Because the audio-visual gameplay and other experiences of the games I played before are becoming increasingly stimulating, it causes every new game I play to not meet my expectations. I have two solutions for this situation."
        },
        {
          "zh": "第一种放弃打游戏多走走玩玩，看点书，刷电影电视剧什么的，慢慢把心境重新沉淀下来，就能够再次体验一款游戏的优秀之处了。",
          "en": "The first is to give up playing games and go out more, read some books, watch movies and TV series, etc., and slowly settle your mood again, so that you can experience the excellence of a game again."
        },
        {
          "zh": "第二种找到更好玩的游戏，这种会像咖啡因一样，越喝就会越想要更好的，这不是问题，问题是如何找到更优秀的作品。",
          "en": "The second is to find a more fun game. This is like caffeine, the more you drink, the more you want better. This is not a problem, the problem is how to find more excellent works."
        },
        {
          "zh": "我的答案是：老作品，老作品虽然画质更差，但是美术，音乐，剧情，玩法是绝对不会过时的，经典作品在这些地方只会更闪耀，按照你自己的偏好来找到自己喜欢的作品。",
          "en": "My answer is: old works. Although old works have worse graphics, the art, music, plot, and gameplay will never be outdated. Classic works will only shine more in these areas. Find your favorite works according to your own preferences."
        },
        {
          "zh": "当然也有意外的情况就是出了一款非常优秀的新作品，最近我在玩天国拯救 2 ，这个游戏绝对对的上我的电波，太喜欢这游戏了",
          "en": "Of course, there are also unexpected situations where a very excellent new work comes out. I'm playing Kingdom Come: Deliverance 2 recently. This game absolutely fits my vibe, I love this game so much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "对我来说的电子 ED 就是因为工作积压了几乎所有的生活时间和注意力，导致无法再向以前一样投入到游戏中。。",
          "en": "For me, gaming ED is because work has squeezed almost all of my life time and attention, leading to the inability to devote myself to games as I used to..."
        },
        {
          "zh": "跟游戏好不好玩没关系，即使现在还有很多想玩的游戏，也没有去打开他们的动力了。。",
          "en": "It has nothing to do with whether the game is fun or not, even though there are still many games I want to play now, I don't have the motivation to open them..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@namenone 死亡搁浅不错的，之前 E 宝送的玩过了",
          "en": "@namenone Death Stranding is good, I played the one that E宝 gave away before."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在偶尔玩玩《 Governor of Poker 3 》，就等 GTA6 了",
          "en": "Now I occasionally play 'Governor of Poker 3', just waiting for GTA6."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wekecher 有用 VR 打乒乓球，中等 AI 都打不过，难受了",
          "en": "@wekecher I tried playing table tennis in VR, but I can't even beat the medium AI, it's frustrating."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "TheRiftbreaker",
          "en": "TheRiftbreaker"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "fps 试过吗",
          "en": "Have you tried any FPS games?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xdeng 遗迹：灰烬重生，Half-Life: Alyx ，这两个算吗",
          "en": "@xdeng Remnant: From the Ashes, Half-Life: Alyx, do these count?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@AllenCai #3 fps 玩不玩，可以试试 apex ，入门有点难，现在留下来玩的都是老毕登。",
          "en": "@AllenCai #3 Do you play FPS games? You can try Apex, it's a bit difficult to get started, but the only ones still playing are old-timers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "玩过这么多还叫 ED 吗",
          "en": "Having played so many, can you still call it ED?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "俄罗斯钓鱼 4",
          "en": "Russian Fishing 4"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试着出去户外运动吧，我现在沉迷钓鱼",
          "en": "Try going out for outdoor sports, I'm addicted to fishing now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "玩过这么多 ed 了也不亏 我一个游戏都没通关就已经 ed 了 别人推荐的大概率不能让你重拾热情 只有你自寻 试试买一台 nds 玩玩老游戏",
          "en": "Having played so many games you could say you got your money's worth. I got ED without even completing a single game. Recommendations are unlikely to rekindle your passion, you can only find it yourself. Try buying a NDS and playing old games."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试试联机的呢 人多了变化就多",
          "en": "Try playing online games, more people, more possibilities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "cs2 、文明 7 、以及将要出的 gta6",
          "en": "CS2, Civilization 7, and the upcoming GTA6."
        }
      ],
      "type": "replies"
    }
  ]
}