{
  "id": 1111725,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "租了个二楼，一楼有个菜场，每天晚上凌晨剁肉到早上 8 点",
          "en": "Rented a second floor apartment, there's a wet market on the first floor, they chop meat from midnight to 8 am every day."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "夜不能寐，这种事情找哪个部门可以解决，有没有有经验的兄弟 T.T\r\n\r\n地点：海淀区",
          "en": "Can't sleep at night, which department can solve this issue? Any experienced brothers/sisters out there? \r\n\r\nLocation: Haidian District"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@Abbeyok 底商扰民怎么倒反天罡了？商住一体的楼本身就有噪音规定，民法典写的清清楚楚：”住宅楼下商铺有义务不产生噪音影响楼上住户休息。“ 要你在这里装理中客？",
          "en": "@Abbeyok How is complaining about the noise from the downstairs shop acting against common sense? Buildings that are both commercial and residential have noise regulations. The Civil Code clearly states: 'Businesses below residential units have an obligation to not produce noise that affects the rest of the upper residents.' Why are you pretending to be neutral here?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Abbeyok #14 典型斯德哥尔摩综合症。楼下扰民你不骂反而骂起楼主来了。按照你这样的逻辑，你被车撞死了也是活该，因为你出门前肯定知道马路上有车，就应该想到有概率出交通事故",
          "en": "@Abbeyok #14 Typical Stockholm syndrome. Instead of criticizing the downstairs neighbor for making noise, you're criticizing the original poster. Following your logic, if you get hit by a car and die, it's your own fault because you knew there were cars on the road before you left the house and should have considered the possibility of a traffic accident."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让他不剁就是断人生计，不怕剁你啊",
          "en": "Telling him not to chop meat is like cutting off his livelihood, aren't you afraid he'll chop you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同情 OP ，花着小城市住三室一厅的钱，住着京式劏房。",
          "en": "Sympathize with the OP, spending the money for a three-bedroom apartment in a small city, but living in a cramped Beijing apartment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@LanhuaMa 我都怀疑你是否学过逻辑相关课程。剁肉和抢银行是一回事吗？可以类比吗？不会说话可以不说",
          "en": "@LanhuaMa I doubt you've ever taken a logic course. Is chopping meat the same as robbing a bank? Can they be compared? If you can't speak properly, don't say anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这就是房租便宜的原因OP 可以早点下楼帮他剁完肉，就安静了。",
          "en": "That's why the rent is cheap. The OP can just go downstairs and help him chop the meat earlier, and then it will be quiet."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@LanhuaMa 人家剁肉是生计啊，靠这个吃饭的。你居然拿被车撞来对比，那你天天上班就是被车撞的吗？",
          "en": "@LanhuaMa Chopping meat is his livelihood, that's how he makes a living. You're comparing it to getting hit by a car? Does that mean you get hit by a car every day when you go to work?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xuanbg 楼主明知道楼下有菜市场，难道没想到会被吵？你明知道横穿马路很危险，你还要做，是不是你活该？",
          "en": "@xuanbg The OP knew there was a wet market downstairs, didn't they think it would be noisy? You know that crossing the road is dangerous, but you still do it, is it your own fault?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@LanhuaMa 你这比方是偷换概念, 既然知道路上有车, 你是不是更应该注意安全? 还是要求路上的车速都慢到即使撞人了也不怎么受伤的程度?既然知道是菜市场, 噪音肯定是少不了, 是不是更应该注意在选择之前多考虑?或者你去做剁肉的, 你认为你的噪音能做到不影响楼上住户吗?即使你能做到, 你认为这么多的菜市场的噪音能所谓\"合规\"的有多少?  \"合规\"的界线必定是模糊的.而且这是一楼和二楼, 如果当初选四楼五楼, 是否会更好一些些? op 说墙体震动, 但声音不大, 是否剁肉的已经尽量降低噪音了呢? 我们不知道.这个世界有太多事情都不以我们的意愿来发生。",
          "en": "@LanhuaMa Your analogy is a fallacy. Since you know there are cars on the road, shouldn't you be more careful? Or should we demand that all cars on the road drive so slowly that even if they hit someone, they won't get hurt much? Since you know it's a wet market, there's bound to be noise, shouldn't you have considered it more carefully before choosing? Or why don't you go and chop meat yourself? Do you think you can keep the noise from affecting the upstairs residents? Even if you could, how many wet markets do you think can be considered \"compliant\"? The line of \"compliance\" is necessarily blurred. Moreover, this is the first and second floor, would it be better if you chose the fourth or fifth floor? The OP said the walls are vibrating, but the sound is not loud, has the meat chopper already tried to minimize the noise as much as possible? We don't know. Too many things in this world don't happen according to our wishes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Makabaka01 他 @Abbeyok 可没有理中客, 他是完全站在你的对立方, 我才是假装理中客.如果你认为剁肉的不合规, 就去投诉, 好好沟通弄清楚, 也许有效果, 也许没有.如果剁肉的真的太大声, 投诉后, 他大幅降低就还好.如果他现在已经是低噪音了, 在模糊线附近, 那就很难办了, 公婆都有理.但我认为多多少少菜市场总会更嘈杂一些, 当然其他地方也有很多噪音很大的.时常看到有人被各种噪音影响, 当然也包括我自己, 如果觉得自己合理, 就去找部门投诉.最后还是那句话, 太多事情很难或者没办法改变,  以后自己做选择要更谨慎一些也许更好.",
          "en": "@Makabaka01 He @Abbeyok is not neutral at all, he is completely on the opposite side of you, I am the one pretending to be neutral. If you think the meat chopping is not compliant, go and complain, communicate well and figure it out, maybe it will work, maybe not. If the meat chopping is really too loud, and he significantly reduces it after the complaint, that's good. If it's already low noise, and near the blurry line, then it's difficult to handle. Both sides have their reasons. But I think wet markets will always be more noisy to some extent, and of course there are many other places with loud noise. I often see people being affected by various noises, including myself. If you think you're right, go and complain to the departments. Finally, too many things are difficult or impossible to change, maybe it would be better to be more careful when making choices in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "菜场是你租房子之后才开的?一楼是居民房变更了使用性质?如果前两者都是, 直接 12345.如果有否, 那你应该找房东.",
          "en": "Did the wet market only open after you rented the apartment? Was the first floor originally a residential property that changed its use? If both of the above are true, call 12345 directly. If not, you should contact the landlord."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "下楼买 10 斤肥肉馅，全肥不得带半点瘦的，再买 10 斤瘦肉馅，不得带半点肥的，说没带钱，把随时携带的水浒传抵押，稍后来赎回",
          "en": "Go downstairs and buy 10 jin of fatty ground pork, all fat with no lean meat at all, then buy 10 jin of lean ground pork, no fat at all, say you didn't bring any money, and mortgage your always-carried Water Margin as collateral, to be redeemed later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前没声音是商家都回家过年了",
          "en": "There was no noise before because the merchants had all gone home for Chinese New Year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "卖肉的真辛苦。",
          "en": "Butchers really work hard."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你简直是倒反天罡，难道是二楼先建的才有一楼菜市场？",
          "en": "You are completely reversing the order of things. Was the second floor built before the first floor's wet market?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还好你没租在长安街",
          "en": "Glad you didn't rent on Chang'an Avenue."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 换房子2. 早睡",
          "en": "1. Move 2. Sleep early"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@InDom 一直有，但是住进来半个月他们才开始半夜剁肉，之前没动静的",
          "en": "@InDom It's always been there, but they only started chopping meat in the middle of the night half a month after I moved in, there was no noise before."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Lyet813 早睡没用啊，晚上一锤就醒了",
          "en": "@Lyet813 Sleeping early is useless, I wake up from just one chop at night."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@webcape233 白天剁呗，现在是凌晨剁，白天一点声响都没有",
          "en": "@webcape233 They should chop during the day, now they are chopping at midnight, there isn't a peep during the day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很难啊，剁肉你都说了是震动，那就很难算噪音，噪音是有分贝要求的",
          "en": "It's difficult, you said the meat chopping is a vibration, so it's hard to consider it noise, noise has decibel requirements."
        }
      ],
      "type": "replies"
    }
  ]
}