{
  "id": 1108591,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "人类应该减少直接使用笔记本电脑",
          "en": "Humans should reduce the direct use of laptops"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "笔记本的键盘与屏幕整合在一起的设计，会让人类使用的时候，非常违反生理结构。\r\n\r\n",
          "en": "The integrated design of the laptop keyboard and screen is very contrary to the physiological structure when humans use it.\r\n\r\n"
        },
        {
          "zh": "除了小孩外的正常成年人，眼睛与小臂水平后的垂直距离相差太大了。\r\n\r\n",
          "en": "For normal adults other than children, the vertical distance between the eyes and the horizontal forearm is too large.\r\n\r\n"
        },
        {
          "zh": "你想保持手肩姿势正常，你眼睛就得向下看，才能使用笔记本。这样对颈部不好。\r\n\r\n",
          "en": "If you want to maintain a normal hand and shoulder posture, you have to look down with your eyes to use the laptop. This is not good for the neck.\r\n\r\n"
        },
        {
          "zh": "你想保持眼睛平视屏幕，你手就得抬起来还要前伸使用，对肩膀后背都很不好。\r\n\r\n\r\n",
          "en": "If you want to keep your eyes level with the screen, you have to raise your hands and reach forward to use it, which is very bad for your shoulders and back.\r\n\r\n\r\n"
        },
        {
          "zh": "键盘和屏幕分离，才是正确使用电脑的方式。人类应该减少直接使用笔记本电脑。",
          "en": "Separating the keyboard and the screen is the correct way to use a computer. Humans should reduce the direct use of laptops."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "从回复可见，中国教育没教逻辑学确实影响很大。",
          "en": "As seen from the replies, the lack of logic education in China has indeed had a great impact."
        },
        {
          "zh": "笔记本对身体有伤害，就要退化去狩猎采集？",
          "en": "Does the harm to the body from laptops mean we should regress to hunting and gathering?"
        },
        {
          "zh": "这个完全是滑坡谬误。",
          "en": "This is a complete slippery slope fallacy."
        },
        {
          "zh": "用手机对身体伤害更大，跟用笔记本有什么关系？",
          "en": "Using a mobile phone is more harmful to the body, what does it have to do with using a laptop?"
        },
        {
          "zh": "这是两码事，如果这么认为，那应该另发个帖说手机的问题吧…",
          "en": "These are two different things. If you think so, you should post another thread about the problem of mobile phones..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人类应该直接去狩猎采集，这样最符合人体工学",
          "en": "Humans should go directly to hunting and gathering, which is the most ergonomic"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "除了出差， 家里和办公室都有显示器啊",
          "en": "Except for business trips, I have monitors at home and in the office"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是的。笔记本属于移动场合不得已才使用的设备，台式电脑对健康更富有正面意义。",
          "en": "Yes. Laptops are devices that are used only when necessary in mobile situations. Desktop computers are more positive for health."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我修正说一下我上面说的，第一行不小心敲错了个问号，其实那是句号，其实我说确实就很明显是说认同楼主说法了只是我说你可以笔记本换台机或加显示器但明显手机问题就更加该注意，不然各位用手机的角度会比笔记本屏幕高？",
          "en": "Let me correct what I said above. I accidentally typed a question mark in the first line. It was actually a period. In fact, it was obvious that I agreed with the original poster. I just said that you can replace the laptop with a desktop or add a monitor, but obviously the mobile phone problem should be paid more attention to. Otherwise, will everyone's angle of using the mobile phone be higher than the laptop screen?"
        },
        {
          "zh": "那我就不解了，可能大家用手机时手是高高举起的吧上面有人说连续用几年笔记本后颈椎反弓，就不考虑下手机的原因？",
          "en": "Then I don't understand. Maybe everyone raises their hands high when using their mobile phones. Some people said that after using laptops continuously for several years, the cervical spine is curved; don't you consider the reason for the mobile phone?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "笔记本本来就是，楼上还这么多杠精",
          "en": "Laptops are inherently like that; there are so many trolls upstairs"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "按照这个逻辑，人类应该减少直接使用手机，理由类似。",
          "en": "According to this logic, humans should reduce the direct use of mobile phones for similar reasons."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "笔记本直接使用确实非常不舒服，屏幕不论怎么调整，脖子都要向下用力，时间一长颈椎非常受罪。",
          "en": "It is indeed very uncomfortable to use a laptop directly. No matter how the screen is adjusted, the neck has to work downwards, and the cervical spine suffers a lot after a long time."
        },
        {
          "zh": "键盘也是这样，不管品牌再怎么调校键盘手感，键程太短始终是硬伤，除手感外另一方面的问题是两只手的姿势，由于键盘普遍面积较小手和手臂必须要使用类似蛙泳的合手姿势，非常难受",
          "en": "The same goes for the keyboard. No matter how the brand adjusts the keyboard feel, the short key travel is always a fatal flaw. Another problem besides the feel is the posture of both hands. Because the keyboard area is generally small, the hands and arms must use a hand-joining posture similar to breaststroke, which is very uncomfortable."
        },
        {
          "zh": "所以个人只有在比如开会，出差等非固定场所办工才会直接使用笔记本，其他相对固定的场景，比如家里，办公室等，一定会把笔记本变成台式机的使用形态，接上显示器和机械键盘",
          "en": "Therefore, I only use laptops directly in non-fixed places such as meetings and business trips. In other relatively fixed scenarios, such as at home or in the office, I will definitely turn the laptop into a desktop computer, connecting it to a monitor and a mechanical keyboard."
        },
        {
          "zh": "即使是去到图书馆，也一定会带上笔记本支架与键盘，支架把笔记本立起来，让笔记本屏幕与眼睛同高，避免颈椎疲劳",
          "en": "Even when going to the library, I will definitely bring a laptop stand and keyboard, which will raise the laptop to make the laptop screen at the same height as the eyes, avoiding cervical spine fatigue."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ZeawinL 怪不得我那么喜欢钓鱼",
          "en": "@ZeawinL No wonder I like fishing so much"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接使用确实不符合人体工程学",
          "en": "Direct use is indeed not ergonomic"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "第一句有很深的体会，能不用笔记本就尽量不用。",
          "en": "I have a deep understanding of the first sentence. If you can avoid using a laptop, try not to."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "使用笔记本，非常容易得颈椎病",
          "en": "Using a laptop makes it very easy to get cervical spondylosis"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "确实",
          "en": "Indeed"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "牛马不都在用吗？像我这样的等退休人员才不用。。。",
          "en": "Aren't all the beasts of burden using them? People like me who are waiting to retire don't use them..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以同意",
          "en": "Can agree"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "确实是尽量不要常用,我工作后连续用了几年笔记本, 颈椎反弓了",
          "en": "Indeed, try not to use it often. After using a laptop continuously for a few years after work, my cervical spine became curved backwards"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "笔记本屏幕相对普通显示器确实有危害？",
          "en": "Is the laptop screen really harmful compared to regular monitors?"
        },
        {
          "zh": "但你有没有想过你那手机伤害更大，无论是视力伤害还是从颈椎伤害",
          "en": "But have you ever thought that your mobile phone is more harmful, whether it is to your eyesight or cervical spine?"
        },
        {
          "zh": "所以首先应该做的是纠正那些在反人类的强制用户用手机 APP 的 IT 巨头",
          "en": "So the first thing to do is to correct those IT giants who force users to use mobile phone apps against humanity"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大过年的楼上杠精就出来了，哈哈",
          "en": "The trolls upstairs came out during the New Year, haha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "长期使用笔记本真的对劲椎伤害很大，以前尝试使用过一星期，然后脖子就一直很累，后来用回台式机之后，瞬间感觉清爽了",
          "en": "Long-term use of laptops is really harmful to the cervical spine. I tried using it for a week before, and then my neck was always tired. Later, after switching back to a desktop computer, I instantly felt refreshed"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Surface：说的太对了，哥",
          "en": "Surface: You're so right, bro"
        }
      ],
      "type": "replies"
    }
  ]
}