{
  "id": 1114790,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "被 hr 疯狂催入职",
          "en": "Being frantically urged to join by HR"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "二面结束后面试官要求 3 月 5 号到岗，距离面试时间只有一周，现在的公司肯定不放我走，于是我明确说到不了岗。然后那边跟我说可以 5 号先干着，3 月底交接完了再正式走入职流程。我直接？？？，而且发 offer 的时候人事跟我说他 offer 上的试用期填错了，3 个月变成 6 个月。我现在怀疑这公司就是想混我个试用期，到转正时直接裁。",
          "en": "After the second interview, the interviewer asked me to start work on March 5th, which is only one week away from the interview. My current company definitely won't let me go, so I clearly said I couldn't start. Then they told me I could start working on the 5th, and formally go through the onboarding process after the handover is completed at the end of March. I was directly speechless, and when the offer was issued, HR told me that he had filled in the probation period on the offer incorrectly, changing 3 months to 6 months. I now suspect that this company just wants to get me through the probation period and then lay me off when it's time to become a full-time employee."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "试用期能填错的公司建议还是不要入职了，一点不正规，什么玩意儿",
          "en": "I suggest you don't join a company that can fill in the probation period incorrectly. It's not at all standard; what a joke"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“ hr 的说法是怕被领导叼，于是微信跟我说我试用期 3 个月让我用微信当证据”转 20000 押金再说话！· 怕被吊就风险转嫁？行，善良，可以承担，现转 20000 块，你也承担一些风险。· 不是白纸黑字的合同，什么口头都是屁。",
          "en": "“HR says they are afraid of being scolded by their leader, so they told me on WeChat that my probation period is 3 months, and asked me to use WeChat as evidence” Transfer 20000 deposit, then talk! · Afraid of being scolded, so you transfer the risk? Okay, be kind, you can bear it, now transfer 20000 yuan, and you also bear some of the risk. · Without a written contract, all verbal agreements are bullshit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "结贴了 xdm ，撕 offer 了",
          "en": "Thread closed, brothers, I'm rejecting the offer"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "退一万步, offer 填错试用期, 我可以理解. 你问她劳动合同试用期填多少? 3 个月还能行, 6 个月直接叼她顺便曝光公司名字.",
          "en": "Even if we take a step back, I can understand that the offer filled in the probation period incorrectly. Ask her how long the probation period is in the employment contract? 3 months is acceptable, but 6 months, directly scold her and expose the company's name."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Ayaya233 #8 这不能信",
          "en": "@Ayaya233 #8 Don't believe this"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "offer 可以改了重新发的，bro",
          "en": "The offer can be changed and reissued, bro"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试用期都能填错  这不可能呀（难道试用期还分 3 个月 和 6 个月？）以前帮人事修电脑 他们都是模板复制粘贴的就入职人的姓名、日期、薪资，这几个字段是空白的，其他的内容都是固定的而且他们那个模板如果没啥大变动 基本上一用就是几年 不会修改的",
          "en": "Even the probation period can be filled in incorrectly. This is impossible (Does the probation period even have 3 months and 6 months?) I used to help HR fix computers. They all used template copy and paste, only the new employee's name, date, and salary. These fields are blank. The other content is fixed, and if their template doesn't change much, they basically use it for several years and won't modify it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wu67 对方既然提了填错，这不摆明了拿 3 个月骗你然后签合同给你 6 个月试用期吗",
          "en": "@wu67 Since the other party mentioned filling it in incorrectly, isn't it obvious that they are using 3 months to deceive you and then sign a 6-month probation period contract?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wu67 offer 填写错了，这话你也信啊，那你说，你再给我个补充条款，也可以啊。",
          "en": "@wu67 You believe the offer was filled in incorrectly? Then you say, give me another supplementary clause, you can."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "听起来像是计划有变",
          "en": "Sounds like the plan has changed"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "填错了。重新填啊。",
          "en": "It was filled in incorrectly. Refill it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "3 个月变 6 个月，开玩笑那",
          "en": "3 months becomes 6 months, that's a joke"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ColdBird 还真是，已经再打退堂鼓了",
          "en": "@ColdBird That's true, I'm already considering backing down"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zljklang hr 的说法是怕被领导叼，于是微信跟我说我试用期 3 个月让我用微信当证据",
          "en": "@zljklang The HR's explanation is that they are afraid of being scolded by their leader, so they told me on WeChat that my probation period is 3 months and asked me to use WeChat as evidence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么看都像杀猪盘",
          "en": "It looks like a pig-butchering scam"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Ayaya233 #8  千万别信",
          "en": "@Ayaya233 #8 Definitely don't believe it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别去",
          "en": "Don't go"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ok ，xdm ，听劝，及时止损",
          "en": "Okay, brothers, I listened to the advice and cut my losses in time"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别去，可能皮包公司接到了个外包项目，需要你干 4 ，5 个月，然后直接结束",
          "en": "Don't go, maybe a shell company has received an outsourcing project, needs you to work for 4 or 5 months, and then just ends it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Ayaya233 你听她吹牛逼",
          "en": "@Ayaya233 You're listening to her bragging"
        }
      ],
      "type": "replies"
    }
  ]
}