{
  "id": 1109314,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "姐姐生了很严重的病，很迷茫，不知道怎么跟母亲说，该不该隐瞒。",
          "en": "My sister has a very serious illness, I'm very confused, I don't know how to tell my mother, should I hide it?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "如题，医生说平均寿命估计就两年，很迷茫，不知道怎么面对，也不知道怎么跟母亲说。",
          "en": "As the title says, the doctor said the average life expectancy is estimated to be only two years. I'm very confused, I don't know how to face it, and I don't know how to tell my mother."
        },
        {
          "zh": "要不要隐瞒。",
          "en": "Should I hide it?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "换个不同地区的不同医院。",
          "en": "Go to different hospitals in different regions."
        },
        {
          "zh": "再审一遍是不是真的这个病。",
          "en": "Re-examine whether it is really this disease."
        },
        {
          "zh": "是不是真的这么严重。",
          "en": "Is it really that serious?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Shadowxxx  我是这个专业的医生。",
          "en": "@Shadowxxx I am a doctor in this field."
        },
        {
          "zh": "来广州中山六院。",
          "en": "Come to the Sixth Affiliated Hospital of Sun Yat-sen University in Guangzhou."
        },
        {
          "zh": "好好治疗的话，2 年肯定没问题。",
          "en": "With good treatment, 2 years is definitely not a problem."
        },
        {
          "zh": "也有肠癌肝转移十几年的病人。",
          "en": "There are also patients with colorectal cancer with liver metastasis for more than ten years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "检查报告，把名字打马赛克，发出来。",
          "en": "Post the test report with the name censored."
        },
        {
          "zh": "我家里人是医生，帮你看下。",
          "en": "My family member is a doctor, and I can help you take a look."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "每每看到这种帖子都会感叹，身体真的重要。",
          "en": "Every time I see this kind of post, I sigh, the body is really important."
        },
        {
          "zh": "兄弟们都保重身体对自己好一点呀",
          "en": "Brothers, take care of your body and be good to yourselves."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Hally 中医可别瞎掺和了，信中医能治好癌症不如信明天火星撞地球。",
          "en": "@Hally Don't let Chinese medicine get involved, believing that Chinese medicine can cure cancer is like believing that Mars will collide with the Earth tomorrow."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "祝好",
          "en": "Best wishes"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liujianhong 加群的用途是什么呢，化疗和靶向方案就那么几个，我感觉除非你要心理安慰，最忌讳的就是加群东看一个西看一个，肿瘤治疗的特异性非常强，每个人的药都不一样，全国你放哪个医院都是一线二线三线换着用，赌哪个药的效果好",
          "en": "@liujianhong What is the purpose of joining the group? There are only a few chemotherapy and targeted therapy options. I feel that unless you want psychological comfort, the most taboo thing is to join the group and look at one thing in the east and another in the west. The specificity of tumor treatment is very strong. Everyone's medicine is different. No matter which hospital you put it in the country, you can use first-line, second-line, and third-line drugs interchangeably to bet on which drug will work best."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@buxudashi 别捣乱，中医和佛经你自己看，op 家也不要病急乱投医。",
          "en": "@buxudashi Don't mess around, look at traditional Chinese medicine and Buddhist scriptures yourself, and OP's family should not seek medical treatment in desperation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Shadowxxx 早晚都要说，慢慢开导吧。",
          "en": "@Shadowxxx You have to tell her sooner or later, guide her slowly."
        },
        {
          "zh": "现在至少还有两年的时间去接受这个事情，越往后拖去接受的时间越短。",
          "en": "Now there are at least two years to accept this matter, the longer you delay, the shorter the time to accept it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微信公众号搜索：熊猫和朋友们，是一个很专业的消化道肿瘤患者组织，可以加群寻求就医指导。",
          "en": "Search on WeChat official account: Panda and Friends, which is a very professional digestive tract tumor patient organization, you can join the group to seek medical guidance."
        },
        {
          "zh": "加群需要审核资料",
          "en": "Joining the group requires reviewing information."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人类什么时候可以攻克癌症啊。",
          "en": "When will humans conquer cancer?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "外人总是以为了某人好为由隐瞒一些重要的事，比如以担心身体扛不住为由，以担心影响孩子高考为由，以担心谁谁接受不了为由。。。",
          "en": "Outsiders always hide some important things under the guise of doing good for someone, such as worrying about the body not being able to bear it, worrying about affecting the child's college entrance examination, worrying about who can't accept it..."
        },
        {
          "zh": "我想说，能以当事人的角度看看吗？",
          "en": "I want to say, can you look at it from the perspective of the person concerned?"
        },
        {
          "zh": "他/她本人，是否希望及时知道真相，难道不是最重要的吗。",
          "en": "Isn't it the most important thing whether he/she wants to know the truth in time?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@paradoxs 诊断意见乙状结肠壁明显增厚，PET 于相应部位见团块状异常放射性浓聚影，考虑乙状结杨癌，伴肠周受侵、肠周淋巴结转移。",
          "en": "@paradoxs The diagnosis shows that the sigmoid colon wall is significantly thickened, and PET shows a mass-like abnormal radioactive concentration shadow in the corresponding area, considering sigmoid colon cancer, accompanied by perintestinal invasion and perintestinal lymph node metastasis."
        },
        {
          "zh": "腹膜后、双侧略血管旁淋巴结转移。",
          "en": "Retroperitoneal and bilateral slightly para-vascular lymph node metastasis."
        },
        {
          "zh": "腹膜、网膜转移性病变。",
          "en": "Peritoneal and omental metastatic lesions."
        },
        {
          "zh": "肝内多发转移瘤(部分肿瘤中央坏死)双肺转移瘤。",
          "en": "Multiple liver metastases (partial tumor central necrosis) with bilateral lung metastases."
        },
        {
          "zh": "宫旁左侧囊实性密度影，PET 于相应部位见结节状异常放射性浓聚影，考虑卵巢生理性摄取可能性大#,不完全除外附件转移痛，建议复查。",
          "en": "There is a cystic-solid density shadow on the left side of the uterus, and PET shows nodular abnormal radioactive concentration shadow, considering the possibility of physiological uptake of the ovary, but not completely excluding adnexal transfer pain, it is recommended to review."
        },
        {
          "zh": "盆腔少量积液。",
          "en": "Small amount of fluid in the pelvic cavity."
        },
        {
          "zh": "左乳内上象限钙化灶。",
          "en": "Calcification in the upper inner quadrant of the left breast."
        },
        {
          "zh": "双侧颈部、双侧领下、顿下、纵隔淋巴结增生;右下磨牙后区根尖炎。",
          "en": "Bilateral cervical, bilateral submandibular, submental, mediastinal lymph node hyperplasia; apical periodontitis in the right lower molar area."
        },
        {
          "zh": "全身其它部位未见明显异常帮忙看看，多谢。",
          "en": "No obvious abnormality was found in other parts of the body. Please help me take a look, thank you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我家里人直肠癌+肝转移，做了手术，做了造口，做了化疗，一年多走了，过程挺痛苦的。",
          "en": "My family member had rectal cancer + liver metastasis, underwent surgery, ostomy, chemotherapy, and passed away after more than a year. The process was quite painful."
        },
        {
          "zh": "趁还能走动，也让妈妈陪着一起出去玩玩吧，祝好",
          "en": "While you still can, let your mother accompany you out to play, best wishes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@murmur 熊猫和朋友们群主是一个患者家属，有一篇微信上千万阅读的文章《北京中年抗击晚期结肠癌手记》 https://mp.weixin.qq.com/s/TAg4nt7nLFiKwotJy8ikjQ ，群里有很多志愿者，都是过来人，不是骗子群，放心。",
          "en": "@murmur The Panda and Friends group leader is a family member of a patient. There is an article on WeChat with tens of millions of views, \"Notes on a Middle-Aged Beijing Resident Fighting Advanced Colon Cancer\" https://mp.weixin.qq.com/s/TAg4nt7nLFiKwotJy8ikjQ . There are many volunteers in the group who have been there, not a scam group, so don't worry."
        },
        {
          "zh": "可以搜索视频或文章看看",
          "en": "You can search for videos or articles to see."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果父母封建迷信的话建议还是不要说了，不然后续矛盾会很多，比如求神拜佛、算卦占卜、中医传销等等躲都躲不掉，最后的结局就是人财两空",
          "en": "If your parents are feudal and superstitious, it is recommended not to tell them, otherwise there will be many subsequent conflicts, such as praying to gods and Buddhas, fortune-telling, traditional Chinese medicine pyramid schemes, etc., which cannot be avoided, and the final result will be the loss of both people and money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果结果无法改变。",
          "en": "If the result cannot be changed."
        },
        {
          "zh": "当然先不告诉了。",
          "en": "Of course, I won't tell them first."
        },
        {
          "zh": "何必让父母跟着一起担心呢？",
          "en": "Why let your parents worry along with you?"
        },
        {
          "zh": "多看中医。",
          "en": "See more Chinese medicine."
        },
        {
          "zh": "想办法改变才是正确的事。",
          "en": "Finding a way to change is the right thing to do."
        },
        {
          "zh": "另外，一切无常，每个人都有那么一天。",
          "en": "In addition, everything is impermanent, and everyone has that day."
        },
        {
          "zh": "或早或晚都不可避免。",
          "en": "Sooner or later it is inevitable."
        },
        {
          "zh": "最终人都要走向修行这条路。",
          "en": "In the end, people have to embark on the path of cultivation."
        },
        {
          "zh": "六道轮回，要超越。",
          "en": "Six Paths of Reincarnation, to be transcended."
        },
        {
          "zh": "如果没轮回那修行就没必要，过好这辈子就行。",
          "en": "If there is no reincarnation, then cultivation is not necessary, just live this life well."
        },
        {
          "zh": "但是，程序员们，不得先看看佛经佛是怎么说的吗？",
          "en": "But, programmers, shouldn't you first read the Buddhist scriptures to see what the Buddha says?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "禁中医，禁偏方，讲科学",
          "en": "Ban Chinese medicine, ban folk remedies, talk about science."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@WilliamColton 普通的三四百吧，无痛需要麻醉贵些；如果是普通的，个人感觉很痛，特别是肠镜在肠道中拐弯的时候。",
          "en": "@WilliamColton It costs three to four hundred for regular one, painless one needs anesthesia and is more expensive; if it is regular one, I personally feel it is very painful, especially when the colonoscope turns in the intestines."
        },
        {
          "zh": "推荐做无痛的，睡一觉就做完了。",
          "en": "It is recommended to do the painless one, you can finish it after sleeping."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "劝你说的都是没经历过的，这种事能瞒一天是一天，就算你姐要说也要往最轻了说。",
          "en": "Those who advise you to tell are all inexperienced. You should hide this kind of thing for as long as you can, and even if your sister wants to tell, she should say it in the mildest way."
        },
        {
          "zh": "你母亲就算知道了也帮不上忙，更睡不着觉，这种事对母亲来说是完全无法接受的，现在说了只会让你母亲多痛苦两年，不存在提前接受事实这种情况。",
          "en": "Even if your mother knows, she won't be able to help, and she won't be able to sleep. This is completely unacceptable to a mother. Telling her now will only make your mother suffer for two more years. There is no such thing as accepting the facts in advance."
        }
      ],
      "type": "replies"
    }
  ]
}