{
  "id": 1112809,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "三十岁后还有不焦虑失业的么",
          "en": "Are there people over 30 who aren't anxious about unemployment?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前两天一朋友公司准备搬家导致很多想走的想拿礼包，不想走的又因为距离焦虑，感觉牛马好难",
          "en": "A friend's company was preparing to move the other day, which led to many people who wanted to leave hoping to get severance packages, while those who didn't want to leave were anxious about the distance. It feels like being a workhorse is so difficult."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@asdhak 哥们，人总不能只为人生的后 20 年活着，真不至于。",
          "en": "@asdhak Dude, people can't just live for the last 20 years of their lives, it's really not necessary."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@skyrim61 #1 通俗点，不买房，不买车，不结婚，不生子，低消费，毕业就开始存钱养老",
          "en": "@skyrim61 #1 To put it simply, don't buy a house, don't buy a car, don't get married, don't have kids, keep consumption low, and start saving money for retirement after graduation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "低消费, 低欲望, 高储蓄, 可破",
          "en": "Low consumption, low desires, high savings, can break the cycle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yueyuea 如果你认为你的观点有说服力，那就拿出更多论点来论证，而不是用“看起来给你一个支点你可以翘起整个地球”这种话来阴阳对方",
          "en": "@yueyuea If you think your point of view is persuasive, then present more arguments to demonstrate it, instead of using phrases like 'it looks like giving you a fulcrum you can lift the whole earth' to sarcastically attack the other person."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实人生任何问题最终都能解决的，就算最后啥也没准备失业了，也会有各种各样新机会来找你的",
          "en": "Actually, any problem in life can eventually be solved. Even if you're unemployed without any preparation, all sorts of new opportunities will come your way."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一方面不乱花钱,一方面提升自身竞争力",
          "en": "On the one hand, don't spend money recklessly; on the other hand, improve your own competitiveness."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "失业了又会怎样？少吃几顿大餐，少旅游几次，情况再差也不会比学生时代差。",
          "en": "What if you become unemployed? Eat fewer big meals, travel a few fewer times. The situation, even at its worst, won't be worse than when you were a student."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "标准降低点，别做中产和孩子人中龙凤的梦了，活着其实压根不需要那么多钱，相比现在年轻人毕业即失业，已经挺不错的了，我都看开了",
          "en": "Lower your standards a bit, and stop dreaming of being middle-class and your children being outstanding. Living actually doesn't require that much money. Compared to the current situation where young people are unemployed immediately after graduation, it's already pretty good. I've come to terms with it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yueyuea 为什么你认为是 20 年后？难道不是当下已经不会有焦虑了吗？",
          "en": "@yueyuea Why do you think it's 20 years later? Isn't it that there's no anxiety right now?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yueyuea 等到 60 岁的时候，感叹，我 TM 的奋斗了一辈子存了一辈子钱，可是现在还是活成这个吊样哈哈哈哈",
          "en": "@yueyuea When you're 60, you'll exclaim, 'I've worked hard and saved money my whole life, but I'm still living this crappy way, hahaha.'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yueyuea 但是人生的意义总不能只是为了 ‘去码头整点薯条’ 而存在...网上现在有句话很流行，就是人生短短三万天，可能并不需要有什么意义，获得了非常多人的点赞，你也知道人生短短三万天，你愿意追求某些意义，可就是有很大一部分人不愿意追求你所谓的意义，大家只要各自活好各自的就行",
          "en": "@yueyuea But the meaning of life can't just be 'to go to the dock and get some fries'... There's a popular saying online now, which is that life is only 30,000 short days, and it may not need to have any meaning, which has been liked by a lot of people. You also know that life is only 30,000 short days, and you are willing to pursue some meaning, but there are a large number of people who are unwilling to pursue your so-called meaning, everyone just needs to live their own lives well."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我这个月刚过完 46 岁生日，嵌入式软件开发，坐标深圳，房子、车子、儿子都有了。我目前唯一的焦虑就是在思考，孩子长大了后，如何才能拥有一个不那么焦虑的人生？要润吗？2024 年 7 月底被裁，然后劳动仲裁，下半年我换了 3 份工作，所以，各位 v2er 加油！https://www.v2ex.com/t/1103272",
          "en": "I just had my 46th birthday this month. I'm an embedded software developer in Shenzhen, and I have a house, a car, and a son. My only anxiety right now is thinking about how my child can have a less anxious life when he grows up. Should I leave the country? I was laid off at the end of July 2024, then went through labor arbitration. I changed jobs three times in the second half of the year. So, good luck, everyone! https://www.v2ex.com/t/1103272"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作四五年就感觉到了，所以直接就润了，外面躺平还是轻松多了",
          "en": "I felt it after working for four or five years, so I just left the country directly. It's much easier to lie flat outside."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@skyrim61 确实得降低标准了",
          "en": "@skyrim61 Indeed, you have to lower your standards."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那我这种在学校还没毕业的，怕是毕业即失业了……",
          "en": "Then people like me who haven't graduated from school yet are probably going to be unemployed immediately after graduation..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "43 的老人，最近有所焦虑，不过离职保守有 30w 赔偿所以也就得过且过吧。",
          "en": "A 43-year-old, I've been a bit anxious lately, but I'll have at least 300,000 in compensation if I leave, so I'll just get by."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "32 不焦虑，想被裁",
          "en": "32, not anxious, want to be laid off."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一人吃饱全家不饿，一点不焦虑",
          "en": "I can feed myself and the whole family won't go hungry, not anxious at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有",
          "en": "Yes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dadaji 看来兄弟攒了不少啊",
          "en": "@dadaji Looks like you've saved up quite a bit, bro."
        }
      ],
      "type": "replies"
    }
  ]
}