{
  "id": 1111415,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "兄弟们，有个躺平的机会考虑要不要去",
          "en": "Brothers, there's a chance to lie flat, considering whether to go or not"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "工作地点是某著名净土宗寺庙，负责全栈开发负责他们的官网和小程序开发和维护，不是外包，工资不高好像只有 4K 往后每年固定+400 ，工资全部发现金，工作比较轻松，8 点上班 4 点下班不打卡，包吃住（只能跟着吃素了，但是没强制可以自己出去吃肉，在寺院内需要遵守清规戒律，平时出去不干涉），没有五险一金但是每年会额外报销 10000 额度需要自己去买，年终奖也有具体数字没说。\r\n\r\n前三个月需要跟着打坐发心，不安排工作",
          "en": "The work place is a famous Pure Land sect temple, responsible for full-stack development, responsible for their official website and app development and maintenance, not outsourcing. The salary isn't high, it seems only 4K with a fixed +400 annually. The salary is all paid in cash. The work is relatively easy, working from 8 am to 4 pm without clocking in. It includes room and board (you can only eat vegetarian food, but it's not mandatory, you can go out to eat meat yourself. You need to abide by the temple's rules and regulations, but they don't interfere with going out normally). There's no social insurance or housing fund, but 10,000 yuan will be additionally reimbursed each year, which you need to use to buy it yourself. There is also a specific amount for the year-end bonus, but it hasn't been said.\r\n\r\nFor the first three months, you need to meditate and initiate vows, and no work will be arranged."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "要离职需不需要经过方丈同意？",
          "en": "Do you need the abbot's approval to resign?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不建议去工资低，一年才 4 万 8000天天在那被香冒出来的烟熏，个人觉得对身体不好",
          "en": "I don't recommend going, the salary is low, only 48,000 a year, and you're smoked by the incense fumes every day. I personally don't think it's good for your health."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@shenyiyouge 你怎么敢假定我的性别",
          "en": "@shenyiyouge How dare you assume my gender"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "再找一个远程工作",
          "en": "Find another remote job"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "技术僧？",
          "en": "Tech monk?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "副业赚钱，主业旱涝保收",
          "en": "Make money on the side, and the main job guarantees income regardless of drought or flood."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挺好的啊，真是躺平人的梦想之地",
          "en": "It's pretty good, really a dream place for people who want to lie flat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "需要剃度吗",
          "en": "Do you need to shave your head?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "寺庙都是由专业 IT 外包运维公司的,咋找的你,是不是被忽悠了.法门寺就是,包括网站,旅游,小程序,都是旅游部和景区管理部门对接.哪有和尚干这个的,还让你运维?",
          "en": "Temples are all maintained by professional IT outsourcing and operations companies. How did they find you? Were you coaxed? That's the case with Famen Temple. Including the website, tourism, and apps, everything is connected with the tourism department and scenic area management department. Which monk would do this, and have you do the operations and maintenance?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "主要是你得确定你这个工作稳定按你的话说，一年固定+400那你呆个 10 年，岂不是一个月 8000 了？呆个 20 年，岂不是一个月 12000 了？那你现在就当 30 岁，干到 65 岁退休算你 30 年，岂不是 16000 一个月？我觉得他们这个工作不是很稳定啊，估计干个几年就没了。。。",
          "en": "Mainly, you have to make sure this job is stable. According to you, a fixed +400 per year, if you stay for 10 years, wouldn't that be 8,000 a month? If you stay for 20 years, wouldn't that be 12,000 a month? If you're 30 years old now, and work until you retire at 65, that's 30 years, wouldn't that be 16,000 a month? I don't think this job is very stable, it'll probably be gone in a few years..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "道友乱我佛心",
          "en": "Fellow Taoist, you are disturbing my Buddhist heart."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个岗位特别适合做自媒体  年薪百万指日可待",
          "en": "This position is especially suitable for self-media. A million-dollar annual salary is just around the corner."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好机会啊",
          "en": "Good opportunity!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想去",
          "en": "Want to go"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没五险一金不去。自己花的钱远超一万。",
          "en": "I won't go without social insurance and housing fund. The money you spend yourself far exceeds ten thousand."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好工作",
          "en": "Good job"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这好事，还不赶紧去，寺庙老赚钱了",
          "en": "This is a good thing, hurry up and go. Temples make a lot of money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挺好，可以去试试",
          "en": "Pretty good, you can try it out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看哪个城市的 4000",
          "en": "Depends on which city's 4000"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想起北京的龙泉寺了",
          "en": "Reminds me of Longquan Temple in Beijing"
        }
      ],
      "type": "replies"
    }
  ]
}