{
  "id": 1110835,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "广大 v 友，年后回杭，发现， 有人在窗户外面养大公鸡！",
          "en": "Dear V2EX friends, I returned to Hangzhou after the New Year and discovered that someone is raising a rooster outside their window!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "小区是拆迁房，都是隔断的房间，这两天去楼顶和楼层都找不到对应的房间。\r\n找物业，因为不是业主，无视，说他们也找不到。",
          "en": "The community is in a resettlement building, and the rooms are all partitioned. I've been to the roof and different floors these past few days, but I can't find the room where the rooster is.\r\nI contacted the property management, but they ignored me because I'm not an owner, and they said they can't find it either."
        },
        {
          "zh": "凌晨 3:30 开始鸡叫，隔一个小时鸡叫一次。。。",
          "en": "The rooster starts crowing at 3:30 AM, and crows every hour after that..."
        },
        {
          "zh": "求支招？换房还是等。。。",
          "en": "Any suggestions? Should I move or just wait...?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "喔喔喔",
          "en": "Cock-a-doodle-doo"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "肯定从老家带来的公鸡，别急养几天就吃了。",
          "en": "It must be a rooster brought from their hometown. Don't worry, they'll eat it in a few days."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@abc0123xyz 小时候听了几年，应该是 ger---ger---ger. 或 er---er---er",
          "en": "@abc0123xyz After listening for several years as a child, it should be ger---ger---ger. or er---er---er"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@theOneMe 6 ，改成：本户（ X 栋 X 号）育有大公鸡数只，将于 X 天后进行宰杀烹饪，届时请邻里光临寒舍，共襄盛举、尽欢而散。如 X 天后仍有鸡鸣，可拨打 110 提醒本户进行未竟事宜。",
          "en": "@theOneMe Add this: \"This household (Building X, Number X) is raising several roosters. They will be slaughtered and cooked in X days. At that time, neighbors are welcome to visit our humble abode to celebrate the event and enjoy themselves. If the rooster crows after X days, you can call 110 to remind this household to complete unfinished matters.\""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Lyn321 吃不吃不重要，我想和大公鸡见个面",
          "en": "@Lyn321 Whether they eat it or not is not important, I want to meet the rooster."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我之前也遇到了类似的事情，后来发现 tmd 是闹铃的声音",
          "en": "I encountered something similar before, and later found out it was the sound of an alarm clock. (tmd = abbreviation of a vulgar expression)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把这件事扩大影响范围，打印一些告示，站在养公鸡的角度来说；各位邻居，就是我养的鸡，门牌号：xxx-xxx-xxx ，我就爱养鸡，看不惯也得看着，有本事就报警抓我，没本事就闭嘴；",
          "en": "Expand the influence of this matter, print some notices, and speak from the perspective of the rooster raiser: \"Dear neighbors, I am raising this rooster, address: xxx-xxx-xxx. I just love raising chickens, if you don't like it, you'll have to deal with it. If you have the ability, call the police and arrest me, if you don't, shut up.\""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "牛，那个区域啊",
          "en": "Wow, which area is this?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dylanqqt 我上周也是这样想的，但距离公鸡打鸣也已经一周了",
          "en": "@dylanqqt I thought so too last week, but the rooster has been crowing for a week already."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "估计过两天周末就吃了。因为不是业主原因投诉被无视：换几个手机号，假装是附近几户业主的打电话投诉，不要主动提户号就说 xx 栋-xx 楼听到有公鸡叫声，叫人赶紧来处理。",
          "en": "They will probably eat it in a couple of days during the weekend. Because your complaints are ignored due to you not being an owner: Change a few mobile phone numbers, pretend to be a few nearby owners to call and complain, do not actively mention the flat number, just say that xx building - xx floor heard the rooster crowing, ask people to deal with it quickly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在杭州哪里，这么狂野",
          "en": "Where in Hangzhou is this, so wild?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "报警",
          "en": "Call the police"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正常，西安的拆迁房还有养羊的",
          "en": "Normal, there are even people raising sheep in resettlement housing in Xi'an."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不会是西溪湿地对面那边的小区吧",
          "en": "Could it be the residential area opposite Xixi Wetland?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Lexin914 我也希望这周末就赶紧吃了。那我去找归属地是杭州的号去",
          "en": "@Lexin914 I also hope they eat it this weekend. Then I'll go find some phone numbers registered in Hangzhou to call."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Patrick6 @cksspk 西溪北苑",
          "en": "@Patrick6 @cksspk Xixi Beiyuan"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Patrick6 @minglanyu 余杭西溪北苑 哎，",
          "en": "@Patrick6 @minglanyu Yuhang, Xixi Beiyuan, sigh,"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@theOneMe #11 哈哈哈，这招厉害啊。",
          "en": "@theOneMe #11 Hahaha, that's a great idea."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@theOneMe 我也真的发现，都是怕惹事还是怎么滴？感觉其他人都不在意。。。我还是属于 10:30 就睡觉的那种，我都感觉对我影响挺大的，",
          "en": "@theOneMe I also really found, are they all afraid of trouble or something? I feel like the others don't care... I'm the type who goes to sleep at 10:30, and I feel like it affects me a lot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有几只，一只的话给他抓了吃了，再赔他 100 块不就好了，用 100 块就解决了，哪需要报警",
          "en": "How many are there? If there's only one, just catch it and eat it, then pay him 100 yuan, 100 yuan will solve it, no need to call the police."
        }
      ],
      "type": "replies"
    }
  ]
}