{
  "id": 1112482,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大家认知的现在的智驾是什么水平？",
          "en": "What level of intelligent driving is currently recognized by everyone?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "还有现在的新车带智驾是不是算基本配置，我有天跟朋友讨论了这个事情，我个人感觉还远没有到普及的程度，朋友说我不了解认知偏差，感觉大部分人没有开上带智驾的车，也不了解智驾能做到什么",
          "en": "Are intelligent driving systems considered a basic configuration in new cars nowadays? I was discussing this with a friend the other day, and I personally feel that they are far from being widespread. My friend said I don't understand cognitive bias, and that most people haven't driven a car with intelligent driving and don't understand what intelligent driving can do."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "辅助驾驶愣是被吹成了智驾, 遥遥领先",
          "en": "Assisted driving is being touted as intelligent driving, far ahead of the competition."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "反正上周在我家地库，看到一个自动泊车没泊进去的小鹏，车内没人，我打电话通知车主，跟他说，他的车挡住路了，他还不可置信的说，怎么可能，我车明明停在车位了。",
          "en": "Anyway, last week in my garage, I saw a Xiaopeng car that failed to park automatically. There was no one in the car. I called the owner and told him that his car was blocking the road. He said in disbelief, how is that possible? My car is clearly parked in the parking space."
        },
        {
          "zh": "反正我觉得啥时候智驾出事故后厂商负责处理事故责任的时候，我觉得可以考虑。",
          "en": "Anyway, I think I'll consider it when manufacturers are responsible for handling accident liability after an intelligent driving accident."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dhb233 #20 重新定义 L4",
          "en": "@dhb233 #20 Redefining L4"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "爱国专用",
          "en": "For patriotic use only."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐过带智驾的顺风车，高速和快速路开个定速巡航，打个转向灯就能变道",
          "en": "I've taken a rideshare with intelligent driving. On the highway and expressway, you can turn on cruise control and change lanes by flicking the turn signal."
        },
        {
          "zh": "另外试驾过问界 M7 ，语音直接选个终点，自个儿就过去了，走高驾和自动变道超车都很稳。",
          "en": "I also test drove the AITO M7. I selected a destination directly by voice, and it went there by itself. High-speed driving and automatic lane changes and overtaking were very stable."
        },
        {
          "zh": "自动泊车和代客泊车很流畅，透明影像连车底什么东西都看得一清二楚。",
          "en": "Automatic parking and valet parking are very smooth, and the transparent image shows everything under the car very clearly."
        },
        {
          "zh": "网上吵那么多，不如试驾一次。",
          "en": "Instead of arguing so much online, it's better to take a test drive."
        },
        {
          "zh": "但高配车型限制和智驾包把我劝退了",
          "en": "But the high-end model restrictions and intelligent driving packages deterred me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "单纯讨厌某大嘴，导致现在也讨厌某为",
          "en": "Simply hate a certain big mouth, which leads to hating a certain company now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "评论区里面的小白鼠挺多的 佩服",
          "en": "There are quite a few guinea pigs in the comments. I admire them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能处理高速就行了城市还是自己开吧",
          "en": "It's enough if it can handle highways. I'd rather drive myself in the city."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人车共驾。",
          "en": "Human-machine co-driving."
        },
        {
          "zh": "比如人驾有 5%可能性犯错，打开智驾后因为放松警惕，人犯错可能性增加到 10%，智驾有 35%可能性犯错，那么有人监督的智驾可能就是 3.5%的犯错机会，还是比单纯人驾要好。",
          "en": "For example, if there is a 5% chance of human driving error, and the chance of human error increases to 10% after turning on intelligent driving due to relaxation, and intelligent driving has a 35% chance of error, then intelligent driving with human supervision may have a 3.5% chance of error, which is still better than purely human driving."
        },
        {
          "zh": "数字我瞎拍的，应该是不对的，就是表达个意思。",
          "en": "The numbers I made up, they're probably wrong, just expressing a meaning."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要厂商敢完全承担法律责任，那么智驾就成熟了，目前城市路段开智驾感觉别自己开还累。",
          "en": "Intelligent driving will only be mature when manufacturers dare to take full legal responsibility. Currently, driving with intelligent driving in urban areas feels more tiring than driving myself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没出事都是你好我好大家好，智驾牛逼",
          "en": "If nothing goes wrong, everything is fine, intelligent driving is awesome."
        },
        {
          "zh": "出事就是智能驾驶属于辅助驾驶，驾驶员全责",
          "en": "If something goes wrong, intelligent driving is just assisted driving, and the driver is fully responsible."
        },
        {
          "zh": "什么时候保险公司能全保智能驾驶就是它完全成熟了，因为水军会说谎，但精算师不会",
          "en": "When the insurance company can fully insure intelligent driving, then it is completely mature, because trolls will lie, but actuaries won't."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我在高速上看到最左车道的新能源车，都会试着开上去，慢慢减速。。。特别好玩儿",
          "en": "When I see a new energy vehicle in the leftmost lane on the highway, I try to drive up to it and slowly decelerate... It's especially fun."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关于智驾有一点很神奇，没有任一厂商通过具体数据秀肌肉。",
          "en": "One thing about intelligent driving is very strange: no manufacturer has shown off with specific data."
        },
        {
          "zh": "以前的 waymo 和 apollo 做“自动驾驶”的时候通常会公布里程数据，接管次数之类的数据证明智驾的可靠程度。",
          "en": "When Waymo and Apollo were doing 'automatic driving' in the past, they would usually publish mileage data, intervention times, and other data to prove the reliability of intelligent driving."
        },
        {
          "zh": "现在的“智能驾驶”厂商经常创造一堆高大上的名词，听起来很厉害，但是具体厉害在哪里又无法量化，用户使用智驾出车祸以后运气好一点定性为使用不当，一秒前退出，还能去维权，运气不好连维权的机会都没有了。",
          "en": "The current 'intelligent driving' manufacturers often create a bunch of grand-sounding terms that sound impressive, but it's impossible to quantify exactly where they are so impressive. If a user has an accident using intelligent driving, and is lucky, it will be defined as improper use, and they withdrew a second before, they can still defend their rights, but if they're not lucky, they won't even have the opportunity to defend their rights."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@langhuishan 让交警无法选中",
          "en": "@langhuishan Makes it impossible for traffic police to select."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "城市道路/停车 自己来，高速累了就 AUTOPILOT 。",
          "en": "City roads/parking - do it yourself. Use AUTOPILOT when tired on the highway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我认为华为智驾遥遥领先",
          "en": "I think Huawei's intelligent driving is far ahead."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zhangxiaoaiw  这心太大了吧，起码应该看着车在车位停好",
          "en": "@zhangxiaoaiw That's too careless, you should at least watch the car park properly in the parking space."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@skyrim61",
          "en": "@skyrim61"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大家在坐的都是 L2 ，只有量变没有质变",
          "en": "Everyone here is at L2, there is only quantitative change, no qualitative change."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去头部的车试驾一圈就知道了",
          "en": "Take a test drive of the leading cars and you'll know."
        }
      ],
      "type": "replies"
    }
  ]
}