{
  "id": 1110929,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "已婚和准备结婚的聊聊，婚后生活是否让你后悔",
          "en": "Married and soon-to-be-married folks, let's talk. Do you regret your married life?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "现在跟女友有讨论过结婚或者婚后的事情，感觉越聊越不想结婚了。",
          "en": "I've been discussing marriage and post-marriage life with my girlfriend, and the more we talk, the less I want to get married."
        },
        {
          "zh": "结婚一系列的流程也需要花费不少，大概 30w ，而且还要买房付个首付。",
          "en": "The series of procedures for getting married also cost a lot, about 300,000, and we also have to buy a house and pay a down payment."
        },
        {
          "zh": "我俩都 30 出头了，我对后续工作不看好，结完婚是否要孩子等等都是支出，父母年龄也大了。",
          "en": "We're both in our early 30s, and I'm not optimistic about future job prospects. Whether to have children after marriage is also an expense, and our parents are getting older."
        },
        {
          "zh": "总要预备些钱。",
          "en": "We always need to save some money."
        },
        {
          "zh": "现在对婚后生活一点也不向往。",
          "en": "I have no desire for married life now."
        },
        {
          "zh": "主要还是经济压力吧。",
          "en": "It's mainly the economic pressure."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "婚后生活舒不舒服取决于女人情绪稳不稳定",
          "en": "How comfortable married life is depends on the emotional stability of the woman."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果双方没有承担责任的能力，面对矛盾冲突没有辩证分析问题的能力，那么就别结。",
          "en": "If both parties don't have the ability to take responsibility and don't have the ability to dialectically analyze problems in the face of conflicts, then don't get married."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "结婚一系列的流程也需要花费不少，大概 30w",
          "en": "The series of procedures for getting married also cost a lot, about 300,000"
        },
        {
          "zh": "说白了，这些仪式，就是新郎新娘花钱演戏给亲朋好友看， 看你愿不愿意演。",
          "en": "To put it bluntly, these ceremonies are just the bride and groom spending money to put on a show for friends and relatives, depending on whether you are willing to perform."
        },
        {
          "zh": "结婚的时候，100 块一张的红票子， 就像 1 元钱一样， 发到手软。",
          "en": "When getting married, 100 yuan bills are like 1 yuan bills, handing them out until your hands are soft."
        },
        {
          "zh": "到了第二天早上酒醒， 就感叹， 要搬多少砖才能赚回来。",
          "en": "When you wake up the next morning after the alcohol wears off, you lament how many bricks you have to move to earn it back."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "后悔了，感觉自己过的时候挺好的，唯一的不好可能就是寂寞",
          "en": "I regret it. I felt pretty good when I was living alone, the only downside was maybe loneliness."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果 10 分的话，我觉得给个 8-9 分，还差一分是觉得以后应该会更美好。",
          "en": "If 10 is a perfect score, I would give it an 8-9, the missing point because I think it will be even better in the future."
        },
        {
          "zh": "我和老婆读书时候相识的，毕业时候，白手起家，就去大城市一点点攒，经历了很多事情，也有过很多争吵，最终总算折腾有个我们的家，觉得还是挺值得的，互相都挺珍惜的。",
          "en": "My wife and I met in school. When we graduated, we started from scratch and saved little by little in big cities. We experienced a lot of things and had many quarrels. Finally, we managed to have a home of our own, which I think is quite worthwhile, and we both cherish each other very much."
        },
        {
          "zh": "然后，我们都知道挣钱不容易，攒钱很辛苦，但是我们倒是在争取财务独立这方面有共同的认知，与原生家庭几乎没有财务纠葛，免去了非常多的烦心事，老婆也很理解人，性格也有耐心，觉得两个人的生活比一个人的生活好很多。",
          "en": "Also, we both know that it's not easy to make money and it's hard to save money, but we have a common understanding in striving for financial independence, and there is almost no financial entanglement with our original families, which avoids a lot of worries. My wife is also very understanding and patient, and she thinks that life with two people is much better than life alone."
        },
        {
          "zh": "总之，找到合适的人比找到优秀的人更重要。",
          "en": "In short, finding the right person is more important than finding an excellent person."
        },
        {
          "zh": "祝福 V 友们都能找到合适的人。",
          "en": "I wish all V friends can find the right person."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "结婚还好，带孩子是真的难",
          "en": "Marriage is okay, but raising children is really difficult."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "20 年领证，到现在快 5 年了，宝宝快一岁了，不后悔，很幸福。",
          "en": "Got the marriage certificate in 2020, it's been almost 5 years now, the baby is almost one year old, no regrets, very happy."
        },
        {
          "zh": "你现在这个状态就像我曾经和我前女友一样，总给我各种压力，那我和你结婚是为了产生更多压力？",
          "en": "Your current state is like my ex-girlfriend used to be with me, always putting all kinds of pressure on me. Did I marry you to create more pressure?"
        },
        {
          "zh": "果断分手事实证明我是对的，我现在的妻子对我很好，也不会给我压力，这才是健康的婚姻吧。",
          "en": "The decisive breakup proved me right. My current wife is very good to me and doesn't put pressure on me. This is a healthy marriage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不后悔，很美好",
          "en": "No regrets, it's wonderful"
        },
        {
          "zh": "随着年龄变化，也觉得各种事项都是看自己个人的",
          "en": "As I get older, I also feel that everything depends on the individual"
        },
        {
          "zh": "没有人说 结婚一定要办多少钱的流程的，如果觉得不该花就可以少花，自己觉得好就行",
          "en": "No one said that marriage must be done with a certain amount of money. If you feel you shouldn't spend it, you can spend less. Just feel good about it yourself."
        },
        {
          "zh": "也没说一定要生孩子",
          "en": "It doesn't mean you have to have children."
        },
        {
          "zh": "顾虑的工作不稳定、父母年纪大 就是实际存在的情况，你结不结婚 和这些事都没有影响",
          "en": "Worries about unstable work and aging parents are real, whether you get married or not has no impact on these things."
        },
        {
          "zh": "重要的是和对方 互相理解 待在一起就是很舒服 就结婚，没有准备一起面对生活的勇气 就不要结婚",
          "en": "The important thing is to understand each other and feel comfortable being together before getting married. If you are not prepared to face life together, don't get married."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要女的没被毒鸡汤灌了，男的理智，肯定是结婚好，我结了也没后悔。",
          "en": "As long as the woman hasn't been brainwashed by toxic chicken soup and the man is rational, marriage is definitely good. I got married and didn't regret it."
        },
        {
          "zh": "等哪天父母病了，需要大量时间金钱投入到医院的时候，就会想到自己老了怎么办，所以有一个娃的情况下，都还想再生一个，没体会过的可能无法理解，一个人照顾同时生病的父母是什么滋味。",
          "en": "When your parents get sick one day and need a lot of time and money to invest in the hospital, you will think about what to do when you are old, so even if you have one child, you still want to have another. Those who have not experienced it may not be able to understand what it is like to take care of sick parents at the same time."
        },
        {
          "zh": "不在乎自己面子的情况下，结婚简办就行。",
          "en": "If you don't care about your own face, you can have a simple wedding."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "离婚了 最近计划结婚，还是会向往婚姻的",
          "en": "Divorced. Planning to get married recently, I still yearn for marriage."
        },
        {
          "zh": "之前太年轻，稀里糊涂结婚了，后面两个人越来越不合适，就离婚了，现在 30 了 知道自己想要什么了，也找到三观契合，真正能聊得来的她了，现在想想很幸运。",
          "en": "I was too young before, and got married in a daze. Later, the two people became more and more unsuitable, so we divorced. Now that I am 30, I know what I want, and I have also found someone who shares my values and can really talk to me. Looking back now, I feel very lucky."
        },
        {
          "zh": "我觉得结婚不结婚就是一个法律的证明，真正要问问自己内心过的开不开心。",
          "en": "I think getting married or not is just a legal proof, you really have to ask yourself whether you are happy in your heart."
        },
        {
          "zh": "这点很重要",
          "en": "This is very important"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不要去智商低+性格倔强 / 强势女人结婚。",
          "en": "Don't marry a woman with low IQ + stubborn / strong personality."
        },
        {
          "zh": "成天拿着放大镜对着你的缺点放大。",
          "en": "Always magnifying your shortcomings with a magnifying glass."
        },
        {
          "zh": "对着优点视而不见觉得是应得的。",
          "en": "Turning a blind eye to the advantages, thinking it's deserved."
        },
        {
          "zh": "本着对你好的出发点带领这个家庭步入深渊 [借钱消费，乱投资] ，然后听不见你的建议。",
          "en": "Leading the family into the abyss with the starting point of being good for you [borrowing money for consumption, random investments], and then not listening to your advice."
        },
        {
          "zh": "容不得你的缺点，吃不了有点亏",
          "en": "Cannot tolerate your shortcomings, cannot stand a little loss."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真心不后悔",
          "en": "Sincerely no regrets"
        },
        {
          "zh": "1 、烦恼是可以 half 的",
          "en": "1. Worries can be halved"
        },
        {
          "zh": "2 、幸福是可以 double 的",
          "en": "2. Happiness can be doubled"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@NoobNoob030 上周才结就后悔 那结的是个勾 8",
          "en": "@NoobNoob030 If you regret getting married just last week, then you married a [something vulgar]"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人不一样，时间点不一样，情况也就不一样",
          "en": "People are different, the time is different, and the situation is also different."
        },
        {
          "zh": "当初我和我老婆结婚，就相互两家碰下彩礼然后定下来了",
          "en": "When my wife and I got married, the two families just discussed the bride price and then decided."
        },
        {
          "zh": "刚开始还房贷的时候我俩也很困难，我管月供，她管生活",
          "en": "When we first started paying off the mortgage, we were also very difficult. I took care of the monthly payment and she took care of living expenses."
        },
        {
          "zh": "每周为了省钱，周末一大早去菜市场买下周的食材",
          "en": "Every week, in order to save money, we went to the vegetable market early on weekends to buy ingredients for the next week."
        },
        {
          "zh": "我现在想想，还是年轻的时候好",
          "en": "Now that I think about it, it's better to be young."
        },
        {
          "zh": "年龄大了后反而思前想后，患得患失",
          "en": "When you get older, you think too much and worry about gains and losses."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要娃一时爽  不要娃一直爽",
          "en": "Having a baby is temporarily enjoyable, not having a baby is always enjoyable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生活如果你想计划的过，那只能是缘木求鱼。",
          "en": "If you want to live life according to a plan, it is like climbing a tree to catch fish."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这不是小马过河吗？",
          "en": "Isn't this like the little horse crossing the river?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恋爱和刚结婚幸福是正常的,每个人都一样.",
          "en": "It is normal to be happy when in love and newly married, everyone is the same."
        },
        {
          "zh": "当上有老下有小,遇到中年危机,工作 生活 养老 经济 体力等压力上来的时候,疲于奔命,矛盾就到顶点了",
          "en": "When you have old people above you and young people below you, encounter a mid-life crisis, and face pressure from work, life, pension, economy, physical strength, etc., you are exhausted and the conflict reaches its peak."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liuzimin 全靠缘分，在青藤认识的，聊下来发现特别投缘、",
          "en": "@liuzimin All depends on fate. Met on QingTeng. We chatted and found that we were very compatible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "什么样的家庭结婚流程要花 30 万啊。。。",
          "en": "What kind of family needs to spend 300,000 on marriage procedures...?"
        },
        {
          "zh": "我结婚彩礼 0 ，五金 0 ，没有结亲，岳父母自己包车把我老婆送我家，车费我都没掏，就家里办酒花了几千块钱。",
          "en": "My bride price for marriage was 0, five gold items were 0, there was no wedding ceremony, and my parents-in-law chartered a car to send my wife to my home. I didn't even pay for the car fare, and it only cost a few thousand yuan to hold a banquet at home."
        }
      ],
      "type": "replies"
    }
  ]
}