{
  "id": 1112328,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "外地人想问一下浙里办真的超级好吗？",
          "en": "Out-of-towners want to ask, is the \"Zhe Li Ban\" app really that good?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "最近杭州六小龙很火。",
          "en": "Recently, the 'Hangzhou Six Little Dragons' are very popular."
        },
        {
          "zh": "听说浙里办很方便， 这个是真的吗？",
          "en": "I heard that \"Zhe Li Ban\" is very convenient, is this true?"
        },
        {
          "zh": "在北方办个业务的跑断腿",
          "en": "In the north, you have to run your legs off to handle a single piece of business."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "#16  不要把成都和杭州放在一起，成都的政务 app 多得数不完，一件事都办不成 @weixind",
          "en": "#16 Don't put Chengdu and Hangzhou together. Chengdu has countless government apps, but you can't get anything done. @weixind"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "讲实话，如果比卷的话，浙江政务是真的卷，风气就这样。",
          "en": "To be honest, if we're talking about competitiveness, Zhejiang's government services are truly competitive; that's just the culture."
        },
        {
          "zh": "比起我父辈的年代，至少从信息化程度来看，已经跟上互联网发展了。",
          "en": "Compared to my parents' generation, at least in terms of information technology, it has caught up with the development of the internet."
        },
        {
          "zh": "但还是摆脱不了政务信息系统的特色——又不是不能用。",
          "en": "But it still can't get rid of the characteristics of government information systems - it's not that it can't be used, it's just not ideal."
        },
        {
          "zh": "各种信息系统，只能说有，不能说好，每次访问都要人脸识别，贼烦。",
          "en": "Various information systems can only be said to exist, not that they are good. Every time you access them, you need face recognition, which is very annoying."
        },
        {
          "zh": "体验差成本高，如果是商业项目早被喷了，明明内嵌支付宝，但风控的本领是一点都没学来。",
          "en": "The experience is poor and the cost is high. If it were a commercial project, it would have been criticized long ago. It's obviously embedded with Alipay, but it hasn't learned any of the risk control skills."
        },
        {
          "zh": "至少在关键环节启用人脸来验明正身就够了，光登录验啥呀，还经常验两遍，也不知道前后端咋联调的。",
          "en": "At least enabling face recognition to verify identity in key links is enough. What's the point of just verifying the login, and often verifying it twice? I don't even know how the front-end and back-end are connected."
        },
        {
          "zh": "信息系统建设按政务习惯，走的是基建项目类似的招投标项目制，虽然也是公开招标，但还是有裙带关系在，验收也就这样。",
          "en": "The construction of information systems follows the government's habits, using a bidding and project system similar to infrastructure projects. Although it is also a public tender, there are still cronyism involved, and the acceptance is just so-so."
        },
        {
          "zh": "公共服务的项目还有群众监督，不能用是不可能验收的，不好用也会被骂的。",
          "en": "Public service projects are also subject to public supervision. It's impossible to accept them if they can't be used, and they'll be criticized if they're not easy to use."
        },
        {
          "zh": "不过也有多版本迭代之后变好的，比如杭州的车牌摇号，比起初始版本，明显提升了很多。",
          "en": "However, some projects have improved after multiple version iterations, such as Hangzhou's license plate lottery, which has improved significantly compared to the initial version."
        },
        {
          "zh": "内部系统的话，可以跟屎相提并论。",
          "en": "As for the internal systems, they can be compared to sh*t."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最多跑一次，真不是说说的。。。",
          "en": "'At most one trip' is not just talk..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@weixind #23 因为体验过 对比过 金杯银杯不如老百姓的口碑",
          "en": "@weixind #23 Because I experienced it and compared it, a gold or silver cup is not as good as the people's reputation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "浙里办是浙江政务的缩影，真正厉害在政府改革浙江一直走在最前面的，然后其他地方模仿的。",
          "en": "\"Zhe Li Ban\" is a microcosm of Zhejiang's government affairs. The real strength lies in the government reform, with Zhejiang always being at the forefront, and then other places imitating it."
        },
        {
          "zh": "你要知道要是没有浙里办这种先驱，也不会有现在百花齐放。@weixind",
          "en": "You should know that if there were no pioneers like \"Zhe Li Ban\", there would be no vibrant development now. @weixind"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好不好用，得对比后才知道。",
          "en": "You only know if it's good or not after comparing it."
        },
        {
          "zh": "偷偷告诉你，河南还有个豫事办 哈哈哈哈哈哈哈哈哈",
          "en": "Secretly telling you, Henan also has a \"Yu Shi Ban\" app. Hahahahahahahaha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "浙里办作为 APP ，体验上其实一般，比如进不同的模块要反复刷脸，光进去就要刷脸，提交的时候还要再刷一次。",
          "en": "As an app, Zhe Li Ban's experience is actually average. For example, you have to repeatedly scan your face to enter different modules. You have to scan your face just to enter, and then scan it again when submitting."
        },
        {
          "zh": "感觉第一次就不是很有必要，底座应当为这些不同单位开发的模块提供一个更方便的客户身份认证模块，不用每次都搞强认证。",
          "en": "I feel that the first time is not very necessary. The underlying platform should provide a more convenient customer identity authentication module for the modules developed by these different units, without the need for strong authentication every time."
        },
        {
          "zh": "在技术上浙里办还有一点是我觉得挺厉害的，因为他们的 app 底座是阿里的 mpaas 嘛，去 mpaas 底座的地方相互嵌感觉挺正常的，但他们现在竟然还能在微信小程序里面用，也不知道是阿里出了轨还是腾讯劈了腿。",
          "en": "Technically, another thing I think is quite impressive about \"Zhe Li Ban\" is that because their app's underlying platform is Alibaba's mpaas, it feels normal to embed each other in places with the mpaas platform, but now they can even use it in WeChat mini-programs. I don't know if Alibaba cheated or Tencent cheated."
        },
        {
          "zh": "最厉害的是 ———— 业务流程经过信息化改造，线上线下都是，他们会优化有必要优化的所有流程，给自己和用户省力气",
          "en": "The most amazing thing is that the business processes have been transformed through information technology, both online and offline, and they will optimize all processes that need to be optimized to save effort for themselves and users."
        },
        {
          "zh": "还有就是态度问题，在浙里办的年代之前，如果因为业务流程的不完善，碰到办不下去的情况，不闹不找关系的情况下就是回复：“办不了、回去吧、你这有啥啥问题、那有啥啥问题，管你有理没理，反正都是你的问题”；",
          "en": "And there is the attitude problem. Before the era of \"Zhe Li Ban\", if you encountered a situation where you couldn't handle something due to imperfect business processes, without making a fuss or seeking connections, the reply would be: \"Can't be done, go back, you have this problem, that problem, whether you are right or wrong, it's all your problem anyway\";"
        },
        {
          "zh": "现在碰到办不了的情况心虚的是他们，自觉点的知道自己提交问题给他们的科技部门去处理，不自觉的打个 12345 或者浙里办“民呼我为”提交一下，政府办也是发函过去给对应单位要求 100%限时正式回复，既然是正式回复那肯定是要讲道理的，过阵子还能看到他们线上的流程增加了对此次特殊情况的处理流程（本刁民常干这事，反正他们也就提需求呗，他们的科技部门和外包公司吭哧吭哧把活干了，有时候反应了问题，他们先吭哧吭哧把程序改了再给我回复都有……）。",
          "en": "Now, when they encounter situations that cannot be handled, they are the ones who feel guilty. Those who are aware of the situation know to submit the problem to their technology department for processing, and those who are not aware can call 12345 or submit it via the \"People's Call, I Will Do\" section of Zhe Li Ban. The government office will also send a letter to the corresponding unit, requiring a 100% formal response within a limited time. Since it is a formal response, it must be reasonable. After a while, you can see that their online process has added a process for handling this special situation (I, this troublesome citizen, often do this. Anyway, they just raise the demand, and their technology department and outsourcing companies work hard to get the job done. Sometimes, after I report a problem, they first modify the program and then reply to me...)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "浙里办上申请租房提取公积金，基本信息填上之后，甚至都不需要租房合同。",
          "en": "When applying for housing provident fund withdrawal for renting a house on \"Zhe Li Ban\", after filling in the basic information, you don't even need a rental contract."
        },
        {
          "zh": "提交之后半小时钱就到账了。",
          "en": "The money arrives in your account half an hour after submitting."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最好不跑就可以办",
          "en": "It's best if you can handle it without having to go anywhere."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "江浙沪政务数字化应该都整挺好的，不过江苏十三太保还是挺变态，一个市一个政务平台",
          "en": "The digitization of government affairs in Jiangsu, Zhejiang, and Shanghai should be pretty good, but the \"Thirteen Taibaos of Jiangsu\" are still quite abnormal, with each city having its own government platform."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "盲猜 op 在山东",
          "en": "Blindly guessing that the OP is in Shandong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实不用浙里办，直接去办也挺快的。",
          "en": "Actually, you don't need \"Zhe Li Ban\", it's quite fast to go directly."
        },
        {
          "zh": "办过房产证，护照，身份证，港澳通行证，当场办好，不是当场的免费邮政 ems 到你家。",
          "en": "I have handled property ownership certificates, passports, ID cards, and permits for Hong Kong and Macao. If it can be done on the spot, it will be done. If not, it will be mailed to your home for free via postal EMS."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@weixind 用浙江县级市的行政水平对标首都，难道不是一种进步吗？",
          "en": "@weixind Is it not a form of progress to benchmark the administrative level of a county-level city in Zhejiang against the capital?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dem0ns #21 不营销你怎么知道杭州的政务是“全国第一”。",
          "en": "@dem0ns #21 How would you know that Hangzhou's government affairs are \"number one in the country\" without marketing?"
        },
        {
          "zh": "比如楼上说的“新生儿落户一件联办”。",
          "en": "For example, the \"one-stop joint handling of newborn household registration\" mentioned above."
        },
        {
          "zh": "搜索结果来看全国各地整体政务服务都是升级过的。",
          "en": "Looking at the search results, the overall government services across the country have been upgraded."
        },
        {
          "zh": "只有杭州是全国第一。",
          "en": "Only Hangzhou is the first in the country."
        },
        {
          "zh": "营销并不是贬义啊，很多城市就是差营销这一步。https://www.google.com/search?q=%E6%96%B0%E7%94%9F%E5%84%BF%E8%90%BD%E6%88%B7%E4%B8%80%E4%BB%B6%E8%81%94%E5%8A%9E",
          "en": "Marketing is not a derogatory term. Many cities are lacking in this step of marketing. https://www.google.com/search?q=%E6%96%B0%E7%94%9F%E5%84%BF%E8%90%BD%E6%88%B7%E4%B8%80%E4%BB%B6%E8%81%94%E5%8A%9E"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好用，顺便强烈推荐浙里办的「民呼我为」无论碰到啥问题都能提，不管能不能解决，问题都会闭环，至少会有人去联系或者处理，反馈结果会电话联系你。",
          "en": "It's easy to use. By the way, I strongly recommend \"People's Call, I Will Do\" in \"Zhe Li Ban\". You can raise any problem you encounter. Regardless of whether it can be solved or not, the problem will be closed-loop. At least someone will contact you or handle it, and the feedback result will be contacted by phone."
        },
        {
          "zh": "我自己提交过的有公园流浪狗问题；社保问题；证书补贴问题；建议某路口加装红绿灯等，能不能处理都打电话过来说明原因。",
          "en": "I have submitted problems such as stray dogs in parks; social security issues; certificate subsidy issues; and suggestions to install traffic lights at a certain intersection, etc. They will call to explain the reasons whether they can be handled or not."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SuperDaniel313 #22 看起来方便很多啊！！！！",
          "en": "@SuperDaniel313 #22 It looks much more convenient!!!!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "浙江政务水平跟全国其他地方断档式领先，毫无疑问",
          "en": "There is no doubt that Zhejiang's government service level is leading the rest of the country by a significant margin."
        },
        {
          "zh": "2014 年我办公积金，去北京领我之前工作遗留的，说三个工作日到账，已经觉得很快了，结果下周到杭州领，二楼办的业务，办完还没走到一楼，到账的短信和银行消息推送就到了",
          "en": "In 2014, when I was handling my housing provident fund, I went to Beijing to collect what I had left over from my previous job, and they said it would arrive in three working days, which I already thought was fast. As a result, the following week I went to Hangzhou to collect it, and the SMS and bank message push arrived before I even walked to the first floor after finishing the business on the second floor."
        },
        {
          "zh": "2014 年在杭州办市民卡，在市民卡中心看材料准备复印身份证时，大厅里复印机上贴了四个大字「不用付钱」，换别的省市这种地方不收个一块钱一张起都算友好的",
          "en": "In 2014, when I was applying for a citizen card in Hangzhou, when I was looking at the materials and preparing to photocopy my ID card at the Citizen Card Center, there were four big characters on the photocopier in the hall: \"No payment required.\" If you were in another province or city, it would be considered friendly if they didn't charge at least one yuan per sheet."
        },
        {
          "zh": "2016 年生娃，给娃上户口是某天下午出去做件别的啥事，路过派出所，快下班的点就准备进去问下都要哪些材料和手续，结果当场就办好了，没有「我们马上就要下班了你这人怎么这么事儿逼没点眼力劲赶紧走」的态度",
          "en": "In 2016, when I had a baby, I was going to register the baby's household. One afternoon, I was out doing something else and passed by the police station. It was almost closing time, so I was going to go in and ask what materials and procedures were needed. As a result, it was done on the spot, without the attitude of \"We are about to get off work. Why are you so troublesome and have no brains? Get out quickly.\""
        },
        {
          "zh": "2020 年生老二，这次上户口什么的连去派出所都不用了，直接手机上「出生一件事」联办好，材料直接 EMS 寄回家，这种首次的连快递费都不用出",
          "en": "In 2020, when I had my second child, I didn't even need to go to the police station to register the household. I directly handled the \"One Thing for Birth\" jointly on my mobile phone, and the materials were sent directly to my home by EMS. I didn't even have to pay for the first-time express delivery."
        },
        {
          "zh": "2024 年给老大换身份证给老二办身份证，需要采集指纹这个没法不去现场了，周末去的中午快下班了，服务大厅里还是有志愿者在帮忙，拍照的地方也没有因为小朋友不配合而各种烦躁，反倒是备好有领子的深色外套方便上衣穿得不适合拍照的人临时用，办完说是一周内寄到，其实就是第三天",
          "en": "In 2024, I had to change my eldest child's ID card and apply for an ID card for my second child. This required fingerprint collection, so I had to go to the site. I went on the weekend, near closing time at noon. There were still volunteers helping in the service hall, and the people at the photography place were not annoyed because the children were uncooperative. Instead, they had dark jackets with collars ready for people whose tops were not suitable for taking pictures. After the procedure, they said it would be mailed within a week, but it was actually the third day."
        },
        {
          "zh": "现在区政务中心就在我旁边，没事会去溜达下，一楼大厅里电脑、打印机、复印机都是免费用的，有书吧什么的也免费开放，办事的窗口都是低柜台，工作人员和来办事的大家就平等坐着弄（反正换我是这里工作人员我可能都不愿意做，我觉得有点拘束了，他们薪资高一点我没有任何意见",
          "en": "Now the district government service center is next to me, and I will go for a stroll when I have nothing to do. The computers, printers, and photocopiers in the hall on the first floor are free to use, and the book bar and other things are also open for free. The windows for handling affairs are low counters, and the staff and the people who come to handle affairs sit equally and do it (anyway, if I were a staff here, I might not be willing to do it. I think it's a bit restrictive, and I have no objection to them having higher salaries."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "核心不是浙里办吧，应该是背后部门的整合划分和协调。",
          "en": "The core is not \"Zhe Li Ban\", but the integration, division, and coordination of the departments behind it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实上海的随申办也是不错的，我从外地来到这边之后 发现办证相关的基本上都可以在线上申请 而且审批的速度挺快的。",
          "en": "Actually, Shanghai's \"Suishenban\" is also good. After I came here from out of town, I found that I can basically apply for certificate-related matters online, and the approval speed is quite fast."
        },
        {
          "zh": "相比之下我老家湖北那边一言难尽，就是补办个身份证 或者办理个学生社保卡之类的事情 起码花上一个下午还要排队，不知道现在如何了",
          "en": "In contrast, my hometown Hubei is hard to describe. It takes at least an afternoon and a queue to reissue an ID card or apply for a student social security card. I don't know how it is now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "愉快办也很不错",
          "en": "'Happy Ban' is also very good."
        }
      ],
      "type": "replies"
    }
  ]
}