{
  "id": 1110706,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想问下大家每个月给女朋友多少生活费",
          "en": "I want to ask everyone how much allowance you give your girlfriend each month."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前几天相亲约了一个妹子 27 岁，比我小 10 岁。\r\n\r\n一起吃饭花了 200 多，她买护肤品是她自己的钱。感觉她也挺积极的，主动找话题聊，会主动挽着我的胳膊逛，晚上回去后说我给她印象很好。\r\n\r\n现在计划和她处对象。由于我们之间经济差异大，所以我肯定要多少给她一些生活费的，所以想问下大家的情况参考下。\r\n\r\n我们是在内地一个三线小城市，房价大约 1 万一平。平均工资 5000.",
          "en": "I went on a blind date a few days ago with a girl who is 27 years old, 10 years younger than me.\r\n\r\nWe spent more than 200 yuan on dinner, and she bought her own skincare products with her own money. I feel that she is very active, taking the initiative to find topics to chat about, taking the initiative to hold my arm while shopping, and told me after going back at night that I gave her a very good impression.\r\n\r\nNow I plan to date her. Because of the large economic difference between us, I will definitely give her some living expenses, so I want to ask about everyone's situation for reference.\r\n\r\nWe are in a third-tier city in the mainland, where housing prices are about 10,000 yuan per square meter. The average salary is 5000."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我滴龟龟",
          "en": "Oh my turtle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "为什么要给生活费？",
          "en": "Why give living expenses?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在我的家乡这种行为叫包养",
          "en": "In my hometown, this behavior is called being kept."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上一个踩的坑还不深吗   https://v2ex.com/t/1078225",
          "en": "Wasn't the last pit you fell into deep enough? https://v2ex.com/t/1078225"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "额，我女朋友每个月给钱我的",
          "en": "Um, my girlfriend gives me money every month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "肯定是全部工资上交啊，不然她都没有安全感。",
          "en": "You definitely have to hand in your entire salary, otherwise she won't feel secure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "主动挽胳膊你就上头了？",
          "en": "You got excited just because she took the initiative to hold your arm?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这是半包吗",
          "en": "Is this a partial arrangement?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生活费？你是感觉对方活不起了吗... 主动买单多送点礼物就可以了，顶多过节再发个红包，千万别按月给钱，对任何人都没好处。",
          "en": "Living expenses? Do you feel like the other person can't survive without it? Just take the initiative to pay and give more gifts. At most, send a red envelope during the holidays. Never give money on a monthly basis. It's not good for anyone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有，在女孩身上花钱要花那些两个人都能体验的，比如吃饭、看演出、游玩等，这样不仅能增进感觉还能不亏。切记不用轻易送贵重包、化妆品等奢侈品，这种只能关系到一定程度才能送，比如有亲密接触正式确立关系，不然在女孩眼里就是不自信低价值表现",
          "en": "Also, when spending money on girls, spend it on things that both of you can experience, such as eating, watching shows, and playing, which can not only enhance your feelings but also not be a loss. Remember not to easily give expensive bags, cosmetics and other luxury goods. This can only be given when the relationship reaches a certain level, such as having intimate contact and formally establishing a relationship, otherwise it will be seen as a lack of confidence and low value in the eyes of girls."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看样子你是哪个都没选？ /t/1080226",
          "en": "Looks like you didn't choose any of them? /t/1080226"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@feiniu 看 op 之前的帖子可知：全包是 2w/day",
          "en": "@feiniu According to OP's previous posts: the full package is 20,000 yuan/day"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“由于我们之间经济差异大，所以我肯定要多少给她一些生活费的”你是他爹？这个“所以”是从哪里冒出来的27 岁的大龄女，不谈恋爱是会饿死么？非得谈个恋爱 找个人接济自己？ 22 岁毕业到现在工作 5 年还养不起自己的废物，你还搁这稀罕上了。。。自己给自己买化妆品难道是什么优秀品质？她自己的消费不就该自己来，没钱就该用便宜货。你花你自己钱给自己买东西，难道值得表扬？她积极，是因为你属于她的优质候选人。开开智吧，37 都快 40 了，搁这主动自觉当上 ATM 了，还舔着个脸来问大家“我每个月该给多少”真是搞笑 这破帖子",
          "en": "'Because there is a large economic difference between us, I will definitely give her some living expenses.' Are you her dad? Where did this 'therefore' come from? A 27-year-old older woman, will she starve to death if she doesn't date? Does she have to date someone to support herself? A waste who graduated at 22 and has been working for 5 years and still can't support herself, and you still cherish her... Is it a good quality to buy your own cosmetics? She should pay for her own expenses. If she doesn't have money, she should use cheap goods. You spend your own money to buy things for yourself, is that worthy of praise? She's active because you're her high-quality candidate. Wake up. You're almost 40 at 37, and you're voluntarily and consciously becoming an ATM, and you're shamelessly asking everyone 'How much should I give each month?' This is ridiculous, this shitty post."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就爱吊小妹妹？",
          "en": "Just like chasing young girls?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "结婚 还是什么，肯定给的越多越好呀",
          "en": "If it's marriage or something, the more you give, the better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要是 20 岁我还能理解，点进来看到 27 岁就离谱了...",
          "en": "If she were 20 years old, I could understand, but seeing that she's 27 is just outrageous..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "答应我  别当舔狗好吗   她是四肢瘫痪了还是缺胳膊缺腿了    你要是真喜欢她   宁可出门费用全包也别搞什么生活费亲密付   到时候别分手了又到这里哭对方是渣女",
          "en": "Promise me, don't be a simp. Is she paralyzed in all four limbs or missing arms and legs? If you really like her, you'd rather cover all the expenses for going out than give her living expenses or use the 'intimate payment' feature. Don't come back here crying that she's a bad girl when you break up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在我的家乡这种行为叫包养",
          "en": "In my hometown, this behavior is called being kept."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这不就是包养女大学生么",
          "en": "Isn't this just keeping a female college student?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "师傅，你是做什么工作的？",
          "en": "Master, what kind of work do you do?"
        }
      ],
      "type": "replies"
    }
  ]
}