{
  "id": 1114780,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "2 月最后一天，祝自己快乐",
          "en": "Happy to myself on the last day of February"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "2 月最后一天，祝自己生日快乐。\r\n\r\n30 了，没成家，没立业，没车，没房，没女朋友，没社交，俨然活成了自己曾经讨厌的模样。\r\n\r\n以前，虽然比不上那些大佬，但也算是一小群人中的佼佼者。\r\n\r\n可现在，只是个小小职员，上也上不去，跳也不好跳，还要整天担心被裁员。\r\n\r\n如果那年，我没有乱跳槽，现在也不至于这样啊。\r\n\r\n如果那年，在「爱我的」和「我爱的」两个女孩中间，我没有选择后者，现在小孩估计都能跑了，那可是一个在我没车没房没存款的时候，不要彩礼还愿意跟我一起打拼攒钱买房的好女孩啊。。。\r\n\r\n可惜，人生没有如果，再也遇不到那个贵人，再也遇不到那个女孩...\r\n\r\n不再去想如果了...\r\n\r\n好在，自己父母健康，自己这份工作暂时还没丢，自己还有一点点积蓄，自己还有一点点梦想。\r\n\r\n趁梦想还没丢，趁自己还没放弃，继续努力吧，再拼一把。\r\n\r\n干中学，学中干，加油，自己。",
          "en": "Happy birthday to myself on the last day of February.\r\n\r\nI am 30, unmarried, without a career, no car, no house, no girlfriend, no social life, and I have become the person I used to hate.\r\n\r\nIn the past, although I couldn't compare to those big shots, I was still a top player in a small group.\r\n\r\nBut now, I am just a small employee, unable to be promoted, not easy to change jobs, and always worried about being laid off.\r\n\r\nIf I hadn't changed jobs so frequently that year, I wouldn't be in this situation now.\r\n\r\nIf that year, between the two girls, \"the one who loved me\" and \"the one I loved\", I hadn't chosen the latter, my child might be able to run now. That was a good girl who was willing to work hard and save money to buy a house with me when I didn't have a car, a house, or any savings... \r\n\r\nUnfortunately, life has no ifs. I will never meet that benefactor again, and I will never meet that girl again...\r\n\r\nI will stop thinking about ifs...\r\n\r\nFortunately, my parents are healthy, my job hasn't been lost for the time being, I still have a little savings, and I still have a little dream.\r\n\r\nBefore my dream is lost, before I give up, let's keep working hard, and fight again.\r\n\r\nLearn by doing, and do while learning. Come on, myself."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "牛马三件套了解一下「车贷房贷孩子」，你这都没有被套牢，属实遥遥领先了，还担心个锤子裁员",
          "en": "Get to know the three-piece set of the working class: \"car loans, mortgage loans, and children\". You are not trapped by any of these, you are really far ahead. Why worry about being laid off?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有没有一种可能，你选一个爱你的，结果后面还是掏钱掏心费力生了孩子一地鸡毛人生的路有很多种，你不要美化你没走过的路",
          "en": "Is it possible that if you chose someone who loved you, you would still spend money and effort to have a child, leading to a messy life? There are many paths in life, don't romanticize the path you didn't take."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "已经战胜 99%的牛马了，加油！",
          "en": "You have already defeated 99% of the working class, keep it up!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐。我才意识到二月只有 28 天，异地距离下次相见还有 2 个月，感觉时间一下子又快了 3 天，很开心。",
          "en": "Happy birthday. I just realized February only has 28 days, and it's 2 months until we meet again. I feel like time has suddenly sped up by 3 days. I'm very happy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐，靓仔",
          "en": "Happy birthday, handsome boy"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐，bro",
          "en": "Happy birthday, bro"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fakecoder 这是我最爱的一集，也是整部剧里最爱的一个片段",
          "en": "@fakecoder This is my favorite episode, and also my favorite scene in the whole show"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "嗨，生日快乐",
          "en": "Hi, happy birthday"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生快",
          "en": "Happy birthday"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加油，生日快乐",
          "en": "Come on, happy birthday"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加油，我 29 周岁未满 30 周，无房无车无老婆孩子无存款，普通小职员，不想努力只想躺平，祝你生日快乐",
          "en": "Come on, I am not yet 30 years old, no house, no car, no wife, no children, no savings, an ordinary small employee, I don't want to work hard, I just want to lie down. Happy birthday to you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐。我后天过，过了就 28 了。一样迷茫，保持每天快乐吧，说不定明天就噶了",
          "en": "Happy birthday. I will celebrate it the day after tomorrow, then I will be 28. Just as confused, stay happy every day, maybe I'll die tomorrow"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐，加油！",
          "en": "Happy birthday, keep it up!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐",
          "en": "Happy birthday"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这生日 4 年过一次",
          "en": "You only celebrate your birthday once every 4 years"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Geekgogo 生日不是过阴历吗？",
          "en": "@Geekgogo Isn't birthday celebrated by the lunar calendar?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生日快乐",
          "en": "Happy Birthday"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@harryWebb 确实，不要后悔没选的另一条路",
          "en": "@harryWebb Indeed, don't regret the path you didn't choose"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "兄弟生日快乐。我跟你同龄，也无房无车无对象，这是我主动选择放弃的，现在我感觉我活的非常好，每天都很开心快乐。",
          "en": "Happy birthday, brother. I am the same age as you, and I have no house, no car, and no partner. This is what I chose to give up. Now I feel that I am living very well, and I am happy every day."
        }
      ],
      "type": "replies"
    }
  ]
}