{
  "id": 1111511,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "后续来啦，我们准备订婚了",
          "en": "Update: We are getting engaged!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前情提要：\r\nhttps://www.v2ex.com/t/1049225",
          "en": "Previously on:\r\nhttps://www.v2ex.com/t/1049225"
        },
        {
          "zh": "\r\n\r\n去年上半年因为彩礼的事情我们之间冷战了好几天。",
          "en": "\r\n\r\nLast year, in the first half of the year, we had a cold war for several days because of the bride price."
        },
        {
          "zh": "后来，我和我一个表哥说了这些事情，他希望我们俩能够好好的、心平气和的沟通一次。",
          "en": "Later, I told my cousin about these things, and he hoped that we could have a good and calm conversation."
        },
        {
          "zh": "\r\n\r\n后来，我们面对面好好沟通了一次，也许是之前我们沟通有问题，大家都理解错对方的意思了，也没有站在对方的角度去看待问题，导致了这次的冲突。",
          "en": "\r\n\r\nLater, we had a good face-to-face conversation. Maybe we had communication issues before, and everyone misunderstood each other's meaning, and we didn't look at the problem from each other's perspective, which led to this conflict."
        },
        {
          "zh": "对于彩礼，女朋友的单纯想法是地方的风俗就是这样，如果太少，显得不太重视，而且她觉得她爸妈肯定不会用我们的钱。",
          "en": "Regarding the bride price, my girlfriend's simple idea is that the local custom is like this, if it's too little, it seems like we don't value it enough, and she thinks her parents definitely won't use our money."
        },
        {
          "zh": "女朋友也理解我的压力，会尽量去和她爸妈沟通这些问题，一起努力，对于之前很多不好的习惯也会去改，养成储蓄的习惯，减少不必要的花销，比如周末尽量减少出去吃，而是她下厨自己做，平时她下班早，如果有时间，还会做好饭让我第二天带去。",
          "en": "My girlfriend also understands my pressure and will try her best to communicate these problems with her parents, work together, and change many bad habits, develop the habit of saving, reduce unnecessary expenses, such as trying to reduce eating out on weekends, but instead she cooks herself. Usually, she gets off work early, and if she has time, she will cook and let me take it the next day."
        },
        {
          "zh": "\r\n\r\n去年六七月份的时候她换了工作，待遇好了一些，今年过年前，她偷偷给我买了台 macbook pro 让我非常感动，这对于她来说是一笔非常大的开支。",
          "en": "\r\n\r\nShe changed jobs around June or July last year, and the salary was better. Before the Chinese New Year this year, she secretly bought me a MacBook Pro, which made me very touched, as this is a very large expense for her."
        },
        {
          "zh": "\r\n\r\n今年过年的时候去她家讨论订婚的事情，她爸妈什么要求也没提，没要求车子、房子、彩礼也是让我们家看着给，唯一希望就是以后能生两个。",
          "en": "\r\n\r\nWhen I went to her house to discuss the engagement during the Chinese New Year this year, her parents didn't make any requests. They didn't ask for a car, a house, and the bride price was up to my family to decide. The only hope was that we could have two children in the future."
        },
        {
          "zh": "\r\n\r\n现在回想起来，是自己太过于担心了，无端的焦虑。",
          "en": "\r\n\r\nLooking back now, I was too worried and had unnecessary anxiety."
        },
        {
          "zh": "还有就是得多沟通，沟通能够让双方知道对方的想法，也能够加深感情。",
          "en": "Also, there needs to be more communication. Communication can let both parties know each other's thoughts and deepen the relationship."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "怎么说呢，我感觉是，唬住了要 28 万，没唬住看着给，结果发现把楼主唬大直接要跑了，赶紧挽回一下，不信的话楼主真不参考他们之前的标准，真看着给试试。",
          "en": "How to say it, I feel like, if they intimidate you, they want 280,000, if they don't intimidate you, they'll let you decide. But then they realized that they scared the poster too much and he was about to run away, so they quickly tried to save it. If you don't believe me, try really not referring to their previous standards and really deciding for yourself how much to give."
        },
        {
          "zh": "当然千万别这么做，做人有时候难得糊涂，结果自己感觉是好的的就行。",
          "en": "Of course, don't do that. Sometimes it's good to play dumb. As long as you feel good about the outcome."
        },
        {
          "zh": "恭喜楼主了。",
          "en": "Congratulations to the poster!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“她爸妈什么要求也没提”，牛批，今年你晚上做梦笑醒都是正常的。。",
          "en": "'Her parents didn't make any requests,' awesome. It's normal to wake up laughing in your dreams tonight."
        },
        {
          "zh": "有多少人有你这运气",
          "en": "How many people have your luck"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lasuar #3 看完整句话。",
          "en": "@lasuar #3 Read the whole sentence."
        },
        {
          "zh": "后面压力更大。",
          "en": "The pressure is even greater later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bk201 看完这段文字我也是差不多的感觉。",
          "en": "@bk201 After reading this, I feel almost the same way."
        },
        {
          "zh": "作为没有了解过 OP 感情的纯路人，会觉得这个转变略显突兀。",
          "en": "As a complete stranger who hasn't understood OP's relationship, I feel that this change is a bit abrupt."
        },
        {
          "zh": "原本上来就要求 28w 彩礼的家庭，变成彩礼房子车子什么都不要，一下子全盘放弃。",
          "en": "The family who originally asked for a 280,000 bride price, now doesn't want a bride price, a house, or a car, giving up everything all at once."
        },
        {
          "zh": "如此突然的转向就只是通过和女朋友\"面对面好好沟通了一次\"，是有些意外的。",
          "en": "Such a sudden turnaround is just through 'having a good face-to-face conversation' with the girlfriend, which is a bit unexpected."
        },
        {
          "zh": "通过现在仅有的信息，或许要留意一下，婚后财产转移 & 婚前财产变成夫妻共同财产？",
          "en": "Based on the limited information available, perhaps pay attention to the transfer of property after marriage & pre-marital property becoming joint property?"
        },
        {
          "zh": "不过这也只是完全不了解全貌的热心吃瓜网友，没有恶意。",
          "en": "However, this is just a concerned internet user who doesn't fully understand the situation, with no malicious intent."
        },
        {
          "zh": "也恭喜 OP 了~",
          "en": "Congratulations to OP~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜恭喜",
          "en": "Congratulations!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "会尽量去和她爸妈沟通这些问题和她爸妈什么要求也没提，没要求车子、房子、彩礼也是让我们家看着给不觉得很矛盾吗？",
          "en": "Isn't it contradictory that she will try her best to communicate these problems with her parents, but her parents didn't make any requests for a car, a house, or a bride price, and let our family decide how much to give?"
        },
        {
          "zh": "既然没提，那么为啥要 20w ，还是说你女票希望 20w 直接转给她？",
          "en": "Since they didn't mention it, then why did they want 200,000? Or does your girlfriend want the 200,000 to be transferred directly to her?"
        },
        {
          "zh": "搞不太懂。",
          "en": "I don't quite understand."
        },
        {
          "zh": "还是祝福你新婚快乐吧",
          "en": "Still, I wish you a happy marriage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜了你和未婚妻运气很好 这事后面 估计都有贵人相助你这边是你的表哥，她那边应该也有类似的情况经历过这些应该会更珍惜来之不易的婚姻，好好过下去吧",
          "en": "Congratulations, you and your fiancee are very lucky. I guess there will be helpful people on both sides. Your cousin helped you, and she should have had a similar situation. After experiencing these things, you should cherish the hard-won marriage more. Live a good life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜啊！！！！",
          "en": "Congratulations!!!!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜",
          "en": "Congratulations"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜恭喜啊",
          "en": "Congratulations!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜！所以说，真的是要多沟通呀~",
          "en": "Congratulations! So, you really need to communicate more~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "祝福",
          "en": "Blessings"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜!",
          "en": "Congratulations!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜恭喜，祝幸福",
          "en": "Congratulations, wish you happiness"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜",
          "en": "Congratulations"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜啊",
          "en": "Congratulations!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜",
          "en": "Congratulations"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜，早生贵子，沾沾喜气",
          "en": "Congratulations, may you have a son soon and share the joy"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜～",
          "en": "Congratulations~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜恭喜",
          "en": "Congratulations"
        }
      ],
      "type": "replies"
    }
  ]
}