{
  "id": 1110877,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "经常在各大论坛上看到 100W 不算啥，算个屁的言论和帖子，现在 100W 真算屁吗？",
          "en": "I often see posts and comments on various forums saying that 1 million RMB is nothing, a fart. Is 1 million RMB really a fart now?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前提：无负债，纯纯现金存款，不包含那些有的没的的乱七八糟的非现金，就普通人的无负债 100W 现金存款",
          "en": "Premise: No debt, purely cash savings, not including those miscellaneous non-cash assets. Just the average person's 1 million RMB in debt-free cash savings."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我还以为 100W 充电了",
          "en": "I thought 1 million RMB was charging (like a phone)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "网络上吹牛又不要成本",
          "en": "Bragging on the internet doesn't cost anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "至少有六亿人觉得一百万很多，因为他们月收入一千块，要干一百年才有一百万。",
          "en": "At least 600 million people think 1 million is a lot because they earn 1,000 RMB a month, and it would take them 100 years to earn 1 million."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan #16 王健林当时说的小目标说 1 个亿吧",
          "en": "@coderluan #16 Wang Jianlin's 'small goal' at the time was 100 million, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "存一百万蛮不容易的，对于想在（新）一线买房的程序员来说，对比一下房价，就觉得 100W 不算什么了",
          "en": "Saving one million is not easy. For programmers who want to buy a house in (new) tier-one cities, comparing it to housing prices, you'll feel that 1 million RMB is nothing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "100w 足够能解决我的所有债务问题，摇身一变过上城市土著的生活",
          "en": "1 million is enough to solve all my debt problems and transform myself into a city native."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我的手机 120W ，不比 100W 香？",
          "en": "My phone has 120W (charging power), isn't it better than 1 million?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "对钱没有概念的人就是穷人，他们不知道 100 万的购买力",
          "en": "People who have no concept of money are poor people. They don't know the purchasing power of 1 million."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "程序员 打工仔 10 年 , 没车没房没媳妇没对象昨天刚盘了一下 , 算上公积金 35w 的话现在有 190w 积蓄了(梭哈理财产品 除了公积金,所有的钱基本上 T+2 都可流动)不知道别人怎么看,起码我感觉自己就是个屁....车(20w)房(100w 贷款 200w)结婚(20w 彩礼 其他流程 10w)生娃(不知道) 150w 没了就 ,一朝返贫, 从 200w 存款变 200w 负债, 所以别说 100w 了 , 200w 也就是个屁除非跳出这个圈子",
          "en": "I've been a programmer working for 10 years. No car, no house, no wife, no girlfriend. I just calculated yesterday that including 350,000 in housing fund, I have 1.9 million in savings (invested in financial products, and all money except the housing fund can be withdrawn in T+2 days). I don't know what others think, but I feel like I'm nothing... A car (200,000), a house (1 million down payment, 2 million mortgage), marriage (200,000 dowry, 100,000 other expenses), having a child (unknown), 1.5 million gone. So you're poor again going from 2 million in savings to 2 million in debt, so don't even mention 1 million, 2 million is also nothing unless you get out of this circle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因为一般人对大数字是没有概念的，当他们提到 100W 的时候，他意识里需要一个参考的锚点，这个锚点通常是是房价而不是日常生活开支，100W 对于房价来说确实不算什么",
          "en": "Because ordinary people have no concept of large numbers. When they mention 1 million, they need a reference point in their minds. This reference point is usually housing prices rather than daily expenses. 1 million is indeed nothing for housing prices."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "王健林巅峰期也只是说 100w 是小目标，说 100w 万是算个屁的人只能纯傻逼。但是我认为傻到这种程度的人其实很少见。实际上说 100w 是屁的，往往会有个前提，“和 XX 比，100w 是屁”，“面对 XX ，100w 是屁”，这里的屁只是用来形容差距较大的夸张表达，合理不合理得看 XX 是什么。",
          "en": "Even Wang Jianlin during his peak period only said that 1 million was a small goal. People who say 1 million is nothing are just complete idiots. But I think people who are stupid to this extent are actually rare. In reality, saying 1 million is nothing often has a premise: 'Compared to XX, 1 million is nothing', 'Faced with XX, 1 million is nothing'. The word 'nothing' here is just used to describe an exaggerated expression of a large gap. Whether it is reasonable or not depends on what XX is."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说 100 万算个屁的人，要么真是富人，要么就是没钱人来酸一下。你觉得哪种人多？",
          "en": "People who say 1 million is nothing are either really rich or are just poor people trying to be sour. Which type do you think is more common?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@shadowyue 也可能是没自己挣过钱的人，比如学生们",
          "en": "@shadowyue It may also be people who haven't earned money themselves, like students."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一瓶子不响，半瓶子哐当",
          "en": "An empty bottle makes no sound, but a half-empty bottle clangs loudly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "确实，哎，眼光，哎。。。我也不懂同龄人，为什么人家有 4 套房产，有 400 万存款，人家的投资可不是啥基金，股票，人家是房产，平时可租，以后可卖。。。当然人家有副业，3 天可赚 3 万，人比人气死人。。。",
          "en": "Indeed, sigh, foresight, sigh... I don't understand my peers either. Why do they have 4 properties and 4 million in savings? Their investment isn't in funds or stocks; it's in real estate, which can be rented out normally and sold later... Of course, they have a side hustle and can earn 30,000 in 3 days. Comparing people is maddening..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作 10 年+，扣除负债，纯现金只有 10W+",
          "en": "10+ years of work, after deducting debt, only 100,000+ in pure cash."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先 V 我 50 证明证明实力",
          "en": "First, Venmo me 50 to prove your strength."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "话说 100w 现在移民够么",
          "en": "Speaking of which, is 1 million enough to immigrate now?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得是社会进步太快、大家生活差距较大，而互联网让所有人相聚的结果。就说 100w ，对于打工的人来说，可能要用 5-10 年才能赚到，攒到估计要 7-13 年，这个角度看，100w 比天大；另一方面，主流新势力的电车 20w 以上，一二线城市的房价 250w 起步不算夸张吧？从这个角度看，100w 确实不算什么。所以 100w 算或不算，都有道理。楼上说觉得 100w 不算穷人的网民，都是穷逼在酸，我觉得这也是一种可笑的行为，毕竟还是有很多有钱人上网的～",
          "en": "I think it's the result of rapid social progress, a large gap in living standards, and the internet bringing everyone together. Speaking of 1 million, it may take 5-10 years for working people to earn it, and it's estimated that it will take 7-13 years to save it. From this perspective, 1 million is huge; on the other hand, mainstream electric cars cost more than 200,000, and housing prices in first and second-tier cities start at 2.5 million, which is not an exaggeration, right? From this perspective, 1 million is really nothing. So whether 1 million counts or not, there is reason for both sides. The netizens who said that 1 million is not enough for poor people are just poor people being sour, and I think this is also a ridiculous behavior, after all, there are still many rich people online~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "V 我 50 验验资",
          "en": "Venmo me 50 to verify your funds."
        }
      ],
      "type": "replies"
    }
  ]
}