{
  "id": 1114529,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "感觉我去过的所有城市中，重庆是贫富差距最大的城市了",
          "en": "I feel like among all the cities I've been to, Chongqing has the biggest gap between rich and poor."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "感觉我去过的所有城市中，重庆是贫富差距最大的城市了，好奇形成的原因，有没有老哥可以分析一下。",
          "en": "I feel like among all the cities I've been to, Chongqing has the biggest gap between rich and poor. I'm curious about the reasons behind it. Are there any experienced folks who can analyze it?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我感觉北京才是贫富差距最大的",
          "en": "I feel that Beijing has the biggest wealth gap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fridaycatye#12 不会卖的哈儿果吧",
          "en": "@fridaycatye#12 You wouldn't sell 'ha er guo' (silly fruit), would you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "送过一段时间外卖, 我所在的三线城市, 我都觉得贫富差距很大发现了很多犄角旮旯 阴暗的地下室 也住着人呢",
          "en": "I delivered food for a while. Even in the third-tier city I lived in, I felt that there was a huge gap between rich and poor. I found many hidden and dark basements where people also lived."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@random1221 #13 哈儿果，哈儿果，哈儿吃了补脑壳",
          "en": "@random1221 #13 'Ha er guo, ha er guo, eating 'ha er' replenishes your brain.'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "重庆直辖的附带条件就是把周边几个最穷的区县给划进去都是些山咔咔，没有什么现代化产业，农业产值也低得可怜，大量农名工涌入主城去下苦力挑棒棒2022 年的人均 GDP ，宇宙中心渝中区 27W 万，偏远的巫溪、城口等县城 3W 出头隔壁号称吸血鬼的成都、武汉的差距都没这么大",
          "en": "The condition for Chongqing becoming a municipality was to include some of the poorest districts and counties around it. These are mountainous areas without modern industries and with pitifully low agricultural output. A large number of migrant workers flood into the main city to do hard labor carrying 'bang bang' (porterage). In 2022, the per capita GDP of Yuzhong District, the 'cosmic center,' was 270,000, while the remote Wuxi and Chengkou counties had just over 30,000. Even Chengdu and Wuhan, known as 'vampires,' don't have such a large gap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我查了一下重庆 2024 年基尼系数是没有，众所周知没有就是 0 ，而 0 代表收入分配绝对平等，所以重庆没有贫富差距",
          "en": "I checked, and Chongqing's Gini coefficient for 2024 is not available. As everyone knows, not available means it's 0, and 0 represents absolute equality in income distribution, so Chongqing has no wealth gap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@q474818917 北京贫富差距是挺大的，但是不同圈层互相独立的，一般人也见不着，平常不太能感觉出来",
          "en": "@q474818917 Beijing's wealth gap is quite large, but the different circles are independent of each other. Ordinary people don't see it, so you usually don't notice it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wu00 成都真的是吸血鬼，举全四川之力发展一个成都，成都人不会说自己是四川的。而且四川除了成都其他区域发展都不咋的，如果重庆不独立出去，我估计重庆现在也是四川除成都外的现在的某一个市",
          "en": "@wu00 Chengdu is really a vampire, using the power of the entire Sichuan to develop Chengdu. People in Chengdu won't say they are from Sichuan. Moreover, Sichuan's development outside of Chengdu is terrible. If Chongqing hadn't become independent, I estimate Chongqing would now be just another city in Sichuan besides Chengdu."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@random1221 城中村和摩天大楼交相辉映你应该感到这座城市的包容性。毕竟不像有的城市，把城中村推平，把低端人口迁出。",
          "en": "@random1221 The juxtaposition of urban villages and skyscrapers should make you feel the inclusiveness of this city. After all, unlike some cities that flatten urban villages and move out the low-end population."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要看每个城市的老房拆迁政策，重庆应该算比较友善的。有些一线城市是直接强制拆出市区的，你自然看不到穷人了，也就没有什么贫富差距。",
          "en": "It depends on each city's old housing demolition policies. Chongqing should be considered relatively friendly. Some first-tier cities directly force demolitions out of the city, so you naturally don't see poor people, and there is no wealth gap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我怎么觉得是广深",
          "en": "Why do I feel it's Guangzhou and Shenzhen?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "广东是中国贫富差距最大的地  ，深圳 比 梅州 茂名 那些城市",
          "en": "Guangdong is the place in China with the biggest wealth gap, Shenzhen more so than Meizhou, Maoming and those cities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "明显是北京啊，上限和下限都是看不见也无法想象的",
          "en": "It's obviously Beijing. The upper and lower limits are invisible and unimaginable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "典型的只有论点没有论据。",
          "en": "Typically only the point of view, no arguments."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "破圈以后你会发现哪里的贫富差距都大，县城婆罗门，京圈上等人等等等等。当年打工拿 2000 工资的时候老板带我去见客户，商 K4 个人俩小时 8K 多，很多人这种也算家常便饭了，当然再往上的也有，杭州的 in11 不就是，然后当初大 logo 拍的 200 多 w 的低消 KTV ，因为资金上层资金流不出来，人家那个圈子内循环，你觉得千亿身家会吃 3 块一斤的散装大米吗。未来社会这种差距随时间发展只能越来越大，除非出现一个落榜美术生在小酒馆演讲然后重新洗牌。或者一鲸落万物生(显然不太可能，大多进国库了，最后的福利形式也就是 补贴金额=免掉部分消费税增值税)",
          "en": "Once you break out of your circle, you'll find that the wealth gap is huge everywhere, like the Brahmins in small towns, the upper class in Beijing circles, and so on. When I was working and earning 2000 yuan, my boss took me to see a client. A commercial KTV cost more than 8K for 4 people in two hours. Many people consider this normal, and of course there are even more extravagant things. Isn't there in11 in Hangzhou? Then there's the KTV with a minimum spend of over 2 million that Da Logo filmed. Because the upper-level funds can't flow out, their circle operates internally. Do you think someone with assets worth hundreds of billions would eat unpackaged rice that costs 3 yuan per pound? In the future, this gap will only widen with the passage of time, unless a failed art student gives a speech in a tavern and reshuffles the cards. Or 'one whale falls, and all things live' (obviously unlikely, most of it goes into the national treasury, and the final form of welfare is subsidy amount = exemption of part of consumption tax VAT)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "贫富差距体现在哪里？",
          "en": "Where does the wealth gap manifest itself?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说明你没去过香港",
          "en": "It means you haven't been to Hong Kong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@aitianci 你要是这么说香港是更明显一些，但是反过来说，香港社会制度本身就不同啊",
          "en": "@aitianci If you put it that way, Hong Kong is more obvious, but conversely, Hong Kong's social system itself is different."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@q474818917 举例说明？",
          "en": "@q474818917 Give an example?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "北京的\"低端人口\"被清理了不少，不算差距最大的我去过的城市中是深圳，城中村和摩天大楼交相辉映，讽刺意味颇浓",
          "en": "Beijing's 'low-end population' has been cleared out a lot. Not counting that, among the cities I've been to, Shenzhen has the biggest wealth gap, with urban villages and skyscrapers juxtaposed, full of irony."
        }
      ],
      "type": "replies"
    }
  ]
}