{
  "id": 1113205,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大家有没有觉得大 A 已经进入了牛市",
          "en": "Does everyone feel that the A-share market has entered a bull market?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "年后几乎每天都是 4000 股左右上涨，很多指数特别是中小盘股指数，已经多次创出去年十月份新高了，权重比较拖后腿，但是从 924 之后，现在的位置经过快半年也没有真正意义跌下去过，回落一直在震荡。",
          "en": "Since the Chinese New Year, almost every day has seen around 4000 stocks rising. Many indices, especially the small and mid-cap indices, have repeatedly reached new highs since last October. The heavily weighted stocks are lagging behind, but since September 24th, the current position hasn't really fallen significantly in almost half a year, and the pullback has been fluctuating."
        },
        {
          "zh": "市场现在的赚钱效应确实很不错，成交额自从 924 之后也一直维持在 1.5 到 2w 亿左右，只有春节附近今天有所下滑，正常的，这是这样一直维持的成交活跃度以前几乎没有。",
          "en": "The current market's wealth effect is indeed very good. The trading volume has been maintained at around 1.5 to 2 trillion since September 24th. There has only been a slight decline around the Spring Festival, which is normal. This sustained level of trading activity is unprecedented."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "收到，马上清仓！",
          "en": "Got it, clearing out my positions immediately!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "也真是唏嘘 外资都由空转多 国人竟然还在唱空 艾美莉卡远程养殖技术是真到位 自带狗粮是吧快回去满仓满融干美股吧 昨天刚 “回调” 正是 “绝佳”的进场时机",
          "en": "It's really sad to see that foreign investors have turned from short to long, while Chinese people are still shorting. America's remote farming technology is truly in place, bringing its own dog food. Go back and fully leverage into US stocks! The \"correction\" yesterday was the \"perfect\" time to enter."
        },
        {
          "zh": "快去用你投美股的钱养那些 200 岁以上的虚空吸血鬼吧",
          "en": "Go use the money you invest in US stocks to support those 200-year-old ethereal vampires!"
        },
        {
          "zh": "快去吧 今年真不差你那几个子还在经济形势 就业情况 基本面 别再只看大互联网这一小块了 看看专精特新硬核科技国产替代自主可控的新质生产力吧",
          "en": "Go on! This year doesn't really need your small amount of money. Instead of just focusing on the big internet companies, look at the specialized, sophisticated, and cutting-edge technologies, domestic alternatives, independent and controllable new quality productive forces based on looking at the wider economic situation, the employment situation and the fundamentals."
        },
        {
          "zh": "国外产品份额被挤压成啥了时代变了 大侄子",
          "en": "The market share of foreign products has been squeezed. Times have changed, nephew."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这种问题没啥意义我长期是看空的，但是不妨碍我买 A 股有机会有胜率就做呗，哪里好做就做哪里分析宏观没啥意义，首先是没几个人能分析明白的，其次是就算你分析地明白，看得准，和具体的操作也没啥关系更何况大多数人都是涨到末端爆发的时候才真正相信牛市来了，在前期突破回调的时候也没几个人敢买",
          "en": "This kind of question is meaningless. I'm bearish in the long term, but that doesn't stop me from buying A-shares if there's an opportunity and a good chance of winning. I'll do whatever's easiest. Analyzing macroeconomics is pointless. First of all, few people can understand it, and secondly, even if you understand it and see it accurately, it has nothing to do with the specific operation. Moreover, most people only truly believe a bull market has arrived when it's at the end and exploding; few people dare to buy during the initial breakout and correction."
        },
        {
          "zh": "现阶段，对于手里没有仓位的人来说，我个人是不建议进场的，比较安全的做法是等一个回调整理不破的时间和位置，类似去年 11 月的 A 股最主要的原因是，现在的行情并不是 A 股内生带动的，是外资炒作中概股带动的，很容易被宰，我之前写过文章解释这个： https://mp.weixin.qq.com/s/VNqOEP-EevET__aZaEFlAg",
          "en": "At this stage, for those who don't have any positions, I personally don't recommend entering the market. A safer approach is to wait for a correction and consolidation that doesn't break through, similar to the A-shares in November last year. The main reason is that the current market is not driven by A-share internals but by foreign capital speculating on Chinese concept stocks, making it easy to get slaughtered. I have written an article explaining this: https://mp.weixin.qq.com/s/VNqOEP-EevET__aZaEFlAg"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Arrackisarookie 整个评论区只有你的戾气最重了，大家心平气和讨论，兼听则明啊",
          "en": "@Arrackisarookie Your comment is the most aggressive in the entire comment section. Everyone is discussing peacefully. Listening to both sides brings clarity."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不断炒作下的涨幅 中国的基本问题解决了吗 是失业率下去了还是出生人口开涨了",
          "en": "The rise is due to constant speculation. Have China's fundamental problems been solved? Has the unemployment rate gone down or has the birth rate started to rise?"
        },
        {
          "zh": "去投机可以 觉得中国经济问题没了那就是当大家是傻子",
          "en": "Speculating is fine, but thinking that China's economic problems are gone is treating everyone like fools."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Arrackisarookie 牛逼，这么多年了，粉蛆的脑子里还是只有美利坚。唯一的手段就是虚空打靶了",
          "en": "@Arrackisarookie Awesome, after so many years, all the pinkies have in their minds is still America. The only means they're capable of is empty target practice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "空军来咯，等就是你看多。",
          "en": "The bears are here. Waiting means you are bullish."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "A 股没办法做空导致造假需要承受的风险太低，这就导致了即使牛市了也不过是给之前造假挤水分的空间，最后水挤多了变成僵尸了，僵尸牛算不算牛就不是经济问题了，而是哲学问题了。",
          "en": "The risks in the A-share market being too low due to the difficulty of short-selling causes the opportunity in a bull market to be solely the result of squeezing the water out previously faked numbers and fraud that existed, eventually oversqueezing and turning itself into a zombie. Whether the stock market can be classified as a so-called zombie bull market is no longer simply an issue on the economic scope, but rather a question of philosophy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在怀疑中成长。实际上恒生科技的牛市已经启动了。",
          "en": "Growing amidst doubt. In reality, the bull market in Hang Seng Technology has already started."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大部分人是看衰的说明还能再拿一会儿",
          "en": "Most people are bearish, which means it can still be held for a while."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是不太行吧！没有上涨的实力啊！",
          "en": "Still not good! It doesn't have the strength to rise!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan 融券不就行了，怎么不能做空？",
          "en": "@coderluan Isn't it possible to short by lending out securities? How can you say you can't short?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2 万亿热钱从印度过来，加上这几天开会，你可别太冲动",
          "en": "2 trillion hot money is coming from India, plus the meetings these past few days, don't be too impulsive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jaylee4869 比例太低了，对普通人门槛太高了。",
          "en": "@jaylee4869 The proportion is too low, and the threshold is too high for ordinary people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "骗不到人去玩了",
          "en": "Can't fool people into playing anymore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪位佬分析一下 A 股上涨的逻辑是什么？个人感觉周围的就业环境和经济并没有什么好转哎",
          "en": "Can someone analyze the logic behind the A-share rise? I personally feel that the surrounding employment environment and economy haven't improved much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看来得减仓了",
          "en": "Looks like I need to reduce my positions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你敢进它就敢套",
          "en": "If you dare to enter, it dares to trap you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼上的不知道这波赚到没",
          "en": "Don't know if the person upstairs made money in this wave."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "税太高",
          "en": "Taxes are too high."
        }
      ],
      "type": "replies"
    }
  ]
}