{
  "id": 1113602,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "单休太累了，上海行情咋样？",
          "en": "Single day off is too tiring, what's the job market like in Shanghai?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "11 11 6 ，好几年了，累了，遭不住了。感觉身体明显下滑。",
          "en": "11 11 6 (working from 11am to 11pm, 6 days a week) for several years, I'm tired and can't handle it anymore. I feel my body is significantly declining."
        },
        {
          "zh": "\r\n\r\n上海 GO/Java 开发有什么好去处么，V 友们，双休就行。",
          "en": "\r\n\r\nAre there any good places for GO/Java development in Shanghai, V2EX folks? Just need a two-day weekend."
        },
        {
          "zh": "\r\n\r\n211 本科，7 年了，3 家公司，2 家大厂。目前 Base 比较高，不过双休接受降一下。",
          "en": "\r\n\r\n211 University Bachelor's degree, 7 years of experience, 3 companies, 2 large companies. My current base salary is relatively high, but I'm willing to take a pay cut for a two-day weekend."
        },
        {
          "zh": "\r\n\r\n我在想找一家银行科技岗，或者什么证券公司之类的科技岗，是不是好一点。",
          "en": "\r\n\r\nI'm thinking of finding a technology position in a bank or a securities company. Would that be better?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "别的不知道，Java 在上海我认识好多，现在一周休息 7 天。",
          "en": "I don't know about other roles, but I know many Java developers in Shanghai who now have 7 days off a week."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "也攒了一两百万了吧",
          "en": "Must have saved up a million or two?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个上班强度，太透支自己了，你上班时间很少可以起来活动吧，等于 12 小时里有大概 90%的时间是坐着的",
          "en": "This work intensity is too draining. You probably rarely get up and move around during work, so you're sitting for about 90% of the 12 hours."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://www.v2ex.com/t/1113245",
          "en": "https://www.v2ex.com/t/1113245"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大厂没有双休吗？我还以为大部分都 995 。",
          "en": "Don't large companies have two-day weekends? I thought most were 995."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "pdd 的出去工资要打骨折的",
          "en": "Leaving Pinduoduo (PDD) means taking a huge pay cut."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@biu7 赞@proxytoworld 攒了 1w@whyrookie 有几个还是 6 天的，上海我知道 pdd 还有得物。华为也是很多是 6 天，据说京东有些部门也是单休？@saucer 要是稳定的工作，骨折也认了，遭不住了",
          "en": "@biu7 Agreed. @proxytoworld saved 10k. @whyrookie Some still have 6-day weeks. In Shanghai, I know PDD and DeWu do. Huawei also has many 6-day weeks. I heard some JD departments also have single-day off? @saucer If it's a stable job, I'll take the pay cut, I can't handle this anymore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么感觉上海除了外企就是卷厂，比北京还极端的样子",
          "en": "It feels like Shanghai is either foreign companies or 'involution' factories, even more extreme than Beijing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Bilibili",
          "en": "Bilibili"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "相对来说，字节算是一个权衡虽然也累，但是至少双休。之前我跳槽去外企待了一年半，去年下半年又回字节了。",
          "en": "Relatively speaking, ByteDance is a good compromise. Although it's tiring, at least it has two-day weekends. I previously switched to a foreign company for a year and a half, then went back to ByteDance in the second half of last year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@haiku 上海还有 b 站，字节，腾讯，都是正常的。还有携程是出了名的不卷哈哈哈。b 站据说也可以。我感觉杭州才是卷的离谱，都是被 ali 带起来的，不知道杭州现在怎么样。@Donaldo B 站还行么，前两年好像老是裁员，现在咋样？",
          "en": "@haiku Shanghai also has Bilibili, ByteDance, Tencent, which are all normal. And Ctrip is famous for not being 'involution' haha. I heard Bilibili is also okay. I feel like Hangzhou is ridiculously 'involution', all driven by Alibaba. I don't know how Hangzhou is now. @Donaldo Is Bilibili still good? It seemed to be laying off people a lot in the past two years, how is it now?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@infun 字节确实感觉还不错。要不我再试试，之前三面没进去。。外企咋又回去了嘞？外企不是说是最好归宿么哈哈哈",
          "en": "@infun ByteDance does seem pretty good. Maybe I'll try again. I didn't get in after three interviews before... Why did you go back from the foreign company? Isn't a foreign company supposed to be the best place to end up haha?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SoldierL #9 反正听说上班摸鱼很爽，裁员就不清楚了。",
          "en": "@SoldierL #9 Anyway, I heard it's great to slack off at work, I don't know about the layoffs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Donaldo 技术好像是的。我有俩朋友在 b 站，一个开发一个是运营，开发就比较闲，运营天天卷的要死。。过年还要搞什么晚会啊什么的，也非常累的感觉。",
          "en": "@Donaldo It seems so for the tech side. I have two friends at Bilibili, one developer and one in operations. The developer is relatively idle, while the operations person is 'involution' to death every day... Having to do some kind of gala during the New Year and stuff, it also feels very tiring."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SoldierL 我在携程待了七年。。。不卷的上不去外企。。。钱少",
          "en": "@SoldierL I stayed at Ctrip for seven years... You can't get into a foreign company without 'involution'... less money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "金融 IT 岗貌似需要很强的经验背景，比如熟悉 xxx 之类的。不过如果是外企可能确实要打一半的骨折。某些国企也是，不过外企会撤，国企某种程度上是不是更好？我有同事外企被裁员后去了国企，工资对折，晚上七点走，有双休。",
          "en": "Financial IT positions seem to require a strong experiential background, such as familiarity with xxx. However, if it is a foreign company, you may indeed take a 50% pay cut. The same goes for some state-owned enterprises, but foreign companies withdraw. Aren't state-owned enterprises better to some extent? I have a colleague who went to a state-owned enterprise after being laid off by a foreign company, with half the salary, leaving at 7 pm, and having two-day weekends."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@infun 真实了，老哥。不过你这几家，感觉工作强度都还可以，面试难度也都比较高，是个大佬。。",
          "en": "@infun So true, bro. But those companies you've mentioned, I feel like the work intensity is acceptable, and the interview difficulty is quite high. You are a big shot..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yoiteshaw 哦哦哦，感谢老哥。我了解下来上海很多金融都是交易类的多，用 C++的，这也是个难点。。。国企，我听说现在又卷钱又少呢。。好多国企都想往外跳？不知道是不是真的。。。",
          "en": "@yoiteshaw Oh oh oh, thank you bro. From what I understand, many financial jobs in Shanghai are trading-related, using C++, which is also a difficulty... I heard that state-owned enterprises are now 'involution' with low pay... Many state-owned enterprises want to jump out? I don't know if it's true..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SoldierL 去 maimai 搜一下证券科技就知道什么样了。四五年前还可以，现在都是想跑又跑不出去的",
          "en": "@SoldierL Search for 'securities technology' on Maimai and you'll know what it's like. It was okay four or five years ago, but now everyone wants to leave but can't."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@berchtesgaden get ， 我发现国企好多也是。。好多都想往大厂跑，这不是双向奔赴么。@YaakovZiv 起来活动倒是有，就是时间太长了，熬的。确实在透支",
          "en": "@berchtesgaden got it, I've found that many state-owned enterprises are like that too... Many want to run to big factories, isn't this a two-way street? @YaakovZiv I do get up and move around, but the time is too long, it's just about enduring. It's definitely draining."
        }
      ],
      "type": "replies"
    }
  ]
}