{
  "id": 1112828,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "徕芬的吹风机怎么样?",
          "en": "How is the Laifen hair dryer?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "刚看到有人说徕芬的电动牙刷不好。",
          "en": "I just saw someone say Laifen's electric toothbrush is not good."
        },
        {
          "zh": "不知道他家的吹风机如何？",
          "en": "I wonder how their hair dryer is?"
        },
        {
          "zh": "我在洗浴中心用过一次，感觉还可以。",
          "en": "I used it once in a bath center and it felt okay."
        },
        {
          "zh": "感觉和戴森大差不差。",
          "en": "It feels almost the same as Dyson."
        },
        {
          "zh": "如果质量可靠，确实是可以买，毕竟只有 1/10 戴森的价格。",
          "en": "If the quality is reliable, it is indeed worth buying, after all, it is only 1/10 the price of Dyson."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "徕芬 LF03 用了一年多了 没出现过啥问题",
          "en": "I've been using Laifen LF03 for more than a year and haven't had any problems."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "国补买了一个，用了几个月感觉还行。",
          "en": "I bought one with a government subsidy and it feels okay after using it for a few months."
        },
        {
          "zh": "风力确实很足。",
          "en": "The wind power is indeed very strong."
        },
        {
          "zh": "比以前的百来两百的好用多了",
          "en": "It is much better than the previous ones that cost one or two hundred."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "昨天的帖子说徕芬牙刷不行，下面有不少人赞同并以自己的实际情况举例之前也有人说徕芬牙刷不错，下面有不少人赞同并以自己的实际情况举例",
          "en": "Yesterday's post said Laifen toothbrushes were not good, and many people agreed and cited their own actual situations. Previously, some people said Laifen toothbrushes were good, and many people agreed and cited their own actual situations."
        },
        {
          "zh": "emm ，反正我是买了徕芬的牙刷，刚用一个月，耐用性有待时间验证",
          "en": "emm, anyway, I bought a Laifen toothbrush and have only used it for a month. Durability remains to be verified."
        },
        {
          "zh": "但是目前使用体验很不错，颜值也很好",
          "en": "But the current user experience is very good, and the appearance is also very good."
        },
        {
          "zh": "推荐在京东购买，两年质保，售后相对来说更方便一点",
          "en": "It is recommended to buy on JD.com, with a two-year warranty, and the after-sales service is relatively more convenient."
        },
        {
          "zh": "又不是很贵，质保两年，自己试一下呗",
          "en": "It's not very expensive, with a two-year warranty, so try it yourself."
        },
        {
          "zh": "万一等我被坑了，我肯定也来 v 站发帖吐槽",
          "en": "If I get scammed, I will definitely come to V station to post and complain."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好用, 我买了一个, 后悔没早点买.",
          "en": "Easy to use, I bought one, and I regret not buying it sooner."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说个最直观的体感差异吧。",
          "en": "Let me talk about the most intuitive difference in physical experience."
        },
        {
          "zh": "同样最大挡的状态下，从头顶前上方吹刘海和头顶前部那一块的时候很容易就能感觉出来，戴森吹出来的风是柔和、没有窒息感的，而徕芬吹出来的风是有冲击感、有轻度窒息感的，属于是暴力风扇那种力大砖飞的体感，有些理发店的那种不知名品牌的高速吹风机也有同样的问题。",
          "en": "In the same maximum gear state, it is easy to feel when blowing bangs and the front part of the top of the head from the front upper part of the head. The wind blown by Dyson is soft and has no suffocating feeling, while the wind blown by Laifen has an impact and a slight suffocating feeling. It is a feeling of a violent fan with great power. Some high-speed hair dryers of unknown brands in barber shops also have the same problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@apy 我现在用的飞科，200+ 感觉噪音大。",
          "en": "@apy I am using Flyco now, 200+ feels noisy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "徕芬的牙刷是后来开发的新业务，吹风机是老本行",
          "en": "Laifen's toothbrush is a new business developed later, and the hair dryer is its old business."
        },
        {
          "zh": "我买的好像是四五百的那款，反正明显比后来各种品牌 200 左右的好一些",
          "en": "I bought the one that costs four or five hundred, anyway, it is obviously better than the later brands that cost around 200."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "徕芬的那个啥型号忘了 买的 lite 版 很好用",
          "en": "I forgot the model of Laifen, I bought the lite version, it is very easy to use."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "松下",
          "en": "Panasonic"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不错，买了一个用了一年半，记得清把柄的灰尘",
          "en": "Not bad, I bought one and used it for a year and a half, remember to clean the dust on the handle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "戴森和徕芬各有一个，我媳妇觉得没啥区别",
          "en": "I have both Dyson and Laifen, and my wife thinks there is no difference."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不错，我家里买了一个 给爸妈也买了  风力是我用过最大的  而且最好搭配吸盘用  方便挂墙上",
          "en": "Not bad, I bought one for my family and also bought one for my parents. The wind power is the strongest I have ever used. It is best to use it with a suction cup for easy hanging on the wall."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "风很大，最热的档位吹出来的风体感也冷冷的，但是很快能吹干。",
          "en": "The wind is very strong, and the wind blown out by the hottest gear feels cold, but it can dry quickly."
        },
        {
          "zh": "造型能力不如传统吹风机，只适合吹干。",
          "en": "The styling ability is not as good as traditional hair dryers, it is only suitable for drying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人感觉，比上不知道足不足，但比下绰绰有余，风力很足，用了半年，下方进风口需要即时清灰(要不然会感觉风力变小)。",
          "en": "Personally, I don't know if it's good enough compared to the best, but it's more than enough compared to the worst. The wind power is very strong. After using it for half a year, the air inlet at the bottom needs to be cleaned immediately (otherwise the wind power will feel smaller)."
        },
        {
          "zh": "能磁吸在墙上的底座上 很方便。",
          "en": "It can be magnetically attached to the base on the wall, which is very convenient."
        },
        {
          "zh": "但是我看你提到噪音。",
          "en": "But I saw you mentioned noise."
        },
        {
          "zh": "说实话徕芬开高档声也挺大的",
          "en": "To be honest, Laifen's high-end sound is also very loud."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "17 年买的戴森（ RMB2999 ），去年买的徕芬（ RMB569 ）这两个，我老婆都给予好评。",
          "en": "My wife gave both the Dyson (RMB2999) bought in 2017 and the Laifen (RMB569) bought last year positive reviews."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "京东购入 600 元左右那款忘了什么型号了, 到手两年, 一年返厂维修一次",
          "en": "I bought the model for around 600 yuan on JD.com, I forgot which model it was, it has been two years since I bought it, and it has been returned to the factory for repairs once a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还行吧，我天天都带身上，跑步完后洗完澡用，基本上天天用",
          "en": "It's okay, I carry it with me every day, and use it after washing after running, basically every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好用",
          "en": "Easy to use"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吹风机一个 SE 一个普通版都挺好用的，也都用了挺长时间",
          "en": "Both the SE and the regular version of the hair dryer are very easy to use, and they have been used for a long time."
        },
        {
          "zh": "但是他们家牙刷我也有两个基本上都是刚过保就坏了，也有可能是我运气不好",
          "en": "But I also have two of their toothbrushes, and basically they broke just after the warranty expired, maybe I'm just unlucky."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吹风机 lf03 ，牙刷也买了 都很好用，最近想换剃须刀，我准备等等徕芬",
          "en": "Hair dryer lf03, I also bought a toothbrush, both are very easy to use. I want to replace the razor recently, I am going to wait for Laifen."
        }
      ],
      "type": "replies"
    }
  ]
}