{
  "id": 1110236,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "24 岁，人生第一辆车求建议！",
          "en": "24 years old, seeking advice for my first car!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "小弟目前想买车，有两个疑问想请教一下：\r\n1 、是否有必要买车？\r\n2 、买什么车？二手购车有什么注意事项吗？",
          "en": "I'm currently looking to buy a car and have two questions to ask:\r\n1. Is it necessary to buy a car?\r\n2. What car should I buy? What are the precautions for buying a used car?"
        },
        {
          "zh": "\r\n\r\n背景：坐标杭州，目前存款 7 个,每个月能攒 2-3k 的样子，预算 5w 左右的二手车练练手，5 年没开过车，纯新手。",
          "en": "\r\n\r\nBackground: Located in Hangzhou, currently have 70,000 in savings, can save around 2-3k per month, budget of around 50,000 for a used car to practice with, haven't driven in 5 years, pure beginner."
        },
        {
          "zh": "\r\n\r\n通勤：日常通勤目前来回 12 公里，有车了也许考虑住远点。周末可能会在省内 200km 以内的地方玩一玩，过年回老家单程 850km ，所以不考虑纯电。算下来一年勉强一万公里。",
          "en": "\r\n\r\nCommute: Daily commute is currently 12 kilometers round trip. If I have a car, I might consider living farther away. Weekends might involve trips within 200km in the province. Chinese New Year trip back home is 850km one way, so I'm not considering pure electric vehicles. I estimate I'll drive barely 10,000 kilometers a year."
        },
        {
          "zh": "\r\n\r\n对车的想法：有一定智能化，如大屏中控、倒车影像（ 360 最好）、定速巡航等，第一辆车虽然练手，也不想买体验不太好的车，还是得开个三年以上的。",
          "en": "\r\n\r\nThoughts on the car: Want some level of smart features, such as a large screen central control, reversing camera (360 is best), cruise control, etc. Although this is my first car to practice with, I don't want to buy a car with a bad experience. I still need to drive it for more than three years."
        },
        {
          "zh": "\r\n\r\n关于问题 1：我的用车需求不高，电瓶车基本满足我的日常需求。但是想着有车的话趁年轻能多和女朋友出去玩一玩，拓宽生活半径，也能趁现在练练手，刮坏不心疼，感受我用车的实际需求为以后买车做铺垫，好处也不少，有点矛盾。",
          "en": "\r\n\r\nRegarding question 1: My car usage needs are not high, and an electric bike basically meets my daily needs. But I'm thinking that with a car, I can go out and play with my girlfriend more while I'm young, broaden my living radius, and practice now, not being too heartbroken if I scratch it, and experience my actual car usage needs to pave the way for buying a car in the future. There are many benefits, but it's also a bit contradictory."
        },
        {
          "zh": "\r\n\r\n关于问题 2：我的要求好像得近六七年的车才能满足，目前咸鱼看本地有个挺新的 23 版驱逐舰 05,55km 的，个人用车，他自费改了一些东西，卖五万四，感觉还行，就是不知道买二手插混会不会有什么坑，然后保费好像挺高的，插混贬值也快，之后卖掉感觉不好卖。",
          "en": "\r\n\r\nRegarding question 2: It seems that only cars from the last six or seven years can meet my requirements. Currently, I saw a pretty new 2023 BYD Destroyer 05 with 55km on Xianyu locally. It's a personal car, and he modified some things at his own expense, selling it for 54,000. It feels okay, but I don't know if there are any pitfalls in buying a used plug-in hybrid. Also, the insurance premiums seem quite high, and plug-in hybrids depreciate quickly, so it might be difficult to sell later."
        },
        {
          "zh": "\r\n\r\n我真的应该买车吗？有什么车推荐吗？买二手有哪些坑需要注意？最近一直在看车相关的信息，但还是感觉云里雾里，求指点，谢谢！",
          "en": "\r\n\r\nShould I really buy a car? Are there any car recommendations? What pitfalls should I pay attention to when buying used cars? I've been looking at car-related information recently, but I still feel confused. Seeking guidance, thank you!"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我去年 8 月，和你一样的理由差不多，买了马 3 昂克赛拉，这车是真的没啥毛病，操控没问题，建议你仔细淘一下，买一台 2.0L 的车子，切忌 1.5L ，会比较肉",
          "en": "Last August, I bought a Mazda 3 Axela for pretty much the same reasons as you. This car really has no problems, the handling is fine, I suggest you search carefully and buy a 2.0L car, definitely avoid the 1.5L, it will be quite sluggish."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@qoo2019 #29 是否工作和同居有必然联系？对性饥渴也没什么不对的啊，七情六欲，人之常情。",
          "en": "@qoo2019 #29 Is there a necessary connection between working and living together? There's nothing wrong with being horny either, it's just human nature."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那个二手驱逐舰 05 没有首任车主三电终身质保了",
          "en": "That used Destroyer 05 doesn't have the lifetime warranty on the three electric components for the first owner anymore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在的年轻人考虑这么多吗？我第一辆车看了两次试驾一次就下单了~~",
          "en": "Do young people think so much now? I looked at my first car twice, test drove it once, and then placed the order~~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你停车费怎么算？车的话你一年开销得保险+停车费+油费相关,平均到每个月的话 你每个月只能 2 到 3 的话,后续大概率存不住钱。而已新能源车现在变化很快贬值率高",
          "en": "How do you calculate your parking fees? If you have a car, your annual expenses will be insurance + parking fees + fuel costs, and if you can only save 2 to 3k per month on average, you probably won't be able to save money later. Also, new energy vehicles are changing very quickly, and the depreciation rate is high."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个便宜的二手车吧。3 万左右的。油车",
          "en": "Buy a cheap used car. Around 30,000. A gasoline car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年轻时难得可贵的本金不要轻易挥霍了，如果你把自己当作一个创业者，你会这么开销吗？",
          "en": "Don't squander your hard-earned capital easily when you are young. If you treat yourself as an entrepreneur, would you spend this way?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "二手水很深，闲鱼个人的卖价一般都很高，性价比甚至不如二手车商。",
          "en": "The used car market is very murky, and the prices of individual sellers on Xianyu are generally very high, and the cost performance is even worse than used car dealers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个全新荣威 i5 才 6w ，再加点买个新车",
          "en": "A brand new Roewe i5 is only 60,000, add a little more and buy a new car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近长安逸动和吉利帝豪都在搞促销，要不要去看看？逸动不清楚，但是帝豪好像有 4W 的免息贷款，这俩车都配备 360 ，但是最低配没有，加上购置税啥的，落地 7w 左右，要是还能忍一年，今年入个几千块的二手车，等明年的以旧换新补贴，明年应该是新能源免购置税最后一年了，今年再攒点钱，明年直接上秦 plus/海豹 05 dm-i ，带有天眼之神智驾的，基本上可以开好多好多年了，又省油，又有一定的智驾能力。",
          "en": "Changan Yidong and Geely Emgrand are currently having promotions, do you want to check them out? I'm not sure about Yidong, but Emgrand seems to have a 40,000 interest-free loan. Both cars are equipped with 360, but the lowest configuration does not have it. Adding the purchase tax, the final price is around 70,000. If you can wait another year, buy a used car for a few thousand this year, and wait for next year's old-for-new subsidy. Next year should be the last year for new energy vehicle purchase tax exemption. Save some money this year, and next year, directly get the Qin plus/Sealion 05 dm-i, with the Sky Eye intelligent driving system, which can basically be driven for many years, saving fuel and having certain intelligent driving capabilities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "推荐车我不懂，同在杭州，马上 5 年了基本没出过杭州就去了一次绍兴。年底的时候提了毛豆歪，买了车 1 个多月就去了 10 多个地方，所以让我推荐肯定车得买，但是买啥看其他人咋说吧。",
          "en": "I don't know how to recommend cars. I'm also in Hangzhou. I've almost been here for 5 years and have only been to Shaoxing once. I picked up a Tesla Model Y at the end of the year. I've been to more than 10 places in the month or so since buying the car. So if you ask me to recommend something, I would definitely say you need to buy a car, but as for what to buy, see what others say."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "副业是汽车服务行业的，不太专业，就二手车说说自己的看法，有很多比较热门的车型，比如本田飞度、大众高尔夫、福克斯，都是上手感觉不错，二手价格又比较坚挺的车，用在和自己女朋友出门还是蛮不错的。",
          "en": "My side hustle is in the car service industry, so I'm not very professional. I will just share my opinion on used cars. There are many popular models, such as Honda Fit, Volkswagen Golf, and Ford Focus, which are all good to drive and have stable used car prices, which is quite nice for going out with your girlfriend."
        },
        {
          "zh": "年前自己收了一辆 11 年的福克斯自动挡，仅花了五千块钱，动力很足，可能有些小毛病，但自己整备整备还是不错的。",
          "en": "Before the Chinese New Year, I bought a 2011 Ford Focus automatic for only 5,000 yuan. It has plenty of power. It might have some minor problems, but it's still good after a little work."
        },
        {
          "zh": "有两三万预算完全可以上个还不错的二手车，我个人建议是上个油车，不必要是什么年份很近的车，十年前的车就是过车检麻烦点，需要一年一检，有什么问题怕过不了再花个两百块钱找个黄牛问题不大的。",
          "en": "With a budget of 20,000 to 30,000, you can definitely get a decent used car. My personal suggestion is to get a gasoline car. It doesn't have to be a recent model. The only problem with a car from ten years ago is that the vehicle inspection is a bit troublesome, requiring an inspection every year. If you are afraid that there will be any problems that you can't pass, spending two hundred yuan to find a scalper will solve it."
        },
        {
          "zh": "成色这块自己可以到二手市场看看，自己开开感觉一下，要求一下检测报告，基本上问题不大的。",
          "en": "You can go to the used car market to check the condition yourself, drive it yourself to get a feel for it, and ask for an inspection report. Basically, there won’t be many problems."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 有必要2. 别买小鹏和比亚迪3. 建议买混动4. 底盘与操控 比 所谓汽车智能化重要一百倍",
          "en": "1. Necessary 2. Don't buy Xpeng and BYD 3. Recommend buying a hybrid 4. Chassis and handling are a hundred times more important than so-called car intelligence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jamel 我跟你一样，24 ，毕业后买了一个 11w 的新车（ 21 年）。前两年来杭州了，很少开出去。现在有了崽 回老家 900km ，轿车还是不方便，md 买亏了。我都想卖给你 换 suv 了，奈何 老婆 认为 没必要换。（就酱）",
          "en": "@jamel I'm the same as you, 24, bought a new car for 110,000 after graduation (2021). I came to Hangzhou in the last two years, and rarely drive it out. Now that I have a kid and I'm going back to my hometown 900km away, a sedan is still not convenient. I regret buying it. I even wanted to sell it to you and switch to an SUV, but my wife doesn't think it's necessary. (That's all)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一年 1W 公里不要考虑混动了，保费贵太多，3 年后残值基本无。5W 左右可选择也不多。多看看油车，选择多很多，3 年后不出事故大概也还能值个 2W 。",
          "en": "If you drive 10,000 kilometers a year, don't consider a hybrid. The insurance premiums are too expensive, and the residual value will be basically zero after 3 years. There are not many options around 50,000. Take a look at gasoline cars, there are many more choices. If there are no accidents in 3 years, it can probably still be worth about 20,000."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "推荐给 op 一款合资纯油车，雪佛兰科鲁泽，我自己买的也是这款，23 年 3 月买的当时落地 8w ，裸车 7.5w ，今年 1 月去 4s 做保养问了下价格，今年裸车 5.8w ，坐标苏州，落地估计 6.3-6.5w ，强烈推荐针对 op 的需求：中控有两块 10 寸联屏，有 carplay ，有倒车影像，有定速巡航，音响 6 个喇叭，中配有变道警示、有天窗、有后视镜加热，后轮独立悬挂 后排乘坐感相对不错，反正对我来说完全满足日常要求目前我开了两年不到，4w 公里，没有小毛病，也没有大毛病，正常定时定期做大小保养，高架油耗 4.5-5.5 ，高速油耗 5.5-6.5 ，每年保险 3.3k 左右，仅供参考",
          "en": "I recommend the Chevrolet Cruze, a joint venture pure gasoline car, to the OP. I bought this one myself in March 2023 for 80,000 including all fees, the base model was 75,000. I went to the 4s shop for maintenance in January this year to ask about the price. The base model is 58,000 this year, Located in Suzhou, it will cost about 6.3-6.5w which is highly recommended for OP's needs: the central control has two 10-inch connected screens, has carplay, has reversing camera, has cruise control, and the audio is 6 speakers. The mid-range version has a lane change warning, a sunroof, and heated rear-view mirrors. The rear wheels have independent suspension and the rear seat ride is relatively good. Anyway, it completely meets my daily needs. I have driven it for less than two years and 40,000 kilometers. There are no minor or major problems, normal scheduled maintenance, elevated road fuel consumption is 4.5-5.5, highway fuel consumption is 5.5-6.5, and annual insurance is about 3.3k, for reference only."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以考虑搞个便宜的油车 suv ，出去玩还要带狗怎么也是 suv 方便,当前这状态有车的好处就是想走就走，目前我开的起亚狮跑 开了 11 年了上过山，下过河，偶尔应急车里也能小睡一下；只修过一次车门，换过一次轮胎 现在这车也就一万到三万左右吧，供参考",
          "en": "You can consider getting a cheap gasoline SUV. If you want to take your dog out to play, an SUV is convenient anyway. The benefit of having a car in the current state is that you can leave whenever you want. I currently drive a Kia Sportage. I have been driving it for 11 years, I have gone up mountains, crossed rivers, and I can occasionally take a nap in the car in an emergency; I have only repaired the door once and changed the tires once. Now this car is only worth about 10,000 to 30,000, for reference."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议买个二手的高尔夫 7 ，千万别买太贵的车，年轻时期一般是没钱，时间多，积攒本金是比较重要的，未来会有大用。",
          "en": "I suggest buying a used Golf 7. Don't buy too expensive a car. Young people generally don't have much money but have a lot of time. It is more important to accumulate capital, which will be of great use in the future."
        },
        {
          "zh": "车虽然能改善生活，但有和没有差别比较大，但有了之后边际差别就没有那么跳跃了。",
          "en": "Although a car can improve life, there is a big difference between having one and not having one, but after you have one, the marginal difference is not so significant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你的目的是练车的话，简单的很，闲鱼一堆陪练，还能自带车，而且他们专业的副驾还有刹车。",
          "en": "If your purpose is to practice driving, it's very simple. There are a bunch of driving instructors on Xianyu, and they can even bring their own car, and their professional passenger seats also have brakes."
        },
        {
          "zh": "开熟了去租车开就行了。你这月薪有点抗不住的，停车费油费，加上保养罚单什么的。基本生活都会受影响",
          "en": "Once you are familiar with driving, you can just rent a car to drive. With your monthly salary, you won't be able to afford it. Parking fees, fuel costs, plus maintenance fines, etc. Your basic life will be affected."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@take0a0sleep #76 嗯，你可以先租来开几次练练车，看看自己喜欢轿车还是 SUV 还是什么，然后再算一笔账，我是这么算的：油费高速费不算，因为开什么车都要出这笔钱，然后停车费+保险，我这边一年 1w ，折旧费一年 1w ，然后问一下自己一年能不能开到 40 天车，我理解 40 天以下无脑租车就好。",
          "en": "@take0a0sleep #76 Yeah, you can rent a car and drive it a few times to practice driving first, to see if you like sedans or SUVs or what, and then do the math. This is how I calculated it: Fuel costs and highway tolls are not included, because you have to pay this money no matter what car you drive, then parking fees + insurance, which is 10,000 a year for me, and depreciation costs 10,000 a year. Then ask yourself if you can drive the car for 40 days a year. I understand that it's better to rent a car if it's less than 40 days."
        }
      ],
      "type": "replies"
    }
  ]
}