{
  "id": 1109224,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "打呼噜被对象嫌弃了，减肥真的有用吗？",
          "en": "Snoring is disliked by my partner, is losing weight really helpful?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "早上起床人不见了，一看他在客厅沙发睡觉，说是半夜被我吵的不行",
          "en": "I woke up in the morning and my partner was gone. I found him sleeping on the sofa in the living room, saying he couldn't stand being disturbed by me in the middle of the night."
        },
        {
          "zh": "现在都不让我过夜了，以后周末 do 完就得回家自己睡，但是我很喜欢抱着他的手臂睡觉。。。很有安全感",
          "en": "Now he doesn't even let me stay overnight. In the future, after 'doing it' on weekends, I have to go home and sleep by myself, but I really like sleeping with my arms around his... it feels very safe."
        },
        {
          "zh": "那种夹在鼻子上的我感觉是骗人的，呼吸机应该真的有效，但是听说会形成依赖，打算当兜底的办法。",
          "en": "I feel like those things clipped on the nose are scams. A ventilator should really be effective, but I heard it can be addictive, so I plan to use it as a last resort."
        },
        {
          "zh": "真的有人减肥以后不打呼噜或者呼噜声音变小吗，道听途说的就算了，我想听真实经历。",
          "en": "Has anyone actually stopped snoring or had their snoring become quieter after losing weight? I don't want to hear rumors, I want to hear real experiences."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "他和他  不是她和他",
          "en": "He and him, not she and him."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是 do 的时间太短了  都要几次  他就没精力关注你是否打呼噜了",
          "en": "It's still that the 'doing it' time is too short. If it takes a few times, he won't have the energy to pay attention to whether you're snoring or not."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "男男？ ！",
          "en": "Male and male?!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Awes0me  这个 0 很有深意",
          "en": "Awes0me, this '0' has a profound meaning."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hututu888 #25  记得之前发过的帖子，楼主应该是男的。",
          "en": "@hututu888 #25 I remember the previous posts, the original poster should be male."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买闭嘴贴封嘴睡，呼噜声会小很多",
          "en": "Buy mouth tape to seal your mouth while sleeping, the snoring will be much quieter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "对方都开始嫌弃你了，做什么意义不大。正确的方式是一起寻找解决办法。",
          "en": "If your partner is already disliking it, doing anything alone won't be meaningful. The right way is to find a solution together."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "减肥真的可以减少打呼噜或者不打呼噜，真实体验。",
          "en": "Losing weight can really reduce or eliminate snoring, real experience."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@arischow 这很危险，搞不好有可能憋死。",
          "en": "@arischow This is very dangerous, you might suffocate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@arischow #4 我是闭嘴贴的受益者，对我好用的而且感觉起床嘴巴不干，已经习惯每天睡着之前贴一个。",
          "en": "@arischow #4 I am a beneficiary of mouth tape, it works well for me and I feel like my mouth isn't dry when I wake up. I'm already used to putting one on before falling asleep every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@arischow #4 我也是受益者。感觉睡眠质量高了很多",
          "en": "@arischow #4 I'm also a beneficiary. I feel that my sleep quality has improved a lot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大概介绍下自己的经验，胖的大概率会有呼吸暂停，但不绝对，还是谨遵医嘱",
          "en": "Let me briefly introduce my experience. People who are overweight are more likely to have sleep apnea, but it's not absolute. Please follow your doctor's advice."
        },
        {
          "zh": "1. 嘴贴什么的就别推荐了，像楼上一些朋友说的大概率很危险",
          "en": "1. Don't recommend mouth tape or anything like that. As some friends above said, it's probably very dangerous."
        },
        {
          "zh": "2. 建议先去呼吸科挂个号看看，做个睡眠监测，就是带个设备回家睡一晚",
          "en": "2. It is recommended to first register at the respiratory department and do a sleep monitor, which is to take a device home and sleep for one night."
        },
        {
          "zh": "3. 日常有在用呼吸机，好多年了，非常好用",
          "en": "3. I use a ventilator daily, and I've been using it for many years. It's very useful."
        },
        {
          "zh": "4. 楼上有些说的呼吸机会不自觉拿掉的，我之前也会，然后后来发现可能是和鼻炎有关系，得看一下你用的是鼻罩还是面罩，如果是有鼻炎本身就鼻塞的建议用面罩，基本上习惯了就不会摘掉",
          "en": "4. Some people upstairs said that they would unconsciously take off the ventilator. I used to do that too, but then I found out it might be related to rhinitis. You have to see if you're using a nasal mask or a full face mask. If you have rhinitis and a stuffy nose, it is recommended to use a full face mask. Basically, once you get used to it, you won't take it off."
        },
        {
          "zh": "5. 如果是飞利浦的呼吸机推荐 dreamwear full face 口鼻罩",
          "en": "5. If it is a Philips ventilator, I recommend the DreamWear full face mask."
        },
        {
          "zh": "6. 要买呼吸机建议双水平一步到位，单水平呼气的压力不可调可能更难习惯",
          "en": "6. If you want to buy a ventilator, I recommend a bilevel ventilator in one step. The pressure of the single-level exhalation is not adjustable and may be more difficult to get used to."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看昵称 op 是 0 ？",
          "en": "Judging by the nickname, is the OP a '0'?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接去医院做一次睡眠监测，看看成因是什么，不过如果你体重超标那确实大可能是肥胖导致呼吸道狭窄打呼噜",
          "en": "Go directly to the hospital for a sleep monitor to see what the cause is, but if you are overweight, it is very likely that obesity is causing airway narrowing and snoring."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "调整一下睡姿，还不能改善可以去医院检查一下，之前有个亲戚就是去医院检查做了个小手术，改善不少",
          "en": "Adjust your sleeping position. If it doesn't improve, you can go to the hospital for an examination. A relative of mine had a minor surgery after an examination at the hospital, and it improved a lot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得减肥不太行, 因为我比较瘦, 依然打呼噜.  如果困扰很大的话,去医院听下医生的建议吧.",
          "en": "I don't think losing weight is very effective, because I'm relatively thin and still snore. If it's a big problem, go to the hospital and listen to the doctor's advice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "他？嗯，我瘦的时候从来不打呼噜，后来胖了呼噜震天，然后减肥一段时间，呼噜声小了很多，但并未还原，可能是因为体重也没还原。减肥肯定是有用的，觉得自己更健康了，甚至以前很多东西过敏也都无了。",
          "en": "He? Well, I never snored when I was thin, but later when I got fat, I snored like thunder. Then after losing weight for a while, the snoring became much quieter, but it didn't return to normal, probably because my weight didn't return to normal either. Losing weight is definitely helpful, I feel healthier, and even many previous allergies have disappeared."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我瘦的时候打呼噜胖的时候也打呼噜就戴着呼吸机不打呼噜但是我戴着睡觉不舒服就用了一阵子出二手了我对象现在用耳塞聊胜于无个人经历 仅供参考 建议去医院看看 可能会有呼吸暂停综合征啥的",
          "en": "I snored when I was thin and I snored when I was fat, so I wore a ventilator and didn't snore, but I felt uncomfortable wearing it to sleep, so I used it for a while and sold it second-hand. My partner now uses earplugs, which is better than nothing. Personal experience, for reference only. It is recommended to go to the hospital to see if there is any sleep apnea syndrome or something."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去医院五官科看，做鼻镜和咽喉镜，打呼和肥胖没有必然联系。我从小就打呼，前端时间去医院，喉道狭窄，只有上呼吸机。",
          "en": "Go to the ENT department of the hospital, have a nasal endoscopy and laryngoscopy. There is no necessary connection between snoring and obesity. I have snored since I was a child. I went to the hospital some time ago and found that my throat was narrow, so I can only use a ventilator."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@klo424 危险在？我不会完全封死，会留点缝。我有比较严重的嘴呼吸依赖。",
          "en": "@klo424 What's the danger? I won't seal it completely, I'll leave a little gap. I have a rather serious mouth-breathing dependency."
        }
      ],
      "type": "replies"
    }
  ]
}