{
  "id": 1112490,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "不懂就问，坐电车晕车怎么治？",
          "en": "Asking for a friend, what's the cure for motion sickness in electric cars?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "- 因为经常出差的缘故，滴滴打车使用频率较高。\r\n- 打车现在是十车九电，油车很少晕车，电车司机但凡开的快一点，就开始晕车，虽然没到吐得程度，但也很不舒服。\r\n- 也有不晕车的经历，就是开的特别稳，不快那种。\r\n- 虽然知道自己开不会晕，但是买车肯定要考虑别人，入座的舒适性，这样让我有点对电车扣分。\r\n- 身边也有很多同事，坐电车也会晕车。",
          "en": "- Due to frequent business trips, I use Didi (ride-hailing app) quite often.\r\n- Now, about 9 out of 10 taxis are electric cars. I rarely get motion sickness in gasoline cars, but with electric car drivers, I start feeling motion sickness as soon as they drive a little faster, although it doesn't reach the point of vomiting, it's still very uncomfortable.\r\n- I've also had experiences where I didn't get motion sickness, which was when the driving was very smooth and not fast.\r\n- Although I know I won't get motion sickness if I drive myself, when buying a car, I definitely have to consider others and the comfort of seating, which makes me deduct points for electric cars.\r\n- Many colleagues around me also get motion sickness in electric cars."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "开动能回收了吧，尽量做前座",
          "en": "It's probably the regenerative braking. Try to sit in the front seat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iPhone 上有个功能，叫车俩运动提示。开启之后，如果车辆在动的话，屏幕上会有小点点，防晕特别有用。本人之前在车内玩手机特别晕，现在随便玩。",
          "en": "There's a feature on iPhone called 'Car Motion Hints'. After turning it on, if the vehicle is moving, there will be small dots on the screen, which are very useful for preventing motion sickness. I used to get very motion sick when playing with my phone in the car, but now I can play without any problems."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上车就跟司机说开稳一点，否则吐了概不负责",
          "en": "Tell the driver to drive more smoothly as soon as you get in the car, otherwise you won't be responsible if you throw up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉电车司机都是一脚电门一脚刹车的开，确实很容易晕",
          "en": "It feels like electric car drivers always drive with one foot on the accelerator and the other on the brake, which makes it really easy to get motion sickness."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "电车好多都开动力回收，加之加速本来就猛，很难不晕车的。",
          "en": "Many electric cars use regenerative braking, and coupled with the strong acceleration, it's hard not to get motion sickness."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 车内空气臭其实是主要原因2. 滴滴司机，很多并不是老司机。。。3. 因为长期在路上跑，很擅长插队和担心被加塞，所以，总是一窜一窜4. 虽然，不踩油门，脚就应该放刹车上，但是。。。没事就微踩刹车的就是脑子被门夹过了。以上",
          "en": "1. The main reason is the bad smell inside the car. 2. Many Didi drivers are not experienced drivers... 3. Because they are on the road for a long time, they are very good at cutting in line and are worried about being cut off, so they are always jerky. 4. Although your foot should be on the brake when you are not pressing the accelerator... stepping on the brake slightly for no reason means their brain has been pinched by a door. That's all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "风琴脚，油门一踩就窜，油门一收就减速，一前一后一摇一摇，恶心的一批",
          "en": "Accordion foot, accelerating with a burst and decelerating as soon as the accelerator is released, rocking back and forth is irritating as hell."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "垃圾动能回收 都难受的要死",
          "en": "The garbage regenerative braking is so uncomfortable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1 电车司机更喜欢在车里睡觉（安全），加重味道2 有动能回收，为了省钱3 出身不是传统司机，就是瞎开，便宜，不追求体验，以快速到达为准（特斯拉还专车级别，垃圾的要命，呸，快车钱我都不想坐）",
          "en": "1 Electric car drivers prefer to sleep in the car (safety), which makes the smell worse. 2 They have regenerative braking to save money. 3 They are not from traditional drivers. They just drive blindly because it's cheap, don't pursue the experience, and focus on arriving quickly (Tesla even has a premium level, but it's terribly garbage. I don't even want to take it for the price of a regular ride)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MeteorVIP 外放",
          "en": "@MeteorVIP Play it out loud."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也不行，带老婆孩子就打专车，看车牌号是电车的话就取消再下一单。",
          "en": "I can't either. When I'm with my wife and children, I order premium rides. If I see that the license plate number indicates an electric car, I cancel and order another one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我从来不晕交通工具的，去年被一个开东风电车的滴滴司机整吐了（下车后）。",
          "en": "I never get motion sickness in any vehicles, but last year I was made to throw up by a Didi driver driving a Dongfeng electric car (after getting out of the car)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别说电车，晚上打滴滴经常打到雅阁，司机猛踩，巴不得一脚到目的地，下车脑袋疼",
          "en": "Not just electric cars, when I take Didi at night, I often get Accord drivers who step on the accelerator hard, wishing to arrive at the destination in one step, and my head hurts after getting out of the car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "治的话就是多坐，习惯了就不晕了不想难受的话，上车就提醒司机自己晕车，开车稳一点",
          "en": "To cure it, just ride more, and you'll get used to it and won't get motion sickness anymore. If you don't want to feel uncomfortable, remind the driver that you get motion sickness and ask them to drive steadily."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "主要原因是动能回收，相当于电摩的反充电。让司机把动能回收调最低，或者调成舒适。",
          "en": "The main reason is regenerative braking, which is equivalent to the reverse charging of an electric motorcycle. Ask the driver to set the regenerative braking to the lowest level, or to comfort mode."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也是，打车出去玩特别影响体验，到了地方人已经晕完，都没什么心情了",
          "en": "Me too. Taking a taxi to go out and play really affects the experience. By the time I get there, I'm already dizzy and have no mood for anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐副驾，看前面不要看手机。了解一下晕车原理，之前看过，大概是因为眼睛看到的平衡方向和耳朵里面一个系统感受到的不一致。",
          "en": "Sit in the passenger seat, look ahead and don't look at your phone. Understand the principle of motion sickness. I saw it before. It's probably because the sense of balance seen by your eyes is inconsistent with what a system inside your ears feels."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看窗外",
          "en": "Look out the window."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开窗户 睡大觉",
          "en": "Open the window and have a good sleep."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我想起来一会要打车,头就开始晕了..",
          "en": "I remembered that I have to take a taxi later, and my head starts to spin..."
        }
      ],
      "type": "replies"
    }
  ]
}