{
  "id": 1113994,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "dell u2725qe 官网上架了",
          "en": "Dell U2725QE is now on the official website"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "比上一代增加了不少 feature ，但是首发价格感人\r\n[https://www.dell.com/zh-cn/shop/dell-ultrasharp-27-4k-thunderbolt-hub-%E6%98%BE%E7%A4%BA%E5%99%A8-u2725qe/apd/210-bqmh/%E6%88%B4%E5%B0%94%E6%98%BE%E7%A4%BA%E5%99%A8\r\n]( https://www.dell.com/zh-cn/shop/dell-ultrasharp-27-4k-thunderbolt-hub-%E6%98%BE%E7%A4%BA%E5%99%A8-u2725qe/apd/210-bqmh/%E6%88%B4%E5%B0%94%E6%98%BE%E7%A4%BA%E5%99%A8\r\n)",
          "en": "It has more features than the previous generation, but the initial price is touching.\r\n[https://www.dell.com/zh-cn/shop/dell-ultrasharp-27-4k-thunderbolt-hub-%E6%98%BE%E7%A4%BA%E5%99%A8-u2725qe/apd/210-bqmh/%E6%88%B4%E5%B0%94%E6%98%BE%E7%A4%BA%E5%99%A8\r\n]( https://www.dell.com/zh-cn/shop/dell-ultrasharp-27-4k-thunderbolt-hub-%E6%98%BE%E7%A4%BA%E5%99%A8-u2725qe/apd/210-bqmh/%E6%88%B4%E5%B0%94%E6%98%BE%E7%A4%BA%E5%99%A8\r\n)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@GeekGuru 因为他并不需要那么高的带宽呀，毕竟才 4k120",
          "en": "@GeekGuru Because he doesn't need that much bandwidth, after all, it's only 4k120"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚看了下，供应商价格 4000 ，本来就是和 u2723 一个价，现在 2723 基本 3000 上下是底价，感觉 618 加国补 jd 之类渠道 3600-4000 能搞到",
          "en": "Just looked at it, the supplier price is 4000, which is the same price as u2723. Now 2723 is basically 3000 or so as the bottom price. I feel that 3600-4000 can be obtained through channels such as 618 plus national subsidies and JD."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有 HDR ，这个价格它怎么敢的呀。",
          "en": "No HDR, how dare it at this price?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "额，居然只支持 DP1.4",
          "en": "Well, it only supports DP1.4"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@FreddyLiu 我看支持 displayHDR600 ，不过价格确实感人",
          "en": "@FreddyLiu I see it supports displayHDR600, but the price is indeed touching."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "接口是真多",
          "en": "So many interfaces"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真贵啊  而且好像只能纯办公更合适",
          "en": "It's so expensive, and it seems only suitable for pure office work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "显示器带网线是干嘛的",
          "en": "What is the network cable on the monitor for?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chatgptnext 应该是雷电口接电脑，显示器接网线后可以给电脑供网，网络更稳定，这个是我猜测的",
          "en": "@chatgptnext It should be that the Thunderbolt port is connected to the computer, and the monitor is connected to the network cable to provide the network to the computer. The network is more stable. This is my guess."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "戴尔的官网价格一向都是摆着看的，可以砍价对有需求的人来说这个显示器挺完美的，对这部分人来说没有别的可选（还有一个同系列的 3225QE ）4K 高刷，接口齐全（包含好几个很小重但是特殊场景下特别重要的接口），屏幕本身素质也是很好的一档之前市面上几千块的显示器要么缺这个要么缺那个 ，几乎没有完美的",
          "en": "Dell's official website prices are always for show. You can bargain. For those who need it, this monitor is quite perfect. There are no other options for these people (there is also a 3225QE in the same series). 4K high refresh rate, complete interfaces (including several very small but special interfaces), the screen itself is also very good. Before, the monitors on the market for thousands of dollars either lacked this or that, and there were almost no perfect ones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lg106 你猜对了，比如 mbp 外接戴尔 u2723 这个显示器，这个网口接路由器，网络稳定不少，特别是跨屏跨系统键鼠同步场景，延迟肉眼可及降低。",
          "en": "@lg106 You guessed it right. For example, when the mbp is connected to the Dell u2723 monitor, the network port is connected to the router, and the network is much more stable, especially in the cross-screen and cross-system keyboard and mouse synchronization scenario, the latency is visibly reduced."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真不错，下单买个放办公室里用",
          "en": "Really good, order one to put in the office"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "价格可以找客服谈，会有优惠的。这个显示器基本满足我的需求，4K ，高刷，140W 反向充电，99% DCI-P3 色域。但是看介绍没说支持 FreeSync ，看来不能做工作/游戏两不误。不过 HDMI 支持 VVR ，接 PS5 好像也挺好。",
          "en": "You can talk to customer service about the price, there will be discounts. This monitor basically meets my needs: 4K, high refresh rate, 140W reverse charging, 99% DCI-P3 color gamut. But the introduction doesn't say it supports FreeSync, so it seems that work and games can't be combined. However, HDMI supports VVR, which seems to be good for connecting to PS5."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Takizawa 那我电脑直接接路由器不是更快,还没有中转没有损耗 @lg106",
          "en": "@Takizawa Isn't it faster for my computer to connect directly to the router? There is no transit and no loss @lg106"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chatgptnext 我有一台 2723QX 。我把网线插显示器上，通过 type-c 一线连笔记本，带走的时候只用拔一根线就行，换公司笔记本也只用一根线插拔，很方便。",
          "en": "@chatgptnext I have a 2723QX. I plug the network cable into the monitor and connect the laptop with a single type-c cable. When I take it away, I only need to unplug one cable. It is also very convenient to change the company's laptop with only one cable to plug and unplug."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chatgptnext 桌面整洁，一根线雷电线就解决了。还有苹果笔记本没有网口吧",
          "en": "@chatgptnext The desktop is neat and tidy. One Thunderbolt cable solves the problem. And Apple laptops don't have network ports, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看介绍说是支持菊花链，是不是意味着买一台 u2725 然后就能一根雷电线连电脑根老的 u2723 组双屏了",
          "en": "The introduction says it supports daisy chain. Does it mean that if I buy a u2725, I can connect a Thunderbolt cable to the computer and the old u2723 to form a dual screen?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年年更新，这次不更了，贵太多了...",
          "en": "Updated every year, but not this time, it's too expensive..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找客服问了，到手 4499 。这几个可以的，比上一代 2723QE 多了雷电 4 还有 120Hz 高刷https://imgur.com/a/W3fZPL1",
          "en": "I asked customer service, and it costs 4499 to get it. These are okay. Compared with the previous generation 2723QE, there are more Thunderbolt 4 and 120Hz high refresh rate https://imgur.com/a/W3fZPL1"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@julykitt 价格贵了，再等等吧，4499 把人当水鱼呢",
          "en": "@julykitt The price is too expensive, wait a little longer, 4499 treats people like suckers"
        }
      ],
      "type": "replies"
    }
  ]
}