{
  "id": 1109304,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "月薪多少适合入奥迪 Q5L",
          "en": "What monthly salary is suitable for buying an Audi Q5L?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "最近在琢磨换车，名下一款车已经开了 11 年了，准备今年换掉，目前中意奥迪 Q5L ，价格也合适，想问一下大家后期使用成本什么的，包括保养、维修、换件（轮胎电瓶等等），综合成本，月薪多少能吼住？\r\n\r\n我平时开车不多，现车 11 年才开了不到 9 万公里。",
          "en": "I've been thinking about getting a new car recently. I've had my current car for 11 years and plan to replace it this year. Currently, I'm interested in the Audi Q5L because the price is right. I'd like to ask everyone about the later usage costs, including maintenance, repairs, replacement parts (tires, batteries, etc.), comprehensive costs. What monthly salary can handle it?\r\n\r\nI don't drive much usually. I've only driven less than 90,000 kilometers in the 11 years I've had my current car."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "买车从来不是看年收入的，而是看存款和家庭条件。",
          "en": "Buying a car has never been about annual income, but about savings and family conditions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "OP 问 Q5 ，怎么还有人推荐 A45 AMG 呢...这俩是一个定位的吗",
          "en": "OP is asking about the Q5, why are some people recommending the A45 AMG... are these two in the same segment?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在已经降到很低了，22 年落地 42W 现在只要 30W 。使用成本除了油钱其他不算高，1W 公里一保养，基本上 4 儿子会送三次基础保养，保险一年 5000 左右，其他没多少开销。",
          "en": "The price has dropped very low now. It cost 420,000 in 2022, but now it's only 300,000. The usage cost is not high other than fuel costs. It requires maintenance every 10,000 kilometers. Basically, the dealership will give you three free basic services. Insurance is about 5,000 per year, and there are not many other expenses."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没房贷没负债压力的时候，年入 5W 都能买",
          "en": "When there is no mortgage and no debt pressure, an annual income of 50,000 can afford it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cbythe434 #19 买迈腾，省下的钱干香片，哈哈",
          "en": "@cbythe434 #19 Buy a Magotan, and use the saved money to buy good tea, haha."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以买了  我存款都没你多 房贷还没还完   也买了",
          "en": "You can buy it. I don't even have as much savings as you, and I haven't finished paying off my mortgage, but I bought it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hackerwgf #36 唉~插电滴东西我们不要",
          "en": "@hackerwgf #36 Alas~ we don't want plug-in stuff."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lycpang #75 反正我第一年是四儿子店强制保险要 9000 ，后面都是 5000 多一年了，都是三百万三者险 + 座位险",
          "en": "@lycpang #75 Anyway, in the first year, the dealership forced me to get insurance for 9000, and later it was more than 5000 a year, all with three million third-party liability insurance + seat insurance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得如果 OP 是经过深思熟虑，对 Q5L 这个车也是完全了解（而且还对比了其他同价位的车）的情况下想买 Q5L 就买。",
          "en": "I think if OP has carefully considered and fully understands the Q5L (and has also compared it with other cars in the same price range), then buy the Q5L if you want to."
        },
        {
          "zh": "也许它的性价比确实是不如很多新能源车，但是它就是你的 dreamcar 。",
          "en": "Maybe its cost-effectiveness is indeed not as good as many new energy vehicles, but it is your dream car."
        },
        {
          "zh": "假如你今天听了其他人的意见买了别的车，当有一天开着你新买车在路上看到 Q5L 的时候会不会感叹：当初怎么就没买它呢。",
          "en": "If you listen to other people's opinions and buy other cars today, will you sigh when you drive your new car on the road and see the Q5L one day: Why didn't I buy it in the first place?"
        },
        {
          "zh": "但是这些的前提都是我最前面说的那句话不过楼里有人说什么就是买个标这句话我不太赞同，确实现在性能源性价比很高，特别是很多配置都高于 BBA ，但是我觉得在某些看不到的地方（例如底盘等等）国产新能源有些还真是比不上 BBA",
          "en": "However, all of these premises are the sentence I said at the beginning. But I don't quite agree with the saying that some people in the building say is just buying a logo. It is true that the cost performance of new energy is very high now, especially many configurations are higher than BBA, but I think in some invisible places (such as the chassis, etc.), some domestic new energy vehicles are really not as good as BBA."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@peacelove #1 存款 50+，目前房贷已经还完了",
          "en": "@peacelove #1 Savings 50+, currently the mortgage has been paid off."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今年也打算买这款，借个楼蹲一下",
          "en": "I also plan to buy this model this year, borrowing this thread to wait and see."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这条件这个级别的车随便养。",
          "en": "With your conditions, you can easily afford this level of car."
        },
        {
          "zh": "平时养个五系感觉不疼不痒的，要不了多少钱。",
          "en": "Maintaining a 5 Series usually feels painless and doesn't cost much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我一哥们把 q5l 卖了换成汉兰达了。",
          "en": "A friend of mine sold his Q5L and replaced it with a Highlander."
        },
        {
          "zh": "不知 q5l 有什么好？",
          "en": "I don't know what's so good about the Q5L?"
        },
        {
          "zh": "你的存款够买 q7 了。",
          "en": "Your savings are enough to buy a Q7."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Q5L 现在落地多少钱啊？",
          "en": "How much does the Q5L cost now, all included?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "保时捷 Macan：首付 50 万后，贷款部分月供约 1.5 万-2 万。",
          "en": "Porsche Macan: After a down payment of 500,000, the monthly payment for the loan is about 15,000-20,000."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这车今年下半年要换代,我在等新款",
          "en": "This car will be replaced in the second half of the year, I am waiting for the new model."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gefangshuai 你目前的情况随便买了，Q5L 落地应该 30 左右？",
          "en": "@gefangshuai With your current situation, you can buy it. The Q5L should cost around 300,000 all included?"
        },
        {
          "zh": "常规保养一年预计 2000 左右吧开的不多油费一个月预计 500-800",
          "en": "Regular maintenance is estimated to be around 2,000 per year. If you don't drive much, the fuel cost is estimated to be 500-800 per month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以考虑下 A45 AMG",
          "en": "You can consider the A45 AMG."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚看到楼下有一辆刚提没上牌的 Q5L ，心想为什么 2025 年还有人会买这车？",
          "en": "I just saw a Q5L downstairs that was just picked up and didn't have a license plate. I wondered why anyone would buy this car in 2025?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可能我太穷，格局小我在 op 这个情况下，肯定不会买 30 左右的这个车，每年养车这样算 就要 好几万了吧。",
          "en": "Maybe I'm too poor, and my perspective is limited. In OP's situation, I definitely wouldn't buy a car that costs around 300,000. The annual cost of owning a car would be tens of thousands."
        },
        {
          "zh": "不如 小米 su7 之类的了",
          "en": "Better to buy Xiaomi SU7 or something."
        }
      ],
      "type": "replies"
    }
  ]
}