{
  "id": 1108708,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "春运期间大爷大妈是怎么买到票的？",
          "en": "How do older people manage to buy train tickets during the Spring Festival travel season?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "票放出来秒光，这些上了年纪的大爷大妈是怎么买到票的？拼的是运气还是手速？",
          "en": "Tickets sell out instantly. How do these older people manage to buy them? Is it luck or speed that matters?"
        },
        {
          "zh": "我提前预约了，也没有抢到坐票，最后只能买站票返程。上车之后看到好多大爷大妈都有座位陷入了沉思……",
          "en": "I made a reservation in advance, but I still couldn't get a seat. In the end, I could only buy a standing ticket for my return journey. After getting on the train and seeing so many older people with seats, I fell into deep thought..."
        },
        {
          "zh": "不是看不起大爷大妈，单纯好奇他们是怎么买票的。",
          "en": "I'm not looking down on older people, I'm just curious how they buy their tickets."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "大爷大妈也有家人帮买票",
          "en": "Older people also have family members who help them buy tickets."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这个问题跟央视记者站在车厢里问大家「是不是都买到票了呀」不是一样的么，你在车上看到的大爷大妈肯定是有渠道有方法能买到票的大爷大妈，那些买不到票的你根本就看不到。。。",
          "en": "Isn't your question the same as a CCTV reporter standing in a train carriage asking if everyone was able to buy tickets? The older people you see on the train are definitely those who have channels or methods to buy tickets. You simply can't see those who couldn't buy tickets..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "实名制后，年龄是个“指标”我没法知道 12306 做了什么，但什么都没做不可能，连骗子、推销的都知道按年龄选目标反正都能卖出去，金额也一样，接一下上面要求的配额任务，也不影响什么",
          "en": "Since the implementation of real-name registration, age is an 'indicator.' I don't know what 12306 has done, but it's impossible that they've done nothing. Even scammers and salespeople know to select targets by age, as they can always sell something, the amount is the same, and it fulfills the quota requirements without affecting anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hefish @Donaldo 票池早就同步了，你们大概已经很久没有去窗口了吧，不然应该会听到“网上没票我们这里也买不到”",
          "en": "@hefish @Donaldo The ticket pool has been synchronized for a long time. You probably haven't been to the ticket window in a while, otherwise you would have heard, 'If there are no tickets online, we can't buy them here either.'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gorira 不太一样呀，我好奇的是买到票的人是怎么拼赢年轻人手速的。那些没买到票的肯定是没有拼过，所以不在讨论范围之内。",
          "en": "@gorira It's not quite the same. I'm curious how the people who bought tickets managed to beat the speed of young people. Those who didn't buy tickets definitely didn't try, so they're not within the scope of discussion."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你抢的是全程么？说是区间放票，体感上候补还是按先长后短分配，商业公司嘛",
          "en": "Did you try to buy a ticket for the entire journey? It's said that tickets are released for specific sections, but it feels like the waitlist is still allocated based on longer distances first, then shorter distances. It's a commercial company after all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "票源应该是同步的，但是有些退票，退票后的票源是定期批量放出来，不是退一张放一张，而线下是可以实时看票源，所以会有时候，前面排队的人买不到后面的人突然就能买到，或者在窗口的时候工作人员刷新几次随缘突然出来一张一样。",
          "en": "The ticket sources should be synchronized, but some tickets are refunded. Refunded tickets are released periodically in batches, not one at a time. Offline, you can see the ticket availability in real-time, so sometimes the person in front of the line can't buy a ticket, but the person behind them suddenly can, or the staff at the window refresh a few times and a ticket suddenly appears randomly."
        },
        {
          "zh": "老年人怎么买，首先老年人也有子女，也有自己的团体，团体里面会有玩智能手机玩的比较好的人帮很多人买，像我老家附近的厂会有年轻人帮老年人用手机买，以前还没流行网上买票的时候是厂子里安排人批量去火车站买。",
          "en": "How do older people buy tickets? First of all, older people have children, and they also have their own groups. Within the groups, there are people who are good at using smartphones who help many people buy tickets. For example, near my hometown, there are young people who help older people use their phones to buy tickets. Before buying tickets online became popular, the factory arranged for people to go to the train station in batches to buy tickets."
        },
        {
          "zh": "能去外地打工谋生的老年人，绝大概率比年轻人外向擅长交际。",
          "en": "Older people who can go to other places to work and make a living are very likely to be more outgoing and better at socializing than young people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "售票处买的。",
          "en": "Bought at the ticket office."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hefish 难道是给线下售票处预留了一些票，这些票不放在线上抢的？",
          "en": "@hefish Is it possible that some tickets are reserved for offline ticket offices and are not available online?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去窗口买，会预留一部分在人工售票处",
          "en": "Buy at the counter. Some tickets are reserved for manual ticket sales."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人工售票处呀，线下一般会留一些票给那些不会用手机的老人家买票的，当然也有可能是他们家里人帮忙买好了",
          "en": "At the manual ticket office. Offline, some tickets are usually reserved for elderly people who don't know how to use mobile phones to buy tickets. Of course, it's also possible that their family members helped them buy them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ll1506670756 搜了一下，貌似线下票源跟线上是同步的，https://www.zhihu.com/question/61157276?utm_id=0",
          "en": "@ll1506670756 I searched it up, it seems that offline ticket sources are synchronized with online ones. https://www.zhihu.com/question/61157276?utm_id=0"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@0xABCD #2 是的，这些要有额外的保证，",
          "en": "@0xABCD #2 Yes, these need extra guarantees."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "14 年前的上海有好几个线下售票点，每到过节买票的时候，线下售票点在放票前几小时总会排起长队，那时候在崇明岛的售票点如果掐着点去排队基本能够买到票，现在不知道是怎么个情况了",
          "en": "14 years ago, there were several offline ticket sales points in Shanghai. Every time during festivals, when it was time to buy tickets, there were always long queues at the offline ticket sales points a few hours before the tickets were released. At that time, if you went to queue at the ticket sales point on Chongming Island right on time, you could basically buy a ticket. I don't know what the situation is now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Damn #8 确实，这是之前听说的了。",
          "en": "@Damn #8 Indeed, that's what I heard before."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gorira 我在想是否除了手速之外，12306 对老年人有偏向，否则他们就总是处于劣势的一方了",
          "en": "@gorira I'm wondering if, in addition to speed, 12306 is biased towards older people, otherwise they would always be at a disadvantage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别偏见，说不定手机玩得比你还溜",
          "en": "Don't be biased, they might be better at using mobile phones than you are."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大爷大妈又不是孤儿没朋友，人家有自己的买票方法",
          "en": "Older people aren't orphans without friends, they have their own ways of buying tickets."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "虽然一趟车上，行程不一样，分配的各个区间的票数不一样，抢票难易程度也不一样，",
          "en": "Although on the same train, different itineraries have different numbers of tickets allocated to different sections, and the difficulty of grabbing tickets is also different."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大爷大妈有子女，子女可以帮购票；大爷大妈不舍得坐高铁和动车，只买绿皮，竞争基本是同龄人；线下窗口有留票，大爷大妈的时间不值钱，可以凌晨起床去排队；除了铁路空运以外，还有搭老乡的车，坐省际大巴；大爷大妈不用等到法定节假日，进了腊月就陆续返乡了",
          "en": "Older people have children who can help them buy tickets; older people are reluctant to take high-speed trains and only buy green trains, competing mainly with their peers; offline windows reserve tickets, older people's time is not valuable, and they can get up early in the morning to queue; in addition to railways and airlines, they can also take cars with people from their hometown or take interprovincial buses; older people don't have to wait for statutory holidays, and they return home successively after entering the twelfth lunar month."
        }
      ],
      "type": "replies"
    }
  ]
}