{
  "id": 1109544,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想戒掉抖音，但又不想错过那些实时新闻热点事件有什么好的解决方案嘛",
          "en": "I want to quit Douyin (TikTok), but what are some good solutions for not missing out on real-time news and popular events?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "因为抖音真的太费时间了，一刷上头了就停不下来",
          "en": "Because Douyin really wastes too much time. Once I start scrolling, I can't stop."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "错过那些实时新闻热点事件又怎样?",
          "en": "So what if you miss those real-time news and trending events?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "新闻？？抖音？？这两个关键词放一起有点 扯 且 搞笑！抖音鱼龙混杂的，在这个谁都能拍一条的时代，你指望抖音能给你带来你所谓的「新闻」？不过都是未经调查、滥竽充数、放大情绪的垃圾信息，几乎没有例外，这其中也包含了加蓝 v 的官方频道，大家都是互相转发，各种不经调查的拿来二创。在这里看新闻，无异于大海捞针、粪里淘金！那么多信息获取渠道，你偏偏选了个最粪的。你如果说是去抖音消磨时间、了解热梗倒也能理解！",
          "en": "News?? Douyin?? Putting these two keywords together is a bit ridiculous and hilarious! Douyin is full of mixed information. In this era where anyone can film a video, you expect Douyin to bring you so-called 'news'? It's all uninvestigated, shoddy, and emotionally amplified garbage information, almost without exception. This also includes official channels with blue V verification. Everyone is forwarding each other's content, using all kinds of uninvestigated material for secondary creations. Watching news here is like looking for a needle in a haystack, panning for gold in a pile of manure! There are so many information acquisition channels, and you chose the worst one. I could understand if you said you were going to Douyin to kill time and learn about trending memes!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "戒这戒那没用。最主要是要找到喜欢（不讨厌）的事情充实自己的时间。不然戒了抖音，还有小红书、微博、Bili 、YTB 、INS 等等",
          "en": "Quitting this and that is useless. The most important thing is to find something you like (or don't hate) to fill your time. Otherwise, if you quit Douyin, there's also Xiaohongshu, Weibo, BiliBili, YouTube, Instagram, etc."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你用抖音是为了看新闻热点的？",
          "en": "You use Douyin to watch trending news?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有的，每天看 https://newsnow.busiyi.world",
          "en": "Yes, I watch https://newsnow.busiyi.world every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关闭个性化推荐",
          "en": "Turn off personalized recommendations."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坏习惯是戒不掉的。要想改掉坏习惯，就是把好习惯加进去，你才会没有时间花在坏习惯上。可以去看看马斯克的工作理论，如何清洗油污的瓶子。",
          "en": "Bad habits can't be quit. To change a bad habit, you need to add a good habit, and then you won't have time for the bad habit. You can check out Elon Musk's work theory, how to clean an oily bottle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有啥新闻热点是你真的要关注的？是为了投资，还是为了了解行业前沿，还是为了茶余饭后的谈资？用抖音前有这个问题么？如果没有的话你以前是怎么解决的？",
          "en": "What news trends do you really need to pay attention to? Is it for investment, to understand industry frontiers, or for after-dinner conversation? Did you have this problem before using Douyin? If not, how did you solve it before?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多看看有深度的长视频，长文章，静下心来",
          "en": "Watch more in-depth long videos and long articles, and calm down."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微博，微信公众号（这两个需要避免关注过于情绪输出的 KOL ，多关注事实，少关注情绪，左中右都来一些），财新，TEL ，端，华尔街日报，王局...文字传输信息的密度和速度比视频更快更靠谱，转发辟谣的速度也更快，博主和评论之间的地位比视频更平等。然而时间久会发现，这个世界 99.99%的新闻跟我没关系。虽然我也没戒除掉信息的瘾就是了...",
          "en": "Weibo, WeChat official accounts (avoid following KOLs that output too much emotion, pay more attention to facts, less to emotions, get some from the left, center, and right), Caixin, TEL, Initium, Wall Street Journal, Wang Ju... Text transmits information with a higher density and speed than video, and the speed of forwarding rumors is also faster. The relationship between bloggers and comments is more equal than with video. However, over time, you will find that 99.99% of the news in this world has nothing to do with me. Although I haven't gotten rid of my information addiction..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://report.chaosoctopus.top/  v 友做的",
          "en": "https://report.chaosoctopus.top/ made by a V2EX user."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用微博呗",
          "en": "Just use Weibo."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在群里吹水呀 好多人会发新闻",
          "en": "Chat in groups, many people will post news."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从某种程度上，主动去获取你不想错过的东西，减少被投喂，当然也只能尽量优化，不可能做到绝对。但抖音的投喂力度实在太大，使用他又会大幅的降低这个优化效率，所以不如先卸载再说。",
          "en": "To some extent, actively acquire the things you don't want to miss and reduce being fed information. Of course, this can only be optimized as much as possible, and it's impossible to be absolute. But Douyin's feeding intensity is too great, and using it will greatly reduce this optimization efficiency, so it's better to uninstall it first."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把抖音卸载掉，微信公众号关注几个知名的新闻站点，热点新闻实时推送",
          "en": "Uninstall Douyin, and follow a few well-known news sites on WeChat official accounts for real-time hot news pushes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Rss 订阅下新闻源",
          "en": "Subscribe to news sources via RSS."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实不看哪些新闻热点，也不会咋样。",
          "en": "Actually, it's not a big deal if you don't watch those news trends."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iOS 有屏幕限制时间，我限制了 10 分钟。主要抖音用来查一些资料和消息，查着查着就不自觉刷下去了。现在设置这个后时间一到就提醒你已经刷了十分钟了并禁用 app 。",
          "en": "iOS has screen time limits, and I've limited it to 10 minutes. I mainly use Douyin to check some information and news. While checking, I unconsciously scroll. Now, with this setting, it reminds you that you've been scrolling for ten minutes and disables the app when the time is up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "抖音有新闻？不都是 AI 造假一条龙",
          "en": "Douyin has news? Isn't it all a one-stop shop for AI fakes?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用 follow 关注几个合适的资讯源头就好了。",
          "en": "Just use follow to follow a few suitable information sources."
        }
      ],
      "type": "replies"
    }
  ]
}