{
  "id": 1112598,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "买婚房请教各位已婚/订婚的兄弟姐妹们",
          "en": "Seeking advice on buying a wedding house from married/engaged brothers and sisters"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "# 省流版",
          "en": "# TL;DR Version"
        },
        {
          "zh": "**现状**: 目前可选的小区不多，主要考虑的是一个恒大小区。",
          "en": "**Current Situation**: There are not many optional residential areas, and the main consideration is a Evergrande residential area."
        },
        {
          "zh": "该小区因之前破产，由政府保交楼交付，质量存疑，物业也不太好。",
          "en": "This residential area was delivered by the government to ensure delivery due to previous bankruptcy, and the quality is questionable, and the property management is not very good."
        },
        {
          "zh": "目前地下车库仍在施工，交付时间未定。",
          "en": "Currently, the underground garage is still under construction, and the delivery time is undetermined."
        },
        {
          "zh": "隔壁是一个同期小区，正常交付，由万科物业管理。",
          "en": "Next door is a synchronous residential area, delivered normally and managed by Vanke Property."
        },
        {
          "zh": "**小区对比**:\r\n- **恒大小区**: 环境较好，有两个人工湖，楼间距 150 米，有七层小洋房。",
          "en": "**Residential Area Comparison**:\r\n- **Evergrande Residential Area**: Good environment, with two artificial lakes, 150 meters between buildings, and seven-story small western-style houses."
        },
        {
          "zh": "- **隔壁小区**: 环境一般，房价较便宜。",
          "en": "- **Next Door Residential Area**: General environment, cheaper prices."
        },
        {
          "zh": "**选择**: 大家会怎么选？",
          "en": "**Choice**: What would you choose?"
        },
        {
          "zh": "恒大小区的高层、小洋房，还是隔壁小区的高层？",
          "en": "High-rise or small western-style house in Evergrande residential area, or high-rise in the next door residential area?"
        },
        {
          "zh": "# 详细版",
          "en": "# Detailed Version"
        },
        {
          "zh": "## 背景介绍",
          "en": "## Background Introduction"
        },
        {
          "zh": "我和对象于 2024 年 11 月 9 日相亲认识，目前尚未订婚，但已见过家长。",
          "en": "I met my partner on a blind date on November 9, 2024. We are not yet engaged, but have met each other's parents."
        },
        {
          "zh": "我家在 A 市农村，她家在 B 市城区，两地相邻，距离 15 公里，车程约半小时。",
          "en": "My family is in a rural area of ​​City A, and her family is in an urban area of ​​City B. The two places are adjacent, 15 kilometers apart, and about half an hour's drive away."
        },
        {
          "zh": "两家人因买房问题多次争吵。",
          "en": "The two families have quarreled many times over the issue of buying a house."
        },
        {
          "zh": "## 女方观点",
          "en": "## Female's Perspective"
        },
        {
          "zh": "1. 她从小生活在市区，离商场、医疗和教育资源较近，希望继续住在市区。",
          "en": "1. She has lived in the city since she was a child, close to shopping malls, medical and educational resources, and hopes to continue living in the city."
        },
        {
          "zh": "2. 她是单亲家庭，与母亲同住，希望离母亲和工作单位近一些（目前开车 10 分钟到单位）。",
          "en": "2. She is from a single-parent family and lives with her mother. She hopes to be closer to her mother and work unit (currently a 10-minute drive to work)."
        },
        {
          "zh": "3. 对房子面积要求大于 120 平方米。",
          "en": "3. Requires a house area of ​​more than 120 square meters."
        },
        {
          "zh": "4. 她母亲表示，如果买房压力大，彩礼可以适当减少。",
          "en": "4. Her mother said that if the pressure to buy a house is too great, the bride price can be appropriately reduced."
        },
        {
          "zh": "5. 如果要求无法满足，她不愿意结婚。",
          "en": "5. If the requirements cannot be met, she is unwilling to marry."
        },
        {
          "zh": "**备注**: 她开车技术不佳，职业为无编制幼师，买房和装修不出钱，公积金余额 2 万，缴费基数较低。",
          "en": "**Note**: She has poor driving skills, works as an un-established kindergarten teacher, does not contribute to buying or decorating the house, has a housing fund balance of 20,000, and a low contribution base."
        },
        {
          "zh": "## 男方观点",
          "en": "## Male's Perspective"
        },
        {
          "zh": "1. 家庭条件一般，首付预算 60 万。",
          "en": "1. The family conditions are average, and the down payment budget is 600,000."
        },
        {
          "zh": "母亲建议在 A 市农村购买 100 万左右的房子，而 B 市城区房价较高（毛坯单价 1.3 万/平方米），120 平方米的房子加上装修费用过高。",
          "en": "My mother suggested buying a house for about 1 million in the rural area of ​​City A, while the house prices in the urban area of ​​City B are higher (bare unit price of 13,000/square meter), and the cost of a 120 square meter house plus decoration is too high."
        },
        {
          "zh": "2. 作为 A 市人，购买 B 市房子不太乐意，且上班通勤时间更长（目前开车 25 分钟到公司）。",
          "en": "2. As a person from City A, I am reluctant to buy a house in City B, and the commute to work is longer (currently a 25-minute drive to the company)."
        },
        {
          "zh": "3. 理解她单亲家庭的需求，但她家不出钱，要求又高，难以满足。",
          "en": "3. I understand the needs of her single-parent family, but her family does not contribute money and has high demands, which are difficult to meet."
        },
        {
          "zh": "**备注**: 目前月薪到手 8k ，公积金余额 1 万，缴费基数较低，可能是 B 市最低工资较高的原因。",
          "en": "**Note**: The current monthly salary is 8k after tax, the housing fund balance is 10,000, and the contribution base is low, possibly due to the higher minimum wage in City B."
        },
        {
          "zh": "## 之前的情况",
          "en": "## Previous Situation"
        },
        {
          "zh": "曾提出分手，但她不愿意，并表示愿意降低要求，考虑购买靠近 B 市的 A 市房子。",
          "en": "I once proposed to break up, but she was unwilling and said she was willing to lower her demands and consider buying a house in City A near City B."
        },
        {
          "zh": "然而，我的亲戚长辈都反对这一决定。",
          "en": "However, my relatives and elders opposed this decision."
        },
        {
          "zh": "由于相亲一年来她是我遇到的条件较好的对象，目前不考虑分手。",
          "en": "Since she is the best match I have met in the past year of blind dates, I am not currently considering breaking up."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "无编幼师，买房一毛不出，还得在她的城市买 120+的房子，哪来的勇气，而且她还是单亲，她要这么大的房子干嘛？",
          "en": "An un-established kindergarten teacher, contributing nothing to buying a house, and still wanting to buy a 120+ square meter house in her city, where does the courage come from? Moreover, she is from a single-parent family, what does she need such a big house for?"
        },
        {
          "zh": "你马上就要当冤大头了，我感觉她是想找个老实人而已，真的哥们",
          "en": "You are about to be taken advantage of. I feel like she is just looking for an honest man, really bro."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zj27 #24看完更多的信息，感觉 up 有点上头了。",
          "en": "@zj27 #24 After reading more information, I feel that the OP is a bit impulsive."
        },
        {
          "zh": "千万不要小头指挥大头。",
          "en": "Never let the small head command the big head."
        },
        {
          "zh": "这才认识 3 个月就要买房，要结婚。",
          "en": "You've only known each other for 3 months and you're already buying a house and getting married."
        },
        {
          "zh": "你很有可能不知道你“女朋友”的性格。",
          "en": "You probably don't know your 'girlfriend's' personality."
        },
        {
          "zh": "要不你再处半年/一年，多了解了解再说？",
          "en": "Why don't you spend another half a year/year to get to know her better before making a decision?"
        },
        {
          "zh": "单亲，幼师，无编，月光族，追星，胖，比你年纪大，工资 8K ？",
          "en": "Single parent, kindergarten teacher, un-established, living paycheck to paycheck, star chasing, overweight, older than you, salary 8K?"
        },
        {
          "zh": "不知道 UP 条件如何，就现在你女朋友的这些条件，应该达不到普通人水准。",
          "en": "I don't know what the OP's conditions are, but based on your girlfriend's current conditions, she probably doesn't meet the standards of an average person."
        },
        {
          "zh": "要是再加个弟妹，那可能更惨。",
          "en": "If you add a younger sibling, it might be even worse."
        },
        {
          "zh": "千万不要小头指挥大头！",
          "en": "Never let the small head command the big head!"
        },
        {
          "zh": "千万不要小头指挥大头！",
          "en": "Never let the small head command the big head!"
        },
        {
          "zh": "千万不要小头指挥大头！",
          "en": "Never let the small head command the big head!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你现在更重点要解决的问题不是要买哪个小区的房子而是要不要和这个人结婚按照你描述的前置条件你们两个并不适合结合在一起",
          "en": "The main problem you need to solve now is not which residential area to buy a house in, but whether or not to marry this person. According to the prerequisites you described, the two of you are not suitable to be together."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "\"但是结婚嘛，我是愿意将就的，我就怕这个没了，下一个不知道要等到猴年马月，相亲太遭罪了\"",
          "en": "'As for marriage, I'm willing to compromise. I'm afraid that if I lose this one, I don't know when the next one will come. Blind dates are too painful'."
        },
        {
          "zh": "感情不能将就，婚姻更是如此。",
          "en": "You can't compromise on feelings, and even more so on marriage."
        },
        {
          "zh": "结婚是一辈子的事情，你觉得你可以一直忍受这么久嘛？",
          "en": "Marriage is a lifelong affair. Do you think you can endure it for so long?"
        },
        {
          "zh": "(PS: 觉得离婚随便的当我没说)你们从认识到今天才 4 个多月，既然意见不统一，那就再相处相处。",
          "en": "(PS: If you think divorce is easy, then disregard what I said) You've only known each other for 4 months. Since you don't agree, then spend more time together."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "各位提到的建议我都看了，今晚去了她家还给她也看了，有些 v2er 言辞激烈的我也做了解释劝导，防止她生气，后面问了一下她以后月存款大概能有多少，结果她不理我，我再问，她说不知道，然后我很生气，耐心等待了五分钟，再问一遍，她只刷小红书，不理我，我就走了，到家后微信又大吵一架，她说她在生气，怪我把这些事情放在 v2 上了，我说我们都是局中人，局外人看得清楚一点，最后回答了我的问题，她确实是不知道，我就很愤怒，说好的以后一起还贷款，你连基本的月存款都说不出来，这是让我一个人还吗，后面撕破脸了，说好的会改，肯过苦日子，我就知道她这个城里宠大的不是那么轻易好改的，唉，本来以为今年明年肯定可以结婚了，跟朋友聊了聊，朋友觉得我心态比她同年龄的女生还着急，劝我结婚的事情要慢慢来，相亲的人需要好好接触，哪怕订婚也可能不结婚，说我太幼稚，本贴终结，愿大家相亲遇到正常人，稳步走向幸福婚姻",
          "en": "I have read all the suggestions mentioned by everyone. I went to her house tonight and showed them to her. I also explained and persuaded her about some of the more intense remarks from V2EX users to prevent her from getting angry. Later, I asked her how much she could save each month in the future, but she ignored me. I asked again, and she said she didn't know. Then I got very angry. I waited patiently for five minutes and asked again. She just scrolled through Xiaohongshu and ignored me, so I left. After I got home, we had another big fight on WeChat. She said she was angry because I put these things on V2EX. I said that we are both involved, and outsiders can see more clearly. Finally, she answered my question. She really didn't know. This made me very angry. We agreed to pay the mortgage together in the future, but you can't even tell me your basic monthly savings. Does this mean I have to pay it alone? Later, we had a falling out. We agreed that she would change and be willing to live a hard life. I knew that she, who was spoiled and pampered in the city, would not change so easily. Alas, I originally thought we would definitely get married this year or next year. I chatted with my friends, and they thought I was more anxious than girls of her age. They advised me to take things slowly when it comes to marriage, and that people who go on blind dates need to get to know each other well. Even if you get engaged, you might not get married. They said I was too naive. This post is terminated. I hope everyone who goes on blind dates meets normal people and steadily moves towards a happy marriage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "才认识 3 个月，因为房子也就是钱的问题，两家人能多次争吵，那么之后你月薪 8k 背 70 万贷款，你认为你们能按你说的“差不多得了”吗，这还是没算你将来还需要装修结婚彩礼花钱呢，以及房子贬值工作不稳定等可能发生的风险。",
          "en": "You've only known each other for 3 months, and the two families have quarreled many times over the house, which is a matter of money. Then, with your monthly salary of 8k carrying a loan of 700,000, do you think you can 'just make it work' as you said? This doesn't even include the cost of decoration, wedding gifts, etc. you will need in the future, as well as potential risks such as house depreciation and job instability."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也感觉 op 太急了，我和我对象谈了好几年了，即使这样在处理一些大事情的时候我还是会发现她有一些性格和处事细节是我之前没察觉到的，所以我觉得这么短的时间，你看的她不一定是真实的她。",
          "en": "I also feel that OP is too anxious. I have been with my partner for several years, and even so, when dealing with some major issues, I still find that she has some personality and behavior details that I didn't notice before. So, I don't think you can see the real her in such a short time."
        },
        {
          "zh": "在婚前购置东西财产分配这个阶段本身就是需要博弈的，不要想当然的认为自己大度对方就会大度。",
          "en": "The stage of purchasing things and distributing property before marriage itself requires a game. Don't assume that just because you are generous, the other person will be generous too."
        },
        {
          "zh": "而且 op 本身收入并不算高，对方家庭毫无支持，加上一个高消费的对象，以后你的生活压力会很大的，女生是说会降低自己的消费水平，但是你应该考虑为什么她之前会有那么高的消费水平，难道没想过存一点吗？",
          "en": "Moreover, OP's income is not very high, and the other party's family has no support, plus a high-spending partner, your life pressure will be very high in the future. The girl said she will reduce her spending, but you should consider why she had such a high level of spending before, did she not think about saving a little?"
        },
        {
          "zh": "我身边很多家庭条件没那么好的女生都是赚钱就早早的存钱，积攒自己的金库。",
          "en": "Many girls around me who don't have very good family conditions save money early as soon as they earn it and accumulate their own treasure trove."
        },
        {
          "zh": "我一直认为高消费到月光的男生或女生必须是家底子厚才可以理解的。",
          "en": "I have always believed that high-spending men or women who live paycheck to paycheck must have a thick family background to be understood."
        },
        {
          "zh": "而且她现在开始为了以后省钱，说白了是降低她自己的生活质量，后续有任何不如意她都会委屈，会觉得结婚让自己活得更苦了。",
          "en": "Moreover, she is now starting to save money for the future, which is basically lowering her quality of life. If anything goes wrong in the future, she will feel wronged and feel that marriage has made her life more bitter."
        },
        {
          "zh": "建议再多多相处，29 岁对于男生不算年纪大的。",
          "en": "I suggest spending more time together. 29 years old is not considered old for boys."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zj27 #8 相信我，买房、结婚、彩礼，这 3 件事，就是目前女方（包括女方家庭）对你的最大考验，不要单一思维：花钱买省事，除非你的财力足够，否则后面就是无休止的家庭矛盾。",
          "en": "@zj27 #8 Believe me, buying a house, getting married, and the bride price, these 3 things, are the biggest tests of the woman (including the woman's family) for you right now. Don't think simplistically: spending money to save trouble, unless your financial resources are sufficient, otherwise there will be endless family conflicts later."
        },
        {
          "zh": "建议： 1 、考虑下双方工作在哪里更好就业/育儿/购物/教育/交通，再确定买房地点优先级。",
          "en": "Suggestions: 1. Consider where both of you can find better employment/childcare/shopping/education/transportation, and then determine the priority of the house location."
        },
        {
          "zh": "2 、既然买房是你出钱，默认房本写你的名字，请务必明明白白说清楚，如不同意，请斟酌是否要从结婚开销、彩礼上削减，避免前期艰难。",
          "en": "2. Since you are paying for the house, the default is that the house ownership certificate will be in your name. Please be sure to make it clear. If you do not agree, please consider whether to cut back on wedding expenses and the bride price to avoid difficulties in the early stages."
        },
        {
          "zh": "‘3 、面积必须大于 120 平方米的依据请对方给出，不要一句：小于 120 平方米住不了一家人直接搪塞过去。",
          "en": "3. Please ask the other party for the basis of the requirement that the area must be greater than 120 square meters. Don't just dismiss it with a sentence: A family can't live in less than 120 square meters."
        },
        {
          "zh": "请结合你们实际需求，不要让对方一句好面子，疯狂给自己上杠杆。",
          "en": "Please combine your actual needs and don't let the other party's desire to save face put themselves on crazy leverage."
        },
        {
          "zh": "（正常来说三室一厅两卫一厨一阳台，足够 3 口之家居住，建面大概 104,实得大概 85 左右）4 、如果要求无法满足，她不愿意结婚。",
          "en": "(Normally, a three-bedroom, one-living room, two-bathroom, one-kitchen, and one-balcony is enough for a family of 3 to live in, with a construction area of ​​about 104 and a usable area of ​​about 85) 4. If the requirements cannot be met, she is unwilling to marry."
        },
        {
          "zh": "--请记住，结婚是两个人的事，不要你一个人忙前忙后，而她只管提条件，如果出现这种情况，请考虑分手，不开玩笑。",
          "en": "--Please remember that marriage is a matter for two people, don't just have you running around while she only cares about making demands. If this happens, please consider breaking up, no joke."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@weenhall5 你这样的想法跟我妈一样，就是有点自顾自，太有利益角度了，她多退步一点，我就多进一点，我不太喜欢这样，这种行为不好",
          "en": "@weenhall5 Your thinking is the same as my mother's, which is a bit self-centered and too focused on the interests. If she takes a step back, I take a step forward. I don't like this, this behavior is not good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "理解她单亲家庭的需求，但她家不出钱，要求又高，难以满足这个就算是一个问题了",
          "en": "Understanding the needs of her single-parent family, but her family doesn't contribute money and has high demands, which are difficult to meet, is a problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我看网友是闹麻了，我建议是拉爆杠杠，狠狠滴贷",
          "en": "I see the netizens are going crazy. My suggestion is to pull the leverage to the max and take out a huge loan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "月入 4000 喝星巴克，那很好了",
          "en": "Earning 4000 a month and drinking Starbucks, that's great."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wenchaotalk 都谈到结婚买房了还不给发生关系，多半是拿捏了从上文来看，女方=月光+追星+幼师。",
          "en": "@wenchaotalk Talking about marriage and buying a house but not having a relationship, she's probably got you figured out. From the above, the woman = paycheck to paycheck + star chasing + kindergarten teacher."
        },
        {
          "zh": "一般人看来都直接亮红灯的那种。",
          "en": "For most people, that's a red flag right away."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个条件有多好？",
          "en": "How good are these conditions?"
        },
        {
          "zh": "不过是有个城市户口，工作一般，家庭也不行，最多样貌还行房子谈不拢就不买，这个肯定不能为了满足对方而妥协，婚结不了就不结，谁着急了？",
          "en": "She just has a city hukou, the job is average, the family is not good either, and at most the appearance is okay. If the house negotiations don't work out, don't buy it. You definitely can't compromise to satisfy the other party. If the marriage can't be done, then don't get married. Who's in a hurry?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议分手女方，买我家那边的房子，我可以降低要求男方，买我家那边的房子，不舍得分手的理由是，到现在遇到的条件较好的双方考虑的既然不是这人咋样？  哈哈哈哈",
          "en": "I suggest breaking up with the woman and buying a house near my place. I can lower the requirements for the man and buy a house near my place. The reason for not wanting to break up is that the two of you are not considering the person's qualities, but only meeting good conditions so far? Hahahaha."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不打算分手那就是打算结婚了，既然要结婚我觉得现在买房不用急，等啥时候结婚有孩子再考虑吧，说不定省出来的钱以后除了市区还能在农村买一套",
          "en": "If you don't plan to break up, then you plan to get married. Since you want to get married, I don't think there's any need to rush to buy a house now. Wait until you get married and have children before considering it. Maybe the money you save can be used to buy a house in the countryside in addition to the city in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zj27 我看了你后面的回复说彩礼只是走个形式，对方要求只剩下：买房（面积 120 、距离原住址近一些）。",
          "en": "@zj27 I read your later reply saying that the bride price is just a formality, and the other party's only remaining requirements are: buying a house (area of ​​120, close to the original residence)."
        },
        {
          "zh": "看起来不是过分离谱，也有商量妥协的意愿，不至于马上走到分手的阶段。",
          "en": "It doesn't seem too outrageous, and there is a willingness to discuss and compromise. It's not at the point of breaking up immediately."
        },
        {
          "zh": "现在的问题，表面上是小区的选择，实际上男女两家的角力，核心的还在你们两个人身上。",
          "en": "The problem now, on the surface, is the choice of the residential area, but in reality, it's the struggle between the two families. The core is still between the two of you."
        },
        {
          "zh": "真要是那种看对眼的，裸婚的也很多；反过来如果你们俩没啥感觉，就按流程走，别纠结难受，纯当个传声筒得了。",
          "en": "If you really hit it off, there are many who get married without anything. On the other hand, if you two don't have any feelings, just follow the procedure and don't worry about it. Just be a messenger."
        },
        {
          "zh": "当然，也可以借着这种外部压力，把你们两个人拧成一股绳，你们一起拿主意，然后摆平各自家里人，婚姻里人还是最重要的，多评估一下对方品德、思维、待人接物，以后是你俩过日子，不是你俩的母亲过日子。",
          "en": "Of course, you can also use this external pressure to tie the two of you together. You make decisions together and then appease your respective families. People are still the most important thing in marriage. Evaluate the other person's character, thinking, and attitude towards others more. You two will be living together in the future, not your two mothers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "\"母亲建议在 A 市农村购买 100 万左右的房子\"别的不知道，但是这个一定要拒绝。",
          "en": "'My mother suggested buying a house for about 1 million in the rural area of ​​City A.' I don't know about the rest, but this must be rejected."
        },
        {
          "zh": "你买房的时候必须要考虑接盘有没有人，以后农村是人越来越少的，如果要出手，谁来接盘？",
          "en": "When you buy a house, you must consider whether there is anyone to take over. There will be fewer and fewer people in the countryside in the future. If you want to sell it, who will take over?"
        },
        {
          "zh": "再说，你买房也要考虑资源问题啊，上学、医疗、出警、工作机会这是必须要考虑到啊，最根本的就是：哪里资源多多就在哪里买，因为存在接盘人的可能性更大",
          "en": "Furthermore, you must also consider resource issues when buying a house, such as schooling, medical care, police, and job opportunities. The most fundamental thing is: buy where there are more resources, because there is a greater possibility of someone taking over."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这才认识几个月，就着急成这样，很明显是小头指挥大头了。",
          "en": "You've only known each other for a few months and you're already so anxious. It's obvious that the little head is commanding the big head."
        },
        {
          "zh": "楼上好几位都在劝，OP 压根就不听。",
          "en": "Several people upstairs are advising you, but OP isn't listening at all."
        },
        {
          "zh": "那我再多嘴一句，我觉得，继续谈个 1 年起，3 个月相处时间根本看不出来什么，根据 OP 已经给出的信息，我个人的判断的话，及时止损，早日分手最好。",
          "en": "Then I'll add one more word, I think you should continue dating for at least 1 year. You can't see anything in 3 months of dating. Based on the information that OP has already given, my personal judgment is to stop the loss in time and break up as soon as possible."
        },
        {
          "zh": "既然不听劝，那就建议多谈个 1 年起，再相处相处多了解下，如果这也不听劝光一个劲上头，那真没办法了。",
          "en": "Since you don't listen to advice, then I suggest you talk for at least 1 year, and get to know more about each other. If you still don't listen to advice and just blindly get impulsive, then there's really nothing I can do."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zj27 #24 本来觉得这种家务事没啥好劝的，但是看了这楼回复只能说：OP ，快逃……",
          "en": "@zj27 #24 I originally thought there was nothing to advise on this kind of family matter, but after reading the replies in this thread, I can only say: OP, run away..."
        }
      ],
      "type": "replies"
    }
  ]
}