{
  "id": 1017402,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "为什么国内职场有“嫡系”文化？",
          "en": "Why does the domestic workplace have a “lineage” culture?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "公司本身是一个快速解散重组的方式，因此才比其他的组织形式更有效率。\r\n\r\n> 中国一般的跨国公司平均寿命为 10-12 年，中国集团企业平均寿命也仅 7-8 年，中国民营企业的寿命只有 2.9 岁，中国的中小企业的平均寿命仅 2.5 年\r\n\r\n\r\n“嫡系”文化在这种朝生暮死的组织中有什么意义呢？真把公司当自己家了吗？",
          "en": "The company itself is a way of rapid dissolution and reorganization, so it is more efficient than other organizational forms.\r\n\r\n> The average lifespan of a general multinational company in China is 10-12 years, the average lifespan of a Chinese group enterprise is only 7-8 years, the lifespan of Chinese private enterprises is only 2.9 years, and the average lifespan of Chinese small and medium-sized enterprises is only 2.5 years.\r\n\r\n\r\nWhat is the meaning of “lineage” culture in this kind of organization that is born in the morning and dies in the evening? Do they really treat the company as their own home?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "看来 OP 没得到自己想要的答案，气急败坏了",
          "en": "It seems OP did not get the answer he wanted and is furious"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪儿都有，不仅是中国。",
          "en": "It's everywhere, not just China."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主是初入职场？ 还是没在外国公司工作过？",
          "en": "Is the poster new to the workplace? Or has he not worked in a foreign company?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本来想好好的谈话看你几乎每一条都喷人。我只能给比较知名的一个企业：Samsung ，更不要说日本了。",
          "en": "I wanted to have a good conversation, but I see you are criticizing people on almost every point. I can only give you a well-known company: Samsung, not to mention Japan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "为什么仅限于 国内？ 为什么仅限于 公司？ OP 一直在单机吗",
          "en": "Why is it limited to domestic? Why is it limited to the company? Is OP always playing a single game?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "带着立场问问题，结果还没得到自己想听的答案==",
          "en": "Asking questions with a bias, and the result is that he hasn't gotten the answer he wants to hear=="
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪国都有，嫡系也可以跨公司跟着走",
          "en": "It exists in every country, and the lineage can also follow across companies"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "打仗亲兄弟，上阵父子兵说到底，并肩合作，“信任关系”是基础",
          "en": "Fighting brothers, father and son soldiers in battle, in the final analysis, working side by side, “trust relationship” is the foundation"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪都有啊, 外企也一样, 我国内国外大厂都待了, 真一样的.一般谁招进来的人或者谁带起来的校招生, 就是自己人",
          "en": "It's everywhere, and the foreign companies are the same. I've been in big factories both domestically and abroad, it's really the same. Generally, the people who are recruited or the fresh graduates who are brought up are their own people"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@vcfghtyjc Cronyism is like nepotism, except the favor is not toward external friends and relatives. Instead, it’s the internal practice of offering favor, such as a position that one is unqualified for, in exchange for ongoing blind loyalty.https://www.forbes.com/sites/forbeshumanresourcescouncil/2018/06/04/cronyism-the-one-not-so-obvious-mistake-that-can-destroy-company-culture/",
          "en": "@vcfghtyjc Cronyism is like nepotism, except the favor is not toward external friends and relatives. Instead, it’s the internal practice of offering favor, such as a position that one is unqualified for, in exchange for ongoing blind loyalty.https://www.forbes.com/sites/forbeshumanresourcescouncil/2018/06/04/cronyism-the-one-not-so-obvious-mistake-that-can-destroy-company-culture/"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "西方一些国家以商业立国，看重契约精神。国人小聪明太多，表面一套背后一套，缺乏信任，需要有额外纽带捆绑在一起的亲信。纯个人看法",
          "en": "Some Western countries are founded on business and value the spirit of contracts. Chinese people are too clever, they are two-faced, lack trust, and need confidants to be bound together by extra ties. Purely personal opinion"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@vcfghtyjc 嫡系一般跟着大哥流动, 大哥升一级, 他自己也升一级. 我就这么过来的, 在鹅厂的时候接班大哥做主程,  大哥升总监, 再后来我带的毕业生接班主程. 但总体上大家还是一个体系下边的, 新项目还是这波人.跳槽也一样, 我离开腾讯之后现在的公司也有以前的同事过来的, 就还是熟悉信任度高, 这很正常. 当然大家还是讲能力的嘛, 嫡系没能力也不行, 又不是体制内, 嫡系也得有产出啊",
          "en": "@vcfghtyjc The lineage usually moves with the big brother. When the big brother gets promoted, he also gets promoted. I've been through this. When I was at Tencent, I took over my big brother's role as the main programmer. When the big brother was promoted to director, and later the graduates I brought took over as the main programmer. But overall, everyone is still under the same system, and the new projects are still this group of people. The same goes for job hopping. After I left Tencent, I have colleagues from before in my current company, and there is still high familiarity and trust, which is very normal. Of course, everyone still talks about ability, and people from the lineage are not good if they are not capable, it's not in the system, the lineage also needs to produce results"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有意义。有毛线的意义",
          "en": "Meaningful. What a meaning"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "越大公司，就有越多利益团队，但创业时期就有的团队，往往话事权利最大，掌控核心利益也正常。",
          "en": "The bigger the company, the more interest groups there are, but the teams that existed during the start-up period usually have the greatest power to speak and control the core interests. This is normal."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我在加拿大，加拿大的公司也有这个现象",
          "en": "I am in Canada, and Canadian companies also have this phenomenon"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要是人就逃不过彼此打标签和相互 judge ，亲疏远近也是一种标签。",
          "en": "As long as people are involved, they can't escape labeling each other and judging each other. The closeness and distance is also a kind of label."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Fish1024 “嫡系”的英文是什么？",
          "en": "@Fish1024 What is the English word for “lineage”?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@phrack 再聊五块钱的？",
          "en": "@phrack Want to chat again for five yuan?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SephirothD 这些厂里大家不跳槽，换组，裁员，reorg 吗？",
          "en": "@SephirothD Don't people in these factories change jobs, switch groups, lay off people, and reorganize?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "嫡系的意思，不是通常指 xx 领导的嫡系，跟公司没关系，效忠领导的，领导走哪带他到哪",
          "en": "The meaning of lineage, usually refers to the lineage of a certain leader, has nothing to do with the company, it's loyalty to the leader. Wherever the leader goes, they take him."
        }
      ],
      "type": "replies"
    }
  ]
}