{
  "id": 1017462,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "程序员喝什么茶",
          "en": "What tea do programmers drink"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "呜呜，V 友们，有什么绿茶推荐，最近眼睛疼又上火的，总是感觉喉咙涩涩的。寻一款适合的茶，价位 300/斤以内。\r\n最好附上链接啥的",
          "en": "Wuwu, V friends, any green tea recommendations? My eyes hurt and I'm feeling hot lately, and my throat always feels dry. Looking for a suitable tea, priced within 300 yuan/jin.\r\nIt's best to include links and stuff."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我艹这标题！喝个茶和职业有什么关系啊，就冲这标题，超市里袋装立顿就足够了，太好的茶叶会被糟蹋了。",
          "en": "Damn this title! What does drinking tea have to do with your profession? Just based on this title, a bag of Lipton from the supermarket is enough. Too good tea will be wasted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "公司免费提供什么茶就喝什么茶",
          "en": "Drink whatever tea the company provides for free"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "精酿白开水",
          "en": "Crafted pure water"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老板给帕鲁什么，帕鲁就喝什么。",
          "en": "Whatever the boss gives Pal, Pal drinks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喝派出所的茶",
          "en": "Drink tea from the police station"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "帕鲁喝凉白开.",
          "en": "Pal drinks cold boiled water."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我在帮外公炒茶呢，可不要小看我哦~你是我的哥哥麻，本来送你也没什么的不过你也知道，外公他一个人做茶是真的很不容易所以他说先让你尝尝然后他还说你是我朋友，当然要打折啦600 一两，1100 二两，2500 半斤，朋友价哦~你要多少呀？",
          "en": "I'm helping my grandpa make tea, don't underestimate me~ You are my brother, it's not a big deal to give it to you, but you also know that it's really not easy for my grandpa to make tea by himself, so he said let you try it first, and then he said you are my friend, of course there's a discount, 600 per liang, 1100 two liang, 2500 half a jin, friend's price oh~ How much do you want?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hh4646908 妹妹我要一吨，先 KKP （",
          "en": "@hh4646908 Sister, I want a ton, first KKP ("
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "程序员呼吸什么空气程序员吃什么饭程序员喝什么水程序员不是人？",
          "en": "What air do programmers breathe? What food do programmers eat? What water do programmers drink? Are programmers not human?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "眼睛疼就吃点缓解眼部疲劳的补充剂，推荐叶黄素或者花青素胶囊一篇相关研究：Effects of anthocyanin, astaxanthin, and lutein on eye functions: a randomized, double-blind, placebo-controlled study我们研究了含有花青素、虾青素和叶黄素的测试食品对操作视觉显示终端后出现眼疲劳的健康日本成年人眼功能的影响。 四十四名受试者被随机但均等地分配到活性组或安慰剂组。 每日服用一次，服用两粒活性胶囊或安慰剂胶囊，持续 6 周。 在 6 周干预前后评估调节功能、泪膜破裂时间、视力、Schirmer 试验值、黄斑色素光密度水平、肌肉硬度和问卷。 每组包括 20 名受试者进行功效分析。 与安慰剂组相比，治疗组在视觉显示终端手术前和术后 6 周时，双眼和主眼的平均瞳孔反应百分比显着改善。 此外，与安慰剂组相比，服用前和服用后，活性组在“眼睛聚焦困难的感觉”和“难以看清手中和附近的物体或细则”的分数上表现出显着改善。 因此，食用试验食品 6 周抑制了视觉显示终端操作引起的调节功能的下降",
          "en": "If your eyes hurt, take some supplements to relieve eye fatigue. I recommend lutein or anthocyanin capsules. A related study: Effects of anthocyanin, astaxanthin, and lutein on eye functions: a randomized, double-blind, placebo-controlled study.We investigated the effects of test foods containing anthocyanins, astaxanthin, and lutein on the eye functions of healthy Japanese adults who experienced eye fatigue after operating visual display terminals. Forty-four subjects were randomly and equally assigned to either an active group or a placebo group. They took two active or placebo capsules once daily for 6 weeks. Before and after the 6-week intervention, accommodation function, tear film breakup time, visual acuity, Schirmer test value, macular pigment optical density level, muscle stiffness, and questionnaire were evaluated. 20 subjects per group were included in the efficacy analysis. The treatment group showed a significant improvement in the average pupil response percentage of both eyes and the dominant eye at 6 weeks before and after the operation of the visual display terminal compared to the placebo group. In addition, the active group showed a significant improvement in the scores of \"feeling difficulty in focusing the eyes\" and \"difficulty in seeing objects or details in the hands or nearby\" before and after consumption compared with the placebo group. Therefore, eating test foods for 6 weeks inhibited the decline of accommodation function caused by the operation of visual display terminals."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吴裕泰的茉莉云尖",
          "en": "Wuyutai's Jasmine Yunjian"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我又来了。楼主有没有兴趣看看我家产的茶叶？引用一下自己之间的回复。自己家就是产茶的，大别山农村的。没有大片茶园，都是农民菜园地旁边的茶树，所以没有打农药的情况。因此量也不是很大，没有在网上销售，爸爸的老客户每年基本能维持销量了。也不是很贵，明前茶五六百一斤吧，也有三四百的。从几十块到一两百的也有。家里有个小冷库用来储存保鲜，所以现在也有一些存货，品质都有保障。有兴趣可以联系小而美: enJfY3NfMTIwOA==或者 telegram: QHBpcGl4aWFuZQ==已经有几位 V2 老哥在我这里买过了，效果应该还可以。可以这里看一下图片https://blog.tempsite.eu.org/文字记录/家里产的茶叶/",
          "en": "I'm back again. Is the poster interested in my family's tea? Quoting my previous reply. My family produces tea, in the rural areas of Dabie Mountain. There are no large tea gardens, only tea trees next to the farmers' vegetable gardens, so there is no pesticide use. Therefore, the quantity is not very large, and it is not sold online. My father's old customers can basically maintain the sales volume every year. It's not very expensive either, the tea before Qingming is five or six hundred a jin, and there are also three or four hundred. There are also from tens of yuan to one or two hundred. There is a small cold storage at home for storage and preservation, so there are some stocks now, and the quality is guaranteed. If you are interested, you can contact Xiao Er Mei: enJfY3NfMTIwOA== or telegram: QHBpcGl4aWFuZQ== Several V2 brothers have bought from me already, and the effect should be okay. You can take a look at the pictures here https://blog.tempsite.eu.org/文字记录/家里产的茶叶/"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "单枞、青普洱",
          "en": "Dancong oolong, raw Pu'er"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "枸杞+保温杯",
          "en": "Goji berries + thermos"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@daxin945 谢谢，马上购买了，买来试试先，还整了点枸杞菊花茶，嘿嘿",
          "en": "@daxin945 Thank you, I bought it right away, I'll try it first, and I also got some goji berry and chrysanthemum tea, hehe"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "炒茶谨慎买 加香精的一大堆推荐七块一大瓶的东方树叶",
          "en": "Be careful when buying tea. A lot of them are flavored. I recommend Dongfang Shuye, which is seven yuan a large bottle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "湖南莽山绿茶，好喝不贵。",
          "en": "Hunan Mangshan green tea, delicious and not expensive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "龙井。。。",
          "en": "Longjing... (Dragon Well Tea)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喝茶就喝茶，和程序员有什么关系",
          "en": "Drinking tea is just drinking tea, what does it have to do with programmers?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "程序员适合喝一些有助于提神、减压和改善注意力的茶。如绿茶（如龙井茶）、乌龙茶（如铁观音）、普洱茶等，据说对于提高注意力和减轻压力很有帮助。",
          "en": "Programmers are suitable for drinking some teas that help to refresh, relieve stress, and improve attention. Such as green tea (such as Longjing tea), oolong tea (such as Tieguanyin), Pu'er tea, etc., which are said to be very helpful for improving attention and reducing stress."
        }
      ],
      "type": "replies"
    }
  ]
}