{
  "id": 1015462,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "线下购买联想小新 16 被骗，该怎么维权？",
          "en": "I was scammed buying a Lenovo Xiaoxin 16 offline. How do I protect my rights?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "小县城，线下店，非专卖，购买的是联想小新 16 ，配置是 16+512 i5-13420 集成显卡。",
          "en": "Small town, offline store, not a specialty store. I bought a Lenovo Xiaoxin 16, with a configuration of 16+512 i5-13420 integrated graphics card."
        },
        {
          "zh": "为什么说被骗？",
          "en": "Why do I say I was scammed?"
        },
        {
          "zh": "1 电脑没有盒子，卖家说是刚拆出来不久，不需要盒子，也没开发票，而且电脑上还插着无线鼠标接收器，显然我自己是没有这个东西的",
          "en": "1. The computer didn't have a box. The seller said it had just been unboxed, didn't need a box, and didn't issue an invoice. Also, a wireless mouse receiver was plugged into the computer, which I obviously don't have."
        },
        {
          "zh": "2 价格是 4200 ，我在网上就没有找到这一款电脑，联想官网更是没有，更好配置的小新 16 3699 也就拿下了。另外，也没看到小新 16 有这个 cpu 型号，但是在京东一些第三方店有看到在卖",
          "en": "2. The price was 4200. I couldn't find this computer online, and it's not even on the Lenovo official website. A Xiaoxin 16 with a better configuration could be bought for 3699. In addition, I haven't seen the Xiaoxin 16 with this CPU model, but I have seen it being sold in some third-party stores on JD.com."
        },
        {
          "zh": "3 用联想管家看了下服务的激活时间，电脑是 1.31 购买，服务应该也是这个时间激活才对，但是服务的激活时间是 2023.10.12 ，显然不对",
          "en": "3. I checked the service activation time using Lenovo Manager. The computer was purchased on January 31st, and the service should have been activated at the same time, but the service activation time is October 12, 2023, which is clearly incorrect."
        },
        {
          "zh": "基于上述描述推测，该电脑应该是用于向用户展示用的，出厂时就激活摆在柜面上，我购买时重新帮忙装了操作系统，忘记拔掉接收器。",
          "en": "Based on the above description, it is speculated that the computer should have been used for demonstration to customers, activated at the factory and placed on the counter. When I bought it, they reinstalled the operating system for me and forgot to unplug the receiver."
        },
        {
          "zh": "当然文中的我不是作者本人，而是作者的侄女。",
          "en": "Of course, the “I” in this text is not the author, but the author's niece."
        },
        {
          "zh": "目前想到的维权方法有如下几点：",
          "en": "The following are the rights protection methods I have thought of:"
        },
        {
          "zh": "1 去到店里沟通，看看能否更换全新机器还是退款退货还是补差价",
          "en": "1. Go to the store to communicate and see if they can replace it with a brand new machine, refund, return, or make up the price difference."
        },
        {
          "zh": "2 如果对方态度强硬耍赖不认账，那就 12315 ，工商管理局，报警走一波",
          "en": "2. If the other party is uncooperative and refuses to acknowledge the problem, then go to 12315, the Administration for Market Regulation, and the police."
        },
        {
          "zh": "对了，卖家还是我侄女她妈妈的同学。",
          "en": "By the way, the seller is also a classmate of my niece's mother."
        },
        {
          "zh": "想问下大家有啥好的建议吗，待会就要线下对战去了。",
          "en": "I'd like to ask if anyone has any good suggestions. I am going to confront them offline shortly."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "熟人买电脑...生人坑一半，熟人大满贯",
          "en": "Friends buying computers... strangers get scammed half the time, friends get scammed the whole time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小县城你走各种 12315 、工商局处理慢还不一定处理的好，就去店里闹+报警可能比较快",
          "en": "In a small county town, using 12315 and the Administration for Market Regulation is slow and may not even be effective. Going to the store and causing a scene + calling the police might be faster."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "购买到今天，刚好 14 天。",
          "en": "It's been exactly 14 days since the purchase."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "沟通后 12315 吧，先查一下开票的公司名。都是被线下骗过才知道二手东的好哈哈",
          "en": "After communication, use 12315. First check the company name on the invoice. Everyone only knows how good JD.com is after being scammed offline haha."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "线下店坑人的套路深。找店铺退货或者 12315 走起，别超过 14 天。然后去京东买个新的吧。",
          "en": "Offline stores have deep scam schemes. Go to the store for a return or use 12315. Don't exceed 14 days. Then go to JD.com and buy a new one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "典型的小地方“杀熟”。唉，为了几千块钱，同学交情都 i 不要了。",
          "en": "A typical example of “killing acquaintances” in small places. Alas, for a few thousand yuan, you'd sacrifice the friendship of a classmate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "线下都是坑啊 能骗一个是一个但凡正规点 那些电脑城也不会成片倒闭了",
          "en": "Offline stores are all traps. They’ll scam anyone they can. If they were even somewhat legitimate, those computer markets wouldn't have closed down in droves."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去店里开发票，写好机型，配置，序列号，购买日期。然后 12315 直接投诉，买到了以前激活的机器，商家涉及虚假宣传，价格三倍赔偿，不足 5000 的赔偿 5000",
          "en": "Go to the store to get an invoice, write down the model, configuration, serial number, and purchase date. Then file a complaint with 12315 directly. You bought a machine that was previously activated. The merchant is involved in false advertising. You should get triple compensation, or 5000 if the triple compensation is less than 5000."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "错了，是 500",
          "en": "Wrong, it's 500"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生人坑一半，熟人大满贯",
          "en": "Strangers get scammed half the time, friends get scammed the whole time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gaobh 打算线下找店家沟通下，开个发票粗来。@joh 嗯，能退货去京东买最好。@superedlimited 说是同学，实际上连名字都记不清的隔壁班同届同学，何来交情？@HugeDicker 是这样的，当初被中关村坑也是历历在目。@Donahue 太形象了，这也是小地方或者大学附近电器城的套路。@PbCopy111 好的，按照你的描述先去找店家开个发票，然后沟通下看看情况。最后，感谢各位的建议，待会儿跟当事人说明情况，开个发票看看最后怎么处理。",
          "en": "@gaobh I plan to negotiate with the store offline and get an invoice. @joh Yes, it’s best to return it and buy from JD.com. @superedlimited They say it’s a classmate, but in reality, it's a classmate from the next class, and I can’t even remember their name, so what friendship is there? @HugeDicker That’s right, I still vividly remember being scammed in Zhongguancun. @Donahue That's a perfect description and a common scheme in small towns or electronic stores near universities. @PbCopy111 Okay, according to your description, I'll go to the store to get an invoice first, and then communicate to see what happens. Finally, thank you all for your suggestions. I'll explain the situation to the person involved later, get an invoice, and see how it's finally handled."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "谁介绍的熟人谁去解决呗",
          "en": "Whoever introduced the acquaintance should solve the problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gpt5 是的，已经告诉当事人基本情况了，让她们去沟通了。",
          "en": "@gpt5 Yes, I have already told the person involved the basic situation and let them communicate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很久以前线下电脑店，去仓库提货看到封条才给现金，给现金开封，原始简单粗暴，JD 在 3c 品类的统治力不是说的。",
          "en": "A long time ago, at an offline computer store, they would show you the sealed goods from the warehouse before you paid cash. Very primitive, simple, and crude. JD.com's dominance in the 3C category isn't just talk."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.线下店本来就是比网上贵的，几年前帮人买个游戏本，一个高配型号，京东大促时价格 7K ，有人实体店买了 1W 多，而且，重点，实体店是没有 7 天无奶油的。但偏偏许多人就意味实体店稳妥，我家里都有这样的人，说服不了他们。2.熟人都是拿来坑的。3.是不是小新看你单据怎么写和联想如何认定，这点估计你赢不了。4.激活时间这点你赢面应该很大，你敢起诉的话可以要求退一赔三。",
          "en": "1. Offline stores are originally more expensive than online ones. A few years ago, I helped someone buy a gaming laptop. A high-end model was 7K during JD.com's promotion. Someone bought it for more than 10K at a physical store. And, the key point is that physical stores don't have a 7-day no-reason return policy. But many people believe that physical stores are reliable, and I have these people in my family, and I can't convince them. 2. Acquaintances are always taken advantage of. 3. Whether it's Xiaoxin depends on how your receipt is written and how Lenovo identifies it. You probably won't win on this point. 4. You should have a high chance of winning based on the activation time. If you dare to sue, you can demand a refund and triple compensation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有些型号确实是线下特有的，坑多少得看具体硬件型号，光看配置看不出来，但是一般来说都是“生人坑一半，熟人大满贯”，按楼主的描述确实是展台机，但是这玩意说不清的，对方也说了“刚拆出来不久”，你们也同意了，小县城商业执法不一定咋样。要求补发票可以，但是对方即使补给你也有的赚，补完之后哑巴亏也就吃定了。我的建议是如果家里人多，就去一堆人去说说理，啥也别说就要求退货，有多大理出多大声，但是千万别动手，虽然你说没感情的，但是一定要强调对方坑熟人（这样别的商家可能不会帮对方），然后如果你们人多，机器也就退了，如果你们人少，可能赔 200 块钱也就退了。",
          "en": "Some models are indeed unique to offline channels. How much you get scammed depends on the specific hardware model. You can't tell just by looking at the configuration, but generally, it's “strangers get scammed half the time, acquaintances get scammed the whole time.” According to the author's description, it is indeed a display machine, but this is hard to determine, and the other party also said that it had “just been unboxed”, and you agreed. Commercial law enforcement in a small county town is not necessarily good. You can ask for a supplementary invoice, but even if the other party provides it, they can still make a profit, and after it is supplemented, you will have to suffer a loss. My suggestion is that if you have a lot of family members, go with a group of people to reason with them. Don't say anything, just ask for a return. Be as loud as you can, but do not physically assault them. Although you say there is no relationship, you must emphasize that the other party scammed an acquaintance (this will prevent other merchants from helping the other party). Then, if you have a lot of people, the machine will be returned. If you are few, they may return it for 200 yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "维权成本太高，建议协商，协商不成认栽，付出的成本高于维权收回来的",
          "en": "The cost of protecting rights is too high, so I suggest you negotiate. If the negotiation fails, just accept your losses. The cost you pay is higher than what you can recover."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是侄女妈妈同学了，还烦啥。",
          "en": "They are all classmates of your niece's mother, so what's there to be annoyed about."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "难维权，你就当长长记性了吧，下回你就知道了。不要去线下店铺买电脑，不要去线下店铺买电脑，不要去线下店铺买电脑，不知道有没有人告诫过你,我是逢人买电脑都要提醒一下。",
          "en": "It's difficult to protect your rights, so just learn a lesson. Next time you'll know. Don't buy computers from offline stores, don't buy computers from offline stores, don't buy computers from offline stores. I don't know if anyone has warned you, but I remind everyone who buys a computer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "狗东，拼夕夕你运气不好最多买到摸摸机，网上退货换货售后都很方便，线下坑你没商量，偷换配件，低配高卖都是常规操作，电脑店的名声早就臭了，不坑人他就赚不到钱。",
          "en": "If you buy from JD.com or Pinduoduo and have bad luck, you may get a demo unit at most. Online returns, exchanges, and after-sales service are very convenient. Offline stores will scam you without hesitation. Substituting components and selling low-spec machines at high prices are all common practices. The reputation of computer stores has long been ruined. If they don't scam people, they can't make money."
        }
      ],
      "type": "replies"
    }
  ]
}