{
  "id": 1015160,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "回到农村老家 有时候在想 这辈子为啥要那么卷呢 躺平不好吗 现在农村生活比城市舒服多了",
          "en": "Going back to my old home in the countryside， sometimes I wonder why I have to work so hard in this life. Isn't it good to just lie down? Rural life is much more comfortable than city life now."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "不一定，比如徐州丰县的农村也比城市舒服吗？",
          "en": "Not necessarily, for example, is the countryside in Feng County, Xuzhou more comfortable than the city?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你在农村躺平了，你就是全村人的笑料。娶不到媳妇赚不到钱，父母也嫌弃你不给家里长脸明白了吗？你要能无视这些，你就是明白人，做不到，就远离村里是非吧",
          "en": "If you lie down in the countryside, you'll be the laughingstock of the whole village. You can't get a wife or make money, and your parents will also dislike you for not bringing honor to the family, do you understand? If you can ignore these things, you are a sensible person. If you can't, then stay away from the village's troubles."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "地区差异巨大，农村和农村可不一样。",
          "en": "There are huge regional differences; one rural area is not the same as another."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我就在农村躺着 最难的还是找到个伴 很少有女生愿意待农村",
          "en": "I'm lying down in the countryside. The hardest part is finding a partner. Very few girls are willing to stay in the countryside."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "城市最大的好处就是包容。",
          "en": "The biggest advantage of a city is its inclusiveness."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先在村里找份能养活自己的工作再说",
          "en": "First, find a job in the village that can support yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你觉得舒服，大概率是你在城市里赚到了钱，带着钱回农村当然舒服，你要是一直在农村，还能舒服得起来吗？看看现在农村还有几个年轻人，大家都默默用脚投票了，反正我打死不会回去，谁爱回谁回",
          "en": "You feel comfortable, most likely because you made money in the city. Of course, it's comfortable to go back to the countryside with money. If you've always been in the countryside, can you still feel comfortable? Look at how many young people are left in the countryside now. Everyone has voted with their feet. Anyway, I'll never go back, whoever wants to go back can go."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@echo1937 我们这边是沿海 空气环境都不输一线 这些年确实整洁了很多",
          "en": "@echo1937 Our place is coastal, the air and environment are not inferior to first-tier cities. It has indeed become much cleaner in recent years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@amon 把铁链八孩受害者跟东京女优放一起举例子 太逆天了。",
          "en": "@amon Putting the chained eight-child victim and Tokyo AV actresses together as an example is outrageous."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "村里要活着容易，但是被村霸、村干部刁难你就知道多麻烦了。当然你自己有靠山或者本身就是村霸，那也无所谓。",
          "en": "It's easy to live in the village, but you'll know how troublesome it is to be harassed by village bullies or village officials. Of course, if you have a backer or are a village bully yourself, it doesn't matter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那就回去呗",
          "en": "Then go back."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们这边住的质量真的比城市强太多 每家的房子几乎跟别墅差不多",
          "en": "The quality of housing here is really much better than in the city. Each house is almost like a villa."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "医疗 教育 基础设施 工作机会 啥的还是差很多的-。-孤家寡人、无病无忧、没有经济上的问题，自然农村地广人稀很舒服",
          "en": "Medical care, education, infrastructure, job opportunities, and so on are still far behind -. - If you're alone, without illness or worry, and without economic problems, then the countryside, with its vast land and sparse population, is naturally very comfortable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "生活不是只考虑住啊，当然有条件的为什么在卷，生活得开心快乐就好",
          "en": "Life is not just about housing. Of course, if you have the conditions, why work so hard? It is good to live happily and joyfully."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "教育资源，医疗资源，娱乐，商超，差太多了，如果这些你都不需要，那倒还可以",
          "en": "Education resources, medical resources, entertainment, shopping malls are too poor. If you don't need these, then it's okay."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yangpeco 教育医疗确实不如一线 其他还好",
          "en": "@yangpeco Education and medical care are indeed not as good as first-tier cities, but the others are fine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是啊，所以谁去城市里打工谁是傻逼",
          "en": "Yeah, so whoever goes to the city to work is an idiot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我老家搞流域治理，疏浚了河道，种了很多花木，风景比很多城市的河边公园大很多，漂亮很多，但是这也是仅限于度假啊，要有事情做啊，正是因为一群人集中起来做事，才有城市的雏形啊",
          "en": "My hometown is doing watershed management, dredging river channels, and planting many flowers and trees. The scenery is much bigger and more beautiful than many city riverside parks, but this is only for vacation. You need something to do. It is because a group of people work together that cities have a prototype."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我在上海躺平着。别让我去农村。",
          "en": "I'm lying flat in Shanghai. Don't let me go to the countryside."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@silentsky 上图看看",
          "en": "@silentsky Show pictures."
        }
      ],
      "type": "replies"
    }
  ]
}