{
  "id": 1016722,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "2024 年 目前把钱存哪里收益高点。",
          "en": "Where is it profitable to deposit money in 2024?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "目前知道的有微信理财通、支付宝的余额宝、余利宝、招商银行的朝朝盈还是朝朝宝。  上面那几个好像只有招商的 7 日年华高点，想问问 v 友还有什么值得推荐的不。  \r\n\r\n相对找一个稳健点收益的就行，每天不亏钱就行。",
          "en": "Currently, I know about WeChat Financial Management, Alipay's Yu'ebao, Yulibao, and China Merchants Bank's Zhaozhaoying or Zhaozhaobao. It seems that only China Merchants' 7-day annualized yield is higher among the above, and I want to ask V friends if there is anything worth recommending.\r\n\r\nI just want to find a stable return, and I don't want to lose money every day."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "网吧 直接 double",
          "en": "Internet cafe, just double it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "肯定是我大 A 啊。",
          "en": "Definitely my A-shares."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很巧，我年前对比了一波货币基金，就是你说的这些，七日年化都是 1.9%-2.2% 之间，差距不明显。如果你是去年年初问的，事后诸葛亮的角度来看：1 ）买债券，毕竟债券过去一年是牛市，普遍有 5%，但是债券要是跌起来可就离谱了，很难说 24 年会如何；2 ）买长江电力、四大银行、神华煤炭，每年 6 月底分红，股息率大概是 6%，稳吃；但最近三个月这些股息股全部进入历史高位区间（比如长江电力历史新高），我已经卖了，不敢拿了。3 ）如果你这些钱可以准备十年不用，留着养老，可以买一些分红保险，能保证年化 3% 以上，但是从去年底开始也逐渐没有了。所以你的这个问题问的太晚了，本来的这些选择，在 2024 年都变成了不太明智，或者说错失上车机会了。如果非要选，我建议你考虑股息股，哪怕再跌，也能保证每年回 6%，五年以上一定能回本且赚钱。",
          "en": "It's a coincidence, I compared a bunch of money market funds before the Spring Festival, which are the ones you mentioned. The 7-day annualized yield is between 1.9%-2.2%, and the difference is not obvious. If you asked this at the beginning of last year, from the perspective of hindsight: 1) Buy bonds, after all, bonds have been in a bull market in the past year, generally with 5%, but if bonds fall, it will be outrageous, and it is hard to say what will happen in 24; 2) Buy Yangtze Power, the four major banks, and Shenhua Coal, with dividends at the end of June every year, the dividend yield is about 6%, a stable income; but in the past three months, these dividend stocks have all entered the historical high range (such as Yangtze Power hitting a new historical high), I have sold them and dare not hold them. 3) If you can prepare these money for ten years without using them, and save them for retirement, you can buy some dividend insurance, which can guarantee an annualized return of over 3%, but it has gradually disappeared since the end of last year. So your question is asked too late. These original choices have become unwise, or missed the opportunity to get on board, in 2024. If you have to choose, I suggest you consider dividend stocks, even if they fall again, they can still guarantee a 6% return every year, and you will definitely be able to recover your principal and make money in more than five years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "放我兜里",
          "en": "Put it in my pocket"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是微众银行的活期+plus ，类似于余利宝",
          "en": "I am WeBank's current account + plus, similar to Yulibao"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zhangolve 人家万一是美国人呢",
          "en": "@zhangolve What if they're American?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是分了两笔，一部分债基，一分定投纳指 ETF",
          "en": "I split it into two parts, one part of bond funds, and one part of a fixed investment in Nasdaq ETF"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "三倍做空中国的基金",
          "en": "Triple short China fund"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在存银行还不如每几天饿一顿饭的收益来的高",
          "en": "Saving money in the bank now is not as profitable as skipping a meal every few days"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买蝴蝶刀 全花了然后挂平台上租",
          "en": "Buy a Butterfly Knife, spend all the money, then list it on a platform for rent"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "招商招祥纯债 - 不构成投资建议",
          "en": "China Merchants Zhaoxiang Pure Bond - not investment advice"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SharkShen 6",
          "en": "@SharkShen 6"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "纯债基金，买之前一定要看基金持仓",
          "en": "Pure bond funds, be sure to check the fund holdings before buying"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "几天之后，跌回年前低点的沪深 300",
          "en": "The Shanghai Shenzhen 300 index will fall back to its pre-Spring Festival low in a few days"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "目前开的新加坡盈立，投了点纳指 100ETF+恒指熊证。半夜偶尔闲着没事拿点钱做超短线的 CFD 赚个饮料钱。不求每天不亏钱，赌国运就完事儿了",
          "en": "Currently, I have opened an account with Singapore's Yingli, and invested in some Nasdaq 100ETF + Hang Seng Index bear warrants. Occasionally, when I am free at midnight, I take some money to do short-term CFD to earn some money for drinks. I don't want to lose money every day, just bet on the country's fortune"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "缅 A 抄底了",
          "en": "Bottom fishing in Myanmar A-shares"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实还可以找很多货币基金，都能做到 T+1 吧。",
          "en": "Actually, you can still find many money market funds that can do T+1."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "转移到境外",
          "en": "Transfer it offshore"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@thfurior #4 我买了纯债基金，请问看持仓要看哪些呢？",
          "en": "@thfurior #4 I bought a pure bond fund, what should I look at in the holdings?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "存美国",
          "en": "Save in America"
        }
      ],
      "type": "replies"
    }
  ]
}