{
  "id": 1014884,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "如果你有足够的时间和金钱，你会打算做什么？",
          "en": "If you had enough time and money, what would you plan to do?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "人生苦短，全在打工，很不幸这是大多数程序员的写照。但临近春节，让我们假设一下，有一天你终于财富自由了，有无数的时间和金钱，你会打算做什么呢？",
          "en": "Life is short, and most programmers spend it working. Unfortunately, this is the reality for most programmers. But with the Spring Festival approaching, let's imagine that one day you finally achieve financial freedom and have countless time and money. What would you plan to do?"
        },
        {
          "zh": "我个人而言，我会去学习音乐，把植物大战僵尸的 bgm 全部都尝试用钢琴演奏一遍！当然，还有写的开源项目，我也要完全一天 8 小时投入进去，让我的工具箱能有千万人去使用。",
          "en": "Personally, I would learn music and try to play all the BGM from Plants vs. Zombies on the piano! Of course, I would also dedicate 8 hours a day to the open-source projects I write, so that millions of people can use my toolkit."
        },
        {
          "zh": "不知道各位又会计划做些什么呢？不妨分享分享",
          "en": "I wonder what everyone else plans to do? Feel free to share."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "第一反应可能比较低俗，具体不说了，懂的都懂然后又感叹，如果没有健康的身体，无数的时间与金钱反而是枷锁与刑具只是忽然感叹一下，不是抬杠",
          "en": "The first reaction might be a bit vulgar, I won't elaborate. You know, you know. Then I sigh; without a healthy body, countless time and money become shackles and instruments of torture. Just a sudden sigh, not arguing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看到又是共产又是镰刀的，又是建党伟业的，乌托邦的还不少呢哈哈哎看看历史上这些要让世界变成所谓乌托邦的人，给人类带来了多少灾难有几本反乌托邦小说还挺值得看的，比如《一九八四》《美丽新世界》《动物庄园》等等",
          "en": "Seeing talk of communism and the sickle, and the great accomplishments of the party, there are quite a few utopians, haha. Let's look at the history of those who wanted to turn the world into a so-called utopia and see how much disaster they brought to humanity. There are a few dystopian novels that are worth reading, such as \"1984\", \"Brave New World\", \"Animal Farm\", etc."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开公司，让大家都有班上",
          "en": "Start a company and give everyone a job."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "捐款，给有慢性病的老人一些医疗费用补助",
          "en": "Donate money, give some medical subsidies to elderly people with chronic diseases."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我想读生物学+计算机学双博士，然后研究永生技术",
          "en": "I want to pursue double PhDs in biology and computer science, and then research immortality technology."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "豪华路段，租一层宽敞明亮的写字楼，招聘 100 个程序员，我想写什么代码，就让他们写什么。",
          "en": "Rent a spacious and bright office building on a prime location, recruit 100 programmers, and let them write whatever code I want."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "踏实的当个废物",
          "en": "Be a solid waste of space financially."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "实现共产主义（",
          "en": "Achieve communism ("
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当科学家呗，亨利·卡文迪许（ 1731-1810 ）就是个例子了，财富自由了，专心搞科研。",
          "en": "Be a scientist. Henry Cavendish (1731-1810) is an example. With financial freedom, focus on scientific research."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "得不到痛苦，得到了空虚，叔本华说的。",
          "en": "Not getting it brings pain, getting it brings emptiness, as Schopenhauer said."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在职场被压抑久了，和不上班后的疯狂报复，都是两个极端靠自己实现财务自由的，大概率精神也会自由，会过取悦自己的生活。",
          "en": "Suppressed in the workplace for a long time, and the crazy revenge after not going to work, are two extremes. Achieving financial freedom by oneself will likely also lead to spiritual freedom, and a life of self-pleasure will also be lived."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给所有喜欢的科研项目捐钱",
          "en": "Donate money to all the scientific research projects I like."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去泰國租個媳婦曬太陽～",
          "en": "Go to Thailand and rent a wife to sunbathe~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我以前也想过学乐器，但尝试过几次，发现自己在节奏和音高听力方面实在没有天赋，属于先天不足，而且学乐器需要花非常大量的时间学同一个曲子，随着重复次数的增加，这个曲子的魅力也会下降。",
          "en": "I used to want to learn a musical instrument, but after trying a few times, I found that I really had no talent in rhythm and pitch hearing, which is an innate deficiency. Also, learning a musical instrument requires a very large amount of time to learn the same piece of music, and as the number of repetitions increases, the charm of the music will also decrease."
        },
        {
          "zh": "有点像魔术，看魔术很开心，但魔术师作为知道了魔术秘密的人，其乐趣大多要转移到表演，看观众反应。",
          "en": "It's a bit like magic; it's fun to watch magic, but for a magician who knows the secrets of the magic, the fun mostly shifts to performing and seeing the audience's reaction."
        },
        {
          "zh": "弹奏乐器也一样，结果会变成听曲子的乐趣下降，需要表演，需要找到观众才能体会快乐。",
          "en": "Playing a musical instrument is the same; the result will be that the pleasure of listening to the music decreases, and one needs to perform and find an audience to experience happiness."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 放松下来看看书，去旅旅行更好的理解这个世界。2. 写点自己想写的产品，不再那么具有功利心。3. 终于可以抛开生存压力去发展自己的爱好，把它当作自己可以持续做下去的事情。",
          "en": "1. Relax, read books, and travel to better understand the world. 2. Write some products you want to write, without being so utilitarian. 3. Finally, you can put aside the pressure of survival and develop your hobbies, taking them as things you can keep doing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "写程序，不用赚钱的那种，像 Linux 那样",
          "en": "Write programs, the kind that don't make money, like Linux."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当然是去做慈善事业了。让世界变得稍微好一点。",
          "en": "Of course, I would do charitable work. Make the world a little better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "财富极大自由了的话，就到处走一走看一看。转够了就找个小众的领域，一点点磨，或许十年二十年后能成大器。",
          "en": "If I had great financial freedom, I would travel around and see the world. When I'm done traveling, I'll find a niche field and slowly work on it, maybe I'll become a great success in ten or twenty years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "考研回到学校那种无忧无虑的环境，想做操作系统方向。反正有钱不怕延毕，可以说没什么压力了。",
          "en": "Take the postgraduate entrance exam and go back to the worry-free environment of school, and want to study the direction of operating systems. Anyway, I have money and am not afraid of delayed graduation, so I have no pressure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去码头搞点薯条",
          "en": "Go to the docks and get some French fries"
        }
      ],
      "type": "replies"
    }
  ]
}