{
  "id": 1017478,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "下班后，好像最想做的就是打 lol，其他事情也想做，但是一打游戏就停不下来，应该如何改变？",
          "en": "After work, it seems like the first thing I want to do is play LOL. I also want to do other things, but I can't stop once I start playing games. How should I change?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "看起来你已经养成了某种习惯。",
          "en": "It seems you’ve developed a certain habit."
        },
        {
          "zh": "要打破你不希望保留的习惯，可以尝试改变你的环境。",
          "en": "To break habits you don't want to keep, you can try changing your environment."
        },
        {
          "zh": "今天下班时，请留意一下自己那些所谓的“半自动行为”，即日常生活中的习惯性动作。",
          "en": "When you get off work today, pay attention to those so-called \"semi-automatic behaviors\", that is, habitual actions in daily life."
        },
        {
          "zh": "例如，你可能习惯于下班后直接回家、点外卖、给手机充电、打开电脑，然后机械地浏览某个固定网站，最后开启 LOL 游戏。",
          "en": "For example, you might be used to going straight home after work, ordering takeout, charging your phone, turning on your computer, and then mechanically browsing a certain website, and finally starting the LOL game."
        },
        {
          "zh": "要知道，如果中断了这个流程中的任何一个环节，都有可能延缓甚至阻止你启动 LOL 游戏。",
          "en": "You should know that if you interrupt any part of this process, it may delay or even prevent you from starting the LOL game."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@junkk 我现在改成输一把就睡觉，发现 15 分钟就能睡了",
          "en": "@junkk I've changed to sleeping after losing one game, and found I can fall asleep within 15 minutes"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议珍惜自己打游戏还有热情的时间",
          "en": "It is recommended to cherish the time when you are still passionate about playing the game"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先来两发",
          "en": "Just two rounds first"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "羡慕可以一直撸啊撸的, 我撸一发之后都觉得累",
          "en": "I envy those who can keep playing, I feel tired after a single game"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "强迫自己消费一些高质量的内容，以此来冲击一直以来玩 LOL 的习惯。",
          "en": "Force yourself to consume some high-quality content to counteract the habit of playing LOL."
        },
        {
          "zh": "比如，看一些名著，最好是思考深度比较强 的那种，看一些好电影，能让你安静下来的，比如《步履不停》。",
          "en": "For example, read some classic books, preferably those with deep philosophical thought, and watch some good movies that can calm you down, such as \"Still Walking\"."
        },
        {
          "zh": "一开始可能难以投入，但是需要强迫自己坚持，如果能发现这些内容与 LOL 之间的强烈对比，你就会逐渐发现 LOL 是真的没意思。",
          "en": "It may be difficult to get into it at first, but you need to force yourself to persevere. If you can find a strong contrast between these contents and LOL, you will gradually find that LOL is really boring."
        },
        {
          "zh": "玩什么 LOL ，玩点单机不好么 ，通关就结束，质量也可以自己挑选。",
          "en": "Why play LOL? Isn't it better to play some single-player games, which end when you complete the game, and you can also choose the quality yourself?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Dota2!",
          "en": "Dota2!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@shyling #7  最后赢一把就睡觉，然后连跪 8 把 /doge",
          "en": "@shyling #7 Sleep after winning the last game, then lose 8 in a row /doge"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "珍惜还能打游戏的时间",
          "en": "Cherish the time you can still play games"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首先，每个人都会有自己的嗜好，这很正常，你要明确你改变它的目的是什么？",
          "en": "First of all, everyone has their own hobbies, which is normal. You need to clarify your purpose for changing it?"
        },
        {
          "zh": "你要只是觉得这样的习惯不好，那其实你改掉这个习惯后也是一样迷茫的状态，并没有什么意义。",
          "en": "If you just think this habit is not good, then you will still be in a confused state after changing this habit, and it is meaningless."
        },
        {
          "zh": "如果你有明确目的性的话，改这种习惯其实真不算什么难事。",
          "en": "If you have a clear purpose, it's not really difficult to change this kind of habit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Aoonthetop 我的解决方式是直接把 Lol 卸载了",
          "en": "@Aoonthetop My solution is to uninstall Lol directly"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@poorAshenOne 最后亿把，赢了就睡觉！",
          "en": "@poorAshenOne The very last one, sleep after winning!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "玩一玩愉悦一下挺好的，lol 也就半小时到一小时一局。",
          "en": "It's great to play for fun, one game of lol takes only half an hour to an hour."
        },
        {
          "zh": "我刚工作的时候下班就开始打 wow 一直到凌晨，下个副本怎么也得 3 ，4 小时起。",
          "en": "When I just started working, I would play wow after work until the early morning, and it would take at least 3 to 4 hours to beat a dungeon."
        },
        {
          "zh": "lol 又不用花钱，多好。",
          "en": "LOL doesn't cost any money, how great."
        },
        {
          "zh": "等有小孩了自然就改了，没啥一起玩的朋友，也没时间了。",
          "en": "You'll naturally change when you have kids. You won't have any friends to play with, and you won't have time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那就先做其他事，最后再开一把",
          "en": "Then do other things first, and finally play one more game"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是说 Follow your heart 嘛想干嘛就干嘛呗",
          "en": "Isn't it said Follow your heart, do whatever you want"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "曾经打 lol 经常超时(大乱斗上瘾单机玩家，超过 12 点), 后来都玩 switch(塞尔达，马利奥系列), 解决娱乐需求(不再想打 lol)的同时玩游戏时长压缩到日均 1 到 2 小时左右, 多出来的时间陪陪家人以及看看书, 目前状态良好。",
          "en": "I used to play LOL and often stayed up too late (addicted to the URF mode and a single-player gamer, past 12 o'clock). Later, I played Switch (Zelda, Mario series), which solved the entertainment needs (no longer wanting to play LOL) and reduced the game time to about 1 to 2 hours per day. I spent the extra time with my family and read books, and my current state is good."
        },
        {
          "zh": "总结就是换一些不容易上瘾的游戏（以及现在年龄大了）。",
          "en": "The summary is to switch to some games that are not easily addictive (and because I am older now)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "LOL 不开黑我碰都不想碰，我不打游戏 但还是什么事情都不想干",
          "en": "I don't want to touch LOL unless I'm playing with friends. I don't play games, but I still don't want to do anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一群人撸的话，建议降低频率",
          "en": "If you are playing with a group of people, it is recommended to reduce the frequency"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能玩的下去就可以了。",
          "en": "It's fine as long as you can play."
        },
        {
          "zh": "像我这 回家都懒得开电脑",
          "en": "Like me, I'm too lazy to turn on the computer when I get home"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "出去面试，增加焦虑感就不想玩了",
          "en": "Go out for an interview, and the increased anxiety makes me not want to play"
        }
      ],
      "type": "replies"
    }
  ]
}