{
  "id": 1013270,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "把生姜打成汁，洗澡的时候倒在头上，洗完澡清洗掉，能不能治疗秃顶？",
          "en": "Can ginger juice be used to treat baldness if it is applied to the head while showering and then rinsed off?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": ""
        },
        {
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "不能，但是可以去腥",
          "en": "No, but it can remove odors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "浇给？",
          "en": "Water it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以，你腌吧",
          "en": "Yes, you can pickle it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "然后毛囊过敏了（或者其他新问题）导致大面积掉发，崩溃，然后辞职，居家哭泣，又来 V2 问：我该咋办。我以前在 V2 看过一句话，只是闲聊，分享给你： 难道英国查理王子是没有人给他提脱发的方案吗？",
          "en": "Then the hair follicles become allergic (or other new problems) leading to large areas of hair loss, breakdown, then resignation, crying at home, and then coming to V2 and asking: What should I do. I once saw a sentence on V2, just chatting, sharing it with you: Doesn't Prince Charles of England have anyone to suggest hair loss solutions to him?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "屋里有鬼，你买个符贴上就不怕了。鬼什么样子？大概黑乎乎的。能抓个来看看吗？鬼看不见，抓不到。能拍个鬼的照片吗？鬼是拍不出的，也没办法探测到的。那就没有鬼了。怎么能说没有鬼呢？看不见不等于鬼不存在！世界上可能有鬼也可能没有鬼，我提醒大家要保持敬畏！鬼流传了那么多年，不是你想否定就能否定的！你说没有鬼，那我晚上看到黑乎乎的东西是什么？存在即合理，要是没有鬼，为什么那么多人谈论它？我相信有鬼，周围的朋友也相信有鬼，你居然说没有鬼，太哗众取宠了！你说没有鬼，那你拿出证据来啊！即便你现在没碰到鬼，万一哪天真的遇见鬼呢？我七姑就是遇到鬼然后疯了！信鬼和不信鬼各有好处！世上没有鬼，怎么会有卖符的？我国画符技术博大精深，岂容你否认？你听说过现在很多洋人也来买符吗？卖符的卖了几千年，不要一杆子打死！你说世上没有鬼，难道我们这么多人贴符都是傻子吗？我虽然不太相信有鬼，但卖符的也不是一无是处。要是没有卖符的，你的祖先早就被鬼吃掉了!就算你不相信鬼，干嘛要妨碍别人卖符呢？尽讲些没用的，能不能说点干货：遇见鬼怎么办？管它有鬼没鬼，贴上符我就安心了！我本来也不相信有鬼，可上次在脑门上贴了个符，晚上睡觉好多了，我也就相信有鬼了。贴了符也没睡好？那是你买的符不正宗。现在卖假符的太多了，卖真符的太难找了。活见鬼。",
          "en": "There are ghosts in the house, buy a talisman and stick it on and you won't be afraid. What does a ghost look like? Probably dark and blurry. Can we catch one to take a look? Ghosts can't be seen or caught. Can you take a photo of a ghost? Ghosts can't be photographed, nor can they be detected. Then there are no ghosts. How can you say there are no ghosts? Invisible doesn't mean ghosts don't exist! There may or may not be ghosts in the world, I remind everyone to be in awe! Ghosts have been around for so many years, it's not something you can deny. You say there are no ghosts, then what is that dark and blurry thing I see at night? Existence is reasonable, if there are no ghosts, why do so many people talk about it? I believe in ghosts, my friends around me also believe in ghosts, and you actually say there are no ghosts, it's too sensational! You say there are no ghosts, then give me some evidence! Even if you haven't encountered a ghost now, what if you really meet one someday? My seventh aunt met a ghost and then went crazy! Believing in ghosts and not believing in ghosts each have their benefits! If there are no ghosts in the world, how can there be people selling talismans? Our country's talisman painting technology is profound and extensive, how can you deny it? Have you heard that many foreigners are now buying talismans? Those selling talismans have been selling them for thousands of years, don't dismiss them completely! You say there are no ghosts in the world, are we so many people sticking talismans all fools? Although I don't really believe in ghosts, those who sell talismans are not completely useless. If there were no people selling talismans, your ancestors would have been eaten by ghosts long ago! Even if you don't believe in ghosts, why should you hinder others from selling talismans? You are just talking about useless things, can you say something practical: What to do if you encounter a ghost? No matter if there are ghosts or not, I feel at ease after sticking a talisman! I didn't believe in ghosts either, but the last time I stuck a talisman on my forehead, I slept much better at night, and then I believed in ghosts. Didn't sleep well even after sticking the talisman? That means the talisman you bought is not authentic. There are too many fake talismans on the market now, it's too hard to find genuine ones. Seeing is believing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼上这么多人说这么多话，都没有详细解释秃头的机制和主要治疗方案。以下是常见论文中描述的雄秃致病机制“AGA 的病因是多因素和多基因的。头皮毛囊是雄激素的靶器官之一，全身和局部雄激素代谢异常是 AGA 发病过程中的重要环节。睾酮和雄烯二酮被 5α-还原酶催化转化为二氢睾酮（ Dihydrotes⁃ tosterone ，DHT ），DHT 与毛囊细胞上的雄激素受体结合后可使毛囊微小化。男性 AGA （ Male Androge⁃ netic Alopecia ，MAGA ） 是雄激素依赖性疾病，虽然遗传方式尚不确定，但观察到明显的遗传易感性，Tosti 等人观察了 20 名青春期前发病的 AGA 患者，发现他们均具有明显的 AGA 家族史，而在女性 AGA （ Female Androgenetic Alopecia ，FAGA ） 中，雄激素的作用尚不确定，只有 1/3 的 FAGA 妇女表现出异常的雄激素水平，在女性秃发患者的一级亲属中发现男性秃发的概率高于对照人群，表明 AGA 有共同的遗传倾向。此外，头皮慢性炎症、氧化应激、Wnt 信号通路的抑制也都参与 AGA 的发病。”我也关注过这方面问题，大部分学者给出的结论是促进血液循环的方法都有用。所以：1 、 梳头、按摩头部皮肤有用，但是要考虑力度和方法，防止过程中损伤毛囊。2 、 生姜等刺激皮肤达到毛细血管扩张活跃的方法有用，但是要防止头部皮肤敏感过敏。3 、 米诺地尔有用，但因为多为酒精溶剂，易致敏。4 、 非那雄胺和度他雄胺可以抑制 5α 还原酶从而使 DHT 血清水平降低、抑制毛囊微型化。但是要自己评估用药后副作用是否影响生活。不论你想怎么治疗，我都推荐你去三甲医院，找医生诊断后配合医生的治疗方案治疗，不要盲目找各种偏方谢谢。",
          "en": "So many people upstairs have said so much, and none have explained in detail the mechanism of baldness and the main treatment options. The following is the pathogenic mechanism of androgenic alopecia (AGA) described in common papers: \"The etiology of AGA is multifactorial and multigenic. Scalp hair follicles are one of the target organs of androgens, and abnormal systemic and local androgen metabolism is an important link in the pathogenesis of AGA. Testosterone and androstenedione are catalyzed by 5α-reductase into dihydrotestosterone (DHT), which, after binding to the androgen receptor on hair follicle cells, can miniaturize hair follicles. Male AGA (Male Androgenetic Alopecia, MAGA) is an androgen-dependent disease. Although the mode of inheritance is uncertain, obvious genetic susceptibility has been observed. Tosti et al. observed 20 patients with pre-pubertal AGA, and found that they all had a significant family history of AGA, while in female AGA (Female Androgenetic Alopecia, FAGA), the role of androgens is uncertain, with only 1/3 of FAGA women showing abnormal androgen levels. The probability of male hair loss is higher than that of the control group in the first-degree relatives of female hair loss patients, indicating that AGA has a common genetic tendency. Additionally, chronic scalp inflammation, oxidative stress, and inhibition of the Wnt signaling pathway are also involved in the pathogenesis of AGA.\" I have also followed this issue, and the conclusion given by most scholars is that methods to promote blood circulation are all useful. Therefore: 1. Combing and massaging the scalp skin is useful, but the force and method should be considered to prevent damage to hair follicles during the process. 2. Methods that stimulate the skin to achieve capillary dilation and activity, such as ginger, are useful, but prevent scalp skin sensitivity and allergies. 3. Minoxidil is useful, but it is often an alcohol solvent and can easily cause allergies. 4. Finasteride and dutasteride can inhibit 5α-reductase, thereby reducing serum DHT levels and inhibiting hair follicle miniaturization. However, one needs to assess whether the side effects of the medication affect their life. No matter how you want to treat it, I recommend that you go to a Class III hospital and seek a doctor to diagnose and treat it with the doctor's treatment plan, do not blindly look for various folk remedies; thank you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "植发吧",
          "en": "Get a hair transplant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "靈魂之子，澆給。",
          "en": "Soul child, water it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要是我秃了就直接光头了，头发对我帅气的容颜影响不大。",
          "en": "If I go bald, I'll just shave my head, hair doesn't have much effect on my handsome face."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Rache1 这个真没忍住，还我功德。",
          "en": "@Rache1 I really couldn't resist this, give me back my merits."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以问问孙亚龙，他经验丰富",
          "en": "You can ask Sun Ya-long, he has a lot of experience."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "脱发和阳痿,男人最信玄学的时候",
          "en": "Hair loss and impotence, when men believe in metaphysics the most."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "凭什么生姜有用，而大蒜五香八角桂皮香叶茴香不行",
          "en": "Why is ginger useful, but not garlic, five-spice powder, star anise, cinnamon bark, bay leaf, or fennel?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别瞎想了",
          "en": "Don't think nonsense."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "????"
        },
        {
          "en": "????"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小心把头皮辣坏了",
          "en": "Be careful not to burn your scalp with the heat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想想吧，如果土方法有用，这世界上还有秃子吗，一切都是徒劳的",
          "en": "Think about it, if folk remedies were useful, would there still be bald people in this world? It's all in vain."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“数据显示，2021 年我国植发行业市场规模达到 169 亿元，比 2020 年同比增长 26.1%。 随着市场的不断扩大，植发技术也日渐成熟。 根据中国整形美容协会 2021 年发布的《毛发移植规范》团体标准，目前植发主要分为毛囊提取和种植两个维度。”你觉得有用吗？",
          "en": "\"Data shows that in 2021, the market size of China's hair transplant industry reached 16.9 billion yuan, an increase of 26.1% year-on-year. With the continuous expansion of the market, hair transplant technology is also becoming more mature. According to the \"Hair Transplant Norms\" group standard released by the Chinese Association of Plastic and Cosmetic Surgery in 2021, hair transplantation is currently mainly divided into two dimensions: hair follicle extraction and implantation.\" Do you think it’s useful?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "秃头就秃头，又没事！",
          "en": "Being bald is being bald, it's okay!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果生姜可以促进生发，那么你你用打成汁的原始方式，估计要在头上放一吨的生姜才能凑够那个成分的量级",
          "en": "If ginger can promote hair growth, then if you use the original method of juicing it, you probably need to put a ton of ginger on your head to get the required amount of that ingredient."
        }
      ],
      "type": "replies"
    }
  ]
}