{
  "id": 1015579,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "第一次出国（阿联酋迪拜），需要注意什么？",
          "en": "What should I pay attention to when going abroad for the first time (Dubai, UAE)?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "预计 2 月 25 号公司要安排我去迪拜出差，这是我第一次出国，问过朋友/网上查询去阿联酋迪拜是不需要签证的（免签 30 天），保险起见我要去哪个网站查询确认这个免签情况呢？另外有去过阿联酋的朋友可以告知下需要注意什么吗？",
          "en": "My company plans to send me to Dubai on a business trip on February 25th. This is my first time going abroad. I've asked friends and checked online, and it seems that a visa is not required to go to Dubai, UAE (visa-free for 30 days). To be on the safe side, which website should I check to confirm this visa-free status? Also, can anyone who has been to the UAE tell me what I should pay attention to?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "小心中国人",
          "en": "Be careful of Chinese people"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当地手机卡办好，国内手机流量漫游过去应该会很贵",
          "en": "Get a local SIM card; roaming data from a domestic phone will probably be very expensive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意诈骗远离同胞",
          "en": "Beware of scams and stay away from fellow countrymen."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "免签可以从事商业行为?",
          "en": "Can I engage in business activities with a visa-free entry?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://www.mfa.gov.cn/wjbzwfwpt/kzx/tzgg/202110/t20211029_10403855.html",
          "en": "https://www.mfa.gov.cn/wjbzwfwpt/kzx/tzgg/202110/t20211029_10403855.html"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去过了，是免签的，打印好回程机票和酒店预订单就可以了，不一定会看，有备无患",
          "en": "I've been there; it's visa-free. Just print out your return ticket and hotel reservation. They might not check, but it's better to be prepared."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "免签的，直接去就行了， 多换点迪拉姆",
          "en": "It's visa-free, just go. Exchange some Dirhams."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "利用阿联酋免签政策入境工作是严重违法行为，将受法律制裁，被处以有期 徒刑和高额罚金，并驱逐出境。http://cs.mfa.gov.cn/zggmcg/ljmdd/yz_645708/alq_645772/rjjl_645782/公司不给工作签证建议不去。非去不可的话注意以下几点。1. 所有交易走现金 2. 商务文件就不要签了。",
          "en": "It is a serious violation of law to use the UAE's visa-free policy to enter the country for work. You will be subject to legal sanctions, including imprisonment and a heavy fine, and you will be deported. http://cs.mfa.gov.cn/zggmcg/ljmdd/yz_645708/alq_645772/rjjl_645782/ It is recommended not to go if the company does not provide a work visa. If you absolutely have to go, pay attention to the following points. 1. All transactions should be in cash. 2. Do not sign any business documents."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@P233 有园区在那边",
          "en": "@P233 There are industrial parks there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先搞清楚当地的各种基本礼仪吧，避免不小心做出了被当地人认为不友好的手势，还有万一见到酋长的话要不要下跪之类的（我瞎说的）",
          "en": "First, figure out the basic local etiquette to avoid making gestures that are considered unfriendly by locals, and also things like whether you need to kneel if you meet the Sheikh (I'm just kidding)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用移动可以在无忧行上开通国漫套餐，买个几 gb 流量应急就可以，很便宜，落地在机场找运营商柜台，办当地卡用作主力上网卡，然后带好 Visa/MASTERCARD 信用卡，现在这边还有雨，而且气温也就二十多度，带好长袖。",
          "en": "You can open an international roaming package on China Mobile's Wuyou Xing app, buy a few gigabytes of data for emergencies, it's very cheap. Upon arrival at the airport, find the operator's counter, get a local SIM card to use as your main internet card, and then bring your Visa/MASTERCARD credit card. It's also raining here now, and the temperature is only around twenty degrees, so bring long sleeves."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果不是拿公务护照去的，或者大型国企的分公司。建议不去。",
          "en": "If you are not going with an official passport, or as a branch of a large state-owned enterprise, it is not recommended to go."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yyzh 30 天免签，我说过去旅游的应该没问题？",
          "en": "@yyzh 30-day visa-free, I said it should be fine if I go for tourism?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@1145148964 为什么呢？",
          "en": "@1145148964 Why?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kwok702 因为某些产业从 19 年就在往那边转移。公务护照/大国企等于你有后台罩着你。",
          "en": "@kwok702 Because some industries have been moving there since 2019. An official passport/large state-owned enterprise means you have a support network."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kwok702 补充一下你在 11 楼的回复，如果是拿旅游签证过去的，甚至免签过去的。趁早别去了。你自己觉得正规吗？",
          "en": "@kwok702 To add to your reply in the 11th floor, if you are going with a tourist visa, or even visa-free, don't go. Do you think it's legitimate?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "免签是旅游签证啊，出差不能用旅游签证吧",
          "en": "Visa-free entry is a tourist visa, you can't use a tourist visa for a business trip."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用啥签证要问你公司的人，因为是公司让你出差的。比如说申请签证要钱，这钱就得公司出吧。当然如果你们公司不正规/鸡贼那就麻烦了",
          "en": "Ask your company about what visa to use, because the company is sending you on a business trip. For example, if you need to apply for a visa and it costs money, the company should pay for it. Of course, it's troublesome if your company is not legitimate/sneaky."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "普通护照旅游签出去干活，不要有非现金交易，所有交易走现金，以免被查到说不符合签证类型。",
          "en": "If you're going out to work on a regular passport with a tourist visa, avoid non-cash transactions; all transactions should be in cash to avoid being found out that you're not in compliance with your visa type."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@shortawn #8 没去过迪拜，但听说是国际性旅游城市，国际游客那么多还需要下跪吗？",
          "en": "@shortawn #8 I haven't been to Dubai, but I've heard it's an international tourist city. With so many international tourists, do you still need to kneel?"
        }
      ],
      "type": "replies"
    }
  ]
}