{
  "id": 1014838,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "新家准备组网，大家帮忙看看有没有什么改进建议！谢谢",
          "en": "New home preparation for networking, please help me see if there are any suggestions for improvement! Thank you"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "大家好，我家最近要装修了（精装-。- 太丑 还要改），准备组下网，大家给瞧瞧\r\n\r\n这是户型图  https://imgur.com/Jwkfi8o   108 平的\r\n\r\n这是组网图  https://imgur.com/eLXzgaU\r\n\r\n目前情况是 弱电箱 有 4 根到 客厅  卧室 1 卧室 2 游戏房 3(储藏间) 的网口\r\n\r\n想法是： 软路由+科学上网+去广告等； mesh 漫游； 看电视 ；智能家居\r\n\r\n请大家多多指教, 谢谢",
          "en": "Hello everyone, my house is going to be renovated recently (pre-installed -。- too ugly and needs to be changed), I'm going to set up a network, everyone take a look \r\n\r\nThis is the floor plan https://imgur.com/Jwkfi8o 108 square meters \r\n\r\nThis is the network diagram https://imgur.com/eLXzgaU\r\n\r\nThe current situation is that the weak current box has 4 network ports to the living room, bedroom 1, bedroom 2, game room 3 (storage room)\r\n\r\nThe idea is: soft routing + scientific internet access + ad removal, etc.; mesh roaming; watching TV; smart home\r\n\r\nPlease give me more advice, thank you"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@wolfan 你这监控是群晖监控？如果普通的监控一般好像是说接交换机。想主路由直接看就将 B 改成 AP ，就是不知道会不会吃性能，这点你可以观察下 B 路由平时的状态，如果 B 路由平时也没吃什么 CPU 内存的就直接改 AP 好了。------------@xipuxiaoyehua 我也借楼问下，如果主路由没有 KV 又或者不开 WIFI ，两个次路由自己开 KV ，能实现漫游吗？",
          "en": "@wolfan Is this surveillance Synology Surveillance Station? If it's ordinary surveillance, it's generally said to connect to a switch. If you want the main router to view it directly, change B to AP, but I don't know if it will affect performance, you can observe the status of the B router, if the B router doesn't use much CPU and memory, just change it to AP. ------------@xipuxiaoyehua I'll also ask in the thread, if the main router doesn't have KV or doesn't turn on WIFI, and the two secondary routers open KV themselves, can roaming be achieved?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议你可以考虑在那个客厅与寝宫交界的走廊上方，安装一个吸顶式的 AP 。也许可以少几个 mesh 。",
          "en": "It is recommended that you consider installing a ceiling-mounted AP above the corridor between the living room and the bedroom. Maybe you can reduce the number of meshes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有主 mesh 路由么？",
          "en": "No main mesh router?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xylisten 你好  这个 mesh 是需要  主 从吗      查了一下好像是第一个就作为主  其他都是从      我想的是并联到软路由上",
          "en": "@xylisten Hello, does this mesh need a master-slave relationship? I checked and it seems that the first one is the master and the others are slaves. I'm thinking of parallelizing it to the soft router"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mantouboji 谢谢 建议，但是我现在吸顶那里 没有线和网口呢   房子已经是精装了  没法重新布线了",
          "en": "@mantouboji Thanks for the suggestion, but I don't have any cables or network ports there now. The house is already pre-installed and I can't rewire it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这个还要软路由算是杀鸡用牛刀了吧找个信号好点的路由一个放在 AC 那都解决了，最好放的稍微外面一点，这样主卧不会被次卧的墙挡到。觉得不够就在走廊那加一个，又或者哪个房间无线需要有线速度的就哪个房加一个。既然你装修最好直接每个房拉多条线，万一你将来改变主意，真的不想要那么多设备也可以方便的全部直连外面的主交换机，反正一个房间最多两个有线设备应该够用了。我自己是不喜欢弄那么多设备的，越多越麻烦。",
          "en": "Using a soft router in your case is like using a sledgehammer to crack a nut. Find a router with a good signal and place one at the AC, that should solve everything. It's best to place it slightly outside so the master bedroom won't be blocked by the walls of the secondary bedroom. If that's not enough, add one in the corridor, or add one in any room that needs wired speed for its wireless connection. Since you're renovating, it's best to run multiple lines to each room directly, in case you change your mind in the future, and you don't want so many devices, you can easily connect them all directly to the main switch outside. Anyway, a maximum of two wired devices per room should be enough. I myself don't like setting up so many devices, the more there are, the more troublesome it is."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同事那边差不多也是这个结构，没啥问题，他咸鱼买的 TP 的这个运营商版的 AP ，比 TP 同参数的京东便宜一小半 [闲鱼] https://m.tb.cn/h.5s3vkck?tk=RQ59WQ9XdP4 HU9196 「快来捡漏 [全新 AP300XGI-CT 面板 AP ，白色面板 WI-FI6 套装] 」支持桥接模式，设置完整个屋只有软路由那一层子网；支持 IPTV ，但设置 IPTV 之后客厅那个口就只能给 IPTV 用了",
          "en": "My colleague's setup is similar to this, and there's no problem. He bought this operator version of the TP AP on Xianyu, which is about half the price of the same-spec TP on JD.com [Xianyu] https://m.tb.cn/h.5s3vkck?tk=RQ59WQ9XdP4 HU9196 Come pick up the leak [Brand new AP300XGI-CT panel AP, white panel WI-FI6 set] support bridging mode, after setting up the entire house there is only one subnet for the soft router layer; Supports IPTV, but after setting up IPTV, the port in the living room can only be used for IPTV."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我靠这个户型可以说和我住的地方一模一样了",
          "en": "Wow, this floor plan is exactly the same as where I live."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "搭车问下。三个路由（小米路由*2 ，tp*1 ） A 为主路由（小米）、B 次级路由 1 （小米，在同一屋）、C 次级路由（同 B 一样，由 A 牵了条线。但是 B 在院子的另一端，主要是用作监控设备的网络）。B 路由下拖了一个硬盘（老的小米青春啥的路由，有个 USB 口，接了硬盘当 NAS ），同时拖了一台小主机作为监控的存储和控制台。手机、电视、电脑都是在 A 路由上 WIFI 联接。所以每次看监控都要先切到 B 路由的 WIFI 上看，小米路由的 NAS 要么用 APP ，要么是切路由。请问要怎么设置才可以直接在 A 路由下直接浏览 B 路由的 USB 硬盘和其网络下电脑的目录。",
          "en": "I'll ask a question along the way. Three routers (Xiaomi router *2, TP *1) A is the main router (Xiaomi), B is the secondary router 1 (Xiaomi, in the same room), C is the secondary router (same as B, with a cable from A. But B is at the other end of the yard, mainly used for the network of the surveillance equipment). A hard drive is connected to B router (an old Xiaomi Youth-type router, with a USB port, connecting a hard drive as a NAS), and a small host is also connected as the storage and console for the surveillance. Mobile phones, TVs, and computers are all connected to WIFI on A router. So every time you want to view the surveillance, you have to switch to B router's WIFI first. The Xiaomi router's NAS either uses the APP or switches routers. How do I set it up so that I can directly browse the USB hard drive of B router and the directory of the computer under its network directly under A router?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "bright city ？",
          "en": "bright city ?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fly7632785 #3 mesh 有主从，子 mesh 需要有线链接到主 mesh 的 lan 口。",
          "en": "@fly7632785 #3 mesh has master-slave relationship, and the sub-mesh needs to be connected to the lan port of the main mesh with a cable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@testonly 你好，谢谢 建议。  想要用软路由 主要还是想 科学上网 去广告 自己搞搞网络玩玩。   现在房间已经是精装了，就是说没法重新布线了，定死了-。-     这就是精装难搞的地方  风格还不好看  不受自己控制",
          "en": "@testonly Hello, thank you for the suggestion. The main reason I want to use a soft router is because I want scientific internet access, block ads, and have fun playing with the network. Now the rooms are already pre-installed, which means I can't rewire them, it's a done deal -。- This is the difficult part of pre-installed houses, the style is not good-looking, and it is not under my control."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xipuxiaoyehua 嘿嘿 不会是同一个地方吧  成都坐标",
          "en": "@xipuxiaoyehua Hehe, it can't be the same place, right? Chengdu coordinates"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fly7632785 #12 我猜你在菜鸟驿站和顺丰那一栋？",
          "en": "@fly7632785 #12 I guess you are in the building with Cainiao Post and SF Express?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xylisten 你好，在网上查到一篇资料 说  好像是可以并联呢？ https://post.smzdm.com/p/ar6vr747/   帮忙鉴定下呢  谢谢",
          "en": "@xylisten Hello, I found an article online that says it seems to be connectable in parallel? https://post.smzdm.com/p/ar6vr747/ Please help me to verify. Thank you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xipuxiaoyehua 我家是远大中央公园",
          "en": "@xipuxiaoyehua My home is in Yuanda Central Park"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fly7632785 #14 mesh 是个伪命题，其实只要路由器支持 k/v 协议就行",
          "en": "@fly7632785 #14 mesh is a false proposition, in fact, as long as the router supports the k/v protocol."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "实话，108 没必要上 mesh 直接搞个强力路由器 全覆盖。软路由这个其实和你需求有关。我个人建议 你花 100 买个 RAX3000M 刷 OP 试试，如果它自己就能满足你需求，你 100 就搞掂，如果不能 就把它塞到弱电箱去当主路由 另外买个强力 AP 。既省钱又可扩展。。。",
          "en": "Honestly, there's no need to use mesh for 108, just get a powerful router for full coverage. The soft router is actually related to your needs. I personally suggest that you spend 100 to buy a RAX3000M and flash OP to try it. If it can meet your needs on its own, you can get it done for 100, if not, then put it in the weak current box as the main router and buy another powerful AP. It's both economical and expandable..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Puteulanus 好的 谢谢",
          "en": "@Puteulanus Okay, thank you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@que01 108 边边角角覆盖还是会有些问题，他这个 ap 如果放在客厅，和主卧隔两堵墙，信号衰减很厉害的",
          "en": "@que01 108 coverage at the corners and edges may still be a problem. If he puts the AP in the living room, and it's separated from the master bedroom by two walls, the signal attenuation will be very serious."
        }
      ],
      "type": "replies"
    }
  ]
}