{
  "id": 1016080,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "oppo vivo 这种手机定价非常超出我的认知，原来还可以这样，这种策略上代产品还能卖出去吗？",
          "en": "The pricing of phones like Oppo and Vivo is completely beyond my understanding. Is this even possible? Can this strategy still sell the previous generation of products?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "之前准备换手机，需求只有个拍照和无内置广告。过年感受了下同学的几个国产手机，内置广告好像没有以前那么泛滥了，还是买个便宜的国产吧（仍然排除华为）。按这个需求觉得上代高端机价比高点，顺着 DXOMark 排名高的找了几款。去京东，去官网都看了价格，惊呆了。\r\n\r\n比如 OPPOFind 系列 X7 是 2024 年 1 月新出的，最低配卖 3999 ； X6 2023 年 3 月 21 日发布，也卖 3999 ，X5 2022 年 2 月 24 日，目前售价仍然 3999 。\r\n\r\n详细参数我还没研究，至少 CPU 内存新一代是比上一代有提升。在这种情况，上代居然一点不降价，到底什么人有需求会买上代啊，脑瘫？\r\n\r\n或者人家策略就为了专门对付我这种等捡漏的穷逼？",
          "en": "I was planning to change phones before, with the only requirements being good camera and no built-in ads. During the New Year, I experienced a few domestic phones from my classmates, and the built-in ads didn't seem as rampant as before. I still decided to buy a cheaper domestic phone (still excluding Huawei). Based on this requirement, I thought the previous generation of high-end phones would have a higher price-performance ratio, so I looked for a few models with high DXOMark rankings. I went to JD.com and the official website to check the prices; I was shocked.\r\n\r\nFor example, the OPPO Find X7 series was newly released in January 2024, with the lowest configuration selling for 3999; The X6 released on March 21, 2023, also sells for 3999, and the X5 released on February 24, 2022, still sells for 3999.\r\n\r\nI haven't studied the detailed parameters yet, but at least the CPU and memory of the new generation are improved compared to the previous generation. In this case, the previous generation hasn't dropped in price at all. What kind of people would need to buy the previous generation? Are they brain-damaged?\r\n\r\nOr is their strategy specifically to deal with poor people like me who are waiting for bargains?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "x5 貌似已经停产，京东自营只剩下一款，有“网易专享”的字样，我不知道是为什么。x5pro 京东我这里显示是 3229 。x6 京东我这里显示是 3699 。1.京东是真的坑，直接搜到的链接基本上都是原价，但从张大妈进去的链接就有优惠，比如 x7 我就随手搜到一个自营 3899 的。2.安卓机因为更新换代比较快，官网价格几乎不会变化，但其他渠道价格早就变了（苹果也差不多，参考 ip15 官网价格）。",
          "en": "The X5 seems to have been discontinued; there's only one model left on JD.com's self-operated store, with the words \"NetEase Exclusive,\" I don't know why. The X5 Pro on JD.com shows 3229 for me. The X6 on JD.com shows 3699 for me. 1. JD.com is really a scam. The links found directly mostly show the original price, but there are discounts if you enter through Zhangda Ma. For example, I casually searched and found a self-operated X7 for 3899. 2. Android phones update and change fairly quickly, and the official website prices hardly change, but the prices from other channels have already changed (Apple is similar; refer to the official price of iPhone 15)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "基本出新一代上一代停产了。而且上一代其他渠道早就降价了.",
          "en": "Basically, when the new generation comes out, the previous generation is discontinued. And the previous generation has long been discounted in other channels."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因为你看的是京东和官网啊，那种地方除了 618 ，双十一，一般也不会降价降低的都是渠道，拼多多淘宝 C 店啥的ov 专攻线下渠道你认识人的话，有些机子的价格真的会低很多很多提升的话 cpu 部分，gen3 到 gen2 ，没 8+到 8gen2 大，cpu 和 gpu 大概都 20%左右，8+到 gen2 的 gpu 直接翻倍你要是不急的话，直接等 8gen4 啊，下代高通自研架构，可以期待下，据说 10 月份就有新机了你要买手机的话，618 双十一节点买啊",
          "en": "Because you're looking at JD.com and the official website. Those places usually don't lower prices except for 618 and Double 11. The discounts are usually in channels like Pinduoduo, Taobao C stores, etc. If you know someone, the prices of some phones will be really much lower. In terms of CPU improvements, from Gen3 to Gen2 isn't as big as from 8+ to 8Gen2. The CPU and GPU are about 20% better. The GPU from 8+ to Gen2 is directly doubled. If you're not in a hurry, just wait for 8Gen4. The next-generation Qualcomm self-developed architecture can be expected. It is said that new phones will be available in October. If you want to buy a phone, buy it during the 618 or Double 11 periods."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JensenQian #3 手持骁龙 660 ，等 8gen5.",
          "en": "@JensenQian #3 Holding a Snapdragon 660, waiting for 8gen5."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@idragonet #4 660 这也太古老了吧至少怎么也得 855 ，865 啥的，那都是 4 ，5 年前的玩意了我的 870 今年准备换掉了，换个 8gen2 的次旗舰,或者和库克交朋友",
          "en": "@idragonet #4 The 660 is too old, isn't it? At least something like 855 or 865, those are 4 or 5 years old. I'm planning to replace my 870 this year, and replace it with an 8gen2 secondary flagship, or become friends with Cook."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "660 855 870 8g2 我都用过, 建议有钱还是一步到位, 提升的不止 u, 还有配套的整体硬件配置, 高配用起来真的挺爽的@idragonet @JensenQian",
          "en": "I've used 660, 855, 870, and 8g2. I recommend going all the way if you have the money. The improvement isn't just the CPU; there's also the supporting overall hardware configuration, and it's really great to use a high-end configuration. @idragonet @JensenQian"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Worldispow @JensenQian 卧槽，还有直搜链接的坑，学到了。我知道京东和官网价格肯定会贵，但没想到蓝绿能一直维持原价。以前只注意过小米，251 ，三星之类的，京东上代降幅挺大的，还以为其他厂家也是这样。没打算必须在京东买，只是第一时间用京东做价格参考来着，想不到完全没有参考价值。。我对 CPU 没啥需求，手上的三星 6G 内存实在顶不住了才打算换一下。",
          "en": "@Worldispow @JensenQian Wow, there are pitfalls in direct search links, I learned something. I know JD.com and the official website prices will definitely be expensive, but I didn't expect Blue Green to maintain the original price all the time. I only paid attention to Xiaomi, 251, Samsung, etc. before, and the price reduction of the previous generation on JD.com was quite large. I thought other manufacturers were the same. I didn't plan to buy on JD.com, I was just using JD.com as a price reference at first, but I didn't expect it to be completely worthless. I don't have much requirement for the CPU, I only plan to replace it because the 6G memory of my Samsung can't handle it anymore."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "蓝绿厂的手机在 jd 的价格就是出厂指导价吧，后面一般不维护了？转移一下话题，如果要买 x7 ，建议线下小店，一般官方价格减去 500 ，这是蓝绿厂给渠道的价格，oppo x7 和 vivo x100 的 512G 的，线下价格在 3900 左右。",
          "en": "Are the prices of Blue Green phones on JD.com just the factory guide prices, and they usually don't maintain them later? Shifting the topic, if you want to buy X7, it is recommended to go to offline small stores. Generally, the official price is reduced by 500. This is the price that Blue Green manufacturers give to channels. The offline price of the OPPO X7 and vivo X100 with 512G is around 3900."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@libasten 原来完全是另一套规则，顺便问下，像 realme gt5pro 这种最初为了跟小米拼性价比的型号，也是线下比线上便宜吗？",
          "en": "@libasten So it's a completely different set of rules. By the way, for models like the realme gt5pro, which were originally designed to compete with Xiaomi for cost-effectiveness, are they also cheaper offline than online?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Worldispow 张大妈的链接是带返利的链接，是会带个券",
          "en": "@Worldispow The links on Zhangda Ma are links with cashback, and they will have coupons."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mohulai #7 那你买新的么好了你得看牌子的蓝绿主品牌的话你线下渠道多逛逛，也许有惊喜子品牌还有猴厂这种专攻线上的话，一般价格差不多不过你要性价比的话直接买次旗舰好了，一般次旗舰的话现在 2000-3000 的用的是上代的 8gen21000-2000 的话这个价位推荐买 7gen2 （ 8+稍微砍了点）的那两玩意你日常用差距其实不大，充电速度也差不多，主要是相机和做工了安卓的性价比我推荐 1500-2500 差不多，看着买个就行了3000 以上的话我的想法是直接加点钱买库克算了15 也没多少钱了现在",
          "en": "@mohulai #7 Then you'd better buy a new one. You have to look at the brand. If it's the main brand of Blue Green, then visit the offline channels more often, maybe there will be surprises. If it's a sub-brand or a brand like the monkey factory that specializes in online sales, the prices are generally similar. But if you want a cost-effective option, then directly buy a secondary flagship. The secondary flagship is generally using last generation's 8gen2 in the 2000-3000 range; for 1000-2000, I recommend buying the 7gen2 (the 8+ has been slightly cut). The difference between those two things and your daily use is actually not that big, and the charging speed is also similar. The main thing is the camera and workmanship. I recommend the Android cost-effective option to be around 1500-2500, just look and buy. If it's over 3000, my idea is to directly add some money to buy Cook's phone, the 15 doesn't cost much now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "jd 买肯定选保值换新，否则就找本地的渠道。",
          "en": "If you're buying on JD.com, definitely choose the trade-in for new phones; otherwise, look for local channels."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mohulai #9 realme 和 iqoo 这牌子主要专攻线上的不过这牌子跳水很快，你等 618 再看看吧",
          "en": "@mohulai #9 realme and iqoo, these brands mainly focus on online sales, but these brands' prices drop very fast, so you can wait for 618 and take a look."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JensenQian 不追求性价比啊，需求只有拍照和续航，性价比手机一般不怎么注重拍照吧。苹果系统完全不想碰，再加钱不如等两个月之后跳水的港版 S24+了。",
          "en": "@JensenQian I don't pursue cost-effectiveness; my only requirements are camera and battery life. Cost-effective phones usually don't pay much attention to the camera, right? I don't want to touch the Apple system at all. If I add more money, it's better to wait for the Hong Kong version of the S24+ to drop in price in two months."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jydeng 没啥保值想法，这玩意买来就用，又当不了传家宝。",
          "en": "@jydeng I don't have any thoughts about the value retention. You buy this thing to use it, and it can't be a family heirloom."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@me1onsoda 别管是否返利，比自己搜出来的便宜不就行了。。。",
          "en": "@me1onsoda Forget about whether there's cashback, isn't it enough that it's cheaper than what you searched for...?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我一般只在 618 和 11.11 买手机，差好几百呢",
          "en": "I usually only buy phones on 618 and 11.11, there's a difference of several hundred."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mohulai 不是保值，是可以 8 折回购换新机",
          "en": "@mohulai Not about value retention. You can trade it in for a new phone with an 80% repurchase."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jydeng 还可以这样，没注意过。感觉没必要，不是很爱折腾，每次换也得再添点钱买新的，现在就缺钱。",
          "en": "@jydeng You can do this, I haven't noticed it. I don't feel it's necessary, and I don't like to change things, and you have to add some money to buy a new one every time, and I lack money now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JensenQian #5 平时扫码付款、听听歌、叫滴滴， 真的不碍事。",
          "en": "@JensenQian #5 Usually scanning codes for payment, listening to music, and calling Didi, it really doesn't get in the way."
        }
      ],
      "type": "replies"
    }
  ]
}