{
  "id": 1018346,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "终于找到一款 8 英寸原生安卓平板！",
          "en": "Finally found an 8-inch native Android tablet!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "先说型号：酷比魔方 掌玩 mini ，出口国外的版本叫 iplay 50pro mini ，两者的区别仅在系统，出口版是原生安卓带 google play ，国内版系统也很精简，可以互刷，可 root 。分辨率 1920*1200 ，8+256G ，可插双卡 LTE 接打电话，联发科 G99 的处理器日常使用足够了，唯一的不足是只有一个扬声器。关键是价格仅八百多！用了半个月爽爆了！\n\n喜欢平板，但主流 10 英寸的太大，8 英寸的正好，可惜基本没得选，ipad mini6 系统封闭。华为 m6 的系统限制太多，不能装 google play ，而且现在也停产了。联想 y700 配置不错，但不喜欢那个系统。\n\n喜欢原生安卓和 8 英寸的尺寸，但一直找不到，无意中看到这个型号，居然已经上市半年了，但是在某东上按条件筛选，根本找不到这个型号，都是 ipad 华为小米之类的牌子，估计是利润太少厂家都无力做推广了？",
          "en": "First, the model: Cube iPlay mini, the export version is called iplay 50pro mini. The only difference between the two is the system. The export version is native Android with Google Play, and the domestic version's system is also very streamlined, can be cross-flashed, and can be rooted. Resolution 1920*1200, 8+256G, can insert dual SIM LTE to make calls, the MediaTek G99 processor is enough for daily use, the only drawback is that there is only one speaker. The key is that the price is only more than eight hundred! It's been awesome for half a month!\n\nI like tablets, but the mainstream 10-inch ones are too big, and 8-inch ones are just right, but unfortunately, there's basically no choice. iPad mini6 has a closed system. Huawei M6 has too many system restrictions, can't install Google Play, and is now discontinued. Lenovo Y700 has good configuration, but I don't like that system.\n\nI like the native Android and the 8-inch size, but I haven't been able to find one. I accidentally saw this model, which has been on the market for half a year, but when filtering on a certain e-commerce platform, I can't find this model at all. They are all brands like iPad, Huawei, and Xiaomi. I guess the profit is too small, and the manufacturers are unable to promote it?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "一直想找个能当便携显示器的平板，都是轻量使用，好像只有联想出过两个，价格略贵，感觉都扑街了",
          "en": "I've always wanted to find a tablet that can be used as a portable monitor, and they're all for light use. It seems that only Lenovo has released two, which are a bit expensive, and I feel they all flopped"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://item.m.jd.com/product/10084233029140.html#summary看过，但开孔劝退了。C 口不居中、3.5mm 在圆角上、单喇叭，MD 前两个问题设计时少摸点鱼都能解决吧？这个品牌的东西总能符合一些特殊的使用场景，但就他奶奶的不认真去做。",
          "en": "https://item.m.jd.com/product/10084233029140.html#summary I've seen it, but the hole puts me off. The C port is not centered, the 3.5mm jack is on the rounded corner, and it has a single speaker. MD, could the first two problems be solved if the design team worked a little harder? This brand's products can always meet some special usage scenarios, but they just don't take it seriously."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "搜了一下 好像 DRM 只有 L3",
          "en": "Searched and it seems DRM is only L3"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个型号人家都是改装成 psp 样子的游戏机 能 root 的安卓都是好安卓",
          "en": "This model is modified into a PSP-like gaming console. Androids that can be rooted are good Androids"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JingW #19 我的 ipad mini 在壳上贴了个磁吸环，吸个气泡支架单手用",
          "en": "@JingW #19 I stuck a magnetic ring on the case of my iPad mini and use an air bubble stand to hold it with one hand"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@JingW 我觉得不算重吧，比华为 m6 轻多了，当然屏幕也不如 m6 ，但我讨厌华为的系统。",
          "en": "@JingW I don't think it's heavy, much lighter than Huawei M6, of course the screen is not as good as M6, but I hate Huawei's system."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚买了 2024 NFE 的版本，DRM Info 显示有 L1 。但这个 DRM Info 是固化的，Play 里无法更新，我有点怀疑。其他的还好，799 要什么自行车。TypeC 还好，耳机孔是真的蠢，丑死。好奇 2023 的刷机教程能不能在 2024 上用，有点想搞个 GSI 看看。",
          "en": "Just bought the 2024 NFE version, DRM Info shows L1. But this DRM Info is fixed and cannot be updated in Play, I am a little skeptical. The rest is fine, what more can you ask for at 799. TypeC is okay, the headphone jack is really stupid, it's ugly. I'm curious if the flashing tutorial for 2023 can be used on 2024, and I want to try a GSI."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@tool2d 2024 NFE 的版本，原厂系统有抬起唤醒，配上 Nova Launcher 的手势锁屏，基本不需要按那个松松垮垮的电源键了。",
          "en": "@tool2d The 2024 NFE version has raise to wake in the original system, and with the gesture screen lock of Nova Launcher, you basically don't need to press that loose power button."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ipad 有 uYouPlus 也没广告，可以下视频。同样爽的很。",
          "en": "iPad has uYouPlus and no ads, so you can download videos. It's just as awesome."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "{抱歉，无鼠标情况下全靠键盘和触摸板输入，误触到快捷键了，没输入完整就直接发出去了}拿到手之后，可系统升级(V2.0_20240222 ；路径：设置→关于平板电脑→系统升级)、可系统更新(路径：设置→安全→安全更新、系统更新)；网关模式下，Google 官方应用及 Telegram/Spotify/Neflix 使用均正常，完全符合我的期望。",
          "en": "{Sorry, I relied on the keyboard and touchpad for input without a mouse, and accidentally triggered the shortcut keys. The input was not complete before it was sent} After getting it, it's possible to upgrade the system (V2.0_20240222; Path: Settings → About Tablet → System Upgrade), and update the system (Path: Settings → Security → Security Update, System Update); In gateway mode, Google's official applications and Telegram/Spotify/Netflix work normally and completely meet my expectations."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "酷比魔方的平板确实不错，还有几款全志 a523 之类的更便宜，我认识的几个搞嵌入式的经常买他们家的产品来折腾（",
          "en": "Cube's tablets are really good. There are also a few cheaper ones like Allwinner A523. Some embedded system engineers I know often buy their products to tinker with."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近想买个平板给老人家用，就是纠结 10 寸以上会不会太重，屏幕小了又怕老花看着不方便。",
          "en": "I recently want to buy a tablet for the elderly, I'm just worried that 10 inches or more will be too heavy, and I'm afraid that the screen is too small, making it inconvenient for the elderly to see."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哎，前几个月已经买了 ipad mini 6 了，不然就买它，几百块要啥自行车",
          "en": "Well, I bought the iPad mini 6 a few months ago, otherwise I would buy it, what more can you ask for a few hundred bucks"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买这种小的可以干嘛。。。想问问，真的想问问",
          "en": "What can you do with such a small one... I want to ask, really want to ask"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "屏幕素质如何? 之前用华为 M6, 屏幕瞎眼.@Cheons 设计师当然知道前两个是问题. 设计都是为了实际妥协. 出于什么原因要妥协你可以想想.",
          "en": "How is the screen quality? I used Huawei M6 before, the screen is blinding.@Cheons The designer of course knows that the first two are problems. Design is all about practical compromises. You can think about the reasons for the compromise."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "屏幕效果咋样？",
          "en": "How is the screen effect?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正准备搞个安卓设备玩，还在考虑红米 k60 还是一加 11 ，刚好看到这个帖子，劲省一两千块，不错",
          "en": "I'm preparing to get an Android device to play with, and I'm still considering Redmi K60 or OnePlus 11. I just saw this post and saved a thousand or two yuan, which is good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Y7002 代这种刷类原生也是可以的",
          "en": "Y700 second generation also supports flashing to a near-native system"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mohumohu 手机屏幕小字也小，老人看不清楚，这个平板基本可以代替手机了。",
          "en": "@mohumohu The small text on the phone screen is also small, and the elderly can't see it clearly. This tablet can basically replace the phone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "酷比魔方当车机导航贼爽",
          "en": "Cube can be used as a car navigation device, it's awesome"
        }
      ],
      "type": "replies"
    }
  ]
}