{
  "id": 1015676,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想讨论讨论如何劝爸妈少吃一些碳水，适当增加肉蛋奶",
          "en": "Want to discuss how to persuade parents to eat less carbohydrates and increase meat, eggs, and milk appropriately"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "op 是北方人，碳水大省，90 后。\n过年跟亲戚喝酒吃饭，发现很多长辈都有慢性病了。但他们对慢性病的认识跟我很不一样，有了病就是戒油戒盐，酒要喝，烟要抽，碳水也吃很多，医生的话选择性相信。\n\n70 后的长辈，有 30%左右会根据医生建议控制饮食，比如碳水一天多少两，动物油植物油一比一，盐少吃一些，蛋白质蔬菜之类的吃够，适当补充一些维生素 blabla\n\n大部分长辈还是不听，爷爷奶奶辈我觉得控制饮食有点强人所难，但是爸妈这辈控制一下很有可能可以明显改善身体状况。\n---\n现在就是，别人家的爸妈自己学习营养知识，自己家的爸妈怎么都不听，一顿饭喝粥配馒头，炒个土豆丝，饭后再来个红薯，看着就很懵。。。体检餐前血糖确实还在范围以内。。。怎么劝怎么不听，一说就是这么吃几千年的传统，问就是几千年都是精米精面。。\nV 友们有没有什么相似经历，或者好办法",
          "en": "The OP is a northerner from a carb-heavy province, born in the 90s.\nDuring the New Year, when eating and drinking with relatives, they found that many elders have chronic diseases. However, their understanding of chronic diseases is very different from mine. When they get sick, they just abstain from oil and salt, drink alcohol, smoke, and eat a lot of carbs, selectively believing what the doctor says.\n\nAbout 30% of the elders born in the 70s will control their diet according to the doctor's advice, such as how many ounces of carbs per day, a one-to-one ratio of animal oil to vegetable oil, eating less salt, eating enough protein and vegetables, and supplementing some vitamins blabla.\n\nMost elders still don't listen. I think it's a bit difficult for the grandparents' generation to control their diet, but this generation of parents may be able to significantly improve their physical condition by controlling it.\n---\nNow, other people's parents learn nutrition knowledge themselves, but their own parents don't listen at all. They have a meal of congee and steamed buns, stir-fried potato strips, and then a sweet potato after the meal. It looks very confusing... Their pre-meal blood sugar is indeed still within the range... No matter how they persuade them, they don't listen. They say they've been eating this way for thousands of years. They say that refined rice and refined flour have been eaten for thousands of years.\nDo V friends have any similar experiences or good solutions?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我觉得特别逗，就是我自己懂了点什么事，必须让别人跟我一样。比如我觉得跑步好，就应该所有跟家呆着刷剧的人都出去跑跑。我觉得吃油饼不健康，就该让所有人每周起码吃一次鸡胸肉。但想过没有？强迫把自己的意志给别人，是一件多么自私的事？我也想让我父母健康，所以我就回家做饭，让他们爱吃我做的饭，然后我教给他们怎么做。如果他们不爱吃，我就继续做饭。365 天，我可以做一天，可以做两天，可以做三天，比我说 365 天要靠谱多了。换过来讲，你周围的人天天叨叨叨叨的跟你说，你烦不烦？我要是天天跟你说，好好工作，别玩游戏，别摸鱼，好好看书，多想想怎么挣钱，你烦不烦？一样烦，一样抵触吧。",
          "en": "I find it particularly funny. When I understand something, I have to make others do the same as me. For example, I think running is good, so everyone who stays at home watching TV shows should go out and run. I think eating fried oil cakes is unhealthy, so everyone should eat chicken breast at least once a week. But have you thought about it? Forcing your will on others is such a selfish thing. I also want my parents to be healthy, so I go home to cook, make them love the food I cook, and then I teach them how to cook. If they don't like it, I'll keep cooking. I can do it for one day, two days, or three days out of 365 days, which is much more reliable than saying it for 365 days. In turn, if the people around you nag you every day, wouldn't you be annoyed? If I nag you every day to work hard, don't play games, don't slack off, read books, and think about how to make money, wouldn't you be annoyed? It's just as annoying and just as resistant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "难度比较大，已经劝了好几年了，不管用。",
          "en": "It's quite difficult; I've been trying to persuade them for several years, but it's not working."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "搞不定，“几千年传统”这句话真的怼得你哑口无言。我妈一直就讲那些歪门邪道养生，结果经常腌天天吃咸鸭蛋。什么牙疼含花椒，腿脚疼醋浴，她不相信医生的，说实话这种慢性病现代医学确实也没啥好办法，自己都站不稳，怎么去教育别人？",
          "en": "It can't be done. The phrase “thousands of years of tradition” really shuts you up. My mother has always talked about those crooked and evil ways of health preservation, and as a result, she often eats salted duck eggs every day. She uses Sichuan peppercorns for toothaches and vinegar baths for leg pain. She doesn't believe the doctors. To be honest, modern medicine doesn't really have any good solutions for this kind of chronic disease. You can't even stand on your own two feet, so how can you educate others?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "难。老一辈的很少有听劝的。我爸妈天天就是面条，一点营养没有",
          "en": "It’s difficult. The older generation rarely listens to advice. My parents eat noodles every day, and there is no nutrition."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "唯一办法，你感觉什么东西好，就多往家里买。",
          "en": "The only way is to buy more of what you think is good for them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我爸来我家住的一段时间我在轻断食减肥，还控制碳水。我爸说诶这不错，然后跟着我吃，我不吃他也不吃，我不吃碳水的时候他也不吃，然后他瘦的比我多，笑死。",
          "en": "When my dad came to live at my house for a while, I was intermittent fasting and losing weight, and I also controlled my carbs. My dad said, 'Hey, that's not bad,' and then he ate with me. If I didn't eat, he wouldn't eat either. When I didn't eat carbs, he didn't eat them either, and then he lost more weight than me, lol."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你多给买买就好了，牛奶我都是固定时间就买回去，不喝就扔了，反正一直买。至于绝对控制饮食，我觉得如果是城里人还有可能，农村没啥可能，尽量就是补充。",
          "en": "Just buy more for them. I always buy milk at a fixed time, and I throw it away if they don't drink it. Anyway, I keep buying it. As for absolute control over their diet, I think it's possible for city people, but it's unlikely for rural people. Just try to supplement it as much as possible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你的观点都是在营养角度，我肠胃不好，每次去看医生，都会告诫我少吃肉蛋奶，所以我来从消化角度说下这个问题的看法。肉蛋奶都很难消化，尤其是不运动的情况下。年轻人还好，老年人消化不好，胃很容易不舒服。尤其说下吃撑了的情况，同样是吃的特别撑，面食水果可能一两个小时就没事了，肉食半天消化不了，胃一直难受。",
          "en": "Your perspective is from a nutritional angle. I have a bad stomach, and every time I see a doctor, they tell me to eat less meat, eggs, and milk. So, I'll talk about this issue from a digestive perspective. Meat, eggs, and milk are all difficult to digest, especially when you don't exercise. It's okay for young people, but elderly people have poor digestion, and their stomachs are easily uncomfortable. Especially when you're full, even if you're very full, you might be fine in an hour or two after eating noodles and fruits, but you can't digest meat for half a day, and your stomach always feels uncomfortable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把买菜的担子抢过来，买了他们还能不吃丢掉吗，自然就由你控制了",
          "en": "Take over the responsibility of buying groceries. If you buy it, can they not eat it and throw it away? Naturally, you'll be in control."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SenLief 不喝为什么扔啊，拿回来自己喝啊",
          "en": "@SenLief Why throw it away if they don't drink it? Drink it yourself!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@naminokoe 咋拿回来？ 2000 多公里呢。",
          "en": "@naminokoe How do you get it back? It's more than 2,000 kilometers away."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不太行，不到进医院花笔钱是不会听的。",
          "en": "It's not very effective; they won't listen unless they go to the hospital and spend some money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "放弃吧，你年纪大了你也不会听劝，只要不被骗，随便他们吧",
          "en": "Give up. When you get older, you won't listen to advice either. As long as they're not being scammed, just let them be."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "据说某个伟大的人，从来不刷牙，每天用茶水漱口，没人能劝得了，他牙齿全黑，你应该见过",
          "en": "It is said that a certain great person never brushed his teeth; he rinsed his mouth with tea every day, and no one could persuade him. His teeth were all black; you should have seen it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "改不了的，你不够权威，而且饮食不是短期能看到效果的事情。",
          "en": "They can't change. You are not authoritative enough, and diet is not something that shows results in the short term."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "> 一说就是这么吃几千年的传统，问就是几千年都是精米精面这好像不太对，以前平民百姓都是以粗粮为主，全民吃上精米精面也就几十年历史吧。以前都是怕营养不良，肥胖问题也是最近十几年才开始广泛出现。",
          "en": "> They say they've been eating this way for thousands of years, and they say refined rice and flour have been eaten for thousands of years. This doesn't seem quite right. In the past, ordinary people mainly ate coarse grains. It's only been a few decades since everyone started eating refined rice and flour. In the past, people were afraid of malnutrition, and obesity problems have only started to become widespread in the last decade or so."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "简单啊。你买买买啊。他们不吃浪费了你就教育啊。我不信你买了他们会扔。",
          "en": "It's simple. Just buy and buy them. If they don't eat it and waste it, then teach them. I don't believe they'll throw it away if you buy it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是满满自信几千年传统，何来的几千年传统，几千年都吃不饱饭是真。",
          "en": "Full of confidence in thousands of years of tradition, where does the thousands of years of tradition come from? It is true that people were hungry for thousands of years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你自己做给他们吃",
          "en": "Cook it for them yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么劝素食主义者吃肉？",
          "en": "How to persuade a vegetarian to eat meat?"
        }
      ],
      "type": "replies"
    }
  ]
}