{
  "id": 1018409,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "2024 年打算购买一辆 SUV，各位有什么推荐的吗？",
          "en": "Planning to buy an SUV in 2024, any recommendations?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前段时间看了下，暂时有三款觉得可以考虑的：宝马 X1 ，大众途观 L ，别克昂科威。\r\n这几款车大家觉得怎么样？\r\n预算 25w 以内的 SUV 大家有什么推荐的吗？",
          "en": "I've been looking at some recently, and I'm considering three: BMW X1, Volkswagen Tiguan L, and Buick Envision. What do you think of these cars?\nAny SUV recommendations for a budget under 250,000 yuan?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "首先排除美系车，美系车很多都是外包给墨西哥团队做整车设计或者特供车，不是说不行，但是我不要。\r\n其次 X1 2.0 的是这个价位豪华品牌最实惠的，如果非要把 25 万花掉，那就干 X1 。\r\n如果不是非要花 25 万，我选择 10 万买捷达 VS5 ，剩下 15 万去美国，欧洲玩一圈，骑骑大洋马。",
          "en": "First, I'm excluding American cars. A lot of them are outsourced to Mexican teams for whole-vehicle design or are special editions; it's not that they're bad, but I don't want them.\nSecond, the X1 2.0 is the most affordable luxury brand at this price point. If you absolutely must spend 250,000, then go for the X1.\nIf I don't have to spend 250,000, I'd choose to buy a Jetta VS5 for 100,000, and spend the remaining 150,000 to travel around America and Europe, and ride some foreign horses."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "冤种买车",
          "en": "Sucker buys a car"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "OP 不要在 V2 问车了，你看看这些人推荐车，全是看些外观、内饰、车机的，汽车的三大件闭口不谈。推电车的更是脑子有点问题。买车只要去看各大平台的销量，并注意避坑就行了。自己去了解，比在这问强，别人喜欢的不见得就是你喜欢的。",
          "en": "OP, don't ask about cars on V2. Look at these people recommending cars, they only look at the appearance, interior, and car system, and don't mention the three major components of a car. Those who recommend electric cars have some problems with their brains. When buying a car, just look at the sales of major platforms and pay attention to avoiding pitfalls. It's better to find out yourself than to ask here; what others like may not be what you like."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "反正推荐电车的都缺根弦",
          "en": "Anyway, those who recommend electric cars are all a bit off"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不要买 x1 ，会给人一种买不起，硬要上的感觉。",
          "en": "Don't buy the X1, it will give people the impression that you can't afford it but are trying to make it work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "领克 08 可以看看",
          "en": "You can take a look at Lynk & Co 08"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "X1 蛮好的，新版空间相当充裕，喜欢就买",
          "en": "X1 is pretty good, the new version has plenty of space, buy it if you like it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "周围如果有人会笑话开 20w 以上的车，对这个世界认知太浅薄，这种人敬而远之就行了。",
          "en": "If someone around you laughs at someone driving a car over 200,000 yuan, their understanding of the world is too shallow, just stay away from that kind of person."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坦克 300 ，gs8.",
          "en": "Tank 300, GS8."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买 X1 的话 建议把 X1 这个标扣了 或者买个 X3 Q5L   ，UP 选的这些车都是大冤种",
          "en": "If you buy an X1, I suggest removing the X1 logo or buying an X3 or Q5L. The cars the OP chose are all big suckers"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我的话买个 10 来万的就行了，车子这种消耗品就偶尔开一下，平常基本都是放在那里吃灰，剩下的钱干点其他更重要的事情",
          "en": "I would just buy one for around 100,000 yuan. Cars are consumables; I only drive them occasionally, and they usually sit there collecting dust. Spend the rest of the money on something more important."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "22 年，X1 和途观都试驾过，原来 22 的途观有颗粒捕捉器的问题，现在不知道还有没有。\r\n驾乘感觉，X1 领先途观（途观坐在车内感觉整车很空旷，跟坐在一幢大房子里边一样，个人不太喜欢），最后定了 X1 2.0 尊享版，至今，行驶了一万五千公里，一切体验良好，没有后悔的感觉。",
          "en": "In 2022, I test drove both the X1 and the Tiguan. The 2022 Tiguan originally had a particulate filter issue; I don't know if it still does.\nDriving experience: X1 is better than Tiguan (in the Tiguan, it feels like the whole car is very empty, like sitting in a big house, I don't particularly like it). I finally chose the X1 2.0 Enjoyment Edition. So far, I've driven 15,000 kilometers, and the experience has been good; I have no regrets."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "而且买车不应该是买你喜欢什么，而是看不喜欢的点你是否能够忍受，毕竟车至少也要开个 3 5 年，也没有十全十美的车，如果买了个十分喜欢的车，只有一个点天天怎么看怎么不顺眼，才真闹心呢。",
          "en": "Also, buying a car shouldn't be about what you like, but whether you can tolerate the things you don't like. After all, you'll be driving the car for at least 3 to 5 years, and there's no such thing as a perfect car. If you buy a car you really like, but there's only one thing you dislike, it would really bother you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既然你定了 suv ， 就 x1 2.0T ， 放心不会有人笑你的，不懂的人觉得你是宝马，不会笑 。 \r\n懂的人一看屁股知道是 2.0 也不会笑。 会笑你的人 ，你就算上 X3 也笑你为什么不是 X5 ，X5 为什么不是 X7.  X7 为什么不湾流，。。。你笑笑就行了。",
          "en": "Since you've decided on an SUV, go for the X1 2.0T. Don't worry, no one will laugh at you; those who don't know will think you have a BMW and won't laugh.\nThose who know can tell it's a 2.0 from the rear and won't laugh. Those who laugh at you, even if you get an X3, will laugh at you for not having an X5, and why not an X7? Why not a Gulfstream for the X7? ... Just laugh it off."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "X1 排除吧.",
          "en": "Exclude X1."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本田 CRV 长安 CS75Plus 丰田荣放",
          "en": "Honda CRV, Changan CS75Plus, Toyota RAV4"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@CloudMx X1 为什么排除呢？",
          "en": "@CloudMx Why exclude the X1?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "估计楼下有推荐混动或者电车的。",
          "en": "I guess there are recommendations for hybrid or electric cars below."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同考虑中，目前优先油车，次选油混加上你列的，另外考虑斯巴鲁森林人新款、福特锐界森林人比较中意",
          "en": "Also considering, currently prioritizing gasoline cars, and considering hybrid cars as the next option, in addition to the ones you listed, I'm also considering the new Subaru Forester, Ford Explorer, Subaru Forester is more appealing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "嗯，考虑购买油车，混动或者电车是不考虑在内的",
          "en": "Yes, considering buying a gasoline car, hybrid or electric cars are not being considered."
        }
      ],
      "type": "replies"
    }
  ]
}