{
  "id": 1014039,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "小米净水器是真的无语呀",
          "en": "Xiaomi water purifiers are really speechless"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我两次买小米净水器了，两次都出很多问题，没有第三次了。",
          "en": "I've bought Xiaomi water purifiers twice, and both times there were a lot of problems; there won't be a third time."
        },
        {
          "zh": "\r\n\r\n第一次买回来保修期内总是漏水，修了好多次都没解决，后面直接废弃了。",
          "en": "\r\n\r\nThe first time I bought one, it always leaked within the warranty period, and it couldn't be fixed after many repairs; I eventually discarded it."
        },
        {
          "zh": "\r\n\r\n第二次给老家买了一台新款小米的 S800G ，一年内就出现问题了，然后换了新机，现在一年后又出现问题了，机器直接不通电了，现在已经过了保修期，两千买的净水器感觉就用了两年，而且中间还买了好多次滤芯。",
          "en": "\r\n\r\nThe second time I bought a new Xiaomi S800G for my hometown, it had problems within a year. Then I replaced it with a new one, and now a year later, it has problems again. The machine doesn't power on at all. The warranty period has now expired. I bought the water purifier for two thousand, and it feels like I've only used it for two years, and I've also bought many filter cartridges in between."
        },
        {
          "zh": "\r\n\r\n后面不会再考虑小米的了，滤芯总是提醒更换，滤芯的花费都很高了，非常不值，再加上机器总是坏，夸大了呀。",
          "en": "\r\n\r\nI won't consider Xiaomi anymore. The filter always reminds me to replace it, the cost of the filter is very high, which is very unworthy. In addition, the machine always breaks down, it's an exaggeration."
        },
        {
          "zh": "\r\n\r\n我后面买了海尔的，两年换一次滤芯，还送一个，也就是 4 年才需要更换，而且没出过问题。",
          "en": "\r\n\r\nLater, I bought a Haier one, replacing the filter once every two years, and it also sends a filter, which means it only needs to be replaced every 4 years, and there have been no problems."
        },
        {
          "zh": "\r\n\r\n说说你们买过什么好用的净水器吧",
          "en": "\r\n\r\nTell me about what good water purifiers you have bought"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "自己 diy 400G ro 反渗透，每年就换几个 pp 棉，ro 膜 4 年左右换一次",
          "en": "DIY 400G RO reverse osmosis, just replace a few PP cottons every year, and replace the RO membrane about every 4 years"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "格力似乎更牛，6 年更换，保修 5 年，有用过的吗",
          "en": "Gree seems to be more awesome, 6 years replacement, 5 years warranty, has anyone used it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚装了怡口的全屋净水软水，不知道是智商税还是。。",
          "en": "Just installed the whole-house water purification and softening of E-CO, don't know if it's a tax on intelligence or.."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买的 352 ，目前没发现问题@Mryang 净水还是挺需要的，软水就看水质情况了，如果本身不硬，不装也行",
          "en": "Bought 352, haven't found any problems yet @Mryang Water purification is still quite necessary, the soft water depends on the water quality situation, if it is not hard itself, you can also not install it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买能用通用滤芯的，后期成本低。",
          "en": "Buy those that can use universal filter cartridges, and the later cost will be low."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正准备买小米的净热一体呢....G1000",
          "en": "I'm preparing to buy Xiaomi's water purification and heating integrated machine...G1000"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "顺便求推荐别的厨下净热一体，要求流量大无水箱温度达标",
          "en": "By the way, I would like to recommend other under kitchen water purification and heating integrated machines, requiring large flow and standard tankless temperature"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买的史密斯旗下的佳尼特，就定期换滤芯，四五年了没啥问题。",
          "en": "Bought Canature under Smith, just replace the filter regularly, and there have been no problems for four or five years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买的红嘴鸟的，用着还行，没出过啥岔子，滤芯不算贵之前看哪家的评测，说 98% 脱盐率的滤芯在过了 6 吨水之后就只有 92% 了，感觉滤芯这东西还是换勤点好",
          "en": "Bought Hongzuiniao's, it works well, and there haven't been any problems. The filter cartridge isn't expensive. I saw a review before, saying that the filter cartridge with 98% desalination rate is only 92% after 6 tons of water. I feel that the filter cartridge should be replaced more frequently"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "运气有点差啊，我这小米净水器两年了还可以",
          "en": "My luck is a bit bad, my Xiaomi water purifier has been working well for two years"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "粗粮的东西就是总有些小毛病，以前买过小米净水接头那里漏水，网上搜了一下好像是普遍问题，搬家后索性加钱买溢泰图省心了。",
          "en": "Coarse food products always have some small problems. I had a Xiaomi water purifier before, and the joint leaked. I searched online and it seemed to be a common problem. After moving, I simply paid extra to buy Yitai to save trouble."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "云米代工的，我的好久以前一款也坏了，现在买美的了，美的做白电小家电厨电应该是更好的",
          "en": "Yunmi is OEMing. My old model broke a long time ago, now I buy Midea, Midea should be better at white appliances, small appliances, and kitchen appliances"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gbw1992 #10 这不是运气了，是每次都坏很多次，这就是质量问题了",
          "en": "@gbw1992 #10 This is not luck, it breaks many times every time, this is a quality problem"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ltyj2003 #4 通用的不太会弄，也不想自己去弄，所以就图个省心了",
          "en": "@ltyj2003 #4 I don't know how to use the universal ones, and I don't want to do it myself, so I just try to save trouble"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一通电，滤芯的寿命就开始倒计时了，不管有没有过滤水，他们不是按照滤水量来计算的，买个 tds 检测笔，大于 4,50 了再换",
          "en": "Once powered on, the life of the filter cartridge starts counting down, regardless of whether the water is filtered or not. They don't calculate it by the amount of water filtered. Buy a TDS detection pen, and replace it when it's greater than 4,50"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上一个美的用了 6 ～ 7 年，几个月前换了京造的。",
          "en": "The previous Midea one was used for 6-7 years, and a few months ago I replaced it with Jingzao's."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得正常 本身就不是专业  能投入多大成本去搞没成本  产品还不是能用就行如果是复杂产品 + 不专业 = 格力手机",
          "en": "I think it's normal. It's not professional anyway. How much cost can be invested to do it? There's no cost. It's okay if the product works. If it's a complex product + unprofessional = Gree phone"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用水多换滤芯多很正常，换的少才不正常。",
          "en": "It's normal to change filters frequently with more water usage, it's not normal to replace them less."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个有点不太正常吧，我家装两个了，都用了快 6 年了，一直没啥问题，最近主要就是电机声音响，但还好；小米滤芯是按通电时间计算的，所以不要按它提醒那个来换，如果它老是提醒可以重置一下（把滤芯拿出，然后按新滤芯的过程再装回去它就会认为你换滤芯了），定时注意它那个 TDS 值就好，不放心再买一个检测笔。",
          "en": "This is a bit abnormal, I have installed two at home, they have been used for almost 6 years, and there have been no problems. Recently, the main problem is that the motor noise is loud, but it's okay; Xiaomi filter cartridges are calculated by the power-on time, so don't replace them according to its reminder. If it always reminds you, you can reset it (take out the filter cartridge, and then install it back according to the process of a new filter cartridge, it will think that you have replaced the filter cartridge), just pay attention to the TDS value regularly, and buy a detection pen if you are not sure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Huelse 小米的净水器（现在的不清楚），3 年前的都是按通电时间来算更换周期，和水量没关系，特别奇葩；我开始还按它的设置来换，后来发现 TDS 在更换前也没啥变化啊，才自己开始按大致时间来弄。",
          "en": "@Huelse Xiaomi's water purifier (I'm not sure about the current ones), the ones 3 years ago were all calculated by the power-on time to calculate the replacement cycle, and it has nothing to do with the amount of water, which is very strange; I started to replace them according to its settings, but later I found that the TDS didn't change much before replacement, so I started doing it myself according to the approximate time."
        }
      ],
      "type": "replies"
    }
  ]
}