{
  "id": 1018509,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "新手 2 个月 2K 多公里，什么时候可以独自上高速",
          "en": "New driver, 2 months, over 2,000 kilometers. When can I drive on the highway alone?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "驾照 19 年 10 月拿的，中间用共享汽车租赁用过 2 次练习。然后 12 月中旬提的车，但上下班没开，就周末开一下。目前为止跑了 2500 左右，大部分是国道（广深、北环、107 这些）。\r\n\r\n现在一个人开基本没问题，但还没有一个人上过高速（春节的时候姐夫在旁边来回走过高速，不过单程只有 30 多公里，没有变道什么的）。\r\n\r\n平时抖音上刷事故教学视频比较多，练习开车习惯和意识，现在就是转弯还是要减速，变道要很长距离才敢，以及路口还是走得少（特别是高速下面的国道和主干道路口，好几个分叉的那种，走错过好几次，还要变道什么的很怕，不过现在还好），加减速偶尔会踩刹车。\r\n\r\n平时习惯就是国道提前提前 2 公里变最右道，500 米左右变道准备下，以及如果不是前面有特别慢的车（限速内的）比较少变。\r\n\r\n请教下老司机的各位，什么时候可以独自上高速？以及我这种情况需要注意啥。",
          "en": "I got my license in October 2019 and practiced twice using shared car rentals. Then I got my own car in mid-December, but didn't drive it to work, only on weekends. So far, I've driven about 2500 km, mostly on national highways (Guangzhou-Shenzhen, North Ring, 107, etc.).\r\n\r\nNow, I'm basically fine driving alone, but I haven't driven on the highway alone yet (during the Spring Festival, my brother-in-law drove on the highway with me, but it was only about 30 kilometers each way, without changing lanes, etc.).\r\n\r\nI usually watch a lot of accident tutorial videos on Douyin to practice driving habits and awareness. Now, I still need to slow down when turning, I only dare to change lanes with a long distance, and I still don't drive much at intersections (especially the intersections of national highways and main roads below the highway, the ones with several forks, I've gone the wrong way a few times, and I'm afraid of changing lanes, but it's okay now), and I occasionally step on the brakes when accelerating and decelerating.\r\n\r\nMy usual habit is to change to the rightmost lane 2 kilometers in advance on national highways, prepare to change lanes about 500 meters in advance, and rarely change lanes unless there are particularly slow cars (within the speed limit) in front of me.\r\n\r\nI would like to ask the experienced drivers, when can I drive on the highway alone? And what should I pay attention to in my situation?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我的感受是高速是最好开的。",
          "en": "My feeling is that highways are the easiest to drive on."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我拿照早，买车的时候早满半年了，提车后开了没 300km 就上高速开了。1 主要注意先把车辆主要功能用熟练，油门刹车转向雨刮之类。2 有 etc 最好，没有的话拿卡交卡的时候手别抖，掉了会很尴尬。3 新手请避开高峰期上高速，方便自己，也方便他人。4 汇入主路的加速车道是用来加速的，请［地板油］提速到主路车流速度再并入。5 高速上请尽可能按限速上限跟上车流开，不要开慢车，和车流的相对速度越大越危险。6 避免和左右车辆并排，加速超过去，或者减速去右边车道。7 开导航，下高速提前变道，车少 1km,车多 2km ，进匝道前不用过分减速，进匝道再刹车。",
          "en": "I got my license early and I'd had my car for more than six months when I bought it. I drove on the highway after only 300km of driving after getting the car. 1. Pay attention to mastering the main functions of the vehicle, such as the accelerator, brakes, steering, and wipers. 2. It's best to have ETC. If not, don't shake your hands when getting or handing over the card, it will be embarrassing if you drop it. 3. Beginners should avoid driving on the highway during peak hours, for your own convenience and the convenience of others. 4. The acceleration lane to merge into the main road is for accelerating. Please accelerate [full throttle] to the speed of the main road traffic before merging. 5. Please drive on the highway as close to the speed limit as possible, and don't drive slowly. The greater the relative speed with the traffic flow, the more dangerous it is. 6. Avoid driving abreast with vehicles on either side, either accelerate to overtake, or decelerate to move to the right lane. 7. Use navigation, change lanes in advance when exiting the highway, 1km if there's less traffic, 2km if there's more traffic, and don't decelerate excessively before entering the ramp, brake when entering the ramp."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一堆人说高速好开的都没有意识到高速的难度在哪里。在非高峰期高速上很多都是大直道，没什么人，当然好开没什么难度。高速的难度在于车多的时候，车多且速度快（大于 80 ），车辆前后距离近，离远了容易被加塞。这种情况是最容易出车祸的。这种路是相对难开的。另外一种高速上容易出问题的路就是快变慢，比如车道收窄，或者前方拥堵，需要迅速减速，这种需要驾驶人提前预判路况。po 主应该选择多开你们城市的主干道，比如在深圳的话，就是滨海大道，高峰期。注意不是堵车时候，而是高峰期。车辆很密，都是在八九十的车速。这种路你开个一周，你上高速就没问题。",
          "en": "Many people who say highways are easy to drive on don't realize where the difficulty lies. During off-peak hours, there are many straight roads on the highway, with few people, so of course it is easy to drive. The difficulty of the highway lies in the peak hours when there are many cars, and the speed is fast (greater than 80), the distance between vehicles is close, and it is easy to be cut in if you are too far away. This situation is the most prone to accidents. This kind of road is relatively difficult to drive. Another type of road on the highway that is prone to problems is going from fast to slow, such as lane narrowing, or congestion ahead, which requires rapid deceleration, this requires the driver to predict the road conditions in advance. The OP should choose to drive more on the main roads of your city, such as Binhai Avenue in Shenzhen, during peak hours. Note that it's not during traffic jams, but during peak hours. The vehicles are dense, and the speed is around eighty or ninety kilometers per hour. If you drive on this road for a week, you will have no problem on the highway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拿证八个月 就独立夜间跑高速 350km 路过（不建议实习期独立跑高速）个人见解保持安全车距，后视镜多观察（左右，车内），敢踩油门，不建议长时间占最左侧车道，远离大车，不要跟大车后面及大车前慢悠悠，接近出口提前变道，错过出口就继续往前走好了，安全更重要",
          "en": "I got my license eight months ago and independently ran 350km on the highway at night (I don't recommend running on the highway independently during the probationary period). My personal opinion is to maintain a safe distance, observe the rearview mirrors frequently (left, right, and inside the car), dare to step on the accelerator, do not occupy the leftmost lane for a long time, stay away from large vehicles, do not follow large vehicles closely or slowly in front of them, change lanes in advance when approaching the exit, and just continue to go forward if you miss the exit, safety is more important."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开导航，高速比国道还好开",
          "en": "With navigation, highways are easier to drive on than national highways."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高速上注意点：1 ，不要龟速行驶2 ，不要压人车头超车3 ，匝道入主道要先提速4 ，下高速提前 2km 变道",
          "en": "Points to note on the highway: 1. Do not drive at a snail's pace 2. Do not overtake by cutting in front of other cars 3. Accelerate first when entering the main road from the ramp 4. Change lanes 2km in advance when exiting the highway"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 远离货车尽快加速超过2. 变道头要回头看下盲区，视线别停留速度要快3. 多看内后视镜，对自己前后车辆数量和距离有个大概信息4. 不要并排行驶5. 保持车距，车特别多的时候遇到突然降速或堵车的时候打开双闪提醒后车减速，今年春节高速看到很多车没刹住追尾的6. 天气不好大风/雨/雾/雪开雾灯慢开7. 遇到紧急情况不要踩死刹车猛打方向",
          "en": "1. Stay away from trucks and accelerate to overtake as quickly as possible 2. Turn your head to look at the blind spot when changing lanes, and do not stay in it for too long, the speed must be fast 3. Look at the inner rearview mirror more often to get a general idea of the number and distance of vehicles in front and behind you 4. Do not drive abreast 5. Maintain a safe distance, and turn on the hazard lights to remind the vehicles behind you to decelerate when you encounter a sudden deceleration or traffic jam when there are many vehicles. This year during the Spring Festival, I saw many cars that couldn't brake and rear-ended 6. When the weather is bad, such as strong wind/rain/fog/snow, turn on the fog lights and drive slowly 7. Do not slam on the brakes and violently turn the steering wheel in case of emergencies"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过年刚好单人跑过 1600km ，上路一年，分享一下。1. 调整心态，首先不要怕，刚开始开肯定紧张，但这也是好事，第一次跑 100-200 公里就需要休息缓解一下，适应一下节奏。和自己的车熟悉在高速下的状态。2. 新手最容易犯得错就是摸不准速度，比如匝道汇入主路有来车，所以提前打灯告诉别人你要变道。汇入后尽量往左侧 12 车道变道，34 车道一般都是大车，开得比较慢，和你有速度差， 你容易追尾。3. 不要盲目变道。 如果跟车距离合适，没有占用快车道，（刚开始在高速还是开左侧第二车道，慢一点也没人说你什么），非必要不变道。变道就是成本+风险。4. 学会跟车。不会开就跟着别人学，开车就是个熟能生巧的事情，刚开始不知道前车什么水平，跟多了就慢慢知道前车开得好不好，你慢慢也就摸索出来了。5. 学会发信号灯。 高速上车速比平常要快得多， 所以不要一打灯就变道，最好能让你周围的所有车都知道你要干什么，三秒左右再变道。跟车时候前车高位刹车灯亮，跟着轻点你的刹车，就算是没必要，也要让后车知道。防御性驾驶算是比较高阶了。6. 将路上所有的车都视为傻逼，保持平和心态，胆大心细。最主要的一点，保持车距。 更长的距离对你来说更多的反应时间，你有更多可以操作的空间。",
          "en": "I just drove 1600km alone during the Spring Festival, and I've been driving for a year. Let me share some tips. 1. Adjust your mindset, first of all, don't be afraid. It's definitely nerve-wracking when you first start driving, but that's a good thing. You need to rest and relieve stress after driving 100-200 kilometers for the first time, and adapt to the pace. Get familiar with the state of your car on the highway. 2. The most common mistake for novices is that they can't grasp the speed. For example, when merging from a ramp onto the main road, there are oncoming vehicles, so signal in advance to tell others you want to change lanes. After merging, try to change lanes to lanes 1 and 2 on the left. Lanes 3 and 4 are generally for large vehicles, which drive slowly and have a speed difference with you. You are prone to rear-ending. 3. Don't change lanes blindly. If the following distance is appropriate and you are not occupying the fast lane (in the beginning, it's better to drive in the second lane on the left on the highway, no one will say anything if you drive a little slower), don't change lanes if it's unnecessary. Changing lanes is cost + risk. 4. Learn to follow cars. If you don't know how to drive, follow others to learn. Driving is something that you get good at with practice. At first, you don't know the level of the car in front, but as you follow more, you will gradually know whether the car in front is driving well, and you will gradually figure it out. 5. Learn to signal. The speed on the highway is much faster than usual, so don't change lanes as soon as you turn on your signal lights. It's best to let all the cars around you know what you are going to do, and then change lanes after about three seconds. When following a car, the high-mounted brake light of the car in front lights up, lightly tap your brakes, even if it's unnecessary, you should also let the vehicles behind you know. Defensive driving is considered to be a more advanced skill. 6. Regard all the cars on the road as idiots, maintain a peaceful mindset, be bold and careful. The most important point is to maintain a safe distance. A longer distance gives you more reaction time, and you have more room to operate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高速车少距离远，潜在的危险比市区道路少很多。 比较麻烦的就是开慢车会让车流堆积，所以现在告诉比较危险的有两种，一个是开 S 车的，一个就是开慢车的。相对来说，开慢车比较恶心，只需要三四辆车就可以让一段高速跑不起来。",
          "en": "There are fewer cars and longer distances on the highway, so the potential dangers are much less than on urban roads. The more troublesome thing is that driving slowly will cause traffic congestion, so the two most dangerous types of drivers are those who drive in an S-shape and those who drive slowly. Relatively speaking, driving slowly is more annoying, and only three or four cars can make a section of the highway unable to run."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高速相比较市内是好开的，速度只要你别在最里车道开个 60,70 就行，最快速度自己把控，新手别超 140 ，稳定 120 最好，变道看后视镜，后车在镜子里后半部分先打转向灯，小幅度转方向盘，让车子平缓切换车道还有就是保持车距，心态要好，稳定自己速度，不开气车，不压车速，别管别人滴不滴你，只要不是特别慢，稳定自己就好",
          "en": "Highways are easier to drive on than in the city. As long as you don't drive at 60 or 70 in the innermost lane, control your own maximum speed, and don't exceed 140 for new drivers, it's best to maintain a stable speed of 120. When changing lanes, look at the rearview mirror, and signal first in the second half of the mirror. Turn the steering wheel slightly to make the car smoothly change lanes. Also, maintain a safe distance, have a good mentality, stabilize your speed, don't drive aggressively, don't suppress your speed, don't care if others honk at you, as long as you're not too slow, just keep yourself stable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "24.02.01 拿的证，已经开了 550km 高速，300+城区，坐标广州，高速都是老司机坐副驾驶。老司机告诉我上高速：1. 不要赖在最左最右，这两条车道有人超车2. 不要和别的车并排，尤其是大货车。遇见相邻车道有大货车，你前面有车就放一下车速等前车超过大货车直到有跟车距离够你超过大货车以后还能保持安全车距就果断加速超大货车3. 你在跟车的时候尽量注意不要扎堆，可能跟别的车不是并排的，但是前面路况很好，就你附近几台车扎堆在跑，果断要超车到前面去，万一扎堆的车里有车急刹，反应慢的都得中招4. 提前变道，不要跨 1 条以上车道变道，老实点，保护自己，别害人。遇到右侧有车辆汇入导航提示（有出口提示，基本路过出口就是汇入入口），提前变道左侧两车道，很多车汇入主路速度提不起来(可能不是司机不想提速，是车提速慢)5. 佛系一点，20 几年老司机和我说路怒没用，因为除了无能狂怒你什么都做不了，骂两句就算了，放轻松点，起点到终点，安全第一",
          "en": "I got my license on 2024-02-01, and I've driven 550km on the highway and 300+km in the city. The location is Guangzhou, and an experienced driver always sits in the passenger seat on the highway. The experienced driver told me about driving on the highway: 1. Don't stay in the leftmost or rightmost lanes, there are people overtaking in these two lanes 2. Do not drive abreast with other cars, especially trucks. If there is a truck in the adjacent lane, and there is a car in front of you, slow down and wait for the car in front to overtake the truck until there is enough distance for you to overtake the truck and still maintain a safe distance, then decisively accelerate to overtake the truck 3. When you are following a car, try not to bunch up, it may not be driving abreast with other cars, but the road conditions ahead are very good, and only a few cars near you are bunched up, you must decisively overtake and go ahead, in case a car in the bunch brakes suddenly, those with slow reactions will get hit 4. Change lanes in advance, do not change lanes across more than one lane, be honest, protect yourself, and don't harm others. When the navigation prompts that there are vehicles merging from the right (there is an exit prompt, and basically passing the exit is the entrance for merging), change lanes to the two lanes on the left in advance, many cars cannot speed up when merging into the main road (maybe not because the driver does not want to speed up, but because the car accelerates slowly) 5. Be more Buddhist, an experienced driver with more than 20 years of experience told me that road rage is useless, because you can't do anything except ranting pointlessly, just curse a few words, relax, safety first from the starting point to the end point"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你能问一下就说明你已经可以上高速了。别并排，并排靠右侧。别太有同理心，占在右侧开六十都不要怕。超车坚决点，别来回晃。看见明显鲨臂的车要尽快远离，任何车型。注意隧道，很多傻子看见隧道就是一脚刹车，注意追尾。",
          "en": "The fact that you are asking this question means that you can already drive on the highway. Don't drive abreast, drive abreast on the right side. Don't be too empathetic, don't be afraid to drive at sixty in the right lane. Be decisive when overtaking, don't sway back and forth. Stay away from obviously dangerous cars as soon as possible, of any type. Pay attention to tunnels, many fools will brake when they see a tunnel, and watch out for rear-end collisions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没啥需要担心的，贴好实习贴。高速走外侧道路，少占用快车道，变道先打灯观察后再操作。碰见闸道口，默认脚放刹车上，开个 90-100 码没啥问题。担心速度快自己掌握不好的，平时在市内环线找个 80 多路段开个几次就行。",
          "en": "There is nothing to worry about, put on the learner driver sticker. Drive on the outer lanes of the highway, occupy the fast lane less, change lanes after signaling and observing first. When you encounter a ramp, put your foot on the brake by default, and it's no problem to drive at 90-100 mph. If you are worried that you can't control the speed well, find a section of the inner ring road with a speed limit of over 80 and drive it a few times."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.不要龟速行车，两车道去右边车道，但是要记得和大车拉开距离，至少 200 米以上，三车道可以尝试中间车道，四车道二三都行2.不要并排行车，超不过去就减速让人家先走3.眼光放远一点，不要盯着前面路面看，有突发情况即时反应4.多注意看看后视镜，变道前留足时间打转向灯，不要刚打完灯就变道，打完灯再看一次后视镜确定没车再变道，防止快速左右穿梭车辆突然出现5.下匝道提前 2km 向右变道，不要到了匝道口再出去6.高速开车放松一点，相比来说比国道省道好开。7.多练，熟能生巧，说的再多还不如出去多开开",
          "en": "1. Do not drive at a snail's pace. For two-lane highways, choose the right lane, but remember to keep a distance from large vehicles, at least 200 meters or more. For three-lane highways, you can try the middle lane, and for four-lane highways, lanes two and three are both fine 2. Do not drive abreast. If you can't overtake, slow down and let the other person go first 3. Look further ahead, do not stare at the road surface in front of you, react immediately to unexpected situations 4. Pay more attention to the rearview mirror, leave enough time to turn on the turn signal before changing lanes, do not change lanes as soon as you finish turning on the signal, look at the rearview mirror again after turning on the signal to make sure there are no cars before changing lanes, to prevent vehicles that are quickly weaving left and right from suddenly appearing 5. Change lanes to the right 2km in advance when exiting the ramp, do not go out until you reach the ramp exit 6. Relax a bit when driving on the highway. Compared to national and provincial highways, it is easier to drive. 7. Practice more, practice makes perfect. Talking more is not as good as going out and driving more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你的路线和我刚提车的路线差不多就是走广深、北环，开了 1000 多公里，过年开回家了单程 1200 公里，一个人开了 26 个小时。走广深练车推荐早上 7 点 40 ～ 8 点出发 接近北环 8km 左右的时候 工作日几乎都会有 5km 拥堵 提前熟悉堵车的时候怎么开 回程 7 点出发上北环左转进入必堵再就是多练习过隧道(只有广东的隧道是有灯的 其他省份的灯很小) 上下闸道(导航说多少车速就开多少)最后自己不确定自己能不能上高速，带个老司机上高速，你开完让他评价，我刚提车的时候就是请我同事吃晚饭，和我一起练车，我再把他送回家。",
          "en": "Your route is similar to the route I took when I first got my car, which is to drive the Guangzhou-Shenzhen and North Ring roads. I have driven more than 1000 kilometers, and I drove 1200 kilometers one way to go home during the Spring Festival, and I drove for 26 hours alone. I recommend driving the Guangzhou-Shenzhen line for practice, departing around 7:40～8:00 am. There is almost always a 5km traffic jam on weekdays when you are about 8km near the North Ring. Get familiar with how to drive in traffic jams in advance. Depart at 7:00 pm on the return trip, enter the North Ring and turn left, which is a must-jam. Also, practice going through tunnels (only the tunnels in Guangdong have lights, the lights in other provinces are small) and going on and off the ramps (drive at whatever speed the navigation says). Finally, if you are not sure if you can drive on the highway yourself, take an experienced driver on the highway, and have him evaluate you after you drive. When I first got my car, I invited my colleague to dinner and practiced driving with me, and then I took him home."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "考取驾照满 6 个月，即可独自上高速。不满 6 个月的，需有满 6 个月的司机随车。",
          "en": "You can drive on the highway alone after holding your driver's license for 6 months. If you have held your license for less than 6 months, a driver with a license for over 6 months must be in the car with you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xuanbg #2 这个知道啊。我的意思是我个人上高速，需要注意什么",
          "en": "@xuanbg #2 I know that. My point is what should I pay attention to when I drive on the highway myself?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SpacePig #1 但是速度还是控制不好，而且太快了自己感觉控制不住。",
          "en": "@SpacePig #1 But I still can't control the speed well, and I feel like I can't control it when it's too fast."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我买车了，就在市区跑了两三次就上高速了，变道没什么可怕的，打灯，加速变道，注意后视镜有没有车就行了，高速上的弯道一般都不急，只有那种匝道上的弯可能比较急，感觉快了就减减速呗，市区 国道 乡道 高速我都经常开，我反正是觉得每次开高速是最轻松的，高速危险的点就是速度过快，所以要保持安全距离，感觉近了就松松油门减速啥的，然后还有一点万一遇到什么考验就是驾驶员的眼疾手快了，开高速就保持精神高度集中。跑几次就熟了。",
          "en": "I bought a car and drove on the highway after only two or three times driving in the city. There's nothing scary about changing lanes, signal, accelerate to change lanes, just pay attention to whether there are any cars in the rearview mirror. The curves on the highway are generally not sharp, only the curves on the ramps may be sharper, just slow down if you feel like it's too fast. I often drive in the city, on national highways, on rural roads, and on highways. I always feel that driving on the highway is the most relaxing. The dangerous point on the highway is excessive speed, so maintain a safe distance, and slow down by releasing the accelerator if you feel like it's close, and then another point is that the driver's quick eyes and hands are tested in case of emergencies, and just keep a high degree of mental concentration when driving on the highway. You'll get used to it after a few runs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kuicc1987 跑直线画龙，车道偏离预警及时提醒；踩油门把握不好粒度，打开限速；如果感觉 80 码控制不住车，还是多跑跑室内高架叭，夜间高架车不多，压着限速多跑跑，找找车感。我第一次上高速前，连着跑了好几晚中环，几圈下来，对车况、路况的感知上一个大台阶",
          "en": "@kuicc1987 If the car weaves during straight-line driving, lane departure warning can remind you in time; if you can't grasp the granularity when stepping on the accelerator, turn on the speed limiter; if you feel like you can't control the car at 80 kph, run more on the indoor overpasses, there are not many cars on the overpasses at night, run more while pressing on the speed limit, and find the feeling for the car. Before I drove on the highway for the first time, I ran on the Middle Ring Road for several nights in a row, and after several laps, my perception of the car's condition and road conditions took a big step up."
        }
      ],
      "type": "replies"
    }
  ]
}