{
  "id": 1016734,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "2024 年，是不是学自动档就行了？",
          "en": "In 2024, is it okay to learn only automatic transmission?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "媳妇一直劝我学手动档，我寻思今年下半年买车肯定是买自动档，而我学得手动档，那岂不是还要转换思路和肌肉记忆，而且之后不开手动档的车的话慢慢就会忘了离合的半联动感觉还有挂档手法，我觉得没必要，我的想法正确不？\r\n\r\n另外求推荐学车视频，我现在在 B 站看超英和老胡的，觉得收获不少，新手学车还是要记几个点位的。",
          "en": "My wife has been urging me to learn manual transmission. I figure I'll definitely buy an automatic car in the second half of this year. If I learn manual, wouldn't I have to switch my thinking and muscle memory? Furthermore, if I don't drive manual cars afterwards, I'll slowly forget the feeling of clutch half-engagement and the gear-shifting technique. I think it's unnecessary. Is my thinking correct?\r\n\r\nAlso, I'm looking for recommended driving school videos. I'm currently watching videos by 超英 and 老胡 on Bilibili (B station) and feel I've gained a lot. Beginners still need to remember a few key points."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@hanssx 相信我，等到真有那种需要你开手动挡的时刻，你也早都忘干净了。自动挡",
          "en": "@hanssx Believe me, by the time you really need to drive a manual transmission car, you'll have forgotten everything. Automatic transmission"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自动完全够用，但还是建议学手动，因为成本不高（学习难度大不了多少），收益高（能开房车、皮卡、面包车，对汽车基本原理也更容易理解，感觉上也稍稍比 C2 帅一丁点）",
          "en": "Automatic is perfectly sufficient, but I still recommend learning manual because the cost is not high (the learning difficulty is not much greater), and the benefits are high (you can drive RVs, pickups, and vans, and you can understand the basic principles of the car more easily, and it feels slightly cooler than C2)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是的，只学自动",
          "en": "Yes, only learn automatic."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年轻就手动挡，混个资格而已，想那么多干嘛。其实手动挡也不难的另外学车看视频....直接开就行，点位只在初期有用，你要的是车感。所谓车感就是这个车的半离合点，倒腾时车头，屁股的位置，整个车是正的还是斜的，有多斜等等。开多了就有感觉。刚开始的时候，看到点位到了，就要体会下车子是怎么样一个姿势和位置，看三个镜子 ，最好下车看看。多体会就行。最忌讳看视频死记点位。结果就变车你坐在一个壳子里用方向盘去把两个点对起来。换个车，或者场地，立马歇菜",
          "en": "If you're young, go for manual transmission, just to get the qualification, why think so much? Actually, manual transmission isn't that difficult. Also, when learning to drive, watch videos... just drive. The key points are only useful in the initial stage; what you need is a feel for the car. The so-called feel for the car is the half-clutch point of this car, the position of the front and rear of the car when maneuvering, whether the whole car is straight or tilted, and how tilted it is, and so on. You'll get the feel after driving more. In the beginning, when you see that the key point is reached, you need to experience what kind of posture and position the car is in, look at the three mirrors, and it's best to get out of the car and take a look. Just experience more. The most taboo thing is watching videos and memorizing the key points. As a result, you become a car, sitting in a shell and using the steering wheel to align two points. Change the car or the venue, and it will immediately fail."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "历史已经给出了答案, 100 多年前, 马车 到 汽车的过度期, 一定会有人犹豫过 学什么车",
          "en": "History has already given the answer. More than 100 years ago, during the transition from horse-drawn carriages to cars, surely some people hesitated about what kind of car to learn."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "肯定还是学 C1 撒，  学 C1 兼容 C2 。",
          "en": "You should definitely learn C1, because C1 is compatible with C2."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是的，没必要。除非特定场景，比如工作需要开车，但公司只有手动挡的老破车。不然基本用不上。但手动挡好玩，而且你以后也用不到，何不用这个机会学着玩玩。而且考试也不会难到哪去。甚至很多驾校手动挡的培训费都比自动挡便宜。当然你要是对这些东西完全没兴趣，平时也不玩赛车游戏，就是学个技能，那就直接自动挡吧。",
          "en": "Yes, it's not necessary. Unless in specific scenarios, like you need to drive for work, but the company only has old, broken manual transmission cars. Otherwise, you basically won't use it. But manual transmission is fun, and you won't need it in the future, so why not take this opportunity to learn it for fun? And the exams won't be that difficult. Even the training fees for manual transmission at many driving schools are cheaper than automatic transmission. Of course, if you have absolutely no interest in these things, and you don't play racing games, and you just want to learn a skill, then just go for automatic transmission."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "学自动挡，因为你买不到手动档的车了，不要听什么丢人的话，开在路上鬼晓得你是 C2",
          "en": "Learn automatic transmission, because you can't buy cars with manual transmission anymore. Don't listen to what people say about it being embarrassing; who knows you're C2 when you're driving on the road?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "曾经也不想开手动挡，但是后来开多了，本来打算 11 代思域手动，brz 手动，无奈妥协换了个自动挡车，开着是真的没意思，现在还是喜欢手动挡，听说 dq381 可以无损移植 mq350",
          "en": "I didn't want to drive a manual transmission car either, but after driving it more, I originally planned for a 11th generation Civic manual and a BRZ manual. Unfortunately, I had to compromise and switch to an automatic car. It's really boring to drive. I still like manual transmission now. I heard that dq381 can be transplanted to mq350 without damage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "布鲁斯学的是 C1",
          "en": "Bruce learned C1."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@brom111 我去年也在杭州报了，这个看教练的，有的教练坑得很。。",
          "en": "@brom111 I also signed up in Hangzhou last year. It depends on the coach; some coaches are very bad..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以不用但不能没有",
          "en": "You may not need it, but you can't not have it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不知为什么，我周围只见过嫌弃自动挡太“低端”的男的，还从没见过主动想学自动挡的",
          "en": "I don't know why, but I've only seen men around me who dislike automatics for being too \"low-end,\" and I've never seen anyone actively want to learn automatic."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "夫人要你学手动档的原因是什么？",
          "en": "What's the reason your wife wants you to learn manual transmission?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说起来我也打算学自动挡。 在杭州看了几个驾校，看着都头疼",
          "en": "Speaking of which, I also plan to learn automatic transmission. I've looked at a few driving schools in Hangzhou, and it's all a headache."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们这自动挡比手动挡贵 200",
          "en": "Automatic transmission is 200 yuan more expensive than manual transmission here."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你自己，C1 的好处是以后实在没工作了，还能买个便宜的手动挡小货车拉货。还有驾照都是死记硬背，记住教练说的点就行，别有太多想法。",
          "en": "It depends on you. The benefit of C1 is that if you really lose your job in the future, you can still buy a cheap manual transmission small truck to haul goods. Also, driving licenses are all about rote memorization; just remember the points the coach tells you, don't have too many thoughts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "新能源车还有档么？现在哪怕去租车都是自动档",
          "en": "Do new energy vehicles still have gears? Nowadays, even when renting a car, it's automatic."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我去年开始学驾照，主要是考虑到后面自己买车肯定只买自动挡（现在手动挡好像主要是豪车了？），就学自动挡了，省事以后万一真有长期开手动挡车的需求，再去学个手动挡就好了",
          "en": "I started learning my driver's license last year. Mainly considering that I will definitely only buy automatics in the future (manual transmissions seem to be mainly luxury cars now?), so I learned automatic transmission. It's more convenient, and if I really have the need to drive manual transmission cars for a long time in the future, I can learn manual transmission again."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@naminokoe 她是想让我学个手动档以防万一遇到手动档的车，让我开，她自己学自动档，听着好像合理，但是没必要？",
          "en": "@naminokoe She wants me to learn manual transmission in case I encounter a manual car and she wants me to drive it, while she learns automatic transmission. It sounds reasonable, but is it unnecessary?"
        }
      ],
      "type": "replies"
    }
  ]
}