{
  "id": 1015980,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "30 了，还要出去工作吗",
          "en": "30, still want to go out to work?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "背景：\r\n今年 30 ，普通二本工科男，毕业后在老家(江苏五线小城市)的合资小工厂做工程师，第八年了，855 ，一年 10w 出头，工作压力不大，但是升职也基本无望。\r\n\r\n其实可以一直干下去，但是近些年来公司产品竞争力越来越低(国产竞品越来越多)，再加上大环境不好，公司很明显在走下坡路了。\r\n\r\n从去年年底就想换工作，由于在合资企业干活，跟外企同事打交道多了，已经接受不了私企卷的的工作氛围了，只想找外资企业了。但是五线城市，本来就没多少企业，何况外资，要找也只能找去临近的城市找。\r\n\r\n正好今年过年走亲戚，我老婆的一表哥在无锡一外企做销售小领导，是一家 500 强制造企业。我看那家企业正好也招和我专业差不多的岗位，待遇比我现在可能多 2 ，3 万， 他说如果我想去可以给我帮帮忙。让我考虑好了年后给他答复。\r\n\r\n面临的问题：\r\n最大的问题是我老婆在本地政府事业编，就算我以后在无锡买了房，她也不太可能放弃事业编过来。这样我只能是每周末回家，高速一个半小时到家。如果扣掉房租和通勤费用，等于收入没涨。而且目前还没有小孩，长期两地分居，对子女教育是大问题。\r\n\r\n我的顾虑是已经 30 岁了，后面换工作只会越来越难。现在又正好有个合适的外企不错的机会，过去对个人发展肯定有帮助。而且我现在公司的产品非常小众，过去积累的大部分都是行业内知识，如果等公司不行再想转其他行业就很那难了。\r\n\r\n我老婆是建议我去，她认为只要工资高，分居无所谓。父母不建议我去，他们就想我在本地安安静静的混下去就行了…",
          "en": "Background:\r\nThis year is 30, an ordinary second-tier engineering male, after graduation, I worked as an engineer in a joint venture small factory in my hometown (a fifth-tier small city in Jiangsu). It's been the eighth year, 855, over 100,000 a year. The work pressure is not high, but there is basically no hope of promotion.\r\n\r\nIn fact, I can keep going, but in recent years, the company's product competitiveness has been getting lower and lower (more and more domestic competitors). In addition, the general environment is not good, and the company is obviously going downhill.\r\n\r\nI wanted to change jobs since the end of last year. Because I work in a joint venture, I have interacted with colleagues from foreign companies a lot, and I can no longer accept the working atmosphere of private companies. I only want to find a foreign company. But in a fifth-tier city, there are not many companies to begin with, let alone foreign companies. If I want to find one, I can only go to a nearby city.\r\n\r\nDuring the Chinese New Year this year, I visited relatives. My wife's cousin is a small sales leader in a foreign company in Wuxi, which is a Fortune 500 manufacturing company. I saw that the company happened to be recruiting a position similar to my major, and the salary might be 20,000 to 30,000 more than mine now. He said that he could help me if I wanted to go. Let me consider it and give him an answer after the New Year.\r\n\r\nProblems faced:\r\nThe biggest problem is that my wife is in a local government public institution. Even if I buy a house in Wuxi in the future, it is unlikely that she will give up her public institution to come over. In this way, I can only go home every weekend, and it takes an hour and a half to get home by highway. If the rent and commuting expenses are deducted, it is equivalent to no increase in income. And there are no children yet, and long-term separation will be a big problem for children's education.\r\n\r\nMy concerns are that I am already 30 years old, and it will only become more and more difficult to change jobs in the future. Now there is a suitable and good opportunity in a foreign company, which will definitely help my personal development. Moreover, the products of my current company are very niche, and most of the knowledge accumulated in the past is industry-specific. If I want to switch to other industries after the company fails, it will be very difficult.\r\n\r\nMy wife suggests that I go. She thinks that as long as the salary is high, it doesn't matter if we live apart. My parents don't recommend me to go. They just want me to live a quiet life here..."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你老婆认为只要工资高，分居无所谓。。。听着味儿不对。",
          "en": "Your wife thinks that as long as the salary is high, it doesn't matter if you live apart... It doesn't sound right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hfJ433 人人都想发展副业，其实能把主业做好就不错了",
          "en": "@hfJ433 Everyone wants to develop a side business, but it's good enough to do the main job well."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@eironn 不一定，但是被绿是必须的。我班班花老公在外面包工程，我傻 13 兮兮的以为只有我睡过，结果和另一个男同学喝酒听吐槽。。。三观稀碎。。。",
          "en": "@eironn Not necessarily, but being cuckolded is a must. My class beauty's husband is contracting projects outside. I stupidly thought that only I had slept with him. As a result, I drank with another male classmate and listened to the complaints... My worldview is shattered..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "异地就是离异的最大导火索呀。",
          "en": "Long-distance relationship is the biggest fuse for divorce."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没孩子，还分居，挺危险，多少良家都是老公外地工作",
          "en": "No children, and living apart, it's quite dangerous. Many good wives have husbands working away from home."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不建议去，工资又没有涨多少，路还远。长期分居感情出问题的概率非常大。",
          "en": "I don't recommend going. The salary hasn't increased much, and the road is still long. The probability of emotional problems with long-term separation is very high."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "绿就绿了，绿了正好换个新的。出去闯吧。事业单位绿率翻倍，因为没事儿干太闲太安逸了。",
          "en": "If you're cuckolded, then you're cuckolded. It's good to replace it with a new one. Go out and make a name for yourself. The cuckold rate in public institutions doubles, because there is nothing to do, and it's too idle and comfortable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首先没有恶意，楼主可能一毕业在老家呆的时间太久啦，一个小时的车程可能都会觉得特别远，但如果适应了城市节奏，一个半小时真不算啥，走出去的不只是人，还有思维，见识，以及更多未知的可能～",
          "en": "First of all, there is no malice. The OP may have stayed in his hometown for too long after graduation. A one-hour drive may feel very far, but if you adapt to the pace of the city, an hour and a half is really nothing. What you walk out of is not only yourself, but also your thinking, knowledge, and more unknown possibilities ~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高速一个半小时说实话多大点事? 我每周去滑雪单程都要开两个小时. 北上广深随便一个大城市单程通勤一个小时都稀松平常. 在我看来这就不叫异地.",
          "en": "An hour and a half on the highway, honestly, how big a deal is that? I have to drive two hours each way to ski every week. In any big city like Beijing, Shanghai, Guangzhou, or Shenzhen, an hour's commute each way is commonplace. In my opinion, this is not considered being in a different place."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你老婆是不是属老鼠的，就看一寸？",
          "en": "Is your wife a rat, only looking at an inch?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去，然后半个月或者每个月回一次",
          "en": "Go, and then come back once every half a month or month"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去，， ，，机会难得，难得老婆支持。抓紧要孩子。",
          "en": "Go, , , , It’s a rare opportunity, and it’s rare to have your wife's support. Hurry up and have a baby."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人意见，仅供参考：1 、老婆的政府事业编也未必保险2 、分居提高被绿几率，但被绿也未必是因为分居，感情深怕啥3 、人生不就是多选择多尝试么，窝在一个地方能熬到死么？万一公司不行，没技能和渠道，怎么办？树挪死人挪活，30 岁，还年轻的很",
          "en": "Personal opinion, for reference only: 1. Your wife's government public institution may not be guaranteed. 2. Separation increases the chance of being cuckolded, but being cuckolded is not necessarily because of separation. What's the fear if the relationship is deep? 3. Isn't life about making more choices and trying more? Can you stay in one place until you die? What if the company fails, and you have no skills and channels? Trees move to die, people move to live, 30 years old, still very young"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "分居无所谓？你不会真信了吧",
          "en": "It doesn't matter to live apart? You don't really believe it, do you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "才多这点钱没有什么吸引力。",
          "en": "There's nothing attractive about making just this much more money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以上的兄弟 没看出重点, 这个还是要结婚多几年才能感受出来: 楼主老婆觉着: 男人应该多赚点钱, 别太追求安逸 !!这才是重点, 而不是\"分居\"什么的, 价值观的问题很重要. 没结婚的年轻人, 一提到谁的\"老婆\"就是\"绿\"这, \"绿\"那的 ... 哎...说正事, 意味着如果楼主不去 追求事业发展,   她老婆的价值观也不会变,  以后可能会引发其它长久的问题. 楼主应该也有想出去追求事业的想法. 但楼主如果这事情不能做得太冒然, 做好自身各方面准备再继续下一步. 最后,  关于年龄,    三十岁仍然是年轻人,   二十多岁就是非常非常年轻. 社会关于年龄是\"病态\"的态度,  但自己心里要明白, 但也要做好规划和准备, 毕竟 人还是在江湖之中的.",
          "en": "The above brothers didn't see the point. You still need to be married for a few more years to feel it: The OP's wife feels that: men should make more money, don't pursue comfort too much!! This is the key, not \"separation\" or something like that. The problem of values is very important. Young people who are not married, when they mention someone's \"wife\", they are \"cuckolded\" this, \"cuckolded\" that... Alas... Let's get down to business. It means that if the OP doesn't pursue career development, his wife's values will not change, and it may lead to other long-term problems in the future. The OP should also have the idea of going out to pursue a career. But the OP should not do this thing too rashly. Make good preparations in all aspects before taking the next step. Finally, about age, thirty is still young, and twenty-something is very, very young. Society's attitude towards age is \"pathological\", but you have to understand it in your heart, but you also need to make plans and preparations, after all, people are still in the rivers and lakes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很巧刚好今年也要 30 岁，我的建议是不走，薪资的上涨幅度完全不值得换个城市生活，除非是自己想要尝试换一个地方生活，或者是有非常大的晋升空间。从工作上来看，目前的工作看起来其实是有大把的空闲时间可以用来发展副业，可以从尝试从副业下手提升收入，我自己就是在探索各种副业的过程中找到了喜欢并且收入比较满意的职业。然后关于新工作的部分，既然是有亲戚在的话个人认为也不至于紧迫到必须要立即决定是与非，今年的机会放弃掉也不代表直接封死这条路，反而可以当做一条退路来考虑。嘴比较笨，可能没办法把想法传达到特别明确，祝你好运！",
          "en": "It's a coincidence that I'm also turning 30 this year. My suggestion is not to go. The increase in salary is completely not worth changing cities to live in, unless you want to try to live in a different place, or there is a very large space for promotion. From a work perspective, the current job seems to have a lot of free time that can be used to develop side businesses. You can try to start with side businesses to increase your income. I, myself, found a job I liked and was satisfied with the income in the process of exploring various side businesses. Then, regarding the new job, since there are relatives, I personally think that it is not so urgent that you must make a decision immediately. Giving up this year's opportunity does not mean that this path is directly blocked. Instead, it can be considered as a way out. My mouth is a bit clumsy, and I may not be able to convey my thoughts very clearly. I wish you good luck!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去。没钱没前途，老婆以后照样得跑。发达了把老婆孩子接过去，长期分居只会绿。",
          "en": "Go. No money, no future, your wife will still leave. When you are successful, take your wife and children over. Long-term separation will only result in being cuckolded."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去，去了再回来",
          "en": "Go, go and then come back"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不去，发展副业看看",
          "en": "Don't go, develop a side business and see"
        }
      ],
      "type": "replies"
    }
  ]
}