{
  "id": 1013563,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "过年前，媳妇要先回娘家吃顿肉，然后初四再回娘家一趟，这操作有毛病没？",
          "en": "Before the New Year, the wife wants to go back to her parents' home for a meal of meat, and then go back again on the fourth day of the lunar new year. Is there something wrong with this operation?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "客观情况：两地相距 200 公里，天气不好，过年回家路上车流量大;\r\n主观情况：我不想去，懒得动，感觉跑二百公里就吃顿肉，没太大必要，又不是年后不去了。\r\n题外话：她提前放假，在家带了 2 天孩子，带孩子太累了，这个应该是起因，然后因为喂饭时，让我给孩子倒点水喝，没有及时响应，以及我不愿意年前去她家问题，我们吵了一架。\r\n本身是没多大事情，但让人很难受。",
          "en": "Objective situation: The two places are 200 kilometers apart, the weather is bad, and there is a lot of traffic on the way home for the New Year;\r\nSubjective situation: I don't want to go, I'm too lazy to move, I feel like driving two hundred kilometers just for a meal of meat, it's not that necessary, and it's not that we won't go after the New Year.\r\nAdditional information: She took her vacation early and took care of the children at home for 2 days. Taking care of the children was too tiring. This should be the cause. Then, because she asked me to pour some water for the child during feeding time, I didn't respond in time, and also because I didn't want to go to her home before the New Year, we had a quarrel.\r\nIt's not a big deal in itself, but it makes people feel very uncomfortable."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "不想来回跑就直接在娘家过年",
          "en": "If you don't want to go back and forth, just spend the New Year at your parents' home"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“她提前放假，在家带了 2 天孩子，带孩子太累了”“喂饭时，让我给孩子倒点水喝，没有及时响应”“我不想去，懒得动，感觉跑二百公里就吃顿肉，没太大必要，又不是年后不去了”帖子里居然没有一个人心疼你老婆两个孩子，一个人带了两天，晚上老公回来了，还是她在喂饭，让老公给孩子倒口水喝都得不到及时的响应两个小时的车程，她想回趟家还得征求你的同意我从这个帖子里只看到了她作为妻子的悲凉和无助",
          "en": "“She took a vacation early and took care of the children at home for 2 days, taking care of the children was too tiring.” “When feeding, she asked me to pour some water for the child, and I didn't respond in time.” “I don't want to go, I'm too lazy to move, I feel like driving two hundred kilometers just for a meal of meat, it's not that necessary, and it's not that we won't go after the New Year.” Surprisingly, no one in the post feels sorry for your wife and the two children. She took care of the children alone for two days. When her husband came back in the evening, she was still feeding the children. Even asking her husband to pour a drink of water for the children could not get a timely response. It's a two-hour drive, and she still has to ask for your permission to go home. From this post, I only see her sadness and helplessness as a wife."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "突然想起来小时候的一件事，一个平平无奇的傍晚，已吃过晚饭，一家子人在电视机前看电视因为某些事情我妈不停的在骂我爸，我在一旁战战兢兢不敢吭声我爸躺在床上一动不动一声不吭我妈骂了许久见我爸没动静，最后抄起拖孩往我爸脚上狠抽了一下，然后骂骂咧咧的出去了我爸依旧一动不动的看电视现在回想起来，我爸是个智者而我如今，是一个比我爸更有智慧的智者我不结婚",
          "en": "I suddenly remembered something from my childhood, an ordinary evening, after dinner, the whole family was watching TV. Because of something, my mother kept scolding my father, and I stood aside trembling, not daring to make a sound. My father lay on the bed, motionless and silent. My mother scolded for a long time, and seeing that my father didn't move, finally picked up a slipper and fiercely hit my father's foot, then went out cursing. My father still watched TV without moving. Now, looking back, my father was a wise man, and now I am a wiser person than my father, and I will not get married."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是 90 后.看得开..想回就回..别管父母习俗..一句话可以反驳父母那东西赚不了钱200 公里.自己没空.老婆不会开车..就顺风车回去呢..别因为小事..老婆觉得受压迫式的..个个所谓的向往民主..家里最受压迫可能的就是老婆了..既然都希望民主..就从自己小家庭出发..尊重孩子.老婆.的决定....都成家了父母的决定我都是一票我就否决他们.",
          "en": "We are all post-90s. Just be open-minded.. If you want to go back, go back.. Don't worry about the parents’ customs.. One sentence can refute your parents: that stuff can't make money. 200 kilometers. You are not free, and your wife can't drive.. Just take a ride back.. Don't let your wife feel oppressed because of trivial matters.. Everyone supposedly yearns for democracy.. But the most oppressed person in the family is probably the wife.. Since we all hope for democracy.. Start from your own small family.. Respect the decisions of the children, your wife... When you have a family, I veto all the decisions of my parents with my own vote."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "婚姻是这样的",
          "en": "Marriage is like this"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一般老婆提的要求，只要不是特别过分（花很多钱）或者紧急（马上就走），我都会直接答应。然后过段时间之后再提出一些其他的看法（查了下天气预报发现天气不好，路况不佳），但也是给她做选择，如果她还是坚持，那就全力支持。但即使老婆坚持，也可能转头自己想想觉得你说的也有道理，一段时间后接受你的建议。女人大多第一时间都是靠情绪做决定，提要求的第一时间不是讲道理的时候。等情绪过了，她也会用理性思考，前提是你钱没没有反对她。总的来说，就是要会哄老婆，不要浪费精力在跟情绪讲道理上面。",
          "en": "Generally, I will directly agree to my wife’s requests, as long as they are not too excessive (spending a lot of money) or urgent (leave immediately). Then, after a period of time, I will bring up some other opinions (checked the weather forecast and found that the weather is bad and the road conditions are poor), but I will also give her a choice. If she still insists, I will fully support her. But even if my wife insists, she might turn around and think that what you said also makes sense, and accept your advice after a while. Most women make decisions based on emotions at the first moment, and the first moment of making a request is not the time to reason. When the emotions pass, she will also think rationally, provided that you have not opposed her. In general, you have to know how to coax your wife and don't waste energy on reasoning with emotions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我知道你觉得有毛病，所以我只能回你有毛病。",
          "en": "I know you think there is something wrong, so I can only reply that there is something wrong with you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加油吧 如果只是因为懒就动动， 等有一天你发现，你很勤快都解决不了的问题才叫窒息。 我两边跑一趟就要 近 4000 公里，200 公里已经很幸福了。",
          "en": "Come on, if it's just because you're lazy, just move. When you find one day that you can't solve the problem even if you are diligent, it is called suffocation. I have to run nearly 4000 kilometers one way, and 200 kilometers is already very happy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不好评价，你媳妇儿要大老远的去吃顿肉，我理解但是不赞同。在你媳妇提出回家后，你拒绝了你媳妇还吵架，我也理解也不赞同",
          "en": "It's hard to evaluate. I understand but don't agree that your wife wants to go so far to have a meal of meat. I also understand and don't agree that you refused your wife after she offered to go home and you two quarreled."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是吃顿肉的问题，是尊重的问题。如果是我的话先回娘家吃顿肉没毛病，初二送她去他家，住两个晚上，初四接回来。",
          "en": "It's not about having a meal of meat, it's about respect. If it were me, there would be nothing wrong with going back to the wife's parents' home for a meal of meat first, taking her to her home on the second day of the lunar new year, staying for two nights, and picking her up on the fourth day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dreamjn 那还得坚持坚持，老二快 2 岁了，这个信息很及时啊",
          "en": "@dreamjn Then you have to keep going, the second child is almost 2 years old, this information is very timely"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去一趟吧，200km 换一家人开心，有比这更超值的事情吗？",
          "en": "Go for a trip, 200km for a family's happiness, is there anything more worthwhile than this?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "才 200 公里，我还以为是 2000 公里呢。",
          "en": "It's only 200 kilometers, I thought it was 2000 kilometers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人感觉这才哪到哪，手动狗头我这开始计划的二十九放假晚上或三十开车回家，140km初二早上娶媳妇家（要早上十一点前到，尽可能，媳妇那得习俗是姑爷初二要早上去媳妇家），200km初三或初四回家，参加初六同学婚礼，200km初六帮忙接亲，估计又要个百来公里初七回公司，140km最后想着媳妇怀了，还是就在媳妇家过年算了（去年就是差不多这么做的）总结，结婚了，必然有很多琐碎，提前有个预期知道会比较累，心里就没那么累了，哈哈，好好处理好，让老婆开心就是最大的开心个人观点，不喜勿喷，提前祝大家新年快乐，万事顺心！",
          "en": "Personally, I feel that this is just the beginning. (Manual Dog Head) I am planning to go home on the evening of the 29th day of the lunar new year holiday or the 30th, 140km to my wife's parents' house on the morning of the second day of the lunar new year (arrive before eleven in the morning, if possible, the custom there is that the son-in-law should go to the wife's house early on the second day of the lunar new year), 200km home on the third or fourth day of the lunar new year, attend a classmate's wedding on the sixth day, 200km help with the wedding on the sixth day, and probably another hundred kilometers on the seventh day to go back to work, 140km. Finally, thinking that my wife is pregnant, let's just spend the New Year at my wife's house (that's pretty much what I did last year) In conclusion, after getting married, there will inevitably be many trivial things. Having an expectation in advance and knowing that it will be tiring will make you feel less tired. Haha, handle it well and make your wife happy, that's the greatest happiness. Personal opinion, no disrespect, and wish everyone a happy new year and all the best!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吵架的目的不是为了说服对方，而是为了让对方不爽。",
          "en": "The purpose of arguing is not to convince the other party, but to make the other party unhappy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这发这里好像我们也帮不上啥，只能安慰你一下！",
          "en": "It seems that we can't help you with this since you posted it here. I can only comfort you!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "吵架解决不了问题，吵架永远是在输出情绪。双方先都冷静下来，然后摆事实讲道理，总有一个人要让步",
          "en": "Arguing doesn't solve the problem, arguing is always about expressing emotions. Both parties should calm down first, then state the facts and reason, and someone will have to make concessions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "《民法典》第一千零八十四条，离婚后，不满两周岁的子女，以由母亲直接抚养为原则。已满两周岁的子女，父母双方对抚养问题协议不成的，由人民法院根据双方的具体情况，按照最有利于未成年子女的原则判决。子女已满八周岁的，应当尊重其真实意愿。",
          "en": "Article 1084 of the Civil Code: After a divorce, children under the age of two shall, in principle, be directly raised by their mother. For children over the age of two, if the parents cannot reach an agreement on the issue of custody, the people's court shall make a judgment based on the specific circumstances of both parties, in accordance with the principle that is most conducive to the minor children. For children over the age of eight, their true wishes shall be respected."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@buyerhou 这个开玩笑的，大家别当真啊，还不至于",
          "en": "@buyerhou This is a joke, everyone don't take it seriously, it's not that serious"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是很理解 媳妇想回去 就送她回去呗 谁过年不想回家看看呢",
          "en": "I don't really understand. If your wife wants to go back, just send her back. Who doesn't want to go home and see their family during the New Year?"
        }
      ],
      "type": "replies"
    }
  ]
}