{
  "id": 1016490,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "NAS 求推荐",
          "en": "NAS Recommendation Request"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "网上找了一圈已经看花眼了，之前完全没接触过，不想折腾，预算 2k 以内，求 v 友们给推荐一下吧\r\n\r\n接受小主机或者国内厂商的 NAS ，群晖也看过，但是个人觉得太贵，性价比不高。\r\n\r\n## 需求\r\n- 电影，电影需要放到投影仪上播放\r\n- 照片，不多，200GB 以内，只要存储就可以\r\n- 元信息识别，可以识别出我的电影信息\r\n- 多端访问，手机可以访问到文件\r\n- 支持 docker\r\n\r\n## 加分项\r\n- 不吵，价格便宜",
          "en": "I ve been looking online and my eyes are tired. I haven't been in contact with this before, I don't want to tinker, my budget is within 2k, please recommend it to me, V friends.\r\n\r\nAccept mini-hosts or domestic NAS vendors. I've also seen Synology, but I personally think it's too expensive and not cost-effective.\r\n\r\n## Requirements\r\n- Movies, movies need to be played on a projector\r\n- Photos, not much, within 200GB, just storage is enough\r\n- Metadata recognition, can identify my movie information\r\n- Multi-terminal access, files can be accessed on mobile phones\r\n- Support Docker\r\n\r\n## Bonus Items\r\n- Not noisy, cheap"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "如果是程序员，用什么 NAS ？随便找个能插多硬盘的电脑，装个 Linux 当服务器就完了。 或者自己用小主板攒一台。大多数机顶盒软件，比如 kodi,infuse 都支持读取 NFS 共享。NAS 的所有功能，什么元数据下载，流媒体，网盘， 各种服务，github 上都找得到， 要 docker 自己在 Linux 装个 docker 3 秒钟的事情。要什么 web 管理界面，ssh 不好吗？ 用什么 NAS 系统，出了问题，你还得去找人家系统的问题，麻烦不麻烦。回归本质， 一个 Linux 都能搞得定，或者不行就虚拟化，上个 ESXi",
          "en": "If you're a programmer, what NAS should you use? Just find a computer that can plug in multiple hard drives, install Linux as a server, and you're done. Or you can build one yourself using a small motherboard. Most set-top box software, such as kodi and infuse, supports reading NFS shares. All the functions of a NAS, such as metadata download, streaming media, cloud storage, and various services, can be found on github. If you want Docker, you can install it on Linux in 3 seconds. What web management interface do you need? Isn't SSH good enough? What NAS system should you use? If something goes wrong, you have to go find the problems with their system, isn't that troublesome? Back to the essence, one Linux can handle it, or if that doesn't work, virtualize it and use ESXi"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这加到一块就和便宜不搭边了,两千内四盘,绿联的刮削问题一坨,docker 要自己补 tun 之类的支持,坛内有解析两盘两千块也没几个好买的,qnap 也折腾的一批,要么你去找个成品黑群晖让人帮你远程支持弄完得了",
          "en": "Combining all these requirements makes it not cheap. Within two thousand, with four disks, the scraping issues with UGreen are a mess. Docker needs you to add tun support and so on yourself. There are few good options for two-disk NAS setups at two thousand in the forum. QNAP is also a lot of trouble. Either you find a ready-made black Synology and have someone remotely support you to set it up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ltkun 裸机",
          "en": "@ltkun Bare metal"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "程序员买个威联通把，配置相对好一点。折腾的话，自己也能应付过来。",
          "en": "Programmers should buy a QNAP, the configuration is relatively better. If you like tinkering, you can handle it yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sunziren ds224+是这个吧？",
          "en": "@sunziren Is this ds224+?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不想折腾是指 plex 这种都不想自己跑吗，那绿联自带刮削的播放器听说还不错",
          "en": "Do you mean you don't want to run even things like Plex yourself? Then UGreen's built-in scraping player is said to be not bad."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "极空间&绿联 开箱即用。折腾的话，装个 ubuntu + kodi + nextcloud 也不是不行",
          "en": "JieKong & UGreen are ready to use out of the box. If you like tinkering, installing ubuntu + kodi + nextcloud is also possible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能跑 docker 的就都能折腾了吧~",
          "en": "Anything that can run Docker can be tinkered with~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2k 带存储还是不带 带的话没啥好搞的了",
          "en": "2k with storage or without? If with, there's not much to do."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Puteulanus 这种可以接受，但是如果是黑群晖，或者是像树莓派做 NAS 那样改一堆东西的，接受不了",
          "en": "@Puteulanus This kind of thing is acceptable, but if it's a black Synology, or modifying a bunch of things like using a Raspberry Pi to make a NAS, I can't accept that."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ghostwwg z2pro 看着不错",
          "en": "@ghostwwg z2pro looks good"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jojo0830 后续还想装点 alist 啥的第三方工具",
          "en": "@jojo0830 I also want to install some third-party tools like alist later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "924+ 双 11 好像 2200",
          "en": "924+ seems to be 2200 on Double 11"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@objectgiga 绿联具体啥问题呢，如果预算可以放开一点，有啥推荐吗",
          "en": "@objectgiga What are the specific problems with UGreen? If the budget can be relaxed a bit, what do you recommend?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sunziren 你是说群晖 ds924?",
          "en": "@sunziren You mean Synology ds924?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@thawne 是的",
          "en": "@thawne Yes"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2k 我倾向自组 成品的很鸡肋 估计最多 n5105 这种级别 要求不高的话可以试试 amd 的小组机 对体积没有要求的话 还是大机箱舒服 扩展性好很多 目前自用的几台 AIO 有自组和成品 系统都是 pve 可以组集群",
          "en": "For 2k, I prefer to build it myself. The pre-built ones are not very useful, probably at most n5105 level. If the requirements are not high, you can try AMD's small group machine. If the size is not a requirement, a large chassis is still comfortable and has better expandability. Several AIOs I use now are self-built and pre-built, and the systems are all pve, which can form a cluster."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sunziren 这玩意在哪，jd 没搜到",
          "en": "@sunziren Where is this thing? I couldn't find it on JD."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别买绿联",
          "en": "Don't buy UGreen"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买二手的群晖 ds718 用 plex",
          "en": "Buy a used Synology ds718 and use Plex"
        }
      ],
      "type": "replies"
    }
  ]
}