{
  "id": 1015800,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "仅仅是一个猜想，如果春节期间高速公路不免费，堵车情况会有改善么？",
          "en": "Just a guess, if highways weren't free during the Spring Festival, would the traffic congestion improve?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "赞同 #5 @joh ，本质上是集体活动并发大流量导致的“带宽”不足。高速公路节假免费政策是 2012 年开始实行的，搜一下 2012 年之前的新闻可以得到假设的答案：> 京哈高速公路万家段堵车长达 50 公里 - 2011 年> 京藏高速大堵车已达 7 天千辆车滞留绵延百公里 - 2010 年> 京昆高速由陕入川路段堵车绵延 40 余公里 - 2009 年",
          "en": "Agree with #5 @joh, the essence is the insufficient “bandwidth” caused by collective activities and large traffic flow. The highway free policy during holidays was implemented in 2012. Searching for news before 2012 can get a hypothetical answer:> Beijing-Harbin Expressway Wanjia section traffic jam lasted for 50 kilometers - 2011> Beijing-Tibet Expressway massive traffic jam lasted for 7 days, thousands of vehicles stranded for hundreds of kilometers - 2010> Beijing-Kunming Expressway from Shaanxi into Sichuan section traffic jam stretched for more than 40 kilometers - 2009"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "估计只会更堵，都堵在收费站，难道大家都忘了当年推出节假日免费最大原因就是因为节假日大家都出去结果全堵在收费站几十几百公里的，出行需求并不会因为这几十上百的通行费有所改变的，毕竟一年也就这两三次谁都出得起这钱",
          "en": "It's estimated that it will only get more congested, all jammed at the toll stations. Has everyone forgotten that the biggest reason for introducing free holidays back then was that everyone went out during the holidays and ended up jamming the toll stations for dozens or hundreds of kilometers? The demand for travel won't change because of the toll fees of a few hundred yuan, after all, it is only two or three times a year, and everyone can afford the money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以前做数学建模时候做过这东西。拥堵的根本原因是出行需求远高于道路承载。高速收费，优化道路交通等只能在一定程度上缓解，无法解决根本问题。根本原因还是国人出行太集中了。",
          "en": "I did this stuff when I was doing mathematical modeling before. The fundamental reason for congestion is that the demand for travel is much higher than the road capacity. Highway tolls and optimizing road traffic can only alleviate the problem to a certain extent and cannot fundamentally solve the problem. The fundamental reason is that Chinese people travel too concentrated."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不会有改善，过年都想回家，集中出行导致的车流太大。太小看国人回家过年的执念了，那千八百的过路费太小儿科。",
          "en": "There will be no improvement, everyone wants to go home for the New Year, and the concentrated travel leads to too much traffic. Underestimate the obsession of Chinese people going home for the New Year, the toll fees of a few hundred yuan are too trivial."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不但不免费，还要 5 倍收费，才能改善",
          "en": "Not only is it not free, but it should charge 5 times the fee to improve it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是学学国外吧，再大的节假日也只放 1-2 天，但是有至少 30 天左右的年假可以随意支配",
          "en": "Learn from foreign countries, even the biggest holidays only take 1-2 days, but there are at least 30 days of annual leave that can be freely used"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@joh 为什么太集中，因为假太少，大的节假日屈指可数那几个，至于为什么假少，非我等可议。",
          "en": "@joh Why is it so concentrated? Because there are too few holidays, only a few major holidays. As for why there are few holidays, it is not for us to discuss."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "相反， 如果高速一直免费， 会不会堵呢？",
          "en": "On the contrary, if highways are always free, will they be congested?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有",
          "en": "Yes"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当然有了。高速免费对各景区的游览体验都有影响。",
          "en": "Of course, there are. Free highways have an impact on the experience of visiting various scenic spots."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很会改善，一年两箱油车主大概就不会走高速了。",
          "en": "It will improve a lot, and car owners with two tanks of oil a year probably won't take the highway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有改善，但效果不大",
          "en": "There is improvement, but the effect is not significant"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把春节假期变短至 3 天，劳动法落实年假",
          "en": "Shorten the Spring Festival holiday to 3 days, and implement annual leave in the Labor Law"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让所有人能分散放假 是不是一种思路",
          "en": "Is it a good idea for everyone to be able to take holidays at different times?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Perry 7 楼未来有可能实现的。春晚取消，或者变成千人千面也不是不可能。",
          "en": "@Perry The 7th floor is likely to be realized in the future. It is not impossible to cancel the Spring Festival Gala or turn it into a thousand faces."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不会有任何影响。大年三十高速才免费，三十以前该回家还是要回家，我也没见有人故意等到初一再走的。根本原因是年前放假都是分好多天回家的，但年后上班都集中到了初六左右，不为别的，只因为马上要上班了。",
          "en": "It won't have any impact. Highways are only free on the 30th of the lunar year, and people who should go home before the 30th still have to go home. I haven't seen anyone deliberately wait until the first day of the lunar new year to leave. The fundamental reason is that before the lunar New Year, people take leave and go home for many days, but after the lunar New Year, people all go to work around the sixth day of the lunar new year, for nothing else, just because they are about to go to work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "反而更糟，全堵收费站了，这是执行免费的其中一个原因。落实假期，让人自由错峰才是以人为本的政策。",
          "en": "It's even worse, it's all jammed at the toll stations, which is one of the reasons for implementing free policies. Implementing holidays and allowing people to stagger their travel is a people-oriented policy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高速收费大家过年就不回老家了？答案是否定的话，那还得堵，我年 29 晚回的家，年 30 出的告诉，都没啥人。",
          "en": "Will everyone not go back to their hometown for the New Year if highways charge fees? If the answer is no, then there will still be congestion. I went home on the evening of the 29th of the lunar year and went on the highway on the 30th. There was no one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我年 30 下午走的，一路绿的发指…收费会改善高速途中的，因为都堵在收费站呢",
          "en": "I left on the afternoon of lunar year 30, and it was all green along the way... Charging fees will improve the highway journey, because the toll stations are all jammed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不免费，那收费站就得堵",
          "en": "If it's not free, the toll stations will be congested"
        }
      ],
      "type": "replies"
    }
  ]
}