{
  "id": 1018219,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "有喜欢在公园睡觉的么？",
          "en": "Anyone like sleeping in the park?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我超喜欢在公园长椅上睡觉， 一般不到一下小，周末吃了午饭就会带上薄毯，然后带上一个围在脖子上的靠枕，去公园大树下，找个躺椅，玩玩手机，看看书，睡一会儿。然后感觉非常有精神。全当晒太阳了。 \r\n\r\n当然，天气恶劣时候还是算了。 \r\n\r\n但是有时候公园人多， 没地方，就很无奈了。现在想买个露营躺椅，就不用去占位置了。\r\n\r\n有朋友也喜欢的么。",
          "en": "I really like sleeping on park benches. Usually I just take a short nap. On weekends, after lunch, I'll bring a thin blanket, a neck pillow, go under a big tree in the park, find a recliner, play on my phone, read a book, and sleep for a while. Then I feel very refreshed. It's all just sunbathing.\n\nOf course, it's not an option when the weather is bad.\n\nBut sometimes there are too many people in the park and there's no space, which is very frustrating. Now I want to buy a camping recliner so I don't have to fight for a spot.\n\nAre there any friends who like it too?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "公园想找个座时候，最讨厌那些一个人霸占一个长椅子睡觉的人",
          "en": "When looking for a seat in the park, I hate those people who hog a whole bench to sleep on."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先天流浪汉圣体",
          "en": "Born a vagrant saint"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "冷知识：全球绝大多数地区的蝙蝠都有可能携带某些种类的丽莎病毒，其中大多数的种类对于人类来说是致命的，北美地区的蝙蝠更是直接有可能携带最为人熟知的那种——狂犬病毒。即使是在那些宣称 rabies-free 的国家，也只是地上动物 (terrestrial animals) 中根除，不包括蝙蝠。而小型蝙蝠的叮咬对于熟睡中或意识不清醒的人来说可能完全感觉不到，而蝙蝠叮咬又是「通常只能感觉到而看不见、不留痕迹」(‘Bat bites are often felt and not seen, and may not bleed or leave an obvious mark on the skin.’ 英国政府的小册子上如是说)。在美国和加拿大，都有年轻人因在户外小憩被蝙蝠叮咬而罹患狂犬病死去的先例。OP 如果真有此爱好，或许应考虑像接触蝙蝠工作者一样，每年补种狂犬病疫苗加强针。",
          "en": "Fun fact: bats in most regions of the world can carry some types of Lyssa virus, most of which are fatal to humans. Bats in North America are even directly capable of carrying the most well-known one - rabies virus. Even in countries that claim to be rabies-free, it only refers to the eradication in terrestrial animals, not including bats. And the bites of small bats may be completely unnoticed by people who are asleep or unconscious, and bat bites are often \"felt and not seen, and may not bleed or leave an obvious mark on the skin.\" (As stated in a UK government booklet.) In the United States and Canada, there have been cases of young people dying from rabies after being bitten by bats while napping outdoors. If the OP really has this hobby, they should consider getting annual rabies vaccine booster shots, just like those who work with bats."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老哥適合去美國當講師",
          "en": "Dude is suitable to be a lecturer in the US"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从来没有试过，有种惶恐感～",
          "en": "Never tried it, I feel a sense of fear ~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这和公园没关系. 如果你家有个小院, 相信你也会喜欢在小院里休息的.",
          "en": "It has nothing to do with the park. If you have a yard at home, I believe you will also like to rest in the yard."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是搭个帐篷吧 小心碰到痴汉小偷",
          "en": "It's better to set up a tent, be careful of perverts and thieves"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这可能不太安全，时不时会有醉倒在路边、夜宿洗浴中心、青年旅馆被同性猥亵的新闻。",
          "en": "This may not be very safe. There are occasional news reports of people passing out on the side of the road, staying overnight in bathhouses or youth hostels, and being sexually assaulted by homosexuals."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我看你有三和大神的潜质。",
          "en": "I think you have the potential to be a Sand and Great God."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "又要到饭了兄弟们！",
          "en": "Time for food, brothers!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前有新闻在公园长椅上睡觉被流浪 gay 口了",
          "en": "There was news before that someone was sleeping on a park bench and was orally assaulted by a homeless gay man"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cmdOptionKana 更热的知识：rabid bats 就爱在日间行动，北美的那几个案例都是在中午被咬的（",
          "en": "@cmdOptionKana Hotter knowledge: rabid bats love to be active during the day, and those cases in North America were all bitten at noon ("
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小心被 X",
          "en": "Watch out for X"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "沉迷晒太阳。骨灰级老烧。",
          "en": "Addicted to sunbathing. Veteran."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喜欢带躺椅，把头用帽子盖住晒太阳。天气不好的时候喜欢把车开到没人的地方睡车里听雨声",
          "en": "I like to bring a recliner and cover my head with a hat to sunbathe. When the weather is bad, I like to drive my car to a deserted place and sleep in the car, listening to the sound of rain."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以前有个新闻，一小伙子在公园睡着了，被老大爷把牛子塞嘴里了。。。",
          "en": "There was a news report that a young man fell asleep in the park and an old man put his penis in his mouth..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "蚊子太多，不喜欢",
          "en": "Too many mosquitoes, don't like it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不喜欢出门，",
          "en": "Don't like going out,"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yolee599 对，主要是干扰的东西太多，根本休息不好",
          "en": "@yolee599 Yes, the main thing is that there are too many distractions, and you can't rest at all"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我一直憧憬野外的那种吊床, 没试过很期待.",
          "en": "I've always longed for that kind of hammock outdoors, never tried it, very much looking forward to it."
        }
      ],
      "type": "replies"
    }
  ]
}