{
  "id": 1017735,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "优衣库的线上购买线下换货阴阳条款，必须要和线上价格一致",
          "en": "Uniqlo's online purchase and offline exchange terms are inconsistent, and must be consistent with the online price"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前几天在优衣库买了条裤子，小了，于是确定换货，被告知可以门店换货。提前打电话问门店库存，已经提前告知是网络购买，以及货号，查了相应的库存，告诉我直接到店就可以更换。\r\n\r\n第二天，带着商品和退货单到店，同款没这个色了，想要更换相同款式不同颜色尺码的，店员告知我网上价格和线下不一样，换货需要补足差价，不然无法提供换货。\r\n\r\n无法认同这个规则，联系淘宝官方旗舰店客服，期间问了我一堆奇奇怪怪的问题，比如原因是什么（我回答说店员告知需要补差价），现在店里什么价格等等，最后升级专员处理，专员打电话到店里，店员告诉他可以操作，也可以成功，但是他拒绝操作。最后店员告诉我他们店里卖 249 ，你 99 买的，要是换给你他们就亏了。\r\n\r\n于是我持续和淘宝客服沟通，客服一开始说他们显示已经换货成功了，我告知他们店员拒绝为我换货。然后又是继续处理，期间我一直在询问需要多少时间，因为在已经在门店等待已经一个多小时了，客服就是扯皮说需要时间，不说需要处理多久，导致我一直没有离开门店。\r\n\r\n在等待约半小时后，这个时候我已经等待接近 2 个小时了，客服依然无法给我准行，无奈，我只能先行离开。又过了 40 分钟，客服这个时候只会反复重复他们的退换货条款。\r\n\r\n\r\n>换货仅支持更换同款同价的不同颜色或尺码的商品，不支持更换不同款号的商品。若购买了同款号仅部分颜色降价销售的商品，换货时只能更换同款号同价格的商品。\r\n\r\n\r\n在我反复追问下，客服告知我价格要以商品的售卖金额为准，说时候，这句话也是又歧义的，吊牌价是商品的售卖价格，那降价后的价格也是商品售卖价格啊。我无奈，只能转投诉，不过他们只会说什么抱歉，记录，我想根本一点屁用没有。\r\n\r\n如果要线上线下价格一致才可以门店换货，那么这个功能一点吊用没有。更加离谱的是，没有人会提前告知你这个事情，你到了门店才发现换货还需要补差价，而你一点办法没有。如果需要线上线下价格一致才允许换货，那么你至少应该提醒说明，因为这个条件实际上很难保证。\r\n\r\n我比较倾向于这家门店是有问题的，如果不满足 [仅支持更换同款同价的不同颜色或尺码的商品] ，那么应该直接拒绝我的换货申请，而不是让我补差价，如果是 [若购买了同款号仅部分颜色降价销售的商品，换货时只能更换同款号同价格的商品。] ，那我还只能认了，但我认为我不属于这种情况，线上降价是全颜色的，他们也很少有这种部分颜色降价的促销，而且门店一直说原因是价格不一致，而不是颜色问题。\r\n\r\n最后，大家有什么投诉或者举报的渠道么，浪费了我接近 3 小时就这个结果。",
          "en": "A few days ago, I bought a pair of pants at Uniqlo, they were too small, so I decided to exchange them and was told that I could exchange them in the store. I called the store in advance to ask about the inventory, and had already informed them that it was an online purchase, as well as the item number. They checked the corresponding inventory and told me I could go directly to the store for the exchange.\r\n\r\nThe next day, I went to the store with the item and the return slip. The same style was not available in that color. I wanted to exchange it for the same style but different color and size. The clerk told me that the online price and the offline price were different, and the exchange required me to make up the price difference, otherwise they could not provide the exchange.\r\n\r\nI couldn't agree with this rule, so I contacted the customer service of the official Taobao flagship store. During the process, they asked me a lot of strange questions, such as what the reason was (I replied that the clerk told me to make up the price difference), what the price was in the store now, etc. Finally, it was escalated to a specialist for handling. The specialist called the store, and the clerk told him that it could be done, and it could be successful, but he refused to do it. Finally, the clerk told me that they were selling it for 249 in the store, and I bought it for 99. If they exchanged it for me, they would lose money.\r\n\r\nSo I continued to communicate with Taobao customer service. At first, the customer service said that their system showed that the exchange had been successful. I told them that the clerk refused to exchange it for me. Then they continued to process, and during this time I kept asking how much time it would take, because I had been waiting in the store for more than an hour. Customer service just kept beating around the bush and said they needed time, without saying how long it would take to process, which caused me to keep waiting in the store.\r\n\r\nAfter waiting for about half an hour, at this point I had been waiting for almost 2 hours. The customer service still couldn't give me a clear answer. Helplessly, I could only leave first. After another 40 minutes, the customer service would only repeatedly repeat their return and exchange terms.\r\n\r\n\r\n>Exchange is only supported for exchanging products of the same style and the same price with different colors or sizes. It does not support exchanging products with different style numbers. If you have purchased products of the same style number and only some colors are discounted, you can only exchange products of the same style number and the same price.\r\n\r\n\r\nAfter repeated questioning, the customer service told me that the price should be based on the selling price of the product. In fact, this sentence is also ambiguous. The tag price is the selling price of the product, and the discounted price is also the selling price of the product. I was helpless and could only file a complaint, but they would only say they were sorry and would record it. I think it is completely useless.\r\n\r\nIf the online and offline prices must be consistent before an in-store exchange can be made, then this function is completely useless. What's even more ridiculous is that no one will inform you of this in advance. You only find out that you need to pay the difference when you arrive at the store, and you can't do anything about it. If online and offline prices must be the same to allow an exchange, then you should at least remind and explain, because this condition is actually difficult to guarantee.\r\n\r\nI am more inclined to believe that this store has a problem. If it does not meet [only supporting the exchange of products of the same style and the same price with different colors or sizes], then they should directly reject my exchange application instead of making me pay the difference. If it is [if you have purchased products of the same style number and only some colors are discounted, the exchange can only be for products of the same style number and the same price], then I can only accept it, but I don't think I am in this situation. The online price reduction is for all colors, and they rarely have such promotions with price reductions for only some colors. Moreover, the store has always said that the reason is the price inconsistency, rather than the color issue.\r\n\r\nFinally, does anyone have any channels for complaints or reports? I wasted nearly 3 hours for this result."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "线上的断码商品本来价格就很低，你拿断码商品去换正常码的商品，肯定不给你换的，这波我只能站优衣库。如果说同意给你换，那很多人就会去钻这个空子，拿着很便宜的断码商品去线下换正常码，那商家要亏炸。",
          "en": "The price of online clearance items is already very low. If you use a clearance item to exchange for a regular size item, they definitely won't exchange it for you. I can only support Uniqlo this time. If they agree to exchange it for you, then many people will take advantage of this loophole, using very cheap clearance items to exchange for regular sizes offline, and the merchants will lose a lot of money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xipuxiaoyehua 他那是线上断码的打折商品",
          "en": "@xipuxiaoyehua His is online discounted clearance items"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有些人啊,屁股都是歪的企业内部线上线下协调有问题就是有问题,扯七扯八的",
          "en": "Some people, their asses are all crooked. Problems with internal online and offline coordination in the company are problems, they're just rambling on about it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要我说你直接线上退了不行吗, 买件衣服这么折腾, 来回折腾不嫌烦?",
          "en": "If you ask me, why don't you just return it online? Buying clothes is such a hassle, don't you find it annoying to go back and forth?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小气鬼,这种事也拿出来说,以后肯定没有出息",
          "en": "Cheapskate, even bringing this kind of thing up, you definitely won't have a future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "它一些打折的本来就线上会比线下便宜 线上店的利润又不会摊给门店，只能说选了门店换货，他们没有提前告知换货条件，浪费了时间",
          "en": "Some of its discounted items are originally cheaper online than offline. The profits of online stores are not distributed to the stores. You can only say that you chose to exchange in the store, they didn't inform you of the exchange conditions in advance, and it wasted your time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@CaptainD #7  是的，好像是批次也不一致，但是我作为消费者，不了解也没有渠道了解批次的变化，我认的只能是货号，如果货号相同但是批次不同，存在不同的政策，那他们应该出新的货号，对消费者来说，货号相同，那就是相同的商品。出 iPhone15 就应该用 iPhone15 的货号另外淘宝客服，应该说是专员？  是联系了店里的，我在旁边听到了，但即使如此门店还是拒绝为我换货。他们内部系统不同，内部的摩擦坑的可是消费者，真的是坑死我了",
          "en": "@CaptainD #7 Yes, it seems that the batches are also inconsistent, but as a consumer, I don't know and have no way to understand the changes in batches. I can only recognize the item number. If the item number is the same but the batches are different, and there are different policies, then they should issue a new item number. For consumers, the same item number means the same product. When they release the iPhone 15, they should use the iPhone 15 item number. Also, the Taobao customer service, should that be a specialist? They contacted the store, I heard it next to them, but even so, the store still refused to exchange it for me. Their internal systems are different, and the internal friction is screwing over consumers, it really screwed me over."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "优衣库某些产品本来就是分颜色尺码打折的，比如男款短袖 蓝色 99 ，粉色 59 ，还有就是 xxs 尺码和 xxxL 这种尺码也是骨折，如果按 op 的操作，我在网上买 xxs 的粉色短袖，然后去门店平换 L 码蓝色，就完全规避商家的打折策略了。我觉得门店没做好的是告知有货的时候，没有告知 op 货不多了，op 第二天去剩余的几件货很有可能被卖掉了，而且我觉得站在线下店的角度完全没必要帮 op 留货，因为万一 op 隔了很久才去换货或者后来决定不换货了呢。站在 op 的角度，假设 249 是原价，那 99 已经是骨折款，按优衣库门店的流量，很有可能随时卖完，第二天出门之前应该再打个电话询问库存，避免白跑一趟。",
          "en": "Some Uniqlo products are originally discounted based on color and size, for example, men's short-sleeves are 99 for blue and 59 for pink, and sizes like xxs and xxxL are also deeply discounted. If the OP did that, buying a pink xxs short-sleeve online and then exchanging it for a blue L size in the store would completely circumvent the merchant's discount strategy. I think the store didn't do a good job of informing the OP when they had the item, without telling them that there wasn't much stock left. The few remaining items could very likely be sold out when the OP goes there the next day. Furthermore, I think from the perspective of the offline store, there is absolutely no need to reserve the item for the OP, because what if the OP goes to exchange it a long time later, or later decides not to exchange it. From the OP's perspective, assuming 249 is the original price, then 99 is already a deeply discounted price. Based on the traffic in Uniqlo stores, the items could be sold out at any time. The OP should have called to check the inventory before leaving the house the next day, to avoid a wasted trip."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我能理解线下门店不给换，毕竟优衣库都是用 RFID 来管理商品的，线下系统库存里面对商品的的颜色、尺码、批次都有记录，售价、盈亏、库存都是门店、总部一起管理的，你这件商品换进去系统里面应该很难对的上，哪怕系统能够识别到也会识别为售价 99 ，然后换货换 299 ，系统层面就会拦截掉这种操作，员工可能根本就操作不下去。哪怕门店经理可能有权限可以换货，造成的差价估计也是门店自理。",
          "en": "I can understand why the offline store wouldn't allow the exchange. After all, Uniqlo uses RFID to manage its products. The offline system's inventory records the color, size, and batch of the products, and the selling price, profit and loss, and inventory are all managed by the stores and headquarters together. It should be very difficult for the system to match the product you are trying to exchange. Even if the system can recognize it, it will recognize the selling price as 99, and then exchange it for 299, the system level will intercept this operation, and the staff may not be able to operate it at all. Even if the store manager has the authority to exchange the product, the resulting difference is likely to be handled by the store itself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所以 zara 直接就把线上买线下退的政策给关了，感觉优衣库也是迟早的事",
          "en": "So Zara has directly shut down the policy of online purchase and offline return, and I feel it will be Uniqlo's turn sooner or later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本来线上买就应该线上退，基本全世界电商都这么操作的，就是为了方便库存管理...结果像楼主和这里一部分回帖的龟毛屌丝太多了，会直接让优衣库取消这个方便顾客的政策。",
          "en": "Originally, buying online should be returned online, which is how almost all e-commerce around the world operates, just to facilitate inventory management... As a result, there are too many picky and petty people like the OP and some commenters here, which will directly make Uniqlo cancel this customer-friendly policy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "退货 直接退，把你想换的也在网上买，如果你网上也是 299 ，当我没说",
          "en": "Return it, just return it, buy what you want to exchange online as well, if it's also 299 online, then I didn't say anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@gw518888 #1  网上没尺码了所以我去门店换的，如果告诉我门店换货需要满足 [和线上价格一致] 的条件，我就直接退了，跑一趟门店也挺麻烦的他们的退换货规则没写这个，打电话到门店告知要换货问库存的时候也没说这个，到门店了讲这个，真的太坏了",
          "en": "@gw518888 #1 There were no sizes online, so I went to the store to exchange it. If they had told me that the in-store exchange had to meet the condition that the [price is consistent with the online price], I would have just returned it. It's also quite troublesome to go to the store. Their return and exchange rules don't state this. When I called the store to inform them that I wanted to exchange it and asked about the inventory, they didn't say this either. They only mentioned it when I got to the store, which is really bad."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "12315 先走一个？",
          "en": "12315, shall we start?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@adgad2 不能在店里试一下其他尺码然后在线换货么",
          "en": "@adgad2 Can't you try on other sizes in the store and then exchange it online?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我之前在优衣库干过，尝试解答一下我估计你 99 买的可能是同款商品的 [早期批次] 或者某种原因导致销售不佳降价处理的商品（比如冷门配色）比如去年生产的，而你要换到的是 249 的同款 [新批次] ，旧批次和新批次 [一般] 没有什么不同，无非是在仓库里呆的时间长短而已，但在店家看来，你这种情况类似于今年买了 iPhone14 ，但想去店里换新一个 iPhone15 ，所以他们会拒绝以我之前的经验，淘宝官方旗舰店一般不会直接联系门店，它们内部是不同系统的，应该不存在淘宝客服帮你联系门店的情况，最近几年情况是否有变化我不清楚",
          "en": "I used to work at Uniqlo, and I'll try to answer your question. I estimate that the 99 you bought may be a [early batch] of the same product or a product discounted due to poor sales (such as an unpopular color), for example, produced last year, and what you want to exchange is the [new batch] of the same product for 249. There is [generally] no difference between the old batch and the new batch, it's just the length of time they've been in the warehouse. But in the eyes of the store, your situation is similar to buying an iPhone 14 this year, but wanting to exchange it for a new iPhone 15 in the store, so they will refuse. Based on my previous experience, the Taobao official flagship store generally does not contact the stores directly, their internal systems are different, and there should be no situation where the Taobao customer service helps you contact the store, I am not sure if there have been any changes in recent years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Bigbelly #3 虽然我也很想走，但是我感觉这很难被支持，人家是同意线上退换的，但是线上购买线下换货更像是额外的附加服务，我觉得 12315 不会支持。也准备线上退货了。只能说以后大家买东西尽量遵循同渠道进出，像这种优衣库根本对门店没有约束力，他们内部的政策/协调问题却要消费者来买单",
          "en": "@Bigbelly #3 Although I also really want to complain, I feel it will be difficult to get support. They agreed to online returns and exchanges, but online purchase and in-store exchange is more like an extra value-added service, I don't think 12315 will support it. Also I'm preparing for an online return. I can only say that in the future, everyone should try to follow the same channel for entering and exiting when buying things. Uniqlo doesn't have any binding force on the stores, it's their internal policies/coordination issues, but the consumers have to pay the bill."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前在天猫优衣库下单线下提货发现尺码大了可以直接转为门店订单直接换货，不过没关注价格 好像都是 299.",
          "en": "Previously, if you placed an order on Tmall Uniqlo and picked it up offline and found that the size was too big, you could directly transfer it to a store order and exchange it, but I didn't pay attention to the price, it seemed to be 299."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "[同款没这个色了，想要更换相同款式不同颜色尺码的] 这句是什么意思呢，到底是同款还是不同款？货号是否一致。",
          "en": "What does [The same style was not available in that color, I wanted to exchange it for the same style but different color and size] mean? Is it the same style or a different style? Is the item number the same?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自从我在优衣库网店买到一条图案歪扭倾斜十来度的衣服, 其他的还有针脚歪扭之类的, 我就再也不买线上店了. 感觉就是把缺陷品和正品混在一起发, 就赌部分消费者没那么眼尖或者懒得折腾退货",
          "en": "Ever since I bought a piece of clothing with a pattern that was crooked and tilted by more than ten degrees on the Uniqlo online store, and there were other issues like crooked stitching, I have never bought from the online store again. It feels like they mix defective products and genuine products together and send them out, betting that some consumers are not that sharp-eyed or are too lazy to bother with returns."
        }
      ],
      "type": "replies"
    }
  ]
}