{
  "id": 1015221,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "关于 40 岁+的软件工作者的职业出路",
          "en": "Regarding the career path of software workers aged 40+"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "别玩梗，真心好奇国内 40 岁+的软件工作者，能一直留在一线写代码的可能性大不大？ 如果不能，其他出路是什么呢？\r\n\r\n有没有 40 岁+的 V 友聊聊？",
          "en": "Stop joking around, I'm genuinely curious. What are the chances of software workers aged 40+ in China being able to stay on the front lines writing code? If not, what other options are there?\r\n\r\nAre there any V friends aged 40+ who would like to chat?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "40 ，已经出来做了几个产品和外包。每次赚到钱就去做产品。产品亏完继续做外包。  今年转外贸。",
          "en": "I'm 40, and I've already launched several products and done some outsourcing. Every time I make money, I start a product. When the product loses money, I go back to outsourcing. I'm switching to foreign trade this year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "83 年在深圳制造业写 C# 税前 21W 年薪。",
          "en": "Born in 1983, writing C# in Shenzhen's manufacturing industry with a pre-tax salary of 210,000 yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在一家制造业，很适合养老的，技术都很菜，缺点就是沟通困难，甩锅的多",
          "en": "In a manufacturing company, it’s very suitable for retirement. The technology is very poor, the disadvantage is communication difficulties, and there's a lot of buck-passing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 持续为客户创造价值2. 去支持那些能够创造价值的公司，人，社区3. 思考为什么 40 岁就要失业了？问题是怎么发生的？有没有解决的办法？解决的过程中就能创造就业。4. 思考我们工作是为了什么5. 都 40 岁了，应该放弃侥幸心理，放弃幸灾乐祸的心态，这应该是 40 岁不惑之年已经具备的，应该具备的素质6. 别老想着管理，大多数人所认为的管理，不叫管理。管理不等于职权是一种权益，当一个 leader 管理者，是要给所有你需要兑付的利益相关人负责的，不是不劳而获领福利的特权，如果你想着的是这样的管理，那就去考你姥姥舅舅的公务员去。7. 前面说了那么多废话，说一句具体一点的，即使是一线城市，产业升级的失败，缩小了对于高端人才的需求，这是 40+ 就业瓶颈产生的原因，如果要解决 40+ 就业，那就要突破产业升级，要创造高端就业岗位，显然这类岗位不会在八线小农村而只会在有产业集群，靠近沿海和市场的大城市。",
          "en": "1. Continuously create value for customers. 2. Support companies, people, and communities that can create value. 3. Think about why people lose their jobs at 40? How did the problem happen? Are there any solutions? Creating employment opportunities during the solution process. 4. Think about why we work. 5. At 40, you should give up the mentality of fluke and gloating. This should be a quality that people at the age of 40 should possess. 6. Don't always think about management. What most people think of as management isn't really management. Management does not equal authority; it is a right. When a leader is a manager, they are responsible for all the stakeholders you need to deliver benefits to, not a privilege to receive benefits without working. If you are thinking about that kind of management, then go take the civil service exam for your grandmother's or uncle's government job. 7. After talking so much nonsense, let me say something specific: even in first-tier cities, the failure of industrial upgrading has reduced the demand for high-end talents. This is the reason for the employment bottleneck for those over 40. To solve the employment problem for those over 40, it is necessary to break through industrial upgrading and create high-end job positions. Obviously, these types of positions will not be in small rural areas but only in large cities with industrial clusters, close to the coast and the market."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就我所在的所谓“新一线”，大部分公司，老板不会考虑 30+，因为他们听说大厂都没 30+的基层员工……我有位朋友的老板（真的是朋友的老板），一次性开除全部 30+的基层员工这样的公司，往往业务很简单，不需要富有经验的员工，老板也往往不懂得资深工程师的价值——或者老板只需要一两个核心员工（如果那核心员工离职……o(∩∩)o...哈哈）抛开小环境，就个人看法而言，经验是优势。但如果随着工龄的增长，经验没有随着增长，知识没随时代更新，需要调低期望值。但在所谓的“新一线”，总是能颠覆我的认知：知识随着时代更新，小环境不见得会随着时代更新，所以……",
          "en": "In the so-called “new first-tier” cities where I am, most companies, the bosses will not consider people over 30, because they heard that large companies do not have frontline employees over 30… The boss of a friend of mine (really, it's my friend's boss) fired all the frontline employees over 30 at once. Such companies often have very simple businesses and do not need experienced employees. The boss also often doesn't understand the value of senior engineers – or the boss only needs one or two core employees (if those core employees leave… o(∩∩)o... haha). Aside from the small environment, in my personal opinion, experience is an advantage. But if experience doesn't increase with seniority, and knowledge doesn't keep up with the times, you need to lower your expectations. But in the so-called “new first-tier” cities, it always subverts my understanding: knowledge updates with the times, but the small environment may not, so..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我 40 多了，刚拿到的 offer 还是写代码，理论上肯定是有可能的，降低期望，肯定能一直做。",
          "en": "I'm over 40, and the offer I just got is still to write code. Theoretically, it's definitely possible. Lowering expectations, I can definitely keep doing it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想一心一辈子写代码的程序员最需要掌握的语言是 -- 外语 （英，法，德等欧美语系），不要把自己局限在“国内”本人 40+，手下刚招了一位 50 的打下手。 在欧美很多国家和地区，年龄从来不是问题。",
          "en": "The most important language for programmers who want to write code for a lifetime is -- a foreign language (English, French, German, and other European and American language families), do not limit yourself to \"domestic\". I'm over 40, and I just hired a 50-year-old assistant. In many countries and regions in Europe and America, age is never a problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "再说一句，就是因为很多人总想着回老家，回分公司做一些边缘工作，看似收入还行，小城市消费低，收入高就显得生活质量还不错！现实情况是，当你的职业生涯不创造，不继续上升的时候，你并不会停在原地，而是会急剧的倒退！技术没有改进了业务没有改进了研究也停止了慢慢的，你会发现菜市场里已经没有你的位置了，还回三线养老吗？",
          "en": "Let me say another thing, it's because many people always think about going back to their hometowns and working in branch offices doing some marginal work. It seems that their income is okay, the consumption in small cities is low, and a high income makes the quality of life seem pretty good! The reality is, when your career doesn't create or continue to advance, you will not stay in place, but will regress sharply! The technology has not improved, the business has not improved, the research has stopped, and slowly, you will find that you no longer have a place in the market. Are you still going back to a third-tier city for retirement?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "管理或转行，一线很少了，还会被年轻的鄙视跟不上",
          "en": "Management or changing careers, there are very few opportunities on the front line, and you will be looked down upon by younger people for not keeping up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有，我有很多同学还在公司写代码，从毕业一直写到今天。",
          "en": "Yes, I have many classmates who are still writing code in companies, they've been doing it since graduation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我 40 多了，已经辞职在出租屋半年多了。",
          "en": "I'm over 40, and I've been unemployed and living in a rented room for over half a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "42 北漂回乡准备退休了，辞职了几个月，挺开心的，不过年前本地成立了老东家的分公司，又被请回来撸代码了。",
          "en": "42, I'm returning to my hometown from Beijing and preparing to retire. I quit my job a few months ago and was quite happy, but before the Spring Festival, my old company set up a branch in my hometown, and I was invited back to write code again."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sunorg 我的偶像。",
          "en": "@sunorg My idol."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果控制好支出，在 40 岁赚够退休的钱，然后找个薪资不高的工作应该没问题",
          "en": "If you control your expenses and earn enough money for retirement by the age of 40, then finding a job with a low salary should not be a problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zivn 老哥你这运气太好了吧。刚成立的分公司，你现在进去刚好可以做管理层干到真正退休了",
          "en": "@zivn You're so lucky, brother. The branch company was just established, and you can now join and be a management-level employee until you really retire."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sunorg 6 的",
          "en": "@sunorg 6"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一直在写代码，已经使用多年人体工学键盘。打算写到不能写，不用写（ AI 越来越厉害",
          "en": "I've been writing code for many years and have been using an ergonomic keyboard for many years. Plan to write until I can't write, don't need to write (AI is getting more and more powerful."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sunorg 偶像",
          "en": "@sunorg Idol"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我 40+还在写，主要写团队的技术方案调研预研，负责评审代码，以前的团队有几个 40+，给人感觉做事稳重，他们也影响过我。还要看团队环境",
          "en": "I'm over 40 and still writing. I mainly write technical solutions for the team, conduct research and preliminary research, and review code. There were a few people over 40 in the previous team, who gave me the impression that they were steady in doing things, and they also influenced me. It also depends on the team environment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "985 的基本没这个担忧",
          "en": "985 graduates basically don't have this worry."
        }
      ],
      "type": "replies"
    }
  ]
}