{
  "id": 1017030,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "朋友孩子毕业 2 年多没找工作，我应该怎么帮？",
          "en": "My friend's child hasn't found a job for over 2 years after graduation, how can I help?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "事情是这样的，朋友的小孩毕业 2 年多了，一直没有找工作（暂时不知道是没找，还是找不到）\r\n朋友小孩是普通本科院校毕业的（海外），读的是工商管理里面的 [国际贸易] 。\r\n\r\n刚毕业的时候说考公务员，为了保留应届生身份，不能交社保（意思是不能签劳动合同，只能实习），然后可能有考几次吧，一直没上岸，然后就不了了之，后面就一直在家。\r\n\r\n过年前的时候和孩子大吵了一架，意思是孩子天天在家不出去找工作，吃老本之类，可能想刺激一下孩子，说了很难听的话，说再不去找工作，就把门锁换了以后都不给回来之类的，伤到孩子的自尊心了。\r\n\r\n现在跟我提起这个事情，我想帮，但是好像也无从下手，主要有以下几个问题：\r\n\r\n- 我不知道 [国际贸易] 适合做什么工作（ GPT 推荐 “进出口公司的贸易专员，大型跨国公司的供应链管理岗位，或者贸易咨询公司的咨询顾问等”可以做，不知道有没有朋友懂的）\r\n\r\n- 毕业那么长时间，应该是没有应届生身份了，没有工作经验，走社会招聘的话，怎么能找到对口的专业？\r\n\r\n- 现在不像以前，托关系找工作打声招呼就行了，现在大公司都要走正规面试流程，即使是关系户，最起码学历，经验条件都要符合才行，直接安排工作应该是不可能的了，我找人内推去大公司，感觉机会也不大\r\n\r\n- 朋友孩子虽然一直没上过班，但是有实习过，做过阿里巴巴之类的，说不喜欢（好像说觉得性格不合适），感觉朋友孩子可能不太能吃苦，甚至有点挑工作，目前实际情况好像也很难有得挑。\r\n\r\n\r\n综合分析下来，我目前只能去一些招聘网站看看，然后想办法帮忙看看怎么丰富简历之类，有没有朋友有好的想法，或者有不同的建议或者观点的，很欢迎评论跟我讨论，我也没说这个忙我一定能帮得上，但是还是希望朋友孩子能尽快找到合适的工作吧。\r\n\r\n欢迎大家理性讨论这个话题，多给点建议，抱拳了",
          "en": "Here's the situation: my friend's child has been graduated for over 2 years and hasn't been employed (I don't know if they haven't looked or can't find a job).\nMy friend's child graduated from a regular undergraduate university abroad, majoring in [International Trade] within Business Administration.\n\nUpon graduation, they mentioned taking the civil service exam. To maintain their status as a recent graduate, they couldn't pay social security (meaning they couldn't sign an employment contract, only intern), and then they might have taken the exam a few times, but they never passed. Then, they just gave up and stayed at home.\n\nBefore the Spring Festival, there was a big argument with the child. The parents meant that the child stayed home all day without looking for a job, living off savings, and probably wanted to stimulate the child. They said some harsh words, saying that if the child didn't look for a job, they would change the locks and not let them come back. This hurt the child's self-esteem.\n\nNow they bring this matter up with me, and I want to help, but it seems difficult to know where to start. The main problems are:\n\n- I don't know what kind of job is suitable for [International Trade] (GPT recommends “trade specialists in import and export companies, supply chain management positions in large multinational companies, or consulting consultants in trade consulting companies”, I don't know if anyone knows).\n\n- After being graduated for so long, they shouldn't have the status of a recent graduate. Without work experience, how can they find a job that matches their major through social recruitment?\n\n- It's not like before. You can just say hello and find a job through connections. Now, big companies have to go through formal interview processes. Even if you have connections, you must meet the minimum education and experience requirements. Directly arranging a job should be impossible. I don't think the chances are high even if I find someone to recommend them internally to a big company.\n\n- Although my friend's child has never worked, they have interned, such as at Alibaba, but they said they didn't like it (it seemed like they felt their personality wasn't suitable). I feel like my friend's child may not be able to endure hardship, and is even a bit picky about jobs, but it seems difficult to be picky about the current situation.\n\n\nAfter a comprehensive analysis, I can only look at some job recruitment websites, and then try to help improve their resume, etc. Any friends have good ideas, or different suggestions or viewpoints, are very welcome to comment and discuss with me. I didn't say that I can definitely help this, but I still hope that my friend's child can find a suitable job as soon as possible.\n\nWelcome everyone to rationally discuss this topic, give some suggestions, and I salute you."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "咸吃萝卜淡操心，多管闲事多吃屁",
          "en": "Worrying needlessly, meddling in others' affairs will get you nowhere."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.你朋友对孩子的预期是什么2.这孩子对自己的预期是什么你如果对这两样不了解，你也是白忙。就像楼上说的，如果只是要份工作，那么去送外卖或开网约车都是可以的。毕竟年轻。如果是想坐办公室，那么去找贸易公司或者国际物流公司，从白丁开始做也是可以，大公司别想了，只有私企，看运气遇到个靠谱的老板也是可以的，但起薪比外卖和网约车收入都要少，进去也是民工级别的从最底开始。发达的机会现在几乎没有。",
          "en": "1. What are your friend's expectations for the child? 2. What are the child's own expectations? If you don't understand these two things, you're wasting your time. As the person above said, if they just want a job, then delivering food or driving ride-hailing services are both options. They are young after all. If they want to work in an office, then they can look for trade companies or international logistics companies, and start as a beginner. Don't even think about big companies, only private companies. It depends on luck whether you meet a reliable boss, but the starting salary is lower than delivering food or driving ride-hailing services, and they will start at the bottom, which feels like a manual labor job. There's almost no chance of getting rich now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "蓝厂黄厂欢迎你，送外卖月入过万",
          "en": "Blue Factory and Yellow Factory welcome you, delivering food can earn over ten thousand a month"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一个客观事实是，大部分人并没有帮人找工作的能力。能帮人找工作的，一般要么是自己是私企的话事人，要么自己有足够的人脉+身处高位的朋友 —— 这两样对大部分人都是奢望。所以别说他只是你的朋友的孩子了，就算是你自己的孩子，你也爱莫能助。路最终还需要他自己走出来，乖乖低下头从小公司的小职位做起。",
          "en": "An objective fact is that most people don't have the ability to help others find a job. Those who can help others generally are either the decision-makers of private companies, or have sufficient connections plus friends in high positions -- both of which are luxuries for most people. So, not to mention that he's just your friend's child, even if it's your own child, you can't do anything about it. The path ultimately needs to be walked by them, and they need to obediently start from a small position in a small company."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "考公考研确实是个很好逃避工作的说辞，我刚毕业也 neet 了半年，假装考个公。身边其实也有不少人这样，大多数家境都不错，后面要么家里介绍工作，要么继承家业了...不过在家里 neet 久了就有惰性了，越来越恐惧出社会，这年头工作也不好找，特别是一个毕业了两年却有两年空窗期而且似乎没有任何技能的人来说，如果性格再内向一点，求职面试基本上是被拷打的状态，社招简历甚至写不了啥东西。感觉你很难帮上忙，让你朋友自己找关系看能不能进啥熟人的公司先干点简单的活混一下工作经验填充一下简历吧，这情况还想一步到位进个什么大公司好岗位感觉不可能了。",
          "en": "Taking the civil service exam or pursuing a postgraduate degree is indeed a good excuse to avoid work. I was also a NEET for half a year after graduation, pretending to take the civil service exam. There are actually quite a few people like this around me, and most of them have good family backgrounds. Later, they either get a job through their family or inherit the family business… But after being a NEET at home for a long time, you become lazy, and increasingly fear entering society. It's also not easy to find a job these days, especially for someone who has been graduated for two years but has a two-year gap and seems to have no skills. If their personality is a bit introverted, the job interview will basically be a torture, and the social recruitment resume can't even write anything. I feel it's hard for you to help. Let your friend try to find connections and see if they can get into a familiar person's company to do some simple work to gain work experience and fill their resume. It seems impossible to get a good position in a big company in one step in this situation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你去注册个公司，每个月给他发几千，工作内容就是每天上 V2EX 发帖。",
          "en": "You register a company and pay him a few thousand every month, and the job content is to post on V2EX every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看看有没有相关行业的朋友内推。用招聘软件帮忙找不算帮，这是打工人自己该会做的事",
          "en": "See if you have friends in related industries who can recommend him. Helping him find a job using recruitment software is not considered help, it's something a worker should already know how to do."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@syh2 #42 我的建议就是不要瞎指导，对孩子只管夸就好了，朋友听了高兴你还没啥风险。指导错了到时候人家叨叨一辈子，“当初要不是那个谁谁谁非让我去干啥啥工作，说不定我现在早就赚大钱了...”。你应该很明白，这孩子现在的状态社招校招都走不了，考公感觉也没那个毅力，家里还没啥能力给安排。。。看样子你也没能力给他安排，这种情况你多说一句到时候发展的不好都得怨你。。。真的，只管夸就可以了。。。多捡好听的说就行了。。。",
          "en": "@syh2 #42 My suggestion is to not give any random guidance, just praise the child. Your friend will be happy and you won't take any risks. If your guidance is wrong, they'll grumble for the rest of their lives, “If it weren’t for that so-and-so forcing me to do such-and-such a job, I might have made a lot of money by now...”. You should understand that the child's current situation is such that they won't be able to get a job through social recruitment or campus recruitment. They don't seem to have the perseverance to take the civil service exam, and their family doesn't have the ability to arrange anything for them... It seems you also don't have the ability to arrange anything for him, so if you say too much and things don't go well later, they'll blame you... Really, just praise them... Just say nice things that are pleasant to hear..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最大的帮助是让家里别给钱给他。",
          "en": "The biggest help is to have the family stop giving him money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zuosiruan 不要只看到好的，这行是贫富最悬殊的行业之一，或者说名字上挂个“业务”两个字的都类似。做好了佣金大把甚至后面出来自己做，所以这行也是发大财人数相对多的，外贸电商也类似。外贸做不好的收底薪然后被扫地出门（大概率），但互联网越来越发达信息差越来越小现在跟以前比已经难多了。外国回来的的确可以容易入职，但入职后呢？入职前是看你英语，入职后就看你开发业务能力了，大部分人都是收底薪或被炒的命运。所以我上面也说了，他在外面读书时是他自己尝试了解电商的最好机会，但错过了，如果做外贸，除非进那些大集团才能保证稳定一点。另外关于楼主，如果对方家长请教你就业问题，潜台词可能是看你有没有资源，至于意见未必重要。如果那孩子是因为读书成绩不好出去读的，考公估计希望不大，最好还是试试看有没国企一些职位对外语能力需求强的吧，我觉得是有可能有的。",
          "en": "@zuosiruan Don't just look at the good side, this industry has one of the largest gaps between the rich and the poor, or any industry with “business” in its name is similar. If you do well, you’ll get a lot of commission and even start your own business later. So this industry also has a relatively high number of people who get rich, and foreign trade e-commerce is similar. If you don't do well in foreign trade, you'll only get a basic salary and then be kicked out (most likely). But the Internet is becoming more and more developed, and the information gap is getting smaller and smaller, which is now much more difficult than before. Those who come back from foreign countries can indeed get a job more easily, but what about after getting the job? Before getting the job, they'll look at your English. After getting the job, they'll look at your ability to develop business. Most people are destined to get only a basic salary or be fired. So, I also said above that when he was studying abroad, it was his best chance to try and understand e-commerce, but he missed it. If he does foreign trade, he can only guarantee to be more stable unless he joins those large groups. In addition, about the OP, if the parents ask you about employment issues, the subtext might be to see if you have resources, and the opinions may not be important. If the child went abroad because their grades were not good, the chances of passing the civil service exam are probably not high, so it’s best to try to see if there are any positions in state-owned enterprises that have strong requirements for foreign language skills. I think it's possible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "做外贸？",
          "en": "Do foreign trade?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "话说上次讲法律专业有人讲红牌专业，国际贸易这种玩意才是真正的红牌专业吧。法律那种本科毕业肯定就业率低，本来就是要律师证的毕业时又没有，考法官又要研究生，但你考上了研究生考公还不是随便考，国际贸易这种就真正呵呵了。其实他有心入行的话，当初在海外时就应该自己苦研跨境电商了，他现在优势就是外语，前提是他读书时不是全部都在混华人圈都在说中文。你要方向的话，就是跨境电商（目的是学点东西自己做），外资，看看有没有一些国企要跟外打交道需要一些真正外语厉害的，还有让他自己到海外的网站找找有没有人要在华采购的。至于真正的国际贸易，除非是大集团有资源给你的，否则大概率是苦工，跟业务员差不多要靠业务抽提成的，你会做到怀疑人生。",
          "en": "Speaking of which, someone mentioned that the law major is a red card major, but international trade is the real red card major. The employment rate of law graduates with a bachelor's degree is definitely low because as a lawyer, you need certificate which you don't have when you graduate either. If you want to become a judge, you need a master's degree, but if you get a master’s degree, you can still take the civil service exam. International trade is really, haha. Actually, if he was interested in this industry, he should have studied cross-border e-commerce by himself when he was overseas. His advantage now is his foreign language, provided that he didn't only hang out in Chinese circles and speak Chinese all the time when he was studying. If you're looking for direction, it's cross-border e-commerce (the purpose is to learn something and do it yourself), foreign-funded enterprises, see if there are some state-owned enterprises that need to communicate with the outside world and need someone with strong foreign language skills, and also let him look for people on overseas websites who want to purchase in China. As for real international trade, unless a large group has resources for you, it's more likely to be a hard job, similar to a salesperson who has to rely on commissions, and you'll be driven to doubt your life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "放弃。。。，尊重。。。",
          "en": "Give up…, respect…"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本人不想干，那就很难了，意愿这个东西，本来就是要花几年去磨的",
          "en": "If the person doesn't want to do it, then it's very difficult. This thing, willingness, originally requires a few years to hone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "送外卖都不愿意的孩子，不值得救",
          "en": "A child who is unwilling to deliver food is not worth saving."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "海外读的本科，就再出去呗，体力活多的是",
          "en": "If they have an undergraduate degree from abroad, just go out again, there's plenty of physical work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@BigShot404 #9 另外我补充一点，国际贸易这个专业在相关的行业里是最水的，因为学校教的东西毫无实际价值（基本就是提单信用证这类早已经被淘汰的知识），所有东西都要从头学起，如果还是端着要专业对口的话，除非自己家的企业了。",
          "en": "@BigShot404 #9 In addition, let me add one point. The international trade major is the most useless in related industries because the things taught in schools are of no practical value (basically knowledge like bills of lading and letters of credit, which have already been eliminated). You have to learn everything from scratch. If you still insist on matching your major, unless it's your family's business."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "送外卖开网约车就挺适合的。普通本科国际贸易，进公司能干嘛？做文员吗。在海外读书，那外语足够好吗？足够好的话去做需要外语能力的文员。",
          "en": "Delivering food or driving ride-hailing services is very suitable. International trade with an ordinary undergraduate degree, what can they do when entering a company? Be a clerk? If they studied abroad, is their foreign language good enough? If it's good enough, then be a clerk that requires foreign language skills."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你有什么资源人脉能帮他吗",
          "en": "What resources and connections do you have to help him?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把他内推进 op 的公司啊，这不是最直接的帮助吗",
          "en": "Recommend him internally to the OP's company, isn't that the most direct help?"
        }
      ],
      "type": "replies"
    }
  ]
}