{
  "id": 1016135,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "长期吃素有没有什么危害？",
          "en": "Are there any hazards to long-term vegetarianism?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "RT ，过年期间我看见肉都头疼，最爱吃点白菜土豆",
          "en": "RT, during the Chinese New Year, I get a headache when I see meat. I love eating some cabbage and potatoes"
        },
        {
          "zh": "如果长期吃素菜，对身体有害吗",
          "en": "If I eat vegetarian food for a long time, is it harmful to my health?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "看到标题一眼看成长期素食，就开始笑看 mygo 看的",
          "en": "I saw the title and immediately thought of long-term vegetarianism, and started to watch mygo with a smile"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "俄罗斯不是有个素食网红主播刚死没多久，一年不到吧",
          "en": "Didn't a vegetarian internet celebrity from Russia die not long ago, less than a year?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "标题一眼 soyo再看下文……不好意思走错了",
          "en": "The title is soyo at a glance, and then read the following text... Sorry, I went the wrong way"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@littiefish #14 不是的，很多动物蛋白的氨基酸，植物无法提供。",
          "en": "@littiefish #14 No, plants cannot provide the amino acids of many animal proteins."
        },
        {
          "zh": "人类是杂食动物，吃素不健康",
          "en": "Humans are omnivores, and eating vegetarian food is not healthy"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "素食者引以为傲的吃肉就吐/闻到肉味就吐 其实是慢性肝损伤的典型特征",
          "en": "The vomiting when eating meat/smelling meat that vegetarians are proud of is actually a typical feature of chronic liver damage"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@littiefish 这个真的是，大学同学为了下决心瘦身，真就吃了两三个月的素食，他胖了",
          "en": "@littiefish This is true, a college classmate ate vegetarian food for two or three months to lose weight, and he gained weight"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是差不多终身素食了。",
          "en": "I've been a vegetarian for almost my whole life."
        },
        {
          "zh": "现在 40.没感觉出来什么。",
          "en": "I'm 40 now. I don't feel anything different."
        },
        {
          "zh": "从小吃的肉加起来应该没普通人半个月吃的多。",
          "en": "The amount of meat I've eaten since I was a child should be less than what an ordinary person eats in half a month."
        },
        {
          "zh": "我家人都吃肉。",
          "en": "My family all eat meat."
        },
        {
          "zh": "就我一个人不吃。",
          "en": "Only I don't."
        },
        {
          "zh": "所以我不认为长期吃有什么害处。",
          "en": "So I don't think there are any harms to eating vegetarian food for a long time."
        },
        {
          "zh": "身高 178.体重 80KG 。",
          "en": "Height 178. Weight 80KG."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意三大元素的搭配就行，就像羊只吃素也能活，但是它每天的吃草量你可能比不了，所以还是要注意配比。",
          "en": "Just pay attention to the combination of the three major elements, just like sheep can live on vegetarian food, but you may not be able to compare the amount of grass they eat every day, so you still have to pay attention to the proportion."
        },
        {
          "zh": "比如不吃肉的话，那么就要多吃大豆蛋白，而且还要比正常吃肉的量还要大才行。",
          "en": "For example, if you don't eat meat, then you need to eat more soybean protein, and the amount should be larger than the amount of normal meat consumption."
        },
        {
          "zh": "脂肪的话，可以考虑牛油果，也算是优质脂肪了。",
          "en": "As for fat, you can consider avocado, which is also considered a high-quality fat."
        },
        {
          "zh": "总的而言，长期吃素当然没问题，但是对钱包要求其实更高，如果是穷人，还是不要折腾了。",
          "en": "In general, there is definitely no problem with long-term vegetarianism, but it actually requires more of your wallet. If you are poor, don't bother."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@seres 厉害，隔空就诊",
          "en": "@seres Awesome, remote diagnosis"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@nothingistrue 多臆造点自己相信的历史方向，多忽略历史内容细节和环境，然后用以偏概全，混淆主次等方法能让自己变得语气更强硬，更具有说服力。",
          "en": "@nothingistrue Fabricate more historical directions that you believe in, ignore more historical content details and environment, and then use methods such as generalizing, confusing the main and the secondary to make yourself sound more assertive and more persuasive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "长期是多长期啊 几个月 几年 一辈子？",
          "en": "How long is long-term? A few months? A few years? A lifetime?"
        },
        {
          "zh": "而且吃不吃鸡蛋？",
          "en": "And do you eat eggs?"
        },
        {
          "zh": "这个区别还是很大的",
          "en": "This difference is still very big"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "据说百年之后会出舍利子",
          "en": "It is said that relics will appear after a hundred years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只吃素食会营养不良的，蛋白质是人体必须的，特别是动物蛋白。",
          "en": "Eating only vegetarian food will lead to malnutrition. Protein is essential for the human body, especially animal protein."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我奶奶经常吃素，后来再也不吃了，经常吃素对身体不好",
          "en": "My grandma often ate vegetarian food, but later she stopped eating it. Eating vegetarian food often is not good for your health"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@buxudashi 碳水吃多了会胖吧？",
          "en": "@buxudashi Won't you get fat if you eat too many carbohydrates?"
        },
        {
          "zh": "另外吃素会不会体质变差，就是容易感冒发烧？",
          "en": "Also, will eating vegetarian food make your physique worse, that is, are you prone to colds and fevers?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把这个问题问了一下 chatgpt4 ，直接吓尿，哈哈",
          "en": "I asked this question to chatgpt4, and it scared me to death, haha"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "纯素肯定不行,至少得加点豆腐,火腿肠,鸡蛋,牛奶之类的",
          "en": "Pure vegetarianism is definitely not possible, at least you have to add some tofu, sausage, eggs, milk and the like"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "身边很少有人纯叫素.",
          "en": "There are very few people around me who are purely vegetarian."
        },
        {
          "zh": "我老家有一个人在 20 多年前就纯素.",
          "en": "There is a person in my hometown who was purely vegetarian over 20 years ago."
        },
        {
          "zh": "在乡下算是大家眼中的另类了.",
          "en": "He is considered a different person in the eyes of everyone in the countryside."
        },
        {
          "zh": "反正他年纪不大, 头发就白了不少.",
          "en": "Anyway, he's not old, but his hair has turned quite white."
        },
        {
          "zh": "不懂和纯素有没有关系.",
          "en": "I don't know if it has anything to do with pure vegetarianism."
        },
        {
          "zh": "真正的纯素, 鸡蛋也不吃.",
          "en": "Real pure vegetarians don't eat eggs either."
        },
        {
          "zh": "炒菜用的油都得是素油",
          "en": "The oil used for cooking must be vegetarian oil"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@whosesmile 没那种感觉。",
          "en": "@whosesmile I don't feel that way."
        },
        {
          "zh": "感冒发烧比别人多更加不存在。",
          "en": "It's even more impossible for me to have more colds and fevers than others."
        },
        {
          "zh": "除了吃冰西瓜我的胃有点不舒服外（现在戒几年了又没这感觉了）。",
          "en": "Except that my stomach is a little uncomfortable after eating ice watermelon (I've quit for a few years now and don't feel this way anymore)."
        },
        {
          "zh": "其他感受不出来跟别人的区别。",
          "en": "I can't feel any difference from others."
        },
        {
          "zh": "其实我不吃肉最担心的反而是我爸妈。",
          "en": "Actually, the people I worry about the most not eating meat are my parents."
        },
        {
          "zh": "但是发现也没啥区别他们也就释然了。",
          "en": "But they have found that there's no difference, so they are relieved."
        },
        {
          "zh": "回家给我做东西都是特意不弄肉的。",
          "en": "When I go home, they deliberately don't put meat in the things they make for me."
        },
        {
          "zh": "饺子也是单独给我煮的。",
          "en": "Dumplings are also cooked separately for me."
        },
        {
          "zh": "毕竟除了我他们都是吃肉的。",
          "en": "After all, they all eat meat except me."
        },
        {
          "zh": "出门在外吃饭都是特别说明解释一下。",
          "en": "When eating out, I always explain it specially."
        },
        {
          "zh": "大家好像也都理解也就都不说什么。",
          "en": "Everyone seems to understand and doesn't say anything."
        },
        {
          "zh": "心理上我已经不把肉当食物。",
          "en": "Psychologically, I don't consider meat as food anymore."
        },
        {
          "zh": "就算饿看到肉跟看到桌子没太大区别。",
          "en": "Even if I'm hungry, seeing meat is not much different from seeing a table."
        },
        {
          "zh": "脑力劳动者。",
          "en": "I'm a mental worker."
        },
        {
          "zh": "做不了重体力活。",
          "en": "I can't do heavy physical work."
        },
        {
          "zh": "但这个我估计是程序员都差不多的。",
          "en": "But I guess this is the same for programmers."
        },
        {
          "zh": "以上就是我遇到的情况。",
          "en": "That's what I've encountered."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "豆制品可以补充 蛋白质",
          "en": "Soy products can supplement protein"
        }
      ],
      "type": "replies"
    }
  ]
}