{
  "id": 1014565,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "过年回家怎么喝咖啡？",
          "en": "How do you drink coffee when you go home for the New Year?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "公司茶水间有一台全自动浓缩咖啡机，自己买豆随便用，几年来已经养成了每天早上中午一杯浓缩加牛奶的习惯。但回到家里就没这个条件了，买咖啡粉自己冲的太淡，买一台胶囊机放家里一年回来用一周又觉得有点浪费，一天两杯外卖的话感觉太破费了。不知道还有什么方案？之前在超市看到过浓缩咖啡液和浓缩咖啡粉，不知道味道如何。",
          "en": "The company's pantry has a fully automatic espresso machine, and I can buy my own beans to use, so for several years I've developed the habit of having a shot of espresso with milk every morning and noon. But I don't have that condition when I get home. Buying coffee grounds to brew myself is too weak. Buying a capsule machine and putting it at home only to use it for a week when I come back after a year feels like a bit of a waste, while buying two takeaway cups a day feels too extravagant. I wonder what other options there are? I've seen espresso liquid and espresso powder in the supermarket before, but I don't know what they taste like."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你得自己试，每家的粉和液味道都会有些区别，就好比你买不同品牌和产地的豆，味道也有区别。",
          "en": "You have to try it yourself. The taste of the powder and liquid from each brand will be a bit different, just like the taste of beans you buy from different brands and origins."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "三顿半咖啡粉试试看",
          "en": "Try San Dun Ban coffee powder"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "云南小粒速溶+奶，最近发现不错",
          "en": "Yunnan small-grain instant coffee + milk, it's quite good recently"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把公司的咖啡机抱回去，上班再带回来[:/doge]",
          "en": "Take the company's coffee machine back home and bring it back to work [:/doge]"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "冻干",
          "en": "Freeze-dried"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "胶囊机买了带回住的地方",
          "en": "Bought a capsule machine and took it back to where I live"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挂耳咖啡",
          "en": "Pour-over coffee"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "瑞幸咖啡 9.9 还没开到你家吗，那就 Moccona 速溶是比较好的。",
          "en": "Has Luckin Coffee's 9.9 deal not reached your place yet? Then Moccona instant coffee is a better choice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "回家挂耳比较方便。我喝过几家的浓缩咖啡液其实味道不错。",
          "en": "Pour-over coffee is more convenient at home. I've drunk espresso liquid from several brands, and the taste is actually quite good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一周不喝（或喝淡点）不行么？",
          "en": "Can't you not drink it for a week (or drink a weaker version)?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "三顿半浓缩咖啡液",
          "en": "San Dun Ban espresso liquid"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挂耳就可以了。我选择把装备带回去",
          "en": "Pour-over coffee is fine. I choose to take the equipment back"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试试冻干",
          "en": "Try freeze-dried"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在十八线都一堆瑞幸，随便买。",
          "en": "Now even the eighteenth-tier cities have a bunch of Luckin, so you can buy it anywhere."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "手磨+摩卡壶，加奶其实我喝不出来跟半自动做的有什么差别",
          "en": "Hand grinding + Moka pot, with milk, I actually can't tell the difference from what a semi-automatic machine makes"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当然是隅田川辣！过年吃的多不消化，就用它！",
          "en": "Of course, it's Sumidagawa! You eat a lot during the New Year and it's hard to digest, so use it!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "冻干，浓缩咖啡液。牛奶， 家里的打蛋器打点奶泡。  口感不错。或者挂耳。",
          "en": "Freeze-dried, espresso liquid. Milk, use the egg beater at home to whip some milk foam. The taste is good. Or pour-over."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我买的 nespresso 咖啡胶囊机 可以直接装在一个小皮箱里(30*25*18) 很方便到处带着",
          "en": "The Nespresso coffee capsule machine I bought can be put directly into a small suitcase (30*25*18), which is very convenient to carry around."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不喝 或者瑞幸",
          "en": "Don't drink it or Luckin"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是自己买了封口机自制挂耳，成本很低，不算麻烦如果 op 想喝浓度高一些的，可以搜搜 omnicup 手压咖啡机，一百来块，有热水就能做浓缩（需要一台磨豆机，或者淘宝买磨好的咖啡粉，如果都嫌麻烦，可以买 omnicup 的胶囊版本）",
          "en": "I bought a sealing machine to make my own pour-over coffee. The cost is very low and it's not troublesome. If the OP wants to drink a higher concentration, you can search for the omnicup manual press coffee machine. It's about a hundred yuan, and you can make espresso with hot water (you need a grinder, or you can buy ground coffee powder on Taobao. If you think it's too troublesome, you can buy the capsule version of omnicup)"
        }
      ],
      "type": "replies"
    }
  ]
}