{
  "id": 1016166,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "今年的目标， Run 到加拿大",
          "en": "This year's goal, Run to Canada"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "年前跟中介交流过，雇主移民费用在 100 万人民币左右，可以分期五年支付，今年的目标就这个了，明年等到了加拿大给各位做汇报。",
          "en": "I talked to an agent before the year, and the employer immigration fee is about 1 million RMB, which can be paid in installments over five years. This is the goal for this year, and I will report to everyone when I get to Canada next year."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "实话实说，你几乎百分之百会上当。",
          "en": "To be honest, you will almost certainly be fooled."
        },
        {
          "zh": "当然你可以不信。",
          "en": "Of course, you can choose not to believe it."
        },
        {
          "zh": "国外社会这种弱肉强食非常常见，也算一种提前体验吧。",
          "en": "This kind of survival of the fittest is very common in foreign societies, and it can be considered a foretaste."
        },
        {
          "zh": "这种事情包成功否则不退款没有意义。",
          "en": "It is meaningless for this kind of thing to guarantee success or no refund."
        },
        {
          "zh": "他不退，你难道跟他打国际官司？",
          "en": "If he doesn't refund, are you going to sue him internationally?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Dosenf 不成功退款基本是幌子，不可能的。",
          "en": "@Dosenf Failure to refund is basically a cover, it's impossible."
        },
        {
          "zh": "花前买雇主移民是非法，哪天被查到或被举报，就等着坐牢遣返吧。",
          "en": "Buying employer immigration before the fact is illegal, if it is found or reported one day, you will be waiting to go to jail and be deported."
        },
        {
          "zh": "然后入境任何发达国家就成为了不可能。",
          "en": "Then it becomes impossible to enter any developed country."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 后来婚离了吗？https://v2ex.com/t/991508#reply301",
          "en": "Did OP get divorced later? https://v2ex.com/t/991508#reply301"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wjfz #59 除了你说的中介的坑，这个有没有坑还两说。",
          "en": "@wjfz #59 Besides the pitfalls of the agent you mentioned, whether this has any pitfalls is still up for debate."
        },
        {
          "zh": "其他的坑你在国内没有？",
          "en": "Don't you have other pitfalls in China?"
        },
        {
          "zh": "还政治正确，笑死",
          "en": "And political correctness, lol"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sky2017 #65 赶紧润，在国内多呆一秒我都看不起你。",
          "en": "@sky2017 #65 Run quickly, I look down on you if you stay in China for one more second."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "何必跑那苦寒之地去遭罪",
          "en": "Why bother going to that cold and desolate place to suffer"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "强烈支持, 多出去点人, 不用那么卷...",
          "en": "Strongly support, more people go out, don't have to be so competitive..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "强烈支持，多出去点人吧",
          "en": "Strongly support, let more people go out"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@1145148964 润是 v2 的最高政治正确",
          "en": "@1145148964 Run is the highest political correctness of v2"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好像 run 出去就是天堂一样。。。",
          "en": "It seems like running out is like heaven..."
        },
        {
          "zh": "搞不明白 有这个实力在国内也能过的很好啊。",
          "en": "I don't understand, with this strength, you can live very well in China too."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么这么多泼冷水的, 加拿大再不济下限还是比较高的祝楼主成功, 一切顺利.",
          "en": "Why so many people pour cold water, even if Canada is not good, the lower limit is still relatively high, I wish the OP success and everything goes well."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐等捷报",
          "en": "Waiting for good news"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "含泪赚取 99 万",
          "en": "Earn 990,000 with tears"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加拿大移民不要找中介.",
          "en": "Don't look for an agent for Canadian immigration."
        },
        {
          "zh": "尤其是在中国境内说中文的中介.",
          "en": "Especially agents who speak Chinese within China."
        },
        {
          "zh": "花钱买工作骗局多, 也许人家是真的退费, 但是真的就赚你个现金流或者 \"一万块钱手续费\"这是你的移民不是你中介的移民, 所有的项目要求材料要求你自己都要看过.",
          "en": "There are many scams to buy jobs, maybe they really refund, but they really just earn your cash flow or a \"ten thousand yuan handling fee\". This is your immigration, not your agent's immigration, all the project requirements and material requirements you have to see yourself."
        },
        {
          "zh": "中介材料造假是重灾区.",
          "en": "Agent's material fraud is a disaster area."
        },
        {
          "zh": "最后出问题后患无穷.",
          "en": "The consequences are endless if problems arise in the end."
        },
        {
          "zh": "也许最不起眼的 100-200cad 找一个 RCIC 为您评估一下当前的选择是您移民路上性价比最高的一笔消费.",
          "en": "Maybe the most inconspicuous 100-200cad to find a RCIC to evaluate your current choice is the most cost-effective expense on your immigration journey."
        },
        {
          "zh": "如果您也是程序员可以跟我一样走 SUV 几个月就可以拿工签带全家走.",
          "en": "If you are also a programmer, you can get a work permit in a few months like me and take your whole family."
        },
        {
          "zh": "我已经来加拿大一年半了.",
          "en": "I have been in Canada for a year and a half."
        },
        {
          "zh": "已经走到 PR 补充材料阶段了.",
          "en": "I have reached the PR supplementary materials stage."
        },
        {
          "zh": "真心建议您三思.",
          "en": "I sincerely suggest you to think twice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "支持，坐等捷报。",
          "en": "Support, waiting for good news."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "慎重+1 加拿大现在不景气+1 以及虽然买雇主移民非法我身边朋友好几个都是买雇主拿 pr 的",
          "en": "Be cautious +1 Canada is not doing well now +1 and although buying employer immigration is illegal, several of my friends have bought employers to get PR"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "插眼, 加入收藏了.",
          "en": "Eye-catching, added to favorites."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "花 100 万雇主移民，您是真的有钱...我建议你先过去一趟呆俩月，一个是看看那边的具体环境，另一个是找一个本地靠谱点的中介。",
          "en": "Spending 1 million on employer immigration, you are really rich... I suggest you go there for a couple of months first, one is to see the specific environment there, and the other is to find a more reliable local agent."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "支持，坐等捷报。",
          "en": "Support, waiting for good news."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加拿大移民政策收紧了，技术人才的分数越卷越高，能被捞到已经很不容易了，就算被捞，后续被安调的概率也比疫情以前大多了，被安调，获取 PR 的时间就会被拉长至少一年，从登陆到获取 PR 的时间里面，你只凭一个封闭式工签很难找工作的，加拿大的物价消费……..，风险很大啊，只能说，希望你三思而后行。",
          "en": "Canadian immigration policy has tightened, the scores of skilled talents are getting more and more competitive, it's not easy to be selected, even if you are selected, the probability of subsequent security checks is much higher than before the epidemic, if security checked, the time to obtain PR will be extended for at least one year, from landing to obtaining PR, you only rely on a closed work permit, it is difficult to find a job, the prices and consumption in Canada...… the risk is very high, I can only say, hope you think twice before you act."
        },
        {
          "zh": "这个消息你看到，对你会很有用，你也可以无视，但这就是事实。",
          "en": "You will find this message very useful, you can also ignore it, but that's the truth."
        }
      ],
      "type": "replies"
    }
  ]
}