{
  "id": 1013250,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "简历里要不要写自己的折腾经历",
          "en": "Should you write your own tinkering experiences in your resume"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "最近在更新简历，想起来自己花了不少时间折腾 Openwrt ，VPN ，Docker ，Blog ，GithubAction 等等，都是一些为自己服务的工具。花了不少时间，也学到不少东西。",
          "en": "I'm updating my resume recently, and I remembered that I spent a lot of time tinkering with Openwrt, VPN, Docker, Blog, GithubAction, etc., which are all tools that serve me. I've spent a lot of time, and learned a lot of things."
        },
        {
          "zh": "\r\n虽然 github repo 上也没几个 star ，但是不知道要不要写到简历里，好处可能是丰富内容，坏处就是与工作无关不务正业。",
          "en": "Although there are not many stars on the github repo, I don't know if I should write it in my resume. The advantage might be enriching the content, and the disadvantage is that it has nothing to do with work and is not doing the right thing."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "理解兄弟的心情，自己花那么多时间，折腾和学习了那么多东西，感觉自己在某些方面有很多闪光点。期望在找工作时，可以被人发现。",
          "en": "I understand how you feel, you've spent so much time tinkering and learning so many things, and you feel that you have many highlights in some aspects. You hope that you can be discovered when looking for a job."
        },
        {
          "zh": "感觉这个看面试官，看缘分了。",
          "en": "I feel this depends on the interviewer, it depends on fate."
        },
        {
          "zh": "有些人和你兴趣相同，觉得这种人面对工作态度会更积极，也许就要了。",
          "en": "Some people share your interests and feel that this kind of person will be more positive in their attitude towards work, and they may hire you."
        },
        {
          "zh": "有些人对工作可能非常理性，就觉得这些你个人成长的东西对他和要面对的工作来说没有价值。",
          "en": "Some people may be very rational about work and feel that these things for your personal growth are not valuable to them and the work they have to face."
        },
        {
          "zh": "如果我面试的时候，我是会深入问一些的，看看你在研究这些东西的时候，是一个什么样的思维模式，处理事情的逻辑。",
          "en": "If I were interviewing, I would ask some in-depth questions to see what kind of thought process and logic you have when you are researching these things."
        },
        {
          "zh": "如果能从中发现你的能力。",
          "en": "If I can discover your abilities from them."
        },
        {
          "zh": "然后岗位需要的基本技能又能达标，那是会加分的。",
          "en": "And if the basic skills required by the position can be met, it will be a plus."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得可以写, 说明你对技术有种额外的兴趣, 而不是单纯为了混饭吃. 这种特质挺打动人的.",
          "en": "I think you can write it, it shows that you have an extra interest in technology, rather than just for a living. This trait is quite touching."
        },
        {
          "zh": "比如我看到一个人自己业余时间捣鼓树莓派帮自己家自动化了什么东西之类, 比那些千篇一律的无聊简历亮眼多了.",
          "en": "For example, when I see someone tinkering with a Raspberry Pi in their spare time to automate something for their home, it's much more eye-catching than those monotonous and boring resumes."
        },
        {
          "zh": "我会好奇并给你一次展示自己的机会.",
          "en": "I will be curious and give you a chance to show yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "写了也没啥，我如果是面试的就会有好感",
          "en": "It's okay to write it, I would have a good impression if I were interviewing"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以，只要不是空的都可以写。",
          "en": "Yes, you can write anything as long as it's not empty."
        },
        {
          "zh": "让面试官有更多了解你的途径如果放个空的 github 账号则会让人感觉迷惑，我遇到过这样的候选人",
          "en": "Give the interviewer more ways to understand you. If you put an empty github account, it will make people feel confused, I have met such candidates"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@harmless 然而事实上所谓的正式项目也只不过是一堆草台班子的玩意，并没有比个人折腾的好哪里去。（当然可能是我本身已经有很多正式项目的经验的关系）",
          "en": "@harmless In fact, so-called formal projects are just a bunch of makeshift things, not much better than personal tinkering. (Of course, it might be because I already have a lot of experience with formal projects)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚毕业可以写，因为本来就没什么实际项目能写，写这些至少能体现出一些个人特质，比如喜欢技术、有自驱力、喜欢钻研。",
          "en": "You can write it if you are a fresh graduate, because you don't have many actual projects to write, and writing these can at least reflect some personal characteristics, such as liking technology, self-driving ability, and a love of research."
        },
        {
          "zh": "但如果都工作了几年还写这些不新鲜且缺乏深度的事情，就没什么意义了。",
          "en": "But if you have been working for several years and are still writing about these things that are not new and lack depth, it is meaningless."
        },
        {
          "zh": "尤其是在正经项目内容少的情况下还会起到反效果，只会让人感觉做事能力不行、学习能力也不行，这点事情也要特意写到简历上炫耀。",
          "en": "Especially when the content of the formal projects is less, it will have the opposite effect, and it will only make people feel that you are not good at doing things and not good at learning, and you even need to write this thing on your resume to show off."
        },
        {
          "zh": "换个场景就是：小朋友拿个刚买的文具盒给别人展示有多好玩没问题，大人还这样就是幼稚了。",
          "en": "In another scenario: it's okay for a child to show others how fun their new pencil case is, but it's childish for adults to do the same."
        },
        {
          "zh": "但大人如果拿个自己设计的创意文具盒出来，展示设计有多巧妙，这是没问题的。",
          "en": "But if an adult takes out a creative pencil case designed by themselves and shows how ingenious the design is, it's okay."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我最近把做的开源项目写进简历了，然后面某一家的时候对面说他们希望候选人可以把全部精力放在工作上，开源的事就别搞了——于是我确定了自己和这家的调性不符（当然也结合了其他方面考虑），拒绝了他们。",
          "en": "I recently wrote the open source projects I did into my resume, and when I interviewed with a company, the other side said that they hoped candidates could put all their energy into work and not do open source things - so I determined that I didn't match the tone of this company (of course, I also considered other aspects) and rejected them."
        },
        {
          "zh": "说到底写简历和面试应该是个互相认识和双向选择的过程，我个人的想法还是不要为了“容易过”把自己搞得不是自己，这样即使最后通过了，工作中也是折磨。",
          "en": "In the end, writing a resume and interviewing should be a process of mutual understanding and two-way selection. My personal idea is still not to make myself not myself for the sake of \"easy pass\", even if you pass in the end, it will be torture in work."
        },
        {
          "zh": "不如在一开始就表明自己是个怎么样的人，有哪些特质，如果公司团队能接受我这样的人再考虑后面的事儿。",
          "en": "It's better to show what kind of person you are and what characteristics you have at the beginning, and then consider the rest of the things if the company team can accept a person like me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@debuggerx 这种公司不去也罢，公司里面很多东西真就是硬搬砖，谁都能干，而且狗屎一样的代码，一点设计都没有，我自己写的代码 我都有代码洁癖，公司的代码我都是糊弄一下，反正大家都是堆面条，我也是堆面条，打份工而已，公司没有这方面的需求，只要求业务，那堆面条就是，反正留下的都是一堆狗看了都嫌弃的面条屎，根本体现不了一个人的价值跟能力，我全年一个线上事故没有，组里面 好几个有背线上事故，结果我年底背个 C ，说我代码质量问题多，这找谁说理去，大环境工作又难找，只能这样了。",
          "en": "@debuggerx It's better not to go to this kind of company, there are many things in the company that are really just hard brick-laying, anyone can do it, and the code is like dog shit, there is no design at all, I have code cleanliness for my own code, I just muddle through the company's code, anyway, everyone is piling noodles, I am also piling noodles, just a job, the company does not have this kind of demand, only requires business, then pile noodles, anyway, what's left is a pile of noodle shit that even dogs despise, it doesn't reflect a person's value and ability at all, I didn't have a single online accident all year round, there were several people in the group who had online accidents, and as a result, I got a C at the end of the year, saying that I had many code quality problems, who can I reason with, the big environment is difficult to find a job, I can only be like this."
        },
        {
          "zh": "所以现实就是大部分工作就是打份工而已，如果是我面试，我更乐意看到面试者有自己的想法 以及开源作品之类的，哪怕 github 上有几篇自己的研究，毕竟公司里面的东西，真的就是一坨屎，开源的东西 以及文章才能体现一个人的探索跟学习能力，毕竟搞码的，大多每年要接触新东西，学习能力不够，那真的就是团队里面的一颗屎，有点小问题就得来找你 问东问西",
          "en": "So the reality is that most jobs are just a job, if I were interviewing, I would be more willing to see the interviewee have their own ideas and open source works, even if there are a few of their own studies on github, after all, the things in the company are really a pile of shit, open source things and articles can reflect a person's exploration and learning ability, after all, the code creators, most of them have to come into contact with new things every year, if your learning ability is not enough, then you are really a shit in the team, you have to come to you with a little problem and ask questions"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "openwrt → 企业域控网络docker → K8sVPN → 企业内外网安全策略GitHub action → 软开全流程自动化控制系统有一个能成功从个人爱好升级到专业领域就足够你吃了",
          "en": "openwrt → enterprise domain control network docker → K8sVPN → enterprise intranet and extranet security strategy GitHub action → soft development full process automation control system, having one that can successfully upgrade from personal hobbies to professional fields is enough for you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“折腾”是指按着教程跑一边的消磨时间的行为？",
          "en": "Does \"tinkering\" mean the behavior of running through a tutorial to pass the time?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@morgan1freeman 懂业务是懂业务的未来发展规划、业务的痛点，懂业界竞品都在干什么，懂业务在绩效考核上真正的亮点是什么。",
          "en": "@morgan1freeman Understanding the business means understanding the future development planning of the business, the pain points of the business, what the industry competitors are doing, and what the real highlights of the business are in terms of performance evaluation."
        },
        {
          "zh": "你说的表结构、项目架构等“业务”，可以说是架构师的“业务”，但不是一线开发的“业务”。",
          "en": "The \"business\" you mentioned, such as table structures and project architecture, can be said to be the \"business\" of architects, but not the \"business\" of front-line developers."
        },
        {
          "zh": "说白了，代码写得好并不能让你升职加薪，懂业务找亮点、真的解决了用户侧的痛点，这才是懂业务，在某种程序，是需要跳出“代码”这个视角，从产品角度来考虑的",
          "en": "To put it bluntly, writing good code can't get you a promotion and salary increase, understanding the business, finding highlights, and really solving the pain points of the user side, this is understanding the business, in a certain degree, it is necessary to step out of the \"code\" perspective and consider it from a product perspective"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "国内不清楚，国外的话都是写的。",
          "en": "I don't know about China, but in foreign countries they all write it."
        },
        {
          "zh": "人家连打羽毛球旅游摄影做家教都能写，自己折腾 docker 不是理所当然更值得写吗。",
          "en": "They can even write about playing badminton, traveling, photography, and tutoring, isn't tinkering with docker more worth writing?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不写，因为只是你自己折腾，远远没有达到正式环境下使用的程度 也不知道正式环境下的各种规章流程。",
          "en": "Don't write it, because you are just tinkering by yourself, far from reaching the level of use in a formal environment, and you don't know the various rules and processes of a formal environment."
        },
        {
          "zh": "在交流的时候如果提到 可以说",
          "en": "You can mention it when communicating"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lcy630409 Make Sense. 是不是可以在不起眼的地方写上一行，比如语言/软件技能里",
          "en": "@lcy630409 Make Sense. Can I write a line in an inconspicuous place, such as in language/software skills"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "做过的正式项目永远是最有用的，写一堆折腾过的东西反而说明没啥项目可写",
          "en": "Formal projects that have been done are always the most useful, writing a bunch of tinkering things instead shows that there are no projects to write"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "简历只写对投递岗位有用的技能",
          "en": "Only write skills that are useful for the job application in the resume"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不能写，简历只可以写和岗位相关或匹配的东西。",
          "en": "You can't write it, the resume can only write things that are related to or match the position."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这种折腾可以在论坛发个贴。",
          "en": "This kind of tinkering can be posted on the forum."
        },
        {
          "zh": "如果是写个极简版的 VPN 或者 docker ，也许值得写在简历中。",
          "en": "If it's a minimalist version of VPN or docker, it might be worth writing in your resume."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我不知道大家简历啥样子的，但我的简历是有个顺序 [Summary -> Work Experience -> Project -> Education -> Additional Info]，比如我是前端选手，首先放个个人博客，里面有每个折腾做的小东西的具体信息， 然后我把所有我折腾过有经历的 经验和用过的技术都加到了简介和补充信息里面，比如自学 rust ，svelte ，expressjs ，做了个小模拟器，画 ui 设计图，移动端开发，维护一个游戏服务器和脚本啥的。",
          "en": "I don't know what everyone's resume is like, but my resume has an order [Summary -> Work Experience -> Project -> Education -> Additional Info], for example, I am a front-end player, first put a personal blog, which has specific information about each small thing I have tinkered with, then I added all the experiences and technologies I have used in tinkering to the introduction and additional information, such as self-taught rust, svelte, expressjs, made a small simulator, drew UI design drawings, mobile terminal development, maintained a game server and scripts, etc."
        },
        {
          "zh": "正文的工作经历和项目就不带这些了",
          "en": "The work experience and projects in the body of the text do not include these"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这种比什么精通，熟悉强太多了，细节有助于对你的了解，而且也有助于后面的提问，我是面试官会给你加分的",
          "en": "This is much stronger than what is proficient and familiar, the details help to understand you, and also help with the questions later, I will give you extra points if I am the interviewer"
        }
      ],
      "type": "replies"
    }
  ]
}