{
  "id": 1018492,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "母亲嗜赌成性怎么办？",
          "en": "What should I do if my mother is addicted to gambling?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "op 今年 24 岁单亲跟随母亲生活，母亲 54 岁无业无存款，唯一爱好就是打牌，经常打牌。并且打牌只说赢不说输，没钱就找我要，不知道怎么处理打牌这件事。因为打牌吵过无数次架不知道怎么解决。单亲的一部分原因也是因为父亲受不了她打牌输空家底，经常家暴最后选择分居。之前还觉得她很可怜命苦，但是现在越来越厌烦感觉有些不孝顺的想法。",
          "en": "OP is 24 years old and lives with their single mother. The mother is 54 years old, unemployed, and has no savings. Her only hobby is playing cards, and she does it frequently. She only talks about winning and not losing when playing cards, and if she runs out of money, she asks me for it. I don't know how to handle this gambling situation. We've argued countless times because of the gambling, and I don't know how to solve it. Part of the reason for being a single-parent family is also because the father couldn't stand her gambling and losing all their savings, often resorting to domestic violence and eventually choosing to separate. I used to feel sorry for her and think she had a hard life, but now I'm increasingly annoyed and feel somewhat disloyal."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "和你母亲说，她自己的钱她爱怎么花都行，全都赌输了也行，但是你的钱一分钱也不会给她拿去赌，她想吃什么要什么你都可以给她买，多少钱也不心疼，但是之后不会给她任何现金。这点一定要坚决，哪怕她去借钱，也不能松口，法律上你放弃继承 her 的遗产，就不用承担她的债务。",
          "en": "Tell your mother that she can spend her own money however she likes, even if she loses it all gambling. But she will not get a single penny of your money to gamble with. You can buy her anything she wants to eat or have, no matter the cost, but you will not give her any cash after that. You must be firm on this point. Even if she goes to borrow money, you cannot budge. Legally, if you waive your inheritance of her estate, you will not be liable for her debts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去棋牌室闹一顿，只要棋牌室让她打，就报警说赌博。老板不傻",
          "en": "Make a scene at the card room. As long as the card room lets her play, report them for gambling. The boss isn't stupid."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "告诉她你股票亏了几十万正在想找谁借点钱来补仓",
          "en": "Tell her you've lost hundreds of thousands of yuan in the stock market and are thinking about borrowing money to cover your positions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己狠不下心，网友在这还劝个 p 啊吃瓜群众快散了吧，咸吃萝卜淡操心",
          "en": "If you can't be ruthless, what's the point of netizens giving advice? People watching the show, just go home, you are worrying about things that don't affect you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan #42 低估赌瘾了，要是都能玩欢乐斗地主，那还有这么多赌狗吗，他们玩的就是赌钱的那个感觉，你欢乐豆能换钱吗",
          "en": "@coderluan #42 You're underestimating the gambling addiction. If they could all play Happy Landlord, would there be so many gambling addicts? What they are playing for is the feeling of betting money. Can you exchange Happy Beans for money?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "黄赌毒，黄赌毒口号喊了这么多年你还不清醒么",
          "en": "Prostitution, gambling, and drugs. The slogan of prostitution, gambling, and drugs has been shouted for so many years, and you're still not awake?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌鬼最大的问题不是赌。是他们除了赌，无所事事。所以针对这两个问题解决，找事情干，找工作做，然后闲暇时间有点兴趣爱好，哪怕是看电视剧有木有。单纯的去解决赌瘾是很难的。",
          "en": "The biggest problem with gamblers isn't gambling itself. It's that they have nothing else to do besides gambling. So address these two issues: find things to do, find a job, and then have some hobbies in your free time, even if it's watching TV. It's very difficult to simply solve the gambling addiction."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我父母就是啊。他们的所有钱都输完了。导致我读完大学家里一分钱都没有。连最后一年大学都没钱给学费。不过我父母强的一点是，没钱就自己挣，10 多年了。他们两老自己老家挣了一套房，自己给自己买了保险，补了社保。一个月退休两个人拿 8000 多。真的幸运到爆炸。对于我而言，就苦一点，从大学毕业就没找家里拿一分钱。买房买车生娃养娃都我自己来，有多苦，坐标北京。现在两老退休了，反正他们拿 8000 多，他们给我算过，就算这样，他们这 10 多年还是输了 30-40 万。但各自安好，我也不干涉。打牌也是娱乐的一种，平均一年 3-4 万。年纪大了也没任何其他业余活动，这点钱是消遣了。所以我反而鼓励他们出去打牌，我知道他们吸取了教训。打点小牌，一把输赢 100-200 那种真无所谓。但是我话说的直，打牌可以，输完自己的钱找我要钱只有生活费，我不可能给钱去打牌。",
          "en": "My parents are like that. They lost all their money. As a result, I had nothing from home after graduating from university. I didn't even have money for tuition in the last year of university. But the strong point of my parents is that if they have no money, they earn it themselves. It's been over 10 years. They earned an apartment for themselves back home, bought insurance for themselves, and supplemented social security. They get over 8000 a month in retirement together. It's really lucky to the point of explosion. For me, it's a bit tough. I haven't asked for a penny from home since I graduated from university. I bought a house, a car, had children, and raised them all by myself. It was so hard, and I'm located in Beijing. Now the two old people are retired. Anyway, they get over 8000, and they've calculated it for me. Even so, they still lost 300,000 to 400,000 in these 10-plus years. But everyone is fine, and I don't interfere. Playing cards is also a form of entertainment, averaging 30,000 to 40,000 a year. They are old and have no other hobbies. This amount of money is just for entertainment. So I encourage them to go out and play cards. I know they've learned their lesson. Playing small cards, with a win or loss of 100-200, doesn't really matter. But I'll be frank. They can play cards; if they lose their own money and ask me for more, they'll only get living expenses. I can't give them money to gamble."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "断绝关系。你不欠她的。",
          "en": "Sever the relationship. You don't owe her anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "切割，赌鬼不可信",
          "en": "Cut ties, gamblers are not trustworthy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "断干净别管了，好多中国孩子对原生家庭总是不够狠心，一直默默忍受父母的压榨，多少还是有点蠢的，愚孝。",
          "en": "Cut it off completely and don't worry about it. Many Chinese children are not ruthless enough towards their original families, and they have been silently enduring the exploitation of their parents. It's somewhat foolish, and a misguided sense of filial piety."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就说一点, 赌博戒不了.",
          "en": "Just one thing, gambling can't be quit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "切割。 同事老丈人也是嗜赌成性。小叔子比较给力，赚钱多。有一次直接给老头 300 万，结果半年就输完了。现在小叔子丈母娘都跟他们说别回去拜年，多少钱不够输的。",
          "en": "Cut ties. My colleague's father-in-law is also addicted to gambling. The younger brother-in-law is very capable and earns a lot. One time he gave the old man 3 million, but he lost it all in six months. Now the younger brother-in-law and mother-in-law are telling them not to go back to give New Year's greetings because no amount of money is enough to lose."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我爸一回老家就打牌，天天输天天打，在城市里就不会打牌，没事刷刷抖音极速版，",
          "en": "My dad plays cards as soon as he goes back to his hometown, loses every day, and plays every day. He doesn't play cards in the city; he just watches Douyin's fast version."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌鬼没救的，我爸也这样，前些年我选择直接断绝关系，互不往来了",
          "en": "Gamblers are hopeless. My dad is like that too. A few years ago, I chose to sever the relationship directly and have no contact with him."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "每月固定给生活费就行了，其他不理，比如每月给一千。",
          "en": "Just give a fixed amount for living expenses each month, and don't care about anything else. For example, give one thousand each month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "赌鬼不值得同情且没救",
          "en": "Gamblers are not worthy of sympathy and are beyond help."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说难听点楼主别不爱听，这种女的你不给钱，可能就有乱搞男女关系弄钱。",
          "en": "To put it bluntly, OP, don't be averse to hearing this, if you don't give this kind of woman money, she might get money by having affairs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@AoEiuV020JP #8 之前督促她找工作，在外地找了个工作，也经常请假回老家和牌友打牌，我不准回去就偷偷回去，头疼",
          "en": "@AoEiuV020JP #8 I urged her to find a job before. She found a job in another city, but she often took leave to go back to her hometown and play cards with her friends. If I didn't allow her to go back, she would sneak back. It's a headache."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ramirezyolis808 #13 确实我非常怕她去借网贷什么的，之前还借信用卡什么的，哎",
          "en": "@ramirezyolis808 #13 Indeed, I'm very afraid that she'll borrow money from online lenders or use credit cards, etc. Sigh."
        }
      ],
      "type": "replies"
    }
  ]
}