{
  "id": 1018062,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "入职远程工作两周,感觉不舒服要不要辞职?",
          "en": "Two weeks into remote work, feeling uncomfortable. Should I quit?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "第一次远程工作,过年的时候入职,现在差不多两周\r\n\r\n公司是新加坡,都是坐班模式,我面试的时候,特别提能不能远程\r\n\r\n面完大概 2 个月通知可以远程上班\r\n\r\n目前遇见的问题就是\r\n1:公司坐班模式,然后群里基本不说话,只有我一个在汇报,甚至早会,运营技术对接会,都不让我参加\r\n2:我入职就开始独立开发一个项目,是从考察,对比,规划,开发一个人全包\r\n3:这让我有一种,本来可以外包价给你开发,但是你入职了可以更便宜,进度更快让你开发,因为要日报,周报,星期五下午还要写自己这周有什么升级点\r\n\r\n第 3 个念头起来的时候,我就浑身不舒服,感觉就是这样\r\n\r\n现在犹豫的点就是\r\nA:是不是我太懒,上几天班受不了\r\nB:现在上班是不是都这样,只是我不习惯?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "第一次远程工作,过年的时候入职,现在差不多两周",
          "en": "First time remote work, joined during the Chinese New Year, it's been about two weeks now."
        },
        {
          "zh": "公司是新加坡,都是坐班模式,我面试的时候,特别提能不能远程",
          "en": "The company is in Singapore, and it's a physical office model. I specifically asked about remote work during the interview."
        },
        {
          "zh": "面完大概 2 个月通知可以远程上班",
          "en": "I was notified about being able to work remotely about 2 months after the interview."
        },
        {
          "zh": "目前遇见的问题就是",
          "en": "The current problems are:"
        },
        {
          "zh": "1:公司坐班模式,然后群里基本不说话,只有我一个在汇报,甚至早会,运营技术对接会,都不让我参加",
          "en": "1: The company has an office-based model. The group chat is mostly silent, and I'm the only one reporting. I'm not even allowed to participate in morning meetings or operations/technology meetings."
        },
        {
          "zh": "2:我入职就开始独立开发一个项目,是从考察,对比,规划,开发一个人全包",
          "en": "2: I started independently developing a project when I joined, covering everything from research, comparison, planning, and development."
        },
        {
          "zh": "3:这让我有一种,本来可以外包价给你开发,但是你入职了可以更便宜,进度更快让你开发,因为要日报,周报,星期五下午还要写自己这周有什么升级点",
          "en": "3: This makes me feel like they could have hired an external contractor at a certain price, but it's cheaper and faster to have me develop it. This is because of the daily reports, weekly reports, and having to write about this week's upgrades on Friday afternoon."
        },
        {
          "zh": "第 3 个念头起来的时候,我就浑身不舒服,感觉就是这样",
          "en": "When I have thought number 3, I feel uncomfortable all over, that's just how it feels."
        },
        {
          "zh": "现在犹豫的点就是",
          "en": "The points of hesitation now are:"
        },
        {
          "zh": "A:是不是我太懒,上几天班受不了",
          "en": "A: Am I too lazy to handle a few days of work?"
        },
        {
          "zh": "B:现在上班是不是都这样,只是我不习惯?",
          "en": "B: Is this how work is now, and I'm just not used to it?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你最后这一点非常不错，有自省的能力",
          "en": "Your last point is very good, you have the ability of self-reflection"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "另外，刚入职在新手期就有什么问题都问，因为你有新手光环啊，问什么都不会有人感觉你问的不对的",
          "en": "Also, when you are new, ask any questions you have throughout the new employee period, because you have a newbie halo. No one will feel that your questions are wrong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "进度不要慌，慢慢搞就好了，日报周边学会写废话。只要对面不催你就没事啊，远程上班能一个人负责一个项目挺舒服的其实。",
          "en": "Don't worry about the progress, just take it slowly. Learn how to write some fluff for the daily reports. As long as they don't rush you, you're fine. Actually, it's quite comfortable to be in charge of a project by yourself while working remotely."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "对公司来说你这个远程就是稳定的外包，这么理解没问题。你也索性就把自己当做是在远程接单就好了，还拿着正式员工的待遇，也不用担心接不到单，这样就想得通了。另外可以分享下找远程工作的经验？",
          "en": "For the company, your remote work is essentially stable outsourcing - which isn't a problem to understand it that way. You can just consider yourself as taking remote orders while still enjoying the benefits of a full-time employee, and you don't have to worry about not getting orders. That makes sense. Also, can you share your experience in finding remote work?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这远程干的比去公司上班还累",
          "en": "This remote work is even more tiring than going to the office."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "日报应该是为了确保你真的远程在上班而不是出去玩儿了",
          "en": "The daily reports are probably to make sure you are actually working remotely instead of going out and playing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你的这些事情，可能是公司对你的能力的考验，也是你和公司建立信任的过程。但什么都一把抓没有给你支撑，这说明公司管理有问题，或者真把你当外包，建议还是应该和领导聊一聊，毕竟，一个人的精力是有限的，合理的分工才能事半功倍。远程工作确实考验人的自律性，而且定期的汇报也是建立彼此信任的一个环节。但我挺认可你的感受，一个远程公司，配套的沟通机制、团队建设和项目管理都应该完善，这些都是效率的基础。最后的建议还是，先做准备，然后尽早和公司沟通",
          "en": "These things might be the company's test of your abilities and a process of building trust with the company. But being responsible for everything without any support shows that the company's management has problems or is treating you like an external contractor. It's still recommended that you talk to your leader. After all, a person's energy is limited, and a reasonable division of labor can achieve twice the results with half the effort. Remote work does test a person's self-discipline, and regular reporting is also a part of building mutual trust. But I do agree with your feelings. A remote company should have well-established communication mechanisms, team building, and project management - these are the foundations of efficiency. The final suggestion is to prepare first, then communicate with the company as soon as possible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "连会都不让参加。。。个人感觉已经很明显了，就是把你弄过去 项目上线稳定后滚蛋.. 除非项目特别赚钱，你又很难替代 有可能翻身 比如给你签证啥的。国内防御性编程可以弄起来",
          "en": "Not even allowed to attend meetings... I personally feel it's already obvious; they just brought you in, and after the project goes live and is stable, they'll let you go... Unless the project is very profitable and you are irreplaceable, you might have a chance to turn things around, for example, giving you a visa. Defensive programming can be set up domestically."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不需要协作的远程可太爽了。自己一个人做项目多没劲，开个编程辅导班，招一堆学生，挑几个有前途的把任务拆分，分发给学生做。",
          "en": "Remote work that doesn't require collaboration is great. It's boring to do a project all by yourself. You can start a programming tutoring class, recruit a bunch of students, and break down the tasks, distributing them to the students."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "尝试约个会议跟领导表达一下自己的困惑呢？沟通一下以后的合作模式。以及你可以主动一点跟同事线上打打招呼",
          "en": "Try to schedule a meeting with your leader and express your confusion? Communicate about the future cooperation model. And you can take the initiative to greet your colleagues online."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "把你的活转包给其他人，赚个差价",
          "en": "Subcontract your work to others and earn the difference"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "倒是不太清楚，没有接触过这一类型的工作形势",
          "en": "I'm not very clear, I haven't been exposed to this type of work situation"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一般入职会有分配你一个同事来指导你吧？你有什么问题都可以问他，你没有的话问领导",
          "en": "Usually, a colleague will be assigned to guide you when you join the company, right? You can ask them any questions you have; if you don't have a colleague, ask your leader."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“考察,对比,规划,开发一个人全包”公司没产品经理？小公司？",
          "en": "Inspection, comparison, planning, all-inclusive development by one person. The company doesn't have a product manager? Is it a small company?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看能不能坚持一个月，如果坚持了一个月，还是太难受那就找其他的吧，做人不要太勉强。",
          "en": "See if you can stick it out for a month. If you still feel too uncomfortable after a month, look for something else. Don't force things too much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "问题的关键就是给你的工资合不合理，如果工资是令人满意的，你的这几个问题就不是问题了。很明显，你对远程的工资不满意了。",
          "en": "The key issue is whether your salary is reasonable. If the salary is satisfactory, these issues of yours won't be a problem. It's obvious that you're not satisfied with the remote work salary."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "日报根本不合理，属于外包模式了",
          "en": "The daily reports are simply unreasonable; this is an outsourcing model."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这不挺好的？上班都这样",
          "en": "Isn't this good? This is how work is."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "早会不让参加是什么鬼",
          "en": "What the hell not being allowed to attend morning meetings?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "什么公司",
          "en": "Which company?"
        }
      ],
      "type": "replies"
    }
  ]
}