{
  "id": 1111742,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "有没有爱喝白酒的兄弟，我在给我爸选口粮酒",
          "en": "Are there any brothers who like to drink baijiu? I'm choosing a daily drinking liquor for my dad."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "如题，看了 B 站 五花八门的牌子推荐，整理如下：\r\n\r\n‍换盖银习  金沙回沙回源 金沙摘要 金沙鱼儿  老珍酒   龙滨  北大仓部优 玉蝉 叙府大曲 臻酿  丹泉  乳玻贡   双桥  尖庄红优 台源   全兴  庞泉  红川特曲  金雁  泸州老窖浇头曲  沱牌",
          "en": "As the title says, I watched the recommendations of various brands on Bilibili and compiled them as follows:\r\n\r\n‍Huan Gai Yin Xi, Jinsha Huisha Huiyuan, Jinsha Zhaiyao, Jinsha Yuer, Lao Zhenjiu, Longbin, Beidacang Buyou, Yuchan, Xufu Daqu, Zhenniang, Danquan, Ru Bo Gong, Shuangqiao, Jianzhuang Hongyou, Taiyuan, Quanxing, Pongquan, Hongchuan Techu, Jinyan, Luzhou Laojiao Jiaotouqu, Tuopai"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "冷知识：酒是一级致癌物",
          "en": "Fun fact: alcohol is a Group 1 carcinogen."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我不明白, 既然是口粮酒那就是个人爱好, 大家和你再怎么挑也不如你爸决定",
          "en": "I don't understand, since it's a daily drinking liquor, it's a personal preference. No matter how much we choose with you, it's not as good as your dad's decision."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "黄盖玻汾黄盖玻汾黄盖玻汾黄盖玻汾黄盖玻汾 ！！！！",
          "en": "Huang Gai Bofen, Huang Gai Bofen, Huang Gai Bofen, Huang Gai Bofen, Huang Gai Bofen!!!!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既然是给老爸买的，买最好的不就行了，酒不是好东西，不如买好点的酒，少喝点。",
          "en": "Since you're buying for your dad, why not just buy the best? Alcohol isn't a good thing, it's better to buy better alcohol and drink less."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "收藏了 12 张图，可惜传不了啊",
          "en": "Collected 12 pictures, but unfortunately, I can't upload them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你这写的大部分都是酱酒，而且上面竟然有摘要？摘要是好酒，但是拿来作为口粮酒怕是家里有矿。标题中既然说了是口粮酒，那么一般家庭基本的口粮酒基本不会超过 100 块钱，但是想买能喝的酱酒最少要一百多。所以基本排除酱香（当然上面提到的银习做口粮酒也行，就是价格高点，有钱另说哈）。那么就去选其他香型的就吧。大部分都会选清香，比如黄盖波粉，非常好的口粮酒",
          "en": "Most of what you've written are Jiang-flavored liquors, and there's even Zhaiyao? Zhaiyao is a good liquor, but using it as a daily drinking liquor, you must be rich. Since the title says it's daily drinking liquor, the basic daily drinking liquor for an ordinary family usually won't exceed 100 yuan, but to buy a drinkable Jiang-flavored liquor, it would cost at least a hundred or so. So basically exclude Jiang-flavored (of course, Yin Xi mentioned above can also be used as a daily drinking liquor, it's just a bit expensive, money is another story). Then go and choose other flavor types. Most people would choose light aroma, such as Huang Gai Bofen, which is a very good daily drinking liquor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "国内有没有那种清酒，25 度，不辛辣，不呛口",
          "en": "Are there any kind of sake in China, 25 degrees, not spicy and not irritating?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "泸州老窖头曲吧，100 的价位，口感很好，不上头。还有小郎酒也可以考虑，差不多也是这个价位，平时泯几口很好喝。太便宜的别碰，会喝出人命，太贵的我也喝不起。",
          "en": "Luzhou Laojiao Touqu, around 100 yuan, tastes great and doesn't give a headache. Xiaolang Liquor is also worth considering, around the same price, it tastes great to sip a few mouthfuls. Don't touch the cheap ones, it will kill you. I can't afford the expensive ones either."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "古井贡、小糊涂仙",
          "en": "Gujinggong, Xiaohutu Xian"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能不喝最好还是别喝。要不喝点啤酒吧。。。",
          "en": "It's best not to drink if you can. Otherwise, drink some beer..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "黄盖玻汾",
          "en": "Huang Gai Bofen"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我推荐一个：牛栏山二锅头这个酒假的很多，我爸说如果能找到稳定的正品货源，牛二是好酒",
          "en": "I recommend one: Niulanshan Erguotou. There are many fakes of this liquor. My dad said that if a stable source of genuine products can be found, Niu Er is good liquor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "汾酒",
          "en": "Fenjiu"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "普茅",
          "en": "Puma"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "米香粟子",
          "en": "Rice aroma millet"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还喝，不要命啦",
          "en": "Still drinking, not afraid to die?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就事论事 汾酒",
          "en": "Speaking of which, Fenjiu."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.什么价位的口粮酒2.什么香型的口粮酒没这些前置条件，问的问题没啥意义。针对性不强。答案五花八门也解决不了问题。",
          "en": "1. What price range of daily drinking liquor? 2. What flavor type of daily drinking liquor? Without these preconditions, the question is meaningless. It is not targeted. The various answers also cannot solve the problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "九江双蒸",
          "en": "Jiujiang Shuangzheng"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "少喝点吧 喝酒对身体没什么好处我都是劝长辈戒酒人啊 年纪一上来 身体最重要 其他都是虚的",
          "en": "Drink less. Drinking alcohol is not good for your health. I always advise elders to quit drinking. When you get older, your health is the most important thing. Everything else is superficial."
        }
      ],
      "type": "replies"
    }
  ]
}