{
  "id": 1013812,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "23 年公司效益下滑的情况下，怎么理解一方面冻结员工调薪和压低绩效，一方面给高管发更多的奖金？",
          "en": "Given the decline in company performance in 2023, how do you understand the freezing of employee salary adjustments and lower performance evaluations, while at the same time giving senior executives more bonuses?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "RT\r\n全体员工除极个别都是没有调薪，绩效全都是 1 个月工资；\r\n这么做的用意是啥？通过高管的高额奖金去激励全体员工的奋斗意识么？",
          "en": "RT\r\nExcept for a very few, all employees have not had their salaries adjusted, and performance evaluations are all equivalent to one month's salary;\r\nWhat is the intention of doing this? Is it to motivate all employees' fighting spirit through the high bonuses of senior executives?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "看到楼上有人说管人比技术难太多了……所以这种氛围就是国内技术永远是抄袭，跟风的原因么。没有哪怕一个原创的技术是源自国内的，抄东西改名字倒是很擅长",
          "en": "I saw someone upstairs say that managing people is much more difficult than technology... So is this atmosphere the reason why domestic technology is always copying and following trends? There is not a single original technology originating from China; they are very good at copying things and changing the names."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你不干有的是帕鲁干",
          "en": "If you don't do it, there are plenty of Palu to do it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就和一个封建王朝一样。灭绝的开始就是特权阶级增加，干活干得多拿得少。",
          "en": "It's just like a feudal dynasty. The beginning of extinction is the increase of the privileged class, working more and getting less."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你为什么会假定公司的目标是激励全体员工呢?",
          "en": "Why would you assume the company's goal is to motivate all employees?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你一个大头兵要理解什么，是没发工资吗？要么忍要么滚，要么你也去嘉兴南湖租条船。",
          "en": "What do you, a foot soldier, need to understand? Are you not getting paid? Either endure it or get out, or you can also rent a boat in Nanhu Lake, Jiaxing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你笑他们不懂组织效率，他们笑你不懂办公室政治。",
          "en": "You laugh at them for not understanding organizational efficiency, they laugh at you for not understanding office politics."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说句搞技术不爱听的话，管人比技术难太多了，换句话说，招一个管理比招一个技术难多了，肯定优先保管理啊。",
          "en": "To say something that tech people don't like to hear, managing people is much more difficult than technology. In other words, it's much harder to recruit a manager than to recruit a technician, so management must be prioritized."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没法理解。碰上效益不好的时候，干掉不干活的小领导才是优解。",
          "en": "I can't understand it. When the efficiency is not good, the best solution is to get rid of the small leaders who don't work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以参考《独裁者手册》，公司和政府是差不多的，只为极少数人的利益服务",
          "en": "You can refer to The Dictator's Handbook. Companies and governments are similar, serving only the interests of a very small number of people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "举个例子，朋友公司有个领导是某甲方的关系户，平时不上班，但只要有搞不定的事，他出面立马就搞定甲方。这种人，哪怕公司其他人一分钱不发，也不能亏了他。",
          "en": "For example, a leader in a friend's company is a connected person from a client. He doesn't usually go to work, but as long as there's something that can't be solved, he can immediately solve the client's problems. For this kind of person, even if the other people in the company are not paid a penny, he can't be treated badly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "定决策的是高管呀。。。你个小兵有饭吃就行，人多的是",
          "en": "The decisions are made by the senior executives... You, a small soldier, just need to have food to eat, there are plenty of people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想想这些决定是谁做的",
          "en": "Think about who made these decisions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "补充下，私人公司。公司都是老板一个人说了算。",
          "en": "Just to add, it’s a private company. The boss has the final say in everything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因为在他们看来领导层不好替换，利益关系的纠缠很紧密，招个新的进来还得重新摸清底细。而底层小兵缺多少都很轻易补充回来。",
          "en": "Because in their view, it's not easy to replace the leadership, the entanglement of interests is very close, and a new person has to figure out the details again. However, the lower-level soldiers are very easy to replenish, no matter how many are missing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "历来是，叶可败，枝需留，强干无虞。",
          "en": "Historically, leaves can be lost, branches need to be kept, and strong trunks are safe."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "高管做事么？如果利润主要靠高管那无可厚非，否则准备走人吧。没意思。",
          "en": "Do senior executives do things? If the profits mainly depend on the senior executives, that's understandable, otherwise, prepare to leave. It's not interesting."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多数现代公司的目标有且只有一个,给股东和管理层赚钱",
          "en": "Most modern companies have only one goal: to make money for shareholders and management."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就像滚雪球一样，只要中间核心不坏掉，外边的随便增增减减都没事",
          "en": "It's like a snowball, as long as the core in the middle doesn't break, it doesn't matter if you add or subtract things on the outside."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是那句话，要么__，要么__",
          "en": "As always, either __, or __"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有啥不理解的，你一大头兵要么忍要么滚",
          "en": "What's not to understand? You, a foot soldier, either endure it or get out."
        }
      ],
      "type": "replies"
    }
  ]
}