{
  "id": 1018103,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想请教一下回国的注意事项",
          "en": "Want to ask about the precautions for returning to China"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "今年黄金周准备回国内看一下家里老人家，今年 91 岁啦。  \r\n由于时隔 13 年，特来请教一下各位大佬需要注意点什么。  \r\n目前我想知道的有下面这几点：\r\n- 准备待两周，大概有 10 天闲着，有什么推荐的活动吗\r\n- 需不需要翻墙工具？可能会用到的国外软件为 LINE ，X ，Apple Music ，Youtube ，不确定会不会敲代码\r\n- 常年在国外是不是应该在国内办个网银？有什么推荐的银行吗？不过感觉需要国内手机号。。。\r\n- 没有过二代身份证，补办用的照片可以直接自己照的么（我看支付宝里面有相关的）\r\n- 买点特产送同事的话，推荐送什么（尽量福建地区的，虽然感觉也可以网购）\r\n\r\n目前就这些，如果有什么建议的话欢迎大佬们赐教～",
          "en": "This Golden Week I plan to go back to China to see the elderly at home, who are 91 years old this year.\r\nSince it has been 13 years, I would like to ask you all what I need to pay attention to.\r\nCurrently, I want to know the following:\r\n- I plan to stay for two weeks, with about 10 days of free time. Are there any recommended activities?\r\n- Do I need a VPN? The foreign software I might use is LINE, X, Apple Music, Youtube, and I'm not sure if I will be coding.\r\n- Should I open online banking in China since I'm abroad all year round? Are there any recommended banks? But it seems like I need a Chinese mobile phone number...\r\n- I don't have a second-generation ID card. Can I take the photos for the replacement myself (I saw something related in Alipay)?\r\n- If I want to buy some specialties to give to colleagues, what do you recommend (preferably from Fujian, although I feel like I can also buy them online)?\r\n\r\nThat's all for now. If you have any suggestions, please let me know~"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "只回去两周这么短的话, 不需要特别准备什么, 一晃就过去了, 把自己当来旅游的外国人即可, 不然你真要\"准备\", 像上面有人说的办这个证那个证的, 随便一个东西就一两天搭进去了, 不值得.",
          "en": "If you are only going back for two weeks, you don't need to prepare anything special. It will be over in a flash. Just treat yourself as a tourist. Otherwise, if you really need to 'prepare,' like getting this certificate or that certificate as some people mentioned, it will take a day or two for each item, which is not worth it."
        },
        {
          "zh": "翻墙工具肯定是需要的, 除非你这两周脱离你之前的网络环境, 但是你最好提前试一下你的翻墙工具管不管用.",
          "en": "A VPN is definitely needed unless you disconnect from your previous internet environment for these two weeks. But you'd better test your VPN beforehand to see if it works."
        },
        {
          "zh": "国内办网银或类似的东西, 感觉没必要, 10 天而已, 办二代身份证更没必要了, 花时间, 而且你办了拿来干什么呢",
          "en": "I don't think it's necessary to open online banking or anything similar in China. It's only for 10 days. It's even more unnecessary to get a second-generation ID card. It takes time, and what will you use it for?"
        },
        {
          "zh": "买特产送同事, 我理解你是打算拿回去送你国外的同事. 福建的话, 就茶叶吧, 虽然同事不一定喝茶",
          "en": "If you're buying specialties for colleagues, I understand you're planning to take them back to your foreign colleagues. For Fujian, tea is a good option, although your colleagues may not necessarily drink tea."
        },
        {
          "zh": "看到楼上有人说准备迎接震撼什么的, 大可不必. 楼主是从国外回来又不是从原始社会穿越过来. 十几年也就那么回事, 不至于莫名惊诧",
          "en": "Seeing someone upstairs saying to prepare for a shock or something, there's no need for that. The original poster is returning from abroad, not traveling from a primitive society. A dozen years is just that, not enough to be inexplicably surprised."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "准备好迎接震撼。",
          "en": "Prepare to be shocked."
        },
        {
          "zh": "→_→我 CA 好友回国感言。",
          "en": "→_→My CA friend's reflections on returning to China."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yechentide 支付宝比较优惠.",
          "en": "@yechentide Alipay is more favorable."
        },
        {
          "zh": "单笔 200 以下免 3%手续费.",
          "en": "No 3% service fee for single transactions under 200."
        },
        {
          "zh": "具体可以看下 https://t.me/DocOfCard/2072",
          "en": "You can check https://t.me/DocOfCard/2072 for details."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Q：想请教一下回国的注意事项？",
          "en": "Q: Want to ask about the precautions for returning to China?"
        },
        {
          "zh": "A：不要回国。",
          "en": "A: Don't return to China."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "13 年！祖国变化太大了，如果感觉不适应可以先看下 A 股，应该和你走时候差不多，比较亲切",
          "en": "13 years! The motherland has changed so much. If you feel uncomfortable, you can take a look at the A-shares, which should be about the same as when you left, so it's more familiar."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "除了偷渡过去的我想象不出，一个 80 后出生的人出的什么国十来年也不回去一趟。。。",
          "en": "Besides sneaking in, I can't imagine what country an 80s baby goes to that they don't go back for over a decade..."
        },
        {
          "zh": "提这些问题也感觉有点无病呻吟或者说有些娇柔做作，你都知道 V2EX 这个网站还在问 AM YTB 需不需要翻墙，会不会被查水表。。。",
          "en": "Asking these questions also feels a bit like complaining for the sake of it, or being a bit pretentious. You know that V2EX exists and are still asking if AM and YTB need a VPN and if you'll be checked by the police..."
        },
        {
          "zh": "我这个人就不太委婉，喜欢说点实话",
          "en": "I'm not very tactful, I like to tell the truth."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Rh1 我也想象不出，不喜欢一个贴子还要特地进来回复的人是有多闲。  先不说你是怎么直接给我加上十几岁的，80 后就一定要隔几年回国一趟？知道 V 站和我问那些软件在国内有没有被墙有关系？我又不是全部贴子都看了。  而且楼上老哥们推荐的东西，比如那些临时卡之类的，如果我自己去找要花多少时间，还不一定找的到。",
          "en": "@Rh1 I can't imagine how idle someone must be to dislike a post and still come in to reply. First of all, how did you directly add more than ten years to my age? Does being an 80s baby mean you have to return to China every few years? Does knowing about V Station have anything to do with me asking if those software are blocked in China? I haven't seen all the posts."
        },
        {
          "zh": "我是中国人，外国游客的方法不一定好用，难道不是去中国的社区问更好？比起贴吧难道不是程序员多的 V 站更好？",
          "en": "I'm Chinese. The methods for foreign tourists may not be useful. Isn't it better to ask in a Chinese community? Isn't V Station, which has more programmers, better than Tieba?"
        },
        {
          "zh": "你是觉得我发这贴是炫耀吗？我在日本，日本现在什么情况全球都知道，这也能叫炫耀？你是有多自卑还是做事不经思考？  不好意思我说话也有点直。",
          "en": "Do you think I'm posting this to brag? I'm in Japan, and the whole world knows the situation in Japan right now. Is that considered bragging? How insecure are you, or do you just not think before you act? Sorry, I'm also being a bit direct."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.是2.注册支付宝也可以.",
          "en": "1. Yes. 2. You can also register for Alipay."
        },
        {
          "zh": "能绑定外国信用卡, 大部分地方都能用.",
          "en": "It can bind to foreign credit cards and can be used in most places."
        },
        {
          "zh": "3.有些地方能自己拍 具体要看每个地方的政策.",
          "en": "3. In some places, you can take the photos yourself. It depends on the policies of each place."
        },
        {
          "zh": "4.福建推荐买点糕点 / 茶叶吧.",
          "en": "4. I recommend buying some pastries/tea from Fujian."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@emeab > 注册支付宝也可以.",
          "en": "@emeab > You can also register for Alipay."
        },
        {
          "zh": "能绑定外国信用卡, 大部分地方都能用支付宝我也有了，还可以绑定外国信用卡的吗 hh  可能因为用的太少了都不知道，我去看看",
          "en": "It can bind to foreign credit cards and can be used in most places. I already have Alipay, and it can also bind to foreign credit cards hh. Maybe I don't know because I use it too little. I'll go take a look."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@isc 还是很期待的，准备回去看看母校，虽然初中已经没了",
          "en": "@isc I'm still looking forward to it. I'm going back to see my alma mater, although my junior high school is gone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@emeab 这个好，太感谢了～",
          "en": "@emeab This is great, thank you so much~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "13 年没回那你错过了太多，比如高铁貌似是 2012 年左右开始全国铺开的，移动互联网/支付这些，也基本从那个时候开始的。",
          "en": "If you haven't been back for 13 years, you've missed a lot. For example, high-speed rail seemed to have started spreading across the country around 2012, and mobile internet/payments also basically started around that time."
        },
        {
          "zh": "可以到处走走看看，大城市小地方都可以，重点是好不容易回来一趟，多吃吃美食看看美景。",
          "en": "You can walk around and see things, big cities and small places are all fine. The main thing is that you've finally come back, so eat more delicious food and see more beautiful scenery."
        },
        {
          "zh": "顺便说下，离开故土 13 年不回，你真是狠人。",
          "en": "By the way, you're really a tough person for leaving your homeland and not returning for 13 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议先搞定二代身份证 当然如果还是中国国籍的话  否则办卡坐车啥的多多少少麻烦",
          "en": "It is recommended to get a second-generation ID card first, of course, if you still have Chinese nationality, otherwise it will be more or less troublesome to get a card or take a car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你说的几个 App 只有一个没被墙, 建议自己搭个 Reality 备着, 临时用租机场也可以",
          "en": "Only one of the apps you mentioned is not blocked. It's recommended to set up a Reality yourself as a backup, or use a rented airport temporarily."
        },
        {
          "zh": "国内只要能正常用支付宝或微信就行, 银行不重要",
          "en": "As long as you can use Alipay or WeChat normally in China, the bank is not important."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "10 天半个月的不用过多的准备，也不会走的很远，没什么不同的。",
          "en": "You don't need to prepare too much for 10 days or half a month, and you won't be going very far, so there's nothing different."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 支付宝绑外卡方便",
          "en": "1. It's convenient to bind a foreign card to Alipay."
        },
        {
          "zh": "2. wise 可以给支付宝转账",
          "en": "2. Wise can transfer money to Alipay."
        },
        {
          "zh": "3. 坐火车可以用护照，中国护照也行",
          "en": "3. You can use a passport to take the train, a Chinese passport is fine too."
        },
        {
          "zh": "4. 你用国外电话卡上网，根本没有墙",
          "en": "4. If you use a foreign SIM card to access the internet, there is no firewall at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你的描述你没入籍，还是持中国护照，那么：1 、直接办个二代身份证吧，公安局的办证中心门口一般能照像，直接去即可",
          "en": "From your description, you haven't naturalized and still hold a Chinese passport, then: 1. Just get a second-generation ID card. There is usually a photo booth at the entrance of the police station's certificate processing center. Just go there."
        },
        {
          "zh": "我自己办身份证是在小区楼下的照相馆照相，然后上传打印回执，照相馆的小哥会用 PS 轻微美容下。",
          "en": "When I got my ID card, I took a picture at the photo studio downstairs in my community, and then uploaded and printed the receipt. The guy at the photo studio will use PS to slightly beautify it."
        },
        {
          "zh": "2 、有了身份证后，就去办理一个手机号码吧，号码建议选移动的，个人觉得移动的服务比其他两家好一些。",
          "en": "2. After you have an ID card, get a mobile phone number. It is recommended to choose China Mobile. I personally think China Mobile's service is better than the other two."
        },
        {
          "zh": "选 8 元保号套餐即可，开通下国际长途和国际漫游，这样在海外也能收验证码了。",
          "en": "Choose the 8 yuan number preservation package, and activate international long distance and international roaming, so that you can receive verification codes overseas."
        },
        {
          "zh": "新号可能会交几百押金，其实没关系，慢慢存着扣月租就好。",
          "en": "You may have to pay a few hundred deposits for a new number, but it doesn't matter. Save it slowly to deduct the monthly rent."
        },
        {
          "zh": "尽量去移动的自营营业厅，不要去加盟或合作营业厅。",
          "en": "Try to go to China Mobile's self-operated business hall, not a franchise or cooperative business hall."
        },
        {
          "zh": "具体大打 10086 咨询。",
          "en": "Call 10086 for details."
        },
        {
          "zh": "3 、然后去当地工行或中行开个户。",
          "en": "3. Then go to the local ICBC or Bank of China to open an account."
        },
        {
          "zh": "开户的银行你如果省会城市选省分行营业部，在一般城市选市分行营业部，他们见多识广，小储蓄所会推诿不愿办。",
          "en": "If you are in a provincial capital city, choose the provincial branch's business department for the bank where you open an account. In general cities, choose the city branch's business department. They are knowledgeable, and small savings banks will shirk and refuse to handle it."
        },
        {
          "zh": "4 、使用国外软件的话，如果从 US 过来，来之前直接开通 GOOGLE FI 的 esim ，这边漫游，短期就几十美元一个月。",
          "en": "4. If you are using foreign software, if you are coming from the US, activate GOOGLE FI's esim directly before coming, roaming here for a short period of time will cost you dozens of dollars a month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 回来漫游吧，不贵，自带翻墙",
          "en": "1. Just roam back, it's not expensive and it comes with a VPN."
        },
        {
          "zh": "2. 身份证和手机号刚需，搞个危险找家里人转点钱进去就行，银行卡办起来复杂也可能受限",
          "en": "2. An ID card and mobile phone number are essential. Transfer some money from your family in case of danger. It is complicated and may be restricted to open a bank card."
        },
        {
          "zh": "3. 上面两个都有了，钱也有，干啥都方便",
          "en": "3. If you have the above two and also have money, it's convenient to do anything."
        },
        {
          "zh": "4. 礼物看心意，国内也不缺啥，所以得你自己来了",
          "en": "4. Gifts depend on your heart. There's no shortage of anything in China, so you have to come yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关于支付方式，建议用支付宝： https://springwood.me/cn-international-credit-card/关于上网，强烈推荐香港手机卡漫游，例如从日本出发的例子 https://springwood.me/cu-hk-jp-prepaid-sim/",
          "en": "Regarding payment methods, it is recommended to use Alipay: https://springwood.me/cn-international-credit-card/ For internet access, I strongly recommend roaming with a Hong Kong mobile phone card, for example, the example of departing from Japan https://springwood.me/cu-hk-jp-prepaid-sim/"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你提到网银我就知道你是真的去国十几年了。",
          "en": "The fact that you mentioned online banking tells me that you have really been abroad for more than ten years."
        },
        {
          "zh": "确实十几年前淘宝还支持网银支付，网页点支付，跳转到银行的网银界面，插 U 盾完成支付，需要装银行的安全控件。",
          "en": "Indeed, more than ten years ago, Taobao still supported online banking payment. You would click on payment on the webpage, jump to the bank's online banking interface, insert a U-shield to complete the payment, and you need to install the bank's security control."
        }
      ],
      "type": "replies"
    }
  ]
}