{
  "id": 1014251,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "35+未婚追求自由的朋友还有一颗放荡旅游的心吗",
          "en": "Do unmarried friends over 35 who pursue freedom still have a heart for wandering and traveling?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "35+未婚追求自由的朋友还有一颗放荡喜欢旅游的心吗\n\n我 36 周岁 2 月了   连去外面旅游都没心了 心态一下子老了 \n\n怕哪天死了 怕生大病",
          "en": "Do unmarried friends over 35 who pursue freedom still have a heart for wandering and enjoying travel?\n\nI'm 36 years old and 2 months. I don't even feel like traveling anymore. My mentality has suddenly aged.\n\nI'm afraid of dying someday and afraid of getting a serious illness."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "孤单与死亡，是出厂设定，消除不掉的。",
          "en": "Loneliness and death are factory settings that cannot be eliminated."
        },
        {
          "zh": "活在当下，是一剂解药。（接纳自我的好与不好，慢慢享受生活的快乐与痛苦）",
          "en": "Living in the present is an antidote. (Accepting your good and bad, slowly enjoying the joys and pains of life)"
        },
        {
          "zh": "繁衍后代，也是一剂解药。（繁衍后代，一剂猛药，生活不断给予你新的刺激，所以你可以暂时逃避孤单与死亡的存在）",
          "en": "Having offspring is also an antidote. (Having offspring is a strong medicine. Life constantly gives you new stimuli, so you can temporarily escape the existence of loneliness and death)"
        },
        {
          "zh": "做有意义的事，也是一剂解药。（所谓有意义的事情，大概就是有持续性正反馈的事情。比如之前在血站做志愿者：有些捐献者长年累月的献血，他们的个人献血量大到惊人，这事对他们是有意义的，只要社会给这种行为正反馈，他们就会持续下去。）",
          "en": "Doing meaningful things is also an antidote. (The so-called meaningful things are probably things that have continuous positive feedback. For example, I was a volunteer at a blood station before: some donors donate blood year after year, and their individual blood donation volume is astonishing. This is meaningful to them, and as long as society gives positive feedback to this behavior, they will continue to do it.)"
        },
        {
          "zh": "在存在主义心理治疗一书中得到的解答。（作者是个心理治疗师，令我大受震撼的是他们几个即将老死的老头，固定时间的圆桌会，分享对死亡最新的见解，圆桌会会员一个个慢慢消失。）",
          "en": "This is the answer I got from the book \"Existential Psychotherapy\". (The author is a psychotherapist. What shocked me most was that several old men who were about to die had a fixed time for a round table meeting to share the latest insights on death, and the members of the round table meeting gradually disappeared one by one.)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@a1b2c3T 没有合适的人想也没用啊 以前没想是怕 35 危机连自己都活不下去 现在嘛 我可能能把危机延到 45",
          "en": "@a1b2c3T It's useless to think about it if there's no suitable person. I didn't think about it before because I was afraid of the 35 crisis and couldn't even survive myself. Now, I may be able to postpone the crisis to 45."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "困住你的不是家，是钱，你财力雄厚可以带上全家去旅游，你没钱只能存几个月去一趟，还不一定有假期。",
          "en": "It's not the house that traps you, it's money. If you have strong financial resources, you can take the whole family to travel. If you don't have money, you can only save for a few months and go once, and you may not even have a vacation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有存款吗，有存款出去玩，YouTuber：一本正经的光头张。一年花费 5 、6 万到处玩。",
          "en": "Do you have savings? If you have savings, go out and play. YouTuber: Serious Bald Zhang. He spends 50,000 to 60,000 a year traveling everywhere."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一个人旅游有什么意思，我媳妇不在家的时候，我连出门吃饭都懒得去。",
          "en": "What's the point of traveling alone? When my wife is not at home, I'm too lazy to even go out to eat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liuzimin 邻村有个女的 都 40 多了 老公满足不了她到处旅游 就离婚 后来又复合了 因为她年纪大了 找不到更好的",
          "en": "@liuzimin There is a woman in the neighboring village who is in her 40s. Her husband couldn't satisfy her with traveling everywhere, so they divorced. Later they got back together because she was old and couldn't find a better one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你永远把钱花不光的话，你就还有一颗放荡的心。",
          "en": "If you never run out of money, you still have a wandering heart."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我快 37 了，母单。现在反而热衷旅游，有一颗看世界的心。虽然假期不多但是每逢小长假都会多请几天往国外跑，当然都是一个人没跟团。心态总是会变，所以我也不知道能保持多久的热情，至少当下我不建议烧钱到处去玩，当然不不至于花光积蓄。",
          "en": "I'm almost 37, and I'm single. Now I'm passionate about traveling and have a heart to see the world. Although I don't have many holidays, I will take a few more days off and travel abroad every small holiday. Of course, I go alone without a group. The mentality will always change, so I don't know how long I can maintain my enthusiasm. At least for now, I don't recommend spending a lot of money to play everywhere, but of course I won't spend all my savings."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老哥还准备结婚吗…",
          "en": "Are you still planning to get married, brother…"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得追求自由挺好的呀。op 为什么要为未知的明天操心呢？意义在哪里？",
          "en": "I think pursuing freedom is very good. Why does OP have to worry about an unknown tomorrow? Where is the meaning?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@isc 人不能一直旅游下去 人是不会满足的 有家被困住柴米油盐的时候就会抱怨生活桎梏没家能出去旅游的时候  又想有个家  人一直旅游下去 没有事做 就会变得没有价值 钱也会耗光",
          "en": "@isc People can't travel all the time. People will not be satisfied. When they are trapped at home by the necessities of life, they will complain about the constraints of life. When they don't have a home to travel, they want to have a home again. If people keep traveling without anything to do, they will become worthless and their money will be exhausted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@echo1937 不能把钱用光 我现在有钱有时间 但不能把钱弄光",
          "en": "@echo1937 Can't spend all the money. I have money and time now, but I can't spend all the money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zzzkkk 你既然都想明白了，为什么还要发这个贴呢？",
          "en": "@zzzkkk Since you've figured it out, why are you posting this?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "已经成没见识的人了，上次经过 50 公里外的市区还是公司旅游。。。但凡有个女朋友，计划计划也就旅游去了，一个人去干啥。。。",
          "en": "I've become someone with no experience. The last time I passed through the city center 50 kilometers away was for a company trip... If I had a girlfriend, I would have planned to travel, but what's the point of going alone..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "他还娶了个乌克兰老婆，生了个闺女，战争的时候逃难到瑞典，把老婆留那了。",
          "en": "He also married a Ukrainian wife and had a daughter. When the war broke out, he fled to Sweden and left his wife there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有，本就不太喜欢旅游",
          "en": "No, I don't really like traveling."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zzzkkk 45 岁这个年龄是直接找老伴吗",
          "en": "@zzzkkk Is this age of 45 for finding a partner directly?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不自洽的人干什么都不舒服 干这个想那个",
          "en": "People who are not self-consistent are uncomfortable doing anything. They want this while doing that."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不一定是旅游，周边闲逛也可以，主要是心态",
          "en": "It doesn't have to be traveling, you can also stroll around, it's mainly about the mentality."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@stinkytofu 一个人当然有意思 泰国达差 斯米兰 不好看吗 水里不好玩吗 一个人还省钱 关键是我现在心态老了",
          "en": "@stinkytofu Traveling alone is of course interesting! Isn't Tachai and Similan in Thailand beautiful? Isn't it fun in the water? Traveling alone also saves money. The key is that my mentality is old now."
        }
      ],
      "type": "replies"
    }
  ]
}