{
  "id": 1015514,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "老家买房抉择求助",
          "en": "Help with the decision of buying a house in my hometown"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "先说下背景：\r\n\r\n老家广东普宁，广东一个十八线县级市。\r\n\r\n买房的预期跟父母稍微统一了一点，期望是 150 平差不多的四室，近市中心，配套齐全。    \r\n\r\n现在买房抉择有两个：  \r\n\r\n父母倾向于买小产权（这边主要是那种村子集资盖的集体房），出于便宜，我们那边很多人买（均价现在是 3000-5000 ）；    \r\n\r\n我稍微倾向于大产权，将来好置换（虽然好像也没啥置换的可能？我将来有没有买房定居的需求都不好说），法律风险小（小产权遇到拆迁大概率不会补贴购房者），（现在均价 6000-10000 ，但我只能接受 8000 以下的，能力有限，兼之我是看跌这种小城市的）；  \r\n\r\n所以总的预算是 50-120 （小产权可以全款拿下，大产权就要考虑分期、按揭了，现在利率下行，买了应该还是负资产），仅毛胚房，装修还得另外算，可能得一点点装修。  \r\n\r\n现在是在下面的一个小农村里住爷爷盖的老房子（老厝），一家 7 口只能说能住，所以算是刚需，买了新房之后可以全家住（ 2+2+2+1 ）刚好四室，另外在市区，父母也可以选择换工厂做，通勤也近，少走些路（当然我本心是希望父母可以少打点工，多休息，身体重要）。  \r\n\r\n4 个一线打工人（包括我）都在外，一个还在读书，出资方面我应该出 95%，也可能全出，父母务工赚的少，加上之前供子女读书，存的少，其他人刚出来没多久，存的也少，我出来 4 年了，加上是程序员，赚的多些。  \r\n\r\n关于自己：  \r\n\r\n家中长子，一个普通程序员，在深工作 4 年，积蓄主要是工资，投资理财方面，A 股亏了 3W （包括股票基金），其他主要放在债券、货币基金上，还属于是理财小白，挺想留在大城市，但一线房价对于我这种打工人真的很难。  \r\n\r\n我还是单身，没有对象，这套房子其实我挺纠结，因为基本是要掏空自己存款的，但我就过年来住，我将来会在哪里也是不确定的，买这个房子有照顾父母面子的成分。  \r\n\r\n对于个人将来规划，现在比较迷茫，以前毕业时刚在一个中厂工作，每天下班都能刷题、刷八股，想着将来进大厂，后面遇到大厂收缩，裁员，投都投不出去，后面跳去一家外企，待没多久就市场收缩，整个部门端掉，后来面阿里，HR 面挂，对将来挺心灰意冷的，现在在一家小公司待着，持续学英语，但好像也没有特别大的动力往外走，可能后面会回家乡可以尝试远程（不确定）。偶尔想着转行做生意，但没有经验跟主意。  \r\n\r\n一些疑问/求助：  \r\n\r\n在当下，股市、房市、人口下行，有点像日本负债衰退的情况下，这个点买房合适吗？买小产权还是大产权合适？另外有在县城买房的朋友，或者相关经验，求助下，我该怎么做合适？",
          "en": "First, a little background:\n\nMy hometown is Puning, Guangdong, an 18th-tier county-level city in Guangdong.\n\nThe expectations for buying a house are slightly aligned with my parents; we are hoping for a four-bedroom apartment of about 150 square meters, close to the city center, with complete amenities.\n\nThere are two choices for buying a house now:\n\nMy parents prefer to buy small-property-rights houses (mainly collective housing built by the village here), because they are cheap, and many people buy them there (the average price is now 3000-5000);\n\nI slightly prefer large-property-rights houses, which are easier to trade in the future (although it seems unlikely to trade them? It's hard to say whether I will need to settle down there in the future), and there is less legal risk (small-property-rights houses are unlikely to be compensated to the buyer in case of demolition), (the current average price is 6000-10000, but I can only accept below 8000, my ability is limited, and I am bearish on these small cities);\n\nSo the total budget is 50-120 (small-property-rights houses can be paid in full, large-property-rights houses need to consider installments and mortgages, and under the current interest rate decline, buying it should still be a negative asset), only the unfinished building, and the decoration has to be calculated separately, and it may need to be decorated a little bit.\n\nNow I live in my grandfather's old house (Lao Cuo) in a small rural area below, and a family of 7 can only be said to be able to live there, so it's a necessity. After buying a new house, the whole family can live there (2+2+2+1), which is exactly four rooms. In addition, in the city area, my parents can also choose to change factories and work, and the commute will be closer and they will walk less (of course, I sincerely hope that my parents can work less and rest more, and health is important).\n\nFour first-tier city workers (including me) are all working outside, and one is still studying. In terms of funding, I should contribute 95%, or maybe all of it. My parents earn less working, plus they paid for their children to study before, and they have saved less. The others haven't been out for long, and they have saved less. I've been out for 4 years, and I'm a programmer, so I earn more.\n\nAbout myself:\n\nThe eldest son in the family, an ordinary programmer, has been working in Shenzhen for 4 years. My savings are mainly my salary. In terms of investment and financial management, I have lost 3W in A-shares (including stock funds), and the rest is mainly in bonds and monetary funds. I am still a financial novice. I really want to stay in the big city, but the first-tier house prices are really difficult for a worker like me.\n\nI am still single, and I don't have a partner. I am actually quite conflicted about this house, because it basically drains my savings, but I only come back to live during the Spring Festival, and it is uncertain where I will be in the future. Buying this house has an element of taking care of my parents' face.\n\nFor personal future planning, I am now quite confused. When I graduated, I just started working in a medium-sized factory. I could do test questions and brush eight-part essays after work every day, thinking about entering a big factory in the future. Later, I encountered the contraction and layoffs of big factories, and I couldn't even submit my resume. Later, I went to a foreign company, and the market contracted soon after, and the entire department was shut down. Later, I interviewed at Alibaba, but the HR interview failed. I was quite disheartened about the future. Now I am working in a small company, and I am constantly learning English, but it seems that I don't have a particularly strong motivation to go out. Maybe I will try remote work when I go back to my hometown (uncertain). Occasionally, I think about changing careers to do business, but I have no experience and no idea.\n\nSome questions/help:\n\nAt present, when the stock market, housing market, and population are declining, it's somewhat like Japan's debt recession. Is it appropriate to buy a house at this point? Is it better to buy small-property-rights or large-property-rights houses? In addition, friends who have bought houses in county towns, or relevant experience, please help me, how should I do it?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "楼主真是个 ruozhi, 我必须得开喷！1.明知道小县城房价会降还要买房，图啥？图你钱多没处花？2. 又不是没有房子住买新房为啥？为了充面子？不就过年住几天，凑合下不就行了3. 一点主见没有！你父母让你买你就买啊？别人都是父母给买好房子，你父母怎么还来 pua 你了？他们辛苦是因为他们自己没能耐还愿意生四个孩子，没人求他们生。4. 没脑子吗，不考虑自己？钱都花没了你自己怎么办？",
          "en": "The poster is really ruozhi, I have to start ranting! 1. Knowing that house prices in small counties will fall, why are you still buying a house? Is it because you have too much money and nowhere to spend? 2. You don't even have a house. Why buy a new one? To show off? You only live there for a few days during the Spring Festival, just make do with it. 3. You have no opinion! You buy it because your parents told you to? Others have their parents buy them a good house, how come your parents are still pua-ing you? They are struggling because they are incompetent and still willing to have four children, no one asked them to have them. 4. Are you brainless, not considering yourself? What will you do if you run out of money?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人建议不要买，房价很可能还要跌几年，一线房价都扛不住，更别人说十八线城市了。如果你为了改善父母居住条件，可以给他们租一个距离近、更舒适的房子，租房代价更小，买房则没有后悔药。可以看下这个视频。<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/RpeN19WITjE?si=eeYc0Vm7FGNonc9G\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>",
          "en": "My personal suggestion is not to buy. House prices are likely to fall for several more years. Even first-tier cities can't hold on, let alone 18th-tier cities. If you want to improve your parents' living conditions, you can rent them a closer, more comfortable house. Renting is less costly, and buying a house has no regrets. You can watch this video. <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/RpeN19WITjE?si=eeYc0Vm7FGNonc9G\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "兄弟既然你问了，我觉得买房这事真应该三思。三年前在武汉主城区买了，还是全款买的，然而现在依旧很后悔，过去的一年房价下降加上资金的利息成本，基本上三十万是没有了，去年白干。我算是看懂了，只有一种情况应该买，孩子需要接受教育进行择校的时候买学区房，其他时候都不应该买。毕竟把钱放在债基里的利润都够租两套同样的了。",
          "en": "Since you asked, brother, I think you really should think twice about buying a house. I bought one in the main urban area of Wuhan three years ago, and I still paid in full, but I still regret it. In the past year, the decline in house prices plus the interest cost of the funds, basically 300,000 yuan is gone, I worked for nothing last year. I understand now that there is only one situation when you should buy, when your children need to receive education and choose schools, you should buy a school district house, and you shouldn't buy it at any other time. After all, the profit from putting the money in a bond fund is enough to rent two of the same houses."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你出钱就你说了算",
          "en": "You make the call if you are paying"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "第一，不买房是最优选；第二，你是长子，买房的担子不应该落到你一个人头上；第三，全家并非是居无定所的状态，没有特别大的必要买；第四，经济下行期，持币在手是最好的选择，你是长子，有钱在手的话，有时可以给下面的弟妹一些帮助和支援；第五，父母在工厂工作，大概率医保社保缴纳的很低，保障性比较一般，万一你父母身体生了个不大不小的病（举个特殊情况），你全家的钱都在房子里，这个时候是卖房？还是借钱？而小地方的房子现在买了基本就很难脱手；第六，不要炒股。",
          "en": "First, not buying a house is the best option; second, you are the eldest son, and the burden of buying a house should not fall on you alone; third, the whole family is not in a state of being homeless, so there is no particularly great need to buy; fourth, during the economic downturn, holding cash is the best choice. You are the eldest son, and if you have money in hand, you can sometimes give some help and support to your younger siblings; fifth, your parents work in factories, and it is likely that their medical insurance and social security are low, and the security is relatively average. In case your parents get a minor illness (take a special case), and all your family's money is in the house, will you sell the house? Or borrow money? And houses in small places are basically difficult to sell now; sixth, don't trade stocks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看好自己未来就大产权，看衰就小产权。大有大的好 小有小的好。",
          "en": "If you are optimistic about your future, then buy large-property-rights houses, and if you are pessimistic, then buy small-property-rights houses. Big has its advantages, and small has its advantages."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人建议，仅供参考。1 、买大产权2 、你家的居住条件应该买，你也是老大3 、能熬的话先熬几年，哪里的房产都不好，县城的房价更是在走下坡路。4 、县城买房建议买公务员小区或者是医生小区这类集资建房的二手房，主要是考虑未来的物业管理和维修。",
          "en": "Personal suggestions, for reference only. 1. Buy large-property-rights houses. 2. You should buy a house given your family's living conditions, and you are also the eldest. 3. If you can endure it, endure it for a few years first. Real estate everywhere is not good, and house prices in county towns are even on the decline. 4. Buying a house in a county town, it is recommended to buy second-hand houses in civil servant communities or doctor communities, which are collective houses. The main consideration is future property management and maintenance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.小产权就是无产权，建议别买。2.如果想留在大城市，不要在老家买房，更不要在老家贷款买房。",
          "en": "1. Small property rights mean no property rights, it is recommended not to buy. 2. If you want to stay in a big city, don't buy a house in your hometown, and don't take out a loan to buy a house in your hometown."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人看法：1.长期来看都是负资产，不如买损失最小的2.算是给父母买房，也就是过年能全家住3.软装硬装还得二三十万4.别掏空自己，留点余粮",
          "en": "Personal opinion: 1. It's a negative asset in the long run. It's better to buy the one with the least loss. 2. It's considered to be buying a house for your parents, which means the whole family can live there during the Spring Festival. 3. Soft and hard decorations still cost 200,000 to 300,000 yuan. 4. Don't drain yourself, keep some reserves."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你那个说的小产权不叫小产权，那是村集体证，如果有政策要拆，被判为违建，赔偿很少。",
          "en": "The small property rights you mentioned are not called small property rights, that is a village collective certificate. If the policy requires demolition and it is judged as illegal construction, the compensation will be very small."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小产权，就是骗人的，那叫无产权，相当于你花钱白给，房子在法律上还是原房东的",
          "en": "Small property rights are deceptive, that is called no property rights. It is equivalent to you giving money for nothing. The house still belongs to the original landlord in law."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不能租房吗，小地方租个好点的大房子一家子住应该租金也不贵，风险低，等过两年房价跌差不多了再买",
          "en": "Can't you rent a house? Renting a good big house in a small place for the whole family shouldn't be expensive. The risk is low. You can buy it again in two years when house prices have fallen almost enough."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老哥，租房吧，挺好的，房价未来还得跌",
          "en": "Brother, rent a house. It's pretty good, and house prices will continue to fall in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "潮汕地区买小产权要看人看地方，可以的还是尽量选择有产权的。村里有地的话自建可以考虑自建啊。",
          "en": "In Chaoshan area buying small-property is dependent on the person and place. If possible, try to choose one with property rights. If the village has land, self-built houses can be considered."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不要买你说的小产权, 这种以后你大概率转手不出的.要么就买学位,买么买地段(医疗 经济/市中心/商圈 地铁/交通枢纽)我倾向于买地段, 即使你自己现阶段不住, 你可以留给父母养老, 农村的医疗资源真的不行的, 都在往城市集中",
          "en": "Don't buy the small property rights you mentioned, you are likely to not be able to resell this type in the future. Either buy the school district, or buy location (medical resources, economy/city center/business district, subway/transportation hub). I tend to buy the location. Even if you don't live there at this stage, you can leave it to your parents to retire. The medical resources in the countryside are really not good, and they are all concentrated in the city."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这房价很贵，不知道你能不能全款，如果不能你还要还贷，压力会不小。除一线和强二线外不要想着置换了。",
          "en": "Your house price is very expensive. I don't know if you can pay in full. If you can't, you still have to repay the loan, and the pressure will be great. Don't think about replacement except for first-tier and strong second-tier cities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "县级市均价 4000 的小产权，这就离谱",
          "en": "The average price of 4000 for small property rights in county-level cities is ridiculous."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同潮汕地区也在县城租房生活过几年，租房有一个缺点是: 不能拜老爷。逢年过节都得回老家拜。（这边的风俗如此，不是自己的房子不能把老爷请过来。一年里面拜老爷的次数又多）这就意味着风风雨雨得跑这段回家路。父母那辈还是挺看重这个的，劝说念心也无用。举个例子: 有年的年三十在老家拜完后，收拾好东西又回到租房这边。因为家里房子长时间没住人，年前也没时间回去打扫，所以变成这样。（ PS: 没有四轮，都是开摩托车，小电驴，一个小时路程。）",
          "en": "I have also rented a house in a county town in Chaoshan area for a few years. One disadvantage of renting a house is: you can't worship the gods. You have to go back to your hometown to worship during the New Year and festivals. (This is the custom here, you can't invite the gods over if it's not your own house. And there are many times to worship the gods in a year.) This means that you have to run this journey home through wind and rain. The older generation of parents still value this very much, and it's useless to persuade them. For example: After worshiping at my hometown on the New Year's Eve of a certain year, I packed my things and went back to the rental house. Because no one had lived in the house for a long time, and I didn't have time to go back and clean it before the New Year, so it became like this. (PS: No four-wheel drive, all motorcycles, small electric donkeys, a one-hour journey.)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个时候就是买房就是在押宝啊。慎重！没具体建议，看好地段再下手，买风险最小的。未来任何风吹草动，都可能倾家荡产，共勉！",
          "en": "Buying a house is like gambling at this time. Be cautious! No specific advice, look for a good location before buying, and buy the one with the least risk. Any disturbance in the future may lead to bankruptcy. Encourage each other!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "租房，不要背贷款",
          "en": "Rent a house, don't take out a loan"
        }
      ],
      "type": "replies"
    }
  ]
}