{
  "id": 1016739,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "高速公路上使用全速自适应巡航（acc）真是太爽了",
          "en": "Using full-speed adaptive cruise control (ACC) on the highway is really awesome"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "排量 660cc 的小汽车轻轻松松稳定速度 100 （所在国家的高速公路限速就是 100 ），不用踩刹车和油门，全部电脑自己控制了。\r\n\r\n附：我买汽车的日记 https://springwood.me/jp-buy-used-car/",
          "en": "A small car with a displacement of 660cc can easily maintain a speed of 100 (the highway speed limit in the country is 100), without stepping on the brake and accelerator, all controlled by the computer.\r\n\r\nAttached: My diary of buying a car https://springwood.me/jp-buy-used-car/"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 问界的 nca 就更爽了，导航开起来 自动变道 啥都不用管了",
          "en": "If you try Wenjie's NCA, it will be even better. Turn on the navigation, automatic lane change, and you don't need to worry about anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 comma.ai 的 openpilot 就更爽了，“导航开起来 自动变道 啥都不用管了”不知道能不能实现，但很多破车搞个破手机就能跑。",
          "en": "If you try comma.ai's openpilot, it will be even better. I don't know if \"turn on the navigation, automatic lane change, and you don't need to worry about anything\" can be achieved, but many crappy cars can run with a broken phone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wangchonglie 你别为难他了，一个搞 JAVA 的，看得了辅助驾驶底层的嵌入式代码。",
          "en": "@wangchonglie Don't make things difficult for him, he's a JAVA guy, can he understand the embedded code at the bottom of the assisted driving?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@BeforeTooLate 我以前很信任这类辅助。直到某次跟头部某智驾团队合作，然后看了他们的代码实现，真是叹为观止。",
          "en": "@BeforeTooLate I used to trust this kind of assistance very much. Until I cooperated with a leading intelligent driving team, and then I saw their code implementation, it was amazing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是试试老祖宗的马车就更爽了，睡他几天几夜也不会出事故",
          "en": "If you try the ancestor's carriage, it will be even better, you won't have an accident even if you sleep for a few days and nights"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@v2bili 小伙子，你不用那么自卑，中国的高速公路里程是日本的 20 倍，跨越大江南北，世界很大，多出去走走吧。",
          "en": "@v2bili Young man, you don't need to be so self-deprecating. The mileage of China's highways is 20 times that of Japan's, spanning across China. The world is big, go out and take a walk."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 理想的 NOA 就更爽了，导航开起来 自动变道 啥都不用管了",
          "en": "If you try Ideal's NOA, it will be even better. Turn on the navigation, automatic lane change, and you don't need to worry about anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "爽是爽，时间久了不犯困吗",
          "en": "It's awesome, but won't you get sleepy after a long time?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人家是在日本 你们能比吗",
          "en": "They are in Japan, can you compare?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "660cc ？我差点以为是摩托车",
          "en": "660cc? I almost thought it was a motorcycle"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 ${brand} 的 ${product} 就更爽了，导航开起来 自动变道 啥都不用管了",
          "en": "If you try ${brand}'s ${product}, it will be even better. Turn on the navigation, automatic lane change, and you don't need to worry about anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Heisenbery #37 @wangchonglie #83  视觉算法是 yolo ，然后雷达+其他传感器一起校验 yolo 结果。校验完成后几千几万个 if 。跟我们普通写的代码不一样，这玩意没法证明他一定没问题，只能靠各种测试 case ，新发现一个 case 就新写一个 if 。万一你哪天厂商没有遇到的 case ，就可能出问题。我们有个需求，CTO 让直接用他们的 yolo 模型，我把他们模型拿来一跑，我淦，动不动就识别错误。这玩意万一 yolo 识别错了，后续雷达也没纠正过来，然后 if else 代码就可能出问题，这太可怕了。",
          "en": "@Heisenbery #37 @wangchonglie #83 The visual algorithm is yolo, and then the radar + other sensors together verify the yolo results. After the verification is completed, there are thousands of if statements. It's different from the code we usually write. This thing can't prove that it is definitely not a problem, it can only rely on various test cases. If a new case is found, a new if statement will be written. In case the manufacturer has not encountered a case one day, problems may occur. We have a requirement that the CTO wants to directly use their yolo model. I ran their model, and damn, it often misidentifies. If yolo misidentifies, and the subsequent radar doesn't correct it, then the if else code may have problems, which is terrible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 特斯拉的 eap 就更爽了，导航开起来 自动变道 啥都不用管了",
          "en": "If you try Tesla's EAP, it will be even better. Turn on the navigation, automatic lane change, and you don't need to worry about anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很好玩的小车",
          "en": "A fun little car"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果再加上车道保持就更爽了，我都想改装车道保持了",
          "en": "If you add lane keeping, it will be even better. I even want to modify lane keeping."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 蔚来的 NOP 就更爽了，导航开起来 自动变道 啥都不用管了",
          "en": "If you try NIO's NOP, it will be even better. Turn on the navigation, automatic lane change, and you don't need to worry about anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "恭喜提车。我第一辆也是铃木二手小 K",
          "en": "Congratulations on getting the car. My first car was also a used Suzuki K"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要是再试一下 哪吒的 NNP 就更爽了，导航开起来 自动变道 啥都不用管了",
          "en": "If you try Neta's NNP, it will be even better. Turn on the navigation, automatic lane change, and you don't need to worry about anything"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bankroft 有车道保持功能",
          "en": "@bankroft Has lane keeping function"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@FawkesV 车的价格不在一个档次吧",
          "en": "@FawkesV The price of the car is not in the same class, right?"
        }
      ],
      "type": "replies"
    }
  ]
}