{
  "id": 1019371,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "拔过智齿的老哥，疼吗",
          "en": "Experienced folks who have had wisdom teeth extracted, does it hurt?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "拔过智齿的老哥，疼吗？",
          "en": "Experienced folks who have had wisdom teeth extracted, does it hurt?"
        },
        {
          "zh": "最近智齿经常发炎，想去掉，咨询下",
          "en": "My wisdom teeth have been frequently inflamed recently, and I want to get them removed. Seeking advice."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我说不疼你又不信",
          "en": "You wouldn't believe me if I said it doesn't hurt."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "发炎期间似乎不能拔牙",
          "en": "It seems you can't extract teeth during inflammation."
        },
        {
          "zh": "我四颗智齿长齐了 都阻生 都需要拔掉",
          "en": "All four of my wisdom teeth have grown in, and they are all impacted, so they all need to be extracted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不疼，嘶。。。",
          "en": "Doesn't hurt, hiss... (sound of slight discomfort)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "疼是次要的，主要是注意，千万不要诱发干槽症，不然有你受的",
          "en": "The pain is secondary, the main thing is to be careful not to induce dry socket, or you'll suffer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "备好洛索洛芬钠片，疼就来一片",
          "en": "Prepare some Loxoprofen Sodium tablets, take one when it hurts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "疼",
          "en": "It hurts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哎，我也是，可能也得去了",
          "en": "Sigh, me too, I probably have to go as well."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "疼倒是不疼，就是差一点憋死。",
          "en": "It doesn't hurt, but I almost suffocated."
        },
        {
          "zh": "拔完智齿医生会忘那个口塞一个棉花球让你咬，但是嘴里有很多口水，就会想一直咽，咽着咽着一不小心，咬的那个棉花球就随着动作堵嗓子眼了",
          "en": "After the wisdom tooth extraction, the doctor will forget to put a cotton ball in the socket for you to bite on, but there's a lot of saliva in your mouth, so you'll want to keep swallowing. While swallowing, if you're not careful, the cotton ball you're biting on will accidentally block your throat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不疼~四顆智齒記得分開來拔，每周拔一次~一點都不疼~",
          "en": "Doesn't hurt~ Remember to extract the four wisdom teeth separately, once a week~ Doesn't hurt at all~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去正规医院，不疼。",
          "en": "Go to a reputable hospital, it doesn't hurt."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "2 星期一个，2 个月拔完 4 个，发炎时期不能拔会有严重感染风险，然后如果智齿是阻生或畸形，一定挂个主任",
          "en": "One every 2 weeks, 4 extracted in 2 months. You can't extract when it's inflamed, there's a risk of serious infection. And if the wisdom tooth is impacted or malformed, definitely see a chief physician."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "无感，上午拔完下午火锅",
          "en": "No feeling, extracted in the morning, hotpot in the afternoon."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你的智齿好拔不了，发炎的时候拔不了，我当时牙床上来了一刀子，缝针，麻药过劲后疼，但是忍受范围内，睡觉时有吃止疼片。",
          "en": "It depends on whether your wisdom teeth are easy to extract. You can't extract them when they're inflamed. I had a cut on my gum at the time, stitches, and it hurt after the anesthesia wore off, but it was within tolerance. I took painkillers when sleeping."
        },
        {
          "zh": "疼了大概 3 天？",
          "en": "It hurt for about 3 days?"
        },
        {
          "zh": "医生只让吃流质。。。但是我买了很软的面包，直接塞进嗓子眼（不好，还是别学我），不咀嚼。",
          "en": "The doctor only allowed liquid food... but I bought very soft bread and stuffed it directly into my throat (bad, don't follow my example), without chewing."
        },
        {
          "zh": "一周内不能抽烟喝酒。",
          "en": "No smoking or drinking for a week."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去年拔了，也因为老发炎。",
          "en": "I had mine extracted last year, also because they were always inflamed."
        },
        {
          "zh": "要先看你的智齿长的咋样，如果歪的估计有点难搞。",
          "en": "You need to see how your wisdom teeth are growing first. If they are crooked, it might be a bit difficult."
        },
        {
          "zh": "拔的时候打麻醉不疼，麻醉过了有一点点疼，还行能忍。",
          "en": "It doesn't hurt during extraction with anesthesia, after the anesthesia wears off it's a little bit painful, but it's bearable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我拔 2 个一点都不疼，不知道是不是医生问题",
          "en": "I extracted 2 and it didn't hurt at all, I don't know if it's a doctor's issue."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉真得看你的智齿长的好不好拔，我的正常方向，所以当时拔牙的时候医生很轻松的就拔出来了，如果方向不对那就吃力了……",
          "en": "I feel like it really depends on whether your wisdom teeth are easy to extract. Mine were in a normal direction, so the doctor extracted them very easily. If the direction is wrong, then it will be difficult..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一、不要去私立医院，去公立三甲医院，因为其实拔智齿有可能会死人的。",
          "en": "First, don't go to private hospitals, go to public Class A tertiary hospitals, because people can actually die from wisdom tooth extraction."
        },
        {
          "zh": "二、拔的时候疼不疼看医生麻醉药的量。（还有自己的紧张心情会放大疼痛感）",
          "en": "Second, whether it hurts during extraction depends on the amount of anesthetic the doctor uses. (Also, your own nervousness can amplify the pain)."
        },
        {
          "zh": "三、拔完后麻醉药过后会有一段时间的脸肿和疼痛。",
          "en": "Third, after the anesthetic wears off after extraction, there will be a period of facial swelling and pain."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因人而异，真的看体质（医生说我比较耐疼）。",
          "en": "It varies from person to person, it really depends on your constitution (the doctor said I have a high pain tolerance)."
        },
        {
          "zh": "反正我一天时间，拔了俩，还补了个牙。",
          "en": "Anyway, in one day, I extracted two and also filled a cavity."
        },
        {
          "zh": "除了张嘴太久，嘴角撕裂有点疼，别的没啥。",
          "en": "Other than the corner of my mouth tearing a bit from opening my mouth for too long, there's nothing else."
        },
        {
          "zh": "拔牙缝线就晚上躺下睡觉的时候有一点点勒肉的痛感（明显感知到但绝对可以轻松忍受的那种）。",
          "en": "The stitches from the tooth extraction only have a slight, meat-cutting pain when I lie down to sleep at night (clearly perceptible but definitely easily tolerable)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拔得时候不疼   当天晚上肯定会疼的。",
          "en": "It doesn't hurt when it's extracted, but it will definitely hurt that night."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拔的时候会注射麻药，不疼的。",
          "en": "They'll inject anesthetic when extracting, it doesn't hurt."
        },
        {
          "zh": "拔之后因人而异，看创口大小，肯定会肿的，肿得厉害就会疼。",
          "en": "After extraction, it varies from person to person, depending on the size of the wound. It will definitely be swollen, and if it's severely swollen, it will hurt."
        }
      ],
      "type": "replies"
    }
  ]
}