{
  "id": 1014283,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "第三方平台爬 12306 的数据、抢票是否涉嫌破坏计算机信息系统？",
          "en": "Does third-party platforms scraping 12306's data and ticket grabbing constitute a violation of the crime of damaging computer information systems?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我之前以为 12306 至少和携程/飞猪/去哪儿这种大型出行平台有合作。",
          "en": "I previously thought that 12306 at least had partnerships with large travel platforms like Ctrip, Fliggy, and Qunar."
        },
        {
          "zh": "\r\n今天看到新闻，铁路 12306 科创中心技术负责人杨立鹏就公众关注的春运火车票购票相关问题进行解答。",
          "en": "\nToday, I saw news where Yang Lipeng, the technical head of the Railway 12306 Science and Innovation Center, answered questions from the public regarding issues related to purchasing Spring Festival train tickets."
        },
        {
          "zh": "其中提到：\r\n\r\n> “网传‘抢票软件’可通过集中抢票，然后不支付返票或支付后退票，再让退回的车票满足自己提交的候补需求”，其实，利用这种手段抢到车票的概率极低。",
          "en": "He mentioned:\n\n> \"It is rumored that 'ticket-grabbing software' can grab tickets through concentrated ticket purchases, and then not pay for the tickets or refund them after payment, and then have the returned tickets fulfill the user's submitted waiting list needs\". In reality, the probability of grabbing tickets using this method is extremely low."
        },
        {
          "zh": "因为“抢票软件”提交候补需求最终需要进入 12306 候补队列，而 12306 系统的候补是按订单生成的时间顺序兑现，抢票软件无法将其排在后面的候补需求调整至前列，同时 12306 系统可通过多种途径，识别出有异常的候补需求订单并加以处置，不会将票额优先满足异常候补需求。",
          "en": "This is because the 'ticket-grabbing software' submits waiting list requests that ultimately need to enter the 12306 waiting list queue, and the 12306 system's waiting list is fulfilled in the order the orders were created. Ticket-grabbing software cannot adjust its later waiting list needs to a higher position. At the same time, the 12306 system can identify abnormal waiting list order requests and handle them through various means, and will not give priority to fulfilling abnormal waiting list requests with ticket allocations."
        },
        {
          "zh": "> 一些“抢票软件”在其相关页面和功能介绍中大量设置 12306 字样，让旅客误以为其与铁路 12306 平台有合作，票额有保证。",
          "en": "> Some \"ticket-grabbing software\" extensively uses the 12306 wording on its relevant pages and function descriptions, leading passengers to mistakenly believe that it has a partnership with the Railway 12306 platform and that ticket availability is guaranteed."
        },
        {
          "zh": "**实际情况是，12306 平台从未与任何第三方平台机构有合作，也未将票额分配给任何第三方平台发售，也没有与任何第三方平台进行数据链接。**",
          "en": "**The actual situation is that the 12306 platform has never partnered with any third-party platform institutions, has not allocated ticket quotas to any third-party platforms for sale, and has not established any data links with any third-party platforms.**"
        },
        {
          "zh": "> 　“抢票软件”平台页面上显示的余票数据，是从 12306 平台爬取页面显示的信息，然后再修改加工而成。",
          "en": "> The remaining ticket data displayed on the \"ticket-grabbing software\" platform pages is scraped from the information displayed on the 12306 platform, and then modified and processed."
        },
        {
          "zh": "当某车次列车车票售完后，12306 平台上会显示该车次无票，但“抢票软件”平台上显示时将其更改为“有票”，实质是让旅客“买长乘短”和“买短乘长”。",
          "en": "After the train tickets for a certain train are sold out, the 12306 platform will display that there are no tickets for that train, but the \"ticket-grabbing software\" platform will change it to \"available\", which is essentially to make passengers \"buy long, ride short\" and \"buy short, ride long.\""
        },
        {
          "zh": "“抢票软件”诱导旅客设置多个发到站组合，采用多花钱、购买实际到站前方几站车票的“买长乘短”方式，以及先买短途车票上车、违规不下车的“买短乘长”方式购票。",
          "en": "The \"ticket-grabbing software\" induces passengers to set multiple origin and destination combinations, using the \"buy long, ride short\" method of spending more money to buy tickets for a few stops before the actual destination, and the \"buy short, ride long\" method of buying short-distance tickets and getting on the train without getting off, which is a violation."
        },
        {
          "zh": "在“有票”下方附加设置小字提示，如“多买几站”或“全程不用下车、上车补票”等，这种“有票”并不是真的有出发站至到站车票。",
          "en": "Small text prompts are added under the \"available\", such as \"buy a few more stops\" or \"no need to get off the train for the whole journey, buy tickets on the train\", etc. This \"available\" is not really a ticket from the departure station to the destination."
        },
        {
          "zh": "“买长乘短”让旅客多付费用，“买短乘长”、上车补票可能会引发列车超员报警、影响列车运行安全，铁路部门将依规请“买短乘长”人员下车，旅客出行会受到很大影响。",
          "en": "\"Buy long, ride short\" makes passengers pay more fees, and \"buy short, ride long\" and buying tickets on the train may trigger train overcrowding alarms and affect the train's operating safety. The railway department will ask people who \"buy short, ride long\" to get off the train according to regulations, and this will greatly affect passengers' travel."
        },
        {
          "zh": "那这些第三方平台的爬虫，除了爬取数据，还能抢票，是否涉嫌**破坏计算机信息系统罪**，12306 是否可以报警？",
          "en": "Then, these third-party platforms' crawlers, in addition to scraping data, can also grab tickets. Does this constitute the crime of **damaging computer information systems**, and can 12306 report it to the police?"
        },
        {
          "zh": "如果可以，为什么它没有这么做呢？",
          "en": "If it can, why doesn't it?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "因为在国内大公司可以肆意的违法犯罪，同样的事情放在个人和个人企业身上就会被一锅端，你试想个人开发的免费爬虫软件如果也有用户协议的话，难道就不会被抓了吗，只要 12306 报警，一抓一个准，显然不是用户协议的事情。",
          "en": "Because large companies in China can violate laws and commit crimes wantonly, while the same things happening to individuals and individual businesses will be dealt with harshly. Imagine if a free crawler software developed by an individual also had a user agreement, wouldn't they be caught? As long as 12306 reports it to the police, the individual will be caught without fail, and it's clearly not a matter of user agreements."
        },
        {
          "zh": "这些大公司已经涉及民生了，而且给 zf 交大量的税，不会轻易去搞他们。",
          "en": "These large companies are already involved in people's livelihood, and they pay a large amount of taxes to the government, so they won't be easily dealt with."
        },
        {
          "zh": "按照我国违法犯罪的定义和标准，国内几家大公司没有不犯罪的，而且是天天都在发生。",
          "en": "According to the definition and standards of illegal and criminal activities in our country, several major companies in China are all committing crimes, and it happens every day."
        },
        {
          "zh": "随便举个例子，比如淘宝双 11 时号称全网实时比价全网最低，这个过程肯定是涉及非法入侵计算机信息系统罪了（爬虫，另外京东 pdd 不可能把商品价格信息同步给淘宝，因为我有朋友就是在这两个公司里做反爬），那淘宝必然是违法犯罪了。",
          "en": "For example, during Taobao's Double 11 event, it claims to have the lowest real-time price comparison across the entire network. This process certainly involves the crime of illegally intruding into computer information systems (crawlers, and it's impossible for JD and PDD to synchronize product price information to Taobao, because I have friends who work in anti-crawler departments in these two companies), then Taobao is inevitably breaking the law and committing crimes."
        },
        {
          "zh": "pdd 用手机系统漏洞攻击用户手机，获取用户信息，赤裸裸的违法犯罪，网上都吵翻天了，愣是没啥事，如果是个人干这个事，你猜会不会被抓。",
          "en": "PDD uses mobile phone system vulnerabilities to attack user phones and obtain user information, which is a blatant violation of the law and a crime. The internet is in an uproar, but nothing happens. If an individual did this, do you think they would be caught?"
        },
        {
          "zh": "支付宝，如果你像马云一样，运用资产证券化手段搞融资滚雪球，哪怕你和投资者签了协议，你猜会不会定你一个非法集资罪。",
          "en": "Alipay, if you, like Jack Ma, use asset securitization to engage in financing and snowballing, even if you have signed an agreement with investors, do you think you will be charged with illegal fundraising?"
        },
        {
          "zh": "唉，好像得到一个奇怪的结论：在神秘大国，想要成为人上人，必须要违法犯罪，或者游走在违法犯罪的边缘，这个过程中，大部分人被干掉，小部分人真正成为人上人",
          "en": "Well, it seems like a strange conclusion: in the mysterious country, to become a superior person, you must break the law and commit crimes, or walk on the edge of breaking the law and committing crimes. In this process, most people are eliminated, and a small number truly become superior people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从这次买火车票的经历来说，12306 已经在进步了给我最大的感观就是， 信息预填然后直接，只管点那一下抢， 中间没有任何其他延迟的步骤。这不比两三年前各种跳转好太多了。",
          "en": "Speaking from the experience of buying train tickets this time, 12306 has been improving. My biggest impression is that information is pre-filled and then I can directly click to grab the ticket, without any other delayed steps. This is much better than the various jumps of two or three years ago."
        },
        {
          "zh": "12306 也在尝试着改变。",
          "en": "12306 is also trying to change."
        },
        {
          "zh": "还有就是这次的 农民工和学生特别车次，也是一种进步最后说锁票，短程不放票的问题。",
          "en": "Also, this time there are special train services for migrant workers and students, which is also a kind of progress. Finally, regarding the issue of locked tickets and not releasing short-distance tickets."
        },
        {
          "zh": "在春运期间，从运力来说，一定是优先满足长程乘车最好。",
          "en": "During the Spring Festival travel season, in terms of transportation capacity, it is definitely best to give priority to long-distance travel."
        },
        {
          "zh": "如果一开始就放短程，就会导致整个路段支离破碎，运力效率极低。",
          "en": "If short-distance tickets are released at the beginning, it will cause the entire route to be fragmented and the transportation efficiency will be extremely low."
        },
        {
          "zh": "在进步，没摆烂，就能看到希望现在第三方肯定是半默许状态，一个是有民众需求，二可能是心理学角度的能吸引火力。",
          "en": "It's improving, not giving up. We can see hope. Now the third parties are definitely in a semi-tacit state, one is because of the public's demand, and the other may be to attract fire from a psychological perspective."
        },
        {
          "zh": "毕竟抢票软件都抢不到，那是真难抢，或许就没那么纠结，不直接对准 12306 无情开喷了。",
          "en": "After all, even ticket-grabbing software can't grab tickets, it's really difficult to grab them. Maybe people won't be so conflicted, and won't directly and mercilessly criticize 12306."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得是老爷们商量好了，演戏给咱们看的。",
          "en": "I think the officials have discussed it and are putting on a show for us."
        },
        {
          "zh": "那几个软件全中国都知道是黄牛，肯定是违法了",
          "en": "Everyone in China knows that those softwares are scalpers, and they are definitely illegal."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "第三方不知道，有人用抢票软件当黄牛被判了 1 年 6 个月",
          "en": "I don't know about the third parties, but someone was sentenced to 1 year and 6 months for using ticket-grabbing software as a scalper."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“12306 系统的候补是按订单生成的时间顺序兑现”并不属实",
          "en": "\"The 12306 system's waiting list is fulfilled in the order the orders were created\" is not true."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有法务团队就不构成犯罪，如果没有法务团队的第三方平台或个人构成犯罪。",
          "en": "If there is a legal team, it does not constitute a crime. If there is no legal team, the third-party platform or individual constitutes a crime."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "爬数据跟爬数据把网站搞崩了是两码事吧，不然搜索引擎咋办？",
          "en": "Scraping data and crashing a website are two different things, aren't they? Otherwise, what about search engines?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@qingshui33 #15 候补从刚开始上线的时候显示排第几，后面改成显示人数较少、中等、较多，改成现在啥也不显示，只显示成功率。",
          "en": "@qingshui33 #15 The waiting list used to show the ranking when it first went online, then it changed to showing fewer, medium, and more people, and now it shows nothing, only the success rate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@nuomi196500 #43 始发站买短坐满（你只要开放，春运期间绝对座票站票都满），然后中间都补长程票，中间站你还想上人？",
          "en": "@nuomi196500 #43 Buying short tickets at the origin and filling all seats (as long as you open it up, seats and standing tickets will definitely be full during the Spring Festival travel season), and then buying long-distance tickets in the middle. You still want people to get on at the intermediate stations?"
        },
        {
          "zh": "看来你是真没坐过真正繁忙的春运火车。",
          "en": "It seems like you've never taken a really busy Spring Festival train."
        },
        {
          "zh": "你假定了都是买长走短的，那么那些真正长程的人呢？",
          "en": "You assume everyone buys long and rides short, so what about those who are really long-distance travelers?"
        },
        {
          "zh": "不过就是说得好听，背地里就是把真正长程需要的人往死里摁。",
          "en": "It just sounds good, but in reality, it crushes the real long-distance travelers."
        },
        {
          "zh": "这你想要别人留口德？",
          "en": "Do you want others to be polite?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hopingtop #57 看你怎么定义社会责任了。",
          "en": "@hopingtop #57 It depends on how you define social responsibility."
        },
        {
          "zh": "如果把社会责任定义为运载最多的人数，显然短途应该优先。",
          "en": "If social responsibility is defined as transporting the most people, short distances should obviously be given priority."
        },
        {
          "zh": "此模式下，相当于放弃部分长途旅客，转而增大短途运载旅客数量。",
          "en": "Under this model, it is equivalent to giving up some long-distance passengers and increasing the number of short-distance passengers."
        },
        {
          "zh": "而长途可以改为飞机，体验反而比火车更好。",
          "en": "Long-distance travel can be switched to airplanes, and the experience is actually better than trains."
        },
        {
          "zh": "短途选飞机成本和体验都很差。",
          "en": "Short-distance air travel is very poor in terms of cost and experience."
        },
        {
          "zh": "比如从广州去哈尔滨，可选高铁和飞机： 1 、高铁全程 17 多小时，两段路程，总票价 1450 左右。",
          "en": "For example, from Guangzhou to Harbin, you can choose high-speed rail or airplane: 1. The high-speed rail takes more than 17 hours in total, with two legs, and the total ticket price is about 1450 yuan."
        },
        {
          "zh": "2 、飞机全称 4 小时 15 分，票价从 1400 到 4000 都有。",
          "en": "2. The airplane takes 4 hours and 15 minutes, and the ticket price ranges from 1400 to 4000 yuan."
        },
        {
          "zh": "至于你提到的短途无法准确预估旅客线路，这是其实就是精细化管理水平和较高的管理成本。",
          "en": "As for the point you mentioned that it is impossible to accurately estimate the routes of short-distance passengers, this is actually the level of refined management and the high management costs."
        },
        {
          "zh": "更复杂的算法，加大硬件投入，配合 ai 大数据模型预测，提高客服素质和效率，精简业务受理流程，至少理论上可以解决。",
          "en": "More complex algorithms, increased hardware investment, combined with AI big data model predictions, improve customer service quality and efficiency, and streamline business processing procedures, which can be solved at least theoretically."
        },
        {
          "zh": "此外车厢的清洁、检票等成本也在提升。",
          "en": "In addition, the cost of cleaning and ticket checking of carriages is also increasing."
        },
        {
          "zh": "如果按这个思路，首先可以确定把社会责任承担的了极限，因为已经最大化发挥了现有铁路的运载能力，服务人数是尽可能的多，符合承担更多社会责任目标。",
          "en": "If we follow this logic, first of all, we can be sure that we are taking the social responsibility to the limit, because we have maximized the existing railway's carrying capacity, and the number of people served is as much as possible, which is in line with the goal of undertaking more social responsibility."
        },
        {
          "zh": "其次，企业的营收也将最大化，符合企业动机。",
          "en": "Secondly, the company's revenue will also be maximized, which is in line with the company's motivation."
        },
        {
          "zh": "此处营收不等于利润，因成本也在提升。",
          "en": "Revenue here does not equal profit, because costs are also increasing."
        },
        {
          "zh": "最后利润是否提升未知。",
          "en": "Finally, whether the profit increases is unknown."
        },
        {
          "zh": "而且，你说铁老大一直亏损。",
          "en": "Furthermore, you said that the 'Iron Old Man' has been losing money."
        },
        {
          "zh": "正常逻辑，一个一直亏损的企业，即便股东不介意，股本也会亏的变为 0 。",
          "en": "In normal logic, a company that has been losing money, even if the shareholders don't mind, the equity capital will also be lost to 0."
        },
        {
          "zh": "所以铁老大对亏不亏钱并不看重，反正有人兜底。",
          "en": "So, the 'Iron Old Man' doesn't care much about losing or not losing money, anyway, someone will cover the losses."
        },
        {
          "zh": "因此，上述思路理论上他们应该接受。",
          "en": "Therefore, they should theoretically accept the above ideas."
        },
        {
          "zh": "至于为什么不接受？",
          "en": "As for why they don't accept it?"
        },
        {
          "zh": "人的惰性。",
          "en": "Human inertia."
        },
        {
          "zh": "我能躺着把钱挣了，干嘛起早贪黑？",
          "en": "If I can make money lying down, why would I work hard?"
        },
        {
          "zh": "这具体指管理层，基层服务人员是非常辛苦的，且无论哪种方式，都很辛苦。",
          "en": "This specifically refers to the management, and the frontline service personnel are very hard, and no matter which way it is, it is very hard."
        },
        {
          "zh": "而且，管理层和企业股东之间本来就存在矛盾，管理层希望更高的薪资，更好的福利待遇，更少的工作和责任。",
          "en": "Moreover, there is a contradiction between the management and the shareholders of the company. The management hopes for higher salaries, better welfare benefits, and less work and responsibility."
        },
        {
          "zh": "股东希望更多的利润。",
          "en": "The shareholders want more profits."
        },
        {
          "zh": "这是私企股东与管理层间的矛盾。",
          "en": "This is the contradiction between the shareholders and the management of private enterprises."
        },
        {
          "zh": "国家背景的股东连利润都没太多诉求，请问怎么指望铁老大管理层有盈利诉求？",
          "en": "State-owned shareholders don't even have much demand for profits. How can we expect the management of the 'Iron Old Man' to have a desire for profit?"
        },
        {
          "zh": "所以，改变？",
          "en": "So, change?"
        },
        {
          "zh": "确实改变了。",
          "en": "It has indeed changed."
        },
        {
          "zh": "改改 UI ，改改文宣，引导引导舆论，洗洗民众认知。",
          "en": "Change the UI, change the publicity, guide public opinion, and wash the public's perception."
        },
        {
          "zh": "改变？",
          "en": "Change?"
        },
        {
          "zh": "其实什么都没变，惰性没变，思维没变，理念更没变。",
          "en": "Actually, nothing has changed. The inertia hasn't, the thinking hasn't, and the concept hasn't either."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "堵不如疏",
          "en": "It's better to guide than to block."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "估计是把这层风险转嫁给用户了，登陆时候勾选的用户协议，没几个人看过，里面放个转嫁协议很正常",
          "en": "It is estimated that this risk is being transferred to the users. Few people have read the user agreements that are checked when logging in, and it is normal to put a transfer agreement in it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "放开户籍制度吧",
          "en": "Relax the household registration system."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只是现在这些第三方平台目前还没有做大。",
          "en": "It's just that these third-party platforms haven't grown big yet."
        },
        {
          "zh": "早晚有一天会被惩治的，前期养肥再收割这不香嘛。",
          "en": "They will be punished sooner or later. Isn't it good to fatten them up first and then harvest them?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Dscbgc #1 请详解",
          "en": "@Dscbgc #1 Please explain in detail"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lifeshadow #5 估计属实，但短区间的行程放票数量太少(或者不放票)，分不到",
          "en": "@lifeshadow #5 It's probably true, but the number of tickets released for short-distance journeys is too small (or no tickets are released), so they can't be allocated."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lifeshadow #6 优先给全程的出票",
          "en": "@lifeshadow #6 Prioritize issuing tickets for the entire journey"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lifeshadow 是的，目前并没有什么证据能证明他们说的这一点，感觉候补订单可以加个序号表示当前排第几，但是我猜他们不会这样做",
          "en": "@lifeshadow Yes, there is currently no evidence to prove this point. I feel that a serial number can be added to the waiting list order to indicate the current ranking, but I guess they won't do this."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那主要是 12306 锁票啊，我也不想买长乘短，但你 12306 不放票怎么办",
          "en": "That's mainly because 12306 locks the tickets. I don't want to buy long and ride short either, but what can I do if 12306 doesn't release tickets?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要第三方不在票价上加钱相信有关部门是不会理的.毕竟民众有需求.",
          "en": "As long as the third-party platforms don't add money to the ticket price, I believe the relevant departments won't care. After all, the public has a demand."
        }
      ],
      "type": "replies"
    }
  ]
}