{
  "id": 1015809,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "慢性鼻炎，有没有根治或者明显改善的方法？",
          "en": "Chronic rhinitis, is there a way to cure it or significantly improve it?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "多年毛病，时好时坏，看了不少医生，都无法治好，天气稍有变化，鼻子就难受，有什么办法吗？",
          "en": "It's been a problem for many years, sometimes good, sometimes bad. I've seen many doctors but can't get it cured. My nose feels uncomfortable when the weather changes slightly. Is there anything I can do?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "花钱看医生都解决不了，V 友免费解决方案可信度不高啊。。。大部分时候，病人自愈都是个例，而且他会把成果归结为最后一次用的药。针对你给的信息，天气变化鼻子就差，那就想办法让天气变化的影响变小，我猜测是变冷变干你就受不了1 、 你可以带棉口罩，保证你呼吸时，能隔离一下冷空气，呼出去的湿气残留在口罩上，吸气时还能保持湿度2 、室内恒温干燥的话，那就是加湿器。  室内温度保持在 21 度左右，鼻子不受冷。方案不好，那你自己想办法，目标就是让鼻子处于更高的温度，合适的湿度。",
          "en": "Paying to see a doctor doesn't solve the problem, and the credibility of free solutions from V friends isn't high... Most of the time, patients' self-healing is an individual case, and they attribute the results to the last medicine they used. Based on the information you provided, your nose is sensitive to weather changes, so you should try to minimize the impact of weather changes. I guess you can't stand it when it gets cold and dry. 1. You can wear a cotton mask to ensure that when you breathe, it can isolate the cold air, and the exhaled moisture remains on the mask, maintaining humidity when you inhale. 2. If the indoor temperature is constant and dry, then use a humidifier. Maintain the indoor temperature around 21 degrees Celsius so that your nose doesn't feel cold. If the plan isn't good, then you can figure it out yourself. The goal is to keep your nose at a higher temperature and suitable humidity."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "根治?    简单, 你去 新疆某个小乡下住上几个月就知道原因了. 空气才是根本原因",
          "en": "Cure? It’s simple, go to a small village in Xinjiang and live there for a few months, and you'll know the reason. Air is the root cause."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "洗鼻器，那种手动的生理盐水一边进一边出的，能极大缓解。价格也不贵。我大概只用了 1 个月，症状明显轻了很多。",
          "en": "Nasal wash, the manual one with physiological saline going in and out, can greatly relieve it. The price isn't expensive either. I used it for about 1 month, and the symptoms were significantly reduced."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给你出个成本极高的主意我本人原来在成都工作一段时间，鼻子要多不舒服有多不舒服，医院诊断过敏性鼻炎，而且一直都好不了。后来回老家附近工作，不到一个月所有的症状都消失了。所以你可以尝试挪挪窝",
          "en": "I'll give you an idea with a very high cost. I used to work in Chengdu for a while, and my nose was extremely uncomfortable. The hospital diagnosed me with allergic rhinitis, and it never got better. Later, I returned to work near my hometown, and all the symptoms disappeared in less than a month. So you can try moving."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chenliangngng 老家是北方？",
          "en": "@chenliangngng Is your hometown in the north?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 可以保持适当运动。我的经验是：运动对鼻炎的症状的改善可能不大显著，但对于提升承受鼻炎痛苦的能力作用很大。2. 改善空气质量，减少与过敏源的接触和对鼻腔的刺激。楼上的老哥们都过说了，这个改变比较困难。在室内可以试一试空气净化器，似乎有轻微的作用。3. 保持良好的心理健康。不要有太大压力。这个对我作用比较明显，似乎压力大过敏也会更明显。但这个也比较困难。4. 有过敏性（应变）鼻炎吗？可以遵医嘱使用抗过敏药物。如果鼻炎比较严重，应想办法保证睡眠。可以吃一些有效的抗生素，实在不行了就用减充血剂。",
          "en": "1. You can maintain appropriate exercise. My experience is that exercise may not significantly improve the symptoms of rhinitis, but it is very effective in improving your ability to endure the pain of rhinitis. 2. Improve air quality, reduce contact with allergens and irritation to the nasal cavity. The brothers upstairs have already mentioned this, and this change is more difficult. You can try an air purifier indoors, which seems to have a slight effect. 3. Maintain good mental health. Don't have too much stress. This has a more obvious effect on me; it seems that stress makes allergies more obvious too. But this is also more difficult. 4. Do you have allergic (adaptive) rhinitis? You can use anti-allergy drugs as prescribed by a doctor. If the rhinitis is severe, you should try to ensure sleep. You can take some effective antibiotics, and if it doesn't work, use decongestants."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chenlia 成都雾霾太严重了，我在成都也是半年鼻子一直不舒服，回家就没问题了",
          "en": "@chenlia The smog in Chengdu is too serious. I also have an uncomfortable nose in Chengdu for half a year, but it's fine when I go home."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "布地奈德鼻喷雾剂，每天一喷，显著改善生活。无法治愈，停药即复发。",
          "en": "Budesonide nasal spray, one spray a day, significantly improves life. It cannot be cured, and it will relapse as soon as you stop taking the medicine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "运动加饮食调整，无其他解决方法。我认识有人即使去医院做手术都尝试过，也没法根治。",
          "en": "Exercise and diet adjustment, no other solutions. I know someone who even tried surgery in the hospital, but it couldn't be cured."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "无麸质饮食",
          "en": "Gluten-free diet"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "空气净化器，真有用",
          "en": "Air purifier, really useful"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "游泳，我一直有鼻炎，冬泳一冬天，结果好了",
          "en": "Swimming, I've always had rhinitis. I swam in the winter all winter, and it got better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "润",
          "en": "Moist"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么只有一个人正确推荐了布地奈德？糠酸莫米松也行。看个正规西医让医生确定你的问题和用药吧。",
          "en": "Why only one person correctly recommended Budesonide? Mometasone furoate is also okay. See a regular Western doctor and let the doctor determine your problem and medication."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去岭南一线，比北方要有些效果。",
          "en": "Going to the Lingnan area might have some effect compared to the north."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过敏性的路过，慢性的看有网友分享坚持跑步可破。",
          "en": "Someone with allergies passing by. For chronic rhinitis, a netizen shared that persistent running can break it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "《中国变应性鼻炎诊断和治疗指南（ 2022 年，修订版）》",
          "en": "《Chinese Guidelines for Diagnosis and Treatment of Allergic Rhinitis (2022, Revised Edition)》"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你应该说说你的鼻炎具体在哪种条件下发作，是冷时发作还是热时？湿度？因为，同样是所谓“鼻炎”，其实千差万别",
          "en": "You should talk about the specific conditions under which your rhinitis occurs, is it triggered by cold or heat? Humidity? Because, the so-called “rhinitis” is actually very different."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "装 地 暖。实测非常有用",
          "en": "Install underfloor heating. Tested and very useful."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是没有办法，可以尝试艾灸的方法，有治愈案例",
          "en": "It's not impossible. You can try moxibustion, and there are cured cases."
        }
      ],
      "type": "replies"
    }
  ]
}