{
  "id": 1017424,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "流量卡平台，自己办卡+佣金",
          "en": "Traffic card platform, apply for cards yourself + commission"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "看到很多 v 友再问手机卡，流量卡。不如自己做代理商，可以自己办自己拿佣金。\r\n\r\n佣金是很高的，我抽的很少几块钱，不是那些不知道多少级的代理。\r\n\r\n佣金比这少的可以重新注册。\r\n\r\nhttps://haoka.lot-ml.com/  推荐手机号：17051203366\r\n\r\n![图片]( https://s2.loli.net/2024/02/22/MitDrugNCW1k8sY.png)",
          "en": "Seeing many v friends asking about mobile cards and traffic cards. It's better to become an agent yourself, you can apply for cards yourself and get commissions.\r\n\r\nThe commission is very high, I only take a few yuan, not those agents who don't know how many levels.\r\n\r\nCommissions lower than this can be re-registered.\r\n\r\nhttps://haoka.lot-ml.com/ Recommended mobile number: 17051203366\r\n\r\n![image]( https://s2.loli.net/2024/02/22/MitDrugNCW1k8sY.png)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "推广可以看看这个，写软文推广 https://dev.yesmore.cc/articles/llk",
          "en": "For promotion, you can take a look at this, write a soft article to promote https://dev.yesmore.cc/articles/llk"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想起了前些年火的“卡盟”。。",
          "en": "It reminds me of the popular “card alliances” in previous years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@willie1991 物流卡共享流量池的，流量池如果不多了就会限速或者没那么多等等。@a353440815 搜索下名字试试，重新上架的再后面或者会延迟。最新上架的就是最前面。",
          "en": "@willie1991 The logistics card shares the traffic pool, and if the traffic pool is not enough, it will be throttled or there will not be that much, etc. @a353440815 Search the name and try it, the re-listed ones are later or delayed. The latest ones are at the front."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你不知道你已经是几手代理了？",
          "en": "Don't you know how many layers of agent you are already?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你的佣金比我低，已经被抽了很多了",
          "en": "Your commission is lower than mine, and you have been deducted a lot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在还有没有 19 月租的流量卡",
          "en": "Are there any traffic cards with a monthly fee of 19 now?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@llllllllllllllii 我应该是一级，上级是 172 平台。  已经有 172 平台的，佣金如果比这低可以重新拿手机号注册",
          "en": "@llllllllllllllii I should be a first-level agent, and the superior is the 172 platform. If you already have the 172 platform, and the commission is lower than this, you can re-register with a mobile phone number"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chenhua19940128 这是下级的，下级注册就是上图的佣金。我的高一点点，抽了几块钱。",
          "en": "@chenhua19940128 This is the sub-level, and the commission for sub-level registration is the commission shown in the picture. Mine is a little higher, and I took a few yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@stevenshawe 你至少被抽了 3 层",
          "en": "@stevenshawe You have been deducted at least 3 levels"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zhhbinn 有的，推荐这个套餐，两年 19 到期再换一张。https://haokawx.lot-ml.com/h5order/index?pudiD=437&userid=302421",
          "en": "@zhhbinn Yes, I recommend this package, 19 for two years, and then change another card when it expires. https://haokawx.lot-ml.com/h5order/index?pudiD=437&userid=302421"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@llllllllllllllii 看看你的，图上是我的下级。 我发的是下级的佣金。比如梦春卡我的 100 ，我抽了 5 块钱。你的这个有多少啊",
          "en": "@llllllllllllllii Take a look at yours, the picture is my sub-level. I published the commission of the sub-level. For example, for the Mengchun card, mine is 100, and I took 5 yuan. How much is yours?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "办了一张，信号巨差，手机里两张电信卡，一张营业厅正常办理的，一张这种流量卡，不论白天黑夜同一时间同一地点流量卡要么没信号，经常只有 4G ，而且网速超级无敌的慢！！！",
          "en": "I applied for a card, and the signal is terrible. There are two Telecom cards in my phone, one is normally applied for at the business hall, and the other is this kind of traffic card. No matter day or night, at the same time and location, the traffic card either has no signal, often only 4G, and the network speed is super slow!!!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Sahzzz 没区别的，都是正规的卡。两个卡槽互换一下或者去补个卡，是不是卡坏了",
          "en": "@Sahzzz There is no difference, they are all legitimate cards. Swap the two card slots or go to replace a card, is the card broken?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个要了何用，一般都是那种物联网卡吧",
          "en": "What's the use of this? It's usually that kind of IoT card, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cat9life 不是物联网，物联网是没语音的，所以看到无语音不能拨打电话的就不要办。",
          "en": "@cat9life It's not IoT. IoT doesn't have voice, so don't apply if you see that there is no voice and cannot make calls."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@stevenshawe 奥那是两层，越来越卷了",
          "en": "@stevenshawe Oh, that's two layers, it's getting more and more competitive"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你级别比我高，我佣金比你少了 30 多块钱",
          "en": "Your level is higher than mine, and my commission is more than 30 yuan less than yours."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 早上好，我之前也自己办了一张，为啥佣金一直是冻结着的",
          "en": "op Good morning, I also applied for a card myself before, why is the commission always frozen?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@shuxhan 你的上级这么黑呀，重新拿个号注册，注册成我的就是图上的佣金。",
          "en": "@shuxhan Your superior is so greedy, re-register with a number, and register as mine is the commission shown in the picture."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Gyj123 你看到后台佣金结算，一般都是次月底结算。也有秒返的不过佣金会低点。",
          "en": "@Gyj123 You see the commission settlement in the background, it is generally settled at the end of next month. There are also instant refunds, but the commission will be lower."
        }
      ],
      "type": "replies"
    }
  ]
}