{
  "id": 1015812,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "份子钱是必须的嘛？",
          "en": "Is the gift money mandatory?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "份子钱本质上是礼尚往来，但是如果你很明确自己不结婚，是否还有必要搭份子钱？或者说，什么样的情况下，这份子钱可以不搭？\n\n\n\n解释下，对于经常联系的亲戚同学朋友，这份子钱我愿意出。但是对于那些从来没有联系，只要举办婚礼葬礼就要请你搭钱的，我是一点都不愿意出。\n\n\n\n具体一点，比如大学同学，毕业后就没怎么联系过，要结婚了请你，我是不愿意出的。\n\n\n\n你们都怎么操作呢？理性讨论哈。",
          "en": "Gift money is essentially a reciprocal gift, but if you are clear that you are not getting married, is it still necessary to give gift money? Or, in what circumstances can you avoid giving gift money?\n\n\n\nLet me explain, I am willing to give gift money to relatives, classmates, and friends who I often contact. But for those who I have never contacted, who ask for money just to hold a wedding or funeral, I am absolutely unwilling to give.\n\n\n\nTo be specific, for example, university classmates, who I haven't contacted much after graduation, if they invite you to their wedding, I am unwilling to give.\n\n\n\nHow do you all handle this? Rational discussion, huh?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "这个帖子真幼稚，没活可以咬个打火机。",
          "en": "This post is really naive; if you have nothing else to do, you can bite a lighter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "他好意思跟你要钱，你不好意思不给？",
          "en": "Is he embarrassed to ask you for money, and you are embarrassed not to give it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不去不就得了",
          "en": "Just don't go."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "富则广济天下，穷则独善其身。",
          "en": "When rich, help the world; when poor, cultivate oneself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不去，以后不联系，也就不用给份子钱了。",
          "en": "If you don't go, you won't contact them in the future, and you won't need to give gift money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "请了就说啊没有时间，我最近在帮客户#&*@&#*&@*（#&@ 胡编乱造。但就是绝口不提钱的事。",
          "en": "If you are invited, just say you don't have time; I've been helping a client with #&*@&#*&@*（#&@ making things up lately. But I won't mention money at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "重点在于，你结婚时，想不想请他来。就这么简单，如果你结婚都不想请他，那还给什么份子钱？另外，看你想不想去聚会，趁此机会和旧同学重新建立更多联系，那也可以去。否则，你都不想在那个圈子混了，当然不用管啦，已读不回即可。",
          "en": "The key is, when you get married, do you want to invite him? It's that simple; if you don't even want to invite him to your wedding, why give gift money? Also, see if you want to go to the gathering, take this opportunity to re-establish more contact with old classmates, then you can go. Otherwise, if you don't want to hang out in that circle, of course, you don't have to care, just mark it as read and don't reply."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不去不给，去了要给",
          "en": "If you don't go, don't give; if you go, you have to give."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不联系的同学为什么要给钱",
          "en": "Why give money to classmates you don't contact?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关系好的，我就是身上只有 1000 块，我能拿 300 出来随份子关系不好的，我身上就是有 1000 万，我也不会随一分钱",
          "en": "If the relationship is good, even if I only have 1000 yuan, I can give 300 yuan as a gift. If the relationship is bad, even if I have 10 million yuan, I won't give a penny."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看风俗有的地方风俗是不要的，就是你吃我你喜酒，我吃你喜酒，就代替彩礼了",
          "en": "Look at the customs; some places don't require it. It's like you attend my wedding, and I attend yours, which replaces the betrothal gifts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不联系的就没必要去了，分子钱也免了",
          "en": "If you don't contact them, there is no need to go, and the gift money can be waived."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人情世故社会，你单纯说你不结婚就不去，站不住脚。除非你认为以后所有人都不来往。关系比较好的请你，不一定是为了钱。所以你结婚和不结婚跟随不随礼没有直接关系。",
          "en": "In a society of human relationships, it's not tenable to simply say you won't go because you're not getting married. Unless you think you won't interact with anyone in the future. People with a better relationship invite you, not necessarily for the money. Therefore, whether you get married or not has no direct relationship with whether or not you give a gift."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那种十年都没联系过的，突然要结婚来请你，已读不回就完事了。",
          "en": "For those you haven't contacted in ten years, and suddenly invite you for their wedding, just mark it as read and don't reply."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "葬礼要赶着给（你想跟对方交往的情况下，给对方往生者随份子是给活着的人看的），婚礼要是没请你，就不用给，切忌没请你上杆子随喜事的份子。（还份子除外）",
          "en": "You should give for funerals quickly (if you want to interact with the person, giving gift money to the deceased is for the living to see). If you are not invited to the wedding, you don't need to give. Remember not to actively give gifts for happy occasions if you are not invited (excluding returning gifts)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "毕业后不咋联系的那种，看上学的时候关系咋样，关系好就发红包。说话不多的就忽略消息..",
          "en": "For those you don't contact much after graduation, see how the relationship was in school. If it was good, send a red envelope. If they don't talk much, just ignore the message."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当然不必须像那种自从毕业就再也没联系，平时也没啥交情的，发我婚礼安排我都无视交情很好，但参加不了婚礼的，我份子钱直接 500 、1000 ，人到不了那钱必须到位",
          "en": "Of course, it's not necessary to give like with those you haven't contacted since graduation, and with whom there's no relationship normally. If they send me their wedding arrangements, I will ignore it. If the relationship is good, but I can't attend the wedding, I will directly give 500 or 1000, and the money must be in place if the person can't be there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@renmu @243205964 @javen73 @kisick @luoyebuyu 也是哈，经常不联系的，也就没必要了。@woshinide300yuan 很多都是微信发个消息，也不打电话，这种的就可以忽略了。@cmdOptionKana 我并不想结婚，而且这些同学分布在天南海北，毕业后一次都没联系过，聚会就更不能了。@FreshOldMan 大多天各一方，也不会去。除非，经常联系的还有可能过去。@chenliangngng 赞同。@unregister 我这边应该不太行，但是同学都是不同省市的，不清楚对方那边的情况。@m0unta1n886 所有人都不来往肯定不会的，从功利角度讲，来往的基本上是能相互帮助的。感谢建议。@allpass2023 @amon @GT7 @rxmt 好的，感谢建议。",
          "en": "@renmu @243205964 @javen73 @kisick @luoyebuyu Yes, for those you don't contact often, there's also no need. @woshinide300yuan Many just send a message on WeChat and don't call, so you can ignore those. @cmdOptionKana I don't want to get married, and these classmates are scattered all over the country. We haven't contacted each other since graduation, so gatherings are even less possible. @FreshOldMan Most of them are far apart, and they won't go. Unless, if they are contacted often, it is possible to go. @chenliangngng Agreed. @unregister It probably won't work for me, but the classmates are from different provinces and cities, and I don't know the situation there. @m0unta1n886 It's definitely not that you don't interact with everyone. From a utilitarian point of view, those who interact with you can basically help each other. Thanks for the advice. @allpass2023 @amon @GT7 @rxmt Okay, thanks for the advice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@boris1993Jr 基本想法与你一致，感谢。",
          "en": "@boris1993Jr My basic idea is the same as yours, thanks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@boris1993Jr 交情很好也才 500 你也别在这给人建议了",
          "en": "@boris1993Jr Your relationship is very good, and you only give 500. Don't give people advice here."
        }
      ],
      "type": "replies"
    }
  ]
}