{
  "id": 1018729,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "老婆坚持想生孩子，烦",
          "en": "My wife insists on having a baby, annoying."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "在杭州工作 5 年了，有了房子，贷款商贷部分快清了。清完后家庭积蓄只有 60w 了。\r\n\r\n目前家庭总收入差不多税后 90w 的样子，和老婆 82 开。但这收入恐怕不持久，年过 30 了，总感觉最多再持续两三年。\r\n\r\n自己一直想过两人世界，希望攒够钱以后过闲适的生活，找个躺平的工作，有空两个人出去旅游，玩耍。\r\n\r\n但是老婆很想要孩子。\r\n\r\n想到有孩子以后，就需要人照顾，但我不希望引入任何一方的父母来生活，这样完全没有自由，父母来住久了，肯定会干预到我们的生活，比如肯定无法再两个人下班后一起安静看书看剧，玩游戏，出去逛街，干两个人的事情，吃饭的时候也不方便随便分享工作生活中的开心和烦恼，父母在一旁听着，以他们的理解能力恐怕会把任何事情小题大作。更何况，这房子完全是靠我们两个人挣的，完全自食其力却不能得享自由，这样的人生太苦了。\r\n\r\n不请父母，就可能一路上需要月嫂、育儿嫂、保姆、钟点工才能照看孩子一路长大，这中间的开销恐怕躺平以后无法承受，更何况，靠谱的育儿嫂和保姆也很难找，恐怕兜兜转转，最终还是得既要请人，又要父母来看顾，这样家里的人更多，更没有足够的空间过自己和两人的生活。\r\n\r\n除此之外，更害怕有了孩子以后，生活被孩子所占据，辛苦工作下班后。本来是两个人分享各种开心事情，互诉各种烦恼，相互依偎取暖，在家里充好电才能外出打拼，而有了孩子，还得花精力应对孩子，搞的疲惫不堪，两个人的沟通也势必减少，恐怕很多事情都只能藏在心里了，久而久之恐怕会影响两个人感情。\r\n\r\n看到很多其他家庭都是女方不想要孩子，而男方很想要孩子，而我家怎么老婆就这么渴望小孩呢，真是烦恼。",
          "en": "I have been working in Hangzhou for 5 years, and I have a house with a commercial loan that is almost paid off. After paying it off, the family savings will only be 600,000 yuan.\r\n\r\nCurrently, the total family income is about 900,000 yuan after tax, with an 80/20 split between my wife and me. But this income is unlikely to last, I am over 30, and I feel that it will last for two or three years at most.\r\n\r\nI have always wanted a DINK (Double Income No Kids) lifestyle, hoping to save enough money to live a leisurely life in the future, find a laid-back job, and travel and play together when we have time.\r\n\r\nBut my wife really wants a child.\r\n\r\nThinking about having a child, we will need someone to take care of them, but I don't want to involve either of our parents, as that would completely eliminate our freedom. If my parents live with us for a long time, they will definitely interfere with our lives, such as not being able to quietly read books, watch dramas, play games, go shopping, or do things together after work. It would also be inconvenient to casually share the joys and sorrows of work and life during meals, because with their understanding ability, they might make a big deal out of anything. What's more, this house was earned entirely by the two of us, and it's too bitter to not be able to enjoy freedom despite being self-reliant.\r\n\r\nIf we don't ask our parents for help, we may need a confinement nanny, childcare nanny, nanny, and hourly worker along the way to take care of the child as they grow up. The expenses in between may be unbearable after I retire. Moreover, reliable childcare nannies and nannies are also difficult to find, and I'm afraid that in the end, we will have to hire someone and have our parents take care of them, resulting in more people in the family and not enough space to live our own lives.\r\n\r\nIn addition, I am even more afraid that after having a child, our lives will be occupied by the child. After working hard, we would originally share all kinds of happy things, confide in each other our various worries, and huddle together for warmth, recharging at home before going out to fight. But with a child, we will have to spend energy dealing with the child, which will make us exhausted, and the communication between us will inevitably decrease. I'm afraid that many things will only be hidden in our hearts, which may affect our relationship in the long run.\r\n\r\nI see that in many other families, the woman doesn't want children, but the man wants children. Why is my wife so eager for children? It's really annoying."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "放过人家吧，何必呢",
          "en": "Leave them alone, why bother?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@nnqijiu 普通的恋爱不稳定，结婚就可以谈一辈子的恋爱了",
          "en": "@nnqijiu Ordinary love is unstable, marriage allows you to have a lifetime of romance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "明明是自己 单方面的想法非要说的那么高大上。你这种和那种催婚  自我为了你好的有啥区别。只不过换了一种形式而已。",
          "en": "It's clearly your own one-sided thoughts that you're trying to make sound so noble. What's the difference between you and those who pressure people to marry, saying it's for their own good? It's just a different form."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sevenfeet 为啥老婆想生，你不愿意就行，老婆不同意你结扎，你不去？",
          "en": "@sevenfeet Why is it that if your wife wants to have a baby, you simply disagree? If your wife doesn't agree with you getting a vasectomy, won't you go?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "做为有孩子的人, 很不好意思的告诉楼主, 你的所有的担心, 都是对的, 而且情况比你想的还要糟糕另外好奇为什么回复里面一水的常识说服楼主你应该要孩子, 不要孩子有问题的. 恍惚间感觉这个论坛都是上一辈老人在上.",
          "en": "As someone who has children, I'm very embarrassed to tell you, OP, that all your worries are correct, and the situation is even worse than you think. I'm also curious as to why the replies are full of common-sense arguments trying to convince you that you should have children and that there's something wrong with not wanting them. I feel like this forum is full of old-fashioned people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主的担忧都是真的，没有一条是多余的。建议不用考虑道德说教，夫妻双方能达成一致就好了。现在说你“幼稚”、“自私”的，没有一个会来替你养小孩，这远不是“多一张嘴”的问题。",
          "en": "OP's worries are all real, not one is superfluous. It is suggested that you do not consider moral sermons, and it is best for both husband and wife to reach an agreement. None of those who are calling you 'immature' or 'selfish' now will raise your children for you; this is far from a simple matter of 'one more mouth to feed'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "然后等老婆老了不能生了，你换个能生的？想不生简单，你去做个永久绝育就好了。",
          "en": "Then when your wife gets old and can't have children anymore, you'll replace her with someone who can? If you don't want to have children, it's simple, just get a permanent sterilization."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 不想生孩子 被楼上说的有多大的错一样愿意生就生不愿意生就不生  尊重每个人的选择大部分，有责任心的人不敢生，没责任的只管生。",
          "en": "OP doesn't want to have a baby, and the commenters above are acting like he's done something incredibly wrong. If you want to have children, have them; if you don't, don't. Respect everyone's choices. Most responsible people are afraid to have children, while irresponsible people just have them without a second thought."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议离婚做好切割，这个分歧很难调和，虽说现在不鼓励人生娃，但也不能剥夺人生娃的权利吧。",
          "en": "I suggest getting a divorce and making a clean break. This disagreement is difficult to reconcile. Although people are not encouraged to have children now, the right to have children cannot be taken away."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议离婚，互相别耽误。你四五十岁后悔了可以找个能生的再生一个，你老婆现在不生到四五十岁可就生不了了。",
          "en": "I suggest getting a divorce so you don't delay each other. If you regret it in your forties or fifties, you can find someone who can have children and have another one, but if your wife doesn't have children now, she won't be able to have them in her forties or fifties."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼上发神经吧，是 op 老婆要生，又不是 op 要生，为什么又是要 op 去结扎的，又是要离婚的，合着生小孩是应该的呗，op 这种不愿意生的在你们看来都是异类，还扯什么女的年龄大了生不出了，凭什么 assume op 50 岁的时候突然又想要孩子了，而且婚姻本来就是平等的协议，等 50 岁再离婚又怎么样，又不是不分财产了，楼上真的弄的跟不生孩子天塌下来了一样，简直是清朝来的这么简单的权利义务对等都搞不明白，是他老婆要生，结果生下来了还不是要 op 来养说现实一点的，你们收入差距这么大，你完全可以强势一点（说白了你如果一点都不让步她拿你也没办法），如果大家各退一步，那可以要求她生完小孩之后在家全职带孩子，如果她愿意那就生",
          "en": "The comments above are crazy. It's OP's wife who wants to have a baby, not OP. Why are you telling OP to get a vasectomy or get a divorce? It's like you think it's everyone's duty to have children, and that people like OP who don't want children are weirdos. And why are you talking about how women can't have children when they're older? Why are you assuming that OP will suddenly want children when he's 50? Marriage is an equal agreement, and so what if they get divorced when they're 50? It's not like they won't divide the property. The comments above are acting like the sky is falling because someone doesn't want kids, it's like they're from the Qing dynasty and can't understand this simple concept of equal rights and obligations. His wife wants the baby, but isn't OP the one who'll have to raise it? To be realistic, the income difference between them is so great that OP can be assertive (frankly, if you don't make any compromises, she can't do anything to you). If everyone compromises, you can ask her to stay home and take care of the child because she is the one that wants it. If she agrees to the arrangement, she will have the baby."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "贷款还完，积蓄 60W 。年收入 90W 。我欠着 30W 外债，2 个娃。家庭年薪 20W 。最惨是：我过年回来已经被谈话了，准备被裁，还是 35 岁。60W 积蓄，我想不出怎么养不起孩子？",
          "en": "Loan paid off, savings of 600,000, annual income of 900,000. I owe 300,000 in debt and have 2 kids. Family annual salary of 200,000. The worst part is: I was talked to after returning for the New Year and am about to be laid off, and I'm only 35. With 600,000 in savings, I can't imagine how you can't afford to raise a child?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不想生孩子，为什么要被这么多人抨击。OP 年收入 90w 不想生孩子，被你们抨击如果 OP 负债 90w 不想生孩子，你们还会抨击，道德绑架吗",
          "en": "Why is OP being attacked by so many people for not wanting to have children? You criticize OP for not wanting children with an annual income of 900,000. If OP was 900,000 in debt, would you still criticize them? Is this moral blackmail?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我有两个孩子，不觉得是个累赘啊。。这样玩游戏的时候有人跟我一起厮杀，无论是 XBOX 还是手游，最近迷上蛋仔了，四个人可以一起玩，巨爽。还可以出去旅游，周五下午提前让老师送闺女出来，我父母陪着我，带上她一路冲向火车站，她都不知道要干什么，我就直接带她上车直奔上海迪斯尼了。父女两个人欢乐两天，周日晚上再回来，啊哈哈哈哈。闺女被欺负，儿子去学校堵门，儿子被欺负，老子去他学校堵门，太爽了。你觉得有啥不开心的事？带孩子？我从换尿布到做饭，那样都会，因为我爱孩子们啊，我家有保姆，但我还是喜欢跟他们一起玩，一起吃饭，一起长大，太过瘾了。",
          "en": "I have two children, and I don't think it's a burden at all. When I play games, someone is with me, whether it's XBOX or mobile games. Recently, I'm addicted to Eggy Party, and four people can play together, it's so much fun. You can also go on trips. On Friday afternoons, I let the teacher send my daughter out early, and my parents are with me. I take her to the train station, and she doesn't even know what we're doing. I just take her straight to Shanghai Disneyland. The two of us have fun for two days and then come back on Sunday night, hahahaha. When my daughter is bullied, my son goes to block the school gate. When my son is bullied, I'll go block the school gate, it's so great. What unhappy things do you think there are? Raising children? I can do everything from changing diapers to cooking, because I love my children. My family has a nanny, but I still like to play with them, eat together, and grow up together. It's so addicting."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看完了回复，感觉 v 站用户挺下沉的",
          "en": "After reading the replies, I feel that the V2EX users are quite low-level."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "根据你的描述能看出来 你很爱很爱你老婆",
          "en": "Based on your description, I can tell that you love your wife very much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sevenfeet 不希望老婆变成养娃顾家的工具人。",
          "en": "@sevenfeet I don't want my wife to become a tool for raising children and taking care of the family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你先结扎我就信你说的，不然你四五十岁了找个年轻漂亮的一样传宗接代，至于结发妻，希望你那时候还记得她",
          "en": "I'll believe what you say if you get a vasectomy first. Otherwise, when you're in your forties or fifties, you'll find a young and beautiful woman to carry on the family line. As for your wife, I hope you'll still remember her at that time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主不要听那些满脑子传宗接代孩子就是快乐云云的遗老遗少的劝慰，简直不知所云，甲之蜜糖乙之砒霜一个个真搞笑，你与你老婆还是好好沟通，你自己也深思想想什么才是你和你们想要的生活，在得失之间抉择，想清楚了你自己就有答案不需要我们的建议。",
          "en": "OP, don't listen to the advice of those old-fashioned people who are obsessed with carrying on the family line and believe that children are happiness. It's completely incomprehensible. One person's honey is another person's poison. It's really funny. You and your wife should communicate well, and you should also think deeply about what kind of life you and you want. Decide between gains and losses. Once you think clearly, you will have the answer yourself and you won't need our advice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "结婚之前不说清楚？",
          "en": "Didn't you make it clear before getting married?"
        }
      ],
      "type": "replies"
    }
  ]
}