{
  "id": 1015294,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大佬们有没有什么办法可以让原生安卓使用 socks 代理的",
          "en": "Is there any way for Android to use a SOCKS proxy?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "现在是这么个情况\r\n我手里安卓手机 A 没有 root ，想通过热点转发科学或者端口代理给安卓设备 B 去激活设备。\r\n安卓设备 B 本身是个游戏设备，激活是通过 udp 协议完成的，不激活无法进入系统安装 app 。\r\n以我浅薄的知识我知道 2 点……\r\n1 是安卓手机不 root 无法直接通过热点转发科学。\r\n2 是安卓原生只能 HTTP 代理，而 HTTP 不支持 UDP 协议。\r\n\r\n所以有没有我知识外的可能性\r\n1 是有没有什么办法让安卓手机 A 在不 root 的情况下热点转发科学。\r\n2 是有没有什么办法让 HTTP 代理可以转发 UDP 协议。\r\n3 是有没有什么办法让安卓原生可以使用 socks 代理。\r\n\r\n或者…有没有个方法 4…是我想不到的…\r\n求助各位大佬了！\r\n跪求！",
          "en": "Here's the situation:\nI have an Android phone A, which is not rooted, and I want to use a hotspot to forward a VPN or port proxy to Android device B to activate the device.\nAndroid device B is a gaming device, and activation is done via UDP protocol. It cannot enter the system to install apps without being activated.\nBased on my limited knowledge, I know 2 things...\n1. An Android phone cannot directly forward a VPN through a hotspot without root.\n2. Android only supports HTTP proxy, and HTTP does not support UDP protocol.\n\nSo, are there any possibilities outside of my knowledge?\n1. Is there any way to make Android phone A forward a VPN through a hotspot without root?\n2. Is there any way to make HTTP proxy forward UDP protocol?\n3. Is there any way for native Android to use a SOCKS proxy?\n\nOr... is there a Method 4... that I can't think of...\nPlease help, big shots!\nI beg you!"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "说白了，就是：安卓，机场，加速 ns 游戏机。",
          "en": "In short, it's: Android, a VPN service, accelerating the NS game console."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@NanJuly 安卓端服务端用 EVERY PROXY.客户端用 ADGUARD BIFROSTV 接受转发 UDP 毫无鸭梨 妥妥好使。你说无法激活安装应用 应该要连 WIFI 了。那肯定要 ROOT 了用第三方软件转发 WIFI 。但是我记得好像原生的安卓 PIXEL12 系统 就可以把 VPN 直接共享到 WIFI 不用安卓任何应用的也不用 ROOT...另外球一个电脑端可以转发 SOCKS5 UDP 的服务端",
          "en": "@NanJuly Use EVERY PROXY as the server on the Android side and ADGUARD BIFROSTV as the client to receive and forward UDP. It works perfectly. You said you can't activate and install apps, so you should connect to WiFi. Then you definitely need to ROOT and use third-party software to forward WiFi. But I remember that the original Android PIXEL12 system seems to be able to directly share VPN to WIFI without using any Android app or ROOT... Also, I need a server on the computer side that can forward SOCKS5 UDP."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "安卓直接 tun2socks",
          "en": "Android directly tun2socks"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "sagernet 开透明代理入站可能可以，我不确定",
          "en": "Sagernet with transparent proxy inbound might work, I'm not sure"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://play.google.com/store/apps/details?id=app.spidy.proxyserverhttps://play.google.com/store/apps/details?id=com.gorillasoftware.everyproxy---------https://apkpure.net/postern/com.postern/download/1.1.0https://play.google.com/store/apps/details?id=com.proxifier",
          "en": "https://play.google.com/store/apps/details?id=app.spidy.proxyserverhttps://play.google.com/store/apps/details?id=com.gorillasoftware.everyproxy---------https://apkpure.net/postern/com.postern/download/1.1.0https://play.google.com/store/apps/details?id=com.proxifier"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "安装第三方 vpn 客户端，支持 socks 协议，比如 v2rayNG",
          "en": "Install a third-party VPN client that supports the SOCKS protocol, such as v2rayNG"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MeteorVIP #3 说白了，可能就是 Google TV/Meta Quest 2/3 怎么在国内激活……买都买了再花个小钱搞个能刷系统的路由器就完事了。",
          "en": "@MeteorVIP #3 In short, it might just be how to activate Google TV/Meta Quest 2/3 in China... You've already bought it, and you can just spend a little money to get a router that can be flashed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在代理工具都支持入站的",
          "en": "Proxy tools now all support inbound connections"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "路由器层解决比较方便，指定设备走代理。",
          "en": "Solving it at the router level is more convenient, specifying which devices go through the proxy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "surfboard 支持方法 1",
          "en": "Surfboard supports method 1"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@krixaar #6 对对。我阅题少了“激活”",
          "en": "@krixaar #6 Right, right. I missed the word \"activation\" when reading the question."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@f14g 这都是 HTTP ，不支持 udp 。设备 B 不激活装不了三方 app 。@YongXMan 设备 B 不激活装不了三方 app 。@krixaar 别的方法我已经知道怎么搞定了，但现在处于上头状态，就想整明白有没有可能用手机激活。@luoqeng 路由器层太麻烦了，主要是别的方法我能激活，但现在是上头状态，就想整明白有没有可能用手机激活。@M2K4 设备 B 不激活装不了三方 app 。@DefoliationM tun2socks 我看了下还是做 socks 端口代理，但设备 B 是原生安卓，用不了 socks 啊……",
          "en": "@f14g These are all HTTP, which doesn't support UDP. Device B can't install third-party apps without activation. @YongXMan Device B can't install third-party apps without activation. @krixaar I already know how to do it with other methods, but I'm in a state of being obsessed, so I just want to figure out if it's possible to activate with the phone. @luoqeng The router level is too troublesome, the main thing is that I can activate with other methods, but I'm obsessed now, so I just want to figure out if it's possible to activate with the phone. @M2K4 Device B can't install third-party apps without activation. @DefoliationM tun2socks I saw that it still does SOCKS port proxy, but Device B is native Android, so it can't use SOCKS..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有必须要先 udp 通信才能激活系统使用的安卓设备？？？",
          "en": "Also, does an Android device have to communicate via UDP before it can activate the system?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@cvbnt surfboard 看了，也是只能 HTTP 端口代理，并不能直接让热点带上科学…",
          "en": "@cvbnt I looked at surfboard, and it's only an HTTP port proxy, and can't directly get the hotspot to have a VPN..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Cooky 嗯… Quest3 ，小札不当人，必须 UDP 才能激活使用…",
          "en": "@Cooky Yeah... Quest3, Zuck is not a good person, UDP is required for activation..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@NanJuly 懂你说的了，有好几种方案。1. 有电脑，linux 系统，用 tun/tproxy ，开启 ipv4/ipv6 forward, 设置 mangle 将入口流量转发到 tun/tproxy, 手机 b 修改网关为电脑的局域网 ip 就可以了。2. a 手机刷机为 los ，los 设置可以开热点走 vpn service 。3. 用路由器，刷个 openwrt ，有很多插件可以用。",
          "en": "@NanJuly I understand what you're saying, there are several solutions. 1. If you have a computer with a Linux system, use tun/tproxy, enable ipv4/ipv6 forward, set mangle to forward the incoming traffic to tun/tproxy, and then change the gateway of phone B to the LAN IP of the computer. 2. Flash phone A to los, los settings can enable the hotspot to use the VPN service. 3. Use a router, flash OpenWrt, and there are many plugins you can use."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DefoliationM 既然是 quest3 ，肯定有电脑的吧，用电脑很方便。",
          "en": "@DefoliationM Since it's a Quest3, you must have a computer, and using a computer is very convenient."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "通过 VPN Host 使手机热点具备翻墙功能即可，具体是手机开启热点，设备 B 连接热点，此时 VPN Host 主界面第三行会多出一个选项，点击即可",
          "en": "You only need to enable the VPN function on the phone hotspot with VPN Host. Specifically, turn on the hotspot on the phone, connect device B to the hotspot, and then there will be an additional option on the third line of the VPN Host main interface, click it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DefoliationM 感谢老哥回复方法 123 我都已经知道并且尝试过确实是可以的。主要还是我主题里说的，就在想不安卓手机 A 不 root 有没有可能给安卓设备 B 激活…",
          "en": "@DefoliationM Thanks for the reply, I already know and have tried methods 123 and they do work. The main thing is what I said in my topic, I'm just wondering if it's possible to activate Android device B without rooting Android phone A..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ZeroYip 前提是手机本身挂着梯子",
          "en": "@ZeroYip The prerequisite is that the phone itself is using a VPN"
        }
      ],
      "type": "replies"
    }
  ]
}