{
  "id": 1014286,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "1000 块的闲钱，买什么东西好？",
          "en": "What's good to buy with 1000 yuan of spare money?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "a. 一副看电脑专用的防蓝光眼镜\r\nb. 一台显示器\r\nc. 人体工学鼠标\r\nd. 分体式人体工学键盘\r\n\r\na：我近视度数比较高，戴着眼镜看电脑很累，摘下眼镜能看书但看不清电脑，有度数低的旧眼镜但磨损得太严重已经不适合佩戴了，想再配一副低度数眼镜，既然是看电脑专用的话就选个好点的防蓝光镜片\r\nb：手上只有 16 寸的笔记本\r\nc 和 d 则是添头，手上已经有一套键鼠了，出于新鲜感想试试人体工学的有什么不一样\r\n\r\n如果不考虑便宜货和二手，以上四个最多买两个，想知道大家会怎么选择，或是有什么其他的选项",
          "en": "a. A pair of anti-blue light glasses specifically for computer use\r\nb. A monitor\r\nc. Ergonomic mouse\r\nd. Split ergonomic keyboard\r\n\r\na: My myopia is relatively high; it's tiring to look at the computer with glasses. I can read books without glasses, but I can't see the computer clearly. I have old glasses with lower diopters, but they are too worn to wear. I want to get another pair of low diopter glasses. Since they are specifically for computer use, I'll choose a better anti-blue light lens \r\nb: I only have a 16-inch laptop\r\nc and d are extras; I already have a set of keyboard and mouse. I want to try ergonomic ones out of curiosity and see what's different.\r\n\r\nIf we don't consider cheap and second-hand options, we can buy a maximum of two of the above four. I want to know how everyone will choose, or if there are any other options"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "买书 然后读完。",
          "en": "Buy books and then finish reading them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "转给我吧，买个教训",
          "en": "Transfer it to me; learn a lesson"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "显示器怎么买？ 1000 块没法不考虑便宜货和二手吧",
          "en": "How to buy a monitor? It's impossible not to consider cheap or second-hand options with 1000 yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买 A 股",
          "en": "Buy A shares"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "得看具体使用频率了，个人觉得防蓝光眼镜的效果不大，长时间伏案对眼睛的保护就是定时休息。剩下三项，如果使用频率相同，考虑舒适性肯定是换显示器最好。建议换个 27 寸的防蓝光 2K 或者 4K ，如果办公环境运行就换 32 寸 4K 。至于键盘和鼠标，异形键盘肯定是有用的，人体工学鼠标也肯定有效果，但这两个能起到的效果取决于你的使用频率，而且这两个更多的是提高效率，减轻手部负担。",
          "en": "It depends on the specific usage frequency. I personally think the effect of anti-blue light glasses isn't significant; protecting your eyes during long periods of desk work is about taking regular breaks. Of the remaining three items, if the usage frequency is the same, it's definitely best to replace the monitor considering comfort. I recommend replacing it with a 27-inch anti-blue light 2K or 4K monitor. If it's an office environment, then replace it with a 32-inch 4K monitor. As for keyboards and mice, an ergonomic keyboard is definitely useful. An ergonomic mouse also definitely has an effect, but the effect of these two depends on your usage frequency. Moreover, these two are more about improving efficiency and reducing the burden on your hands."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "防蓝光好像是智商税",
          "en": "Anti-blue light seems like a tax on intelligence"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "蓝光眼镜/蓝光显示屏, 不是智商税吗...",
          "en": "Are blue light glasses/blue light screens not a tax on intelligence..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买套路亚装备，再过两个月就能愉快的河边玩路亚了。路亚和程序员绝配：一个室内，一个室外一个坐着，一个站着一个晒不到太阳，一个需要买遮阳帽一个不怎么走动，一个需要到处走动买啥工程学鼠标键盘都不如买套路亚找个风景秀丽的河边，散散步，看看风景，甩甩杆子，钓钓鱼。",
          "en": "Buy a set of Luya equipment; in two months, you can happily play Luya by the river. Luya and programmers are a perfect match: one indoors, one outdoors; one sitting, one standing; one not exposed to the sun, one needing to buy a sun hat; one not moving much, one needing to walk around everywhere. Buying ergonomic mice and keyboards is not as good as buying a set of Luya and finding a scenic riverbank to stroll, enjoy the scenery, cast a rod, and fish."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买我一句忠告：什么钱都不是闲钱",
          "en": "Take my advice: no money is spare money"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SephirothD #65 不需要的，下次有配镜需要可以找我，蔡司按 1.60 报价的话最便宜的 A 系列大概 300 一副，顶级产品线智锐一副也不过 980 起而已。蔡司不值几个钱的，1.67 以内的片全都是国产，高折射率是印度或者德国随机。蔡司今年没听说有新品，倒是智锐亚洲版被改名成了智锐臻选版，而且取消了防卫版的镀膜（抗菌镀膜，疫情期间出的）。另外防蓝光除了新智锐的基材防蓝光以外，旧的镀膜防蓝光都是 + 20 块钱就有的，不值钱的玩意儿。真正有资格卖 6000+ 的是罗敦司得。",
          "en": "@SephirothD #65 No need. You can find me next time you need glasses. If Zeiss is quoted at 1.60, the cheapest A series is about 300 yuan a pair, and the top-of-the-line product line, SmartLife, is only 980 yuan and up. Zeiss isn't worth much; the lenses within 1.67 are all domestic, and the high refractive index is from India or Germany randomly. I haven't heard of any new Zeiss products this year, but the SmartLife Asian version has been renamed the SmartLife Selected Edition and the protective coating (antibacterial coating, released during the pandemic) of the Defense version has been removed. In addition to the base material anti-blue light of the new SmartLife, the old coating anti-blue light is only + 20 yuan and not worth much. The only one truly qualified to sell for 6000+ is Rodenstock."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "轨迹球鼠标，不打游戏的话十分推荐用起来非常舒服。价格很便宜，M575 ，自带蓝牙。200 多吧眼镜我之前看到徕卡镜片 1 折多，低度数配一副也不是很贵。分体式人体工学键盘，建议买个 3d 打印机，然后 DIY 就行了。JLCPCB 打 1x1 万能轴 5x5 拼版的，然后 3d 打印机打外壳（外壳也可以找淘宝打，尼龙更便宜），随便飞飞线焊一下就行了。主控用 nrf52840 的板子，仿 nice!nano 也才几十大洋，固件刷 zmk 。算上键帽，矮轴，一套下来 300 都不到。",
          "en": "Trackball mouse is highly recommended if you don't play games; it's very comfortable to use. The price is very cheap, M575, with built-in Bluetooth. The glasses were over 200. I previously saw Leica lenses at more than 10% off, so it's not very expensive to get a pair with low diopters. For a split ergonomic keyboard, I suggest buying a 3D printer and then DIY. JLCPCB makes a 1x1 universal axis 5x5 splicing board, and then a 3D printer prints the shell (the shell can also be made by Taobao, nylon is cheaper). Just fly wires and solder them. The main controller uses the nrf52840 board, which is similar to nice!nano and costs only a few dozen yuan; the firmware is flashed with zmk. Including keycaps and low-profile switches, a set costs less than 300 yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买 A 股",
          "en": "Buy A shares"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "a, b",
          "en": "a, b"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "然后你会发现 a 就变成了 一副看电脑专用的防蓝光近视眼镜",
          "en": "Then you will find that a becomes a pair of anti-blue light glasses specifically for computer use"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "各种单片机各买一个",
          "en": "Buy one of each kind of microcontroller"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "个人建议显示器1. 1000 块买不到好的防蓝光眼镜, 我刚配了副蔡司的镜片, 中档款, 38002. 显示器, 只有笔记本的情况下, 增加外接显示器简直是质的提升3. 鼠标键盘都啥实质提升, 我都有过, 最终还是回归了普通的机械键盘和雷蛇, 最实用",
          "en": "Personal suggestion: 1. You can't buy good anti-blue light glasses for 1000 yuan. I just got a pair of Zeiss lenses, mid-range, 3800 yuan. 2. Monitor, in the case of only a laptop, adding an external monitor is a qualitative improvement. 3. The mouse and keyboard don't have much substantial improvement, I've had them, and I finally went back to the ordinary mechanical keyboard and Razer, which is most practical."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要不买个太阳灯。。。舒服点。",
          "en": "Or buy a sun lamp... it's more comfortable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "c,d 如你所说是添头，所以就是 a,b 里面选，其中 b 显示器，是刚需且感知明显，然而 a 争议比较大，所以选 b",
          "en": "c, d as you said are extras, so you choose between a and b. Among them, b monitor is a necessity and the perception is obvious, while a is more controversial, so choose b."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "四个都不选.人体工学椅.人体工学电脑桌.",
          "en": "Don't choose any of the four. Ergonomic chair. Ergonomic computer desk."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "btc   扔掉私钥 10 年后再看",
          "en": "btc Throw away the private key and look again in 10 years"
        }
      ],
      "type": "replies"
    }
  ]
}