{
  "id": 1015320,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "如何防止国产软件在 explorer 里乱改？",
          "en": "How to prevent domestic software from messing around in explorer?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "每次用各种网盘和迅雷就要被恶心一遍，一开始用的虚拟机，但毕竟是下载东西，用虚拟机下载比较麻烦，vmware tools 也死活装不上。\r\n用沙盒也一样，不管设置到下载哪个盘里，都会进沙盒文件夹……\r\n也没有更好用的方法，只要它不在 C 盘拉屎我就随他了",
          "en": "Every time I use various cloud storage services and Xunlei, I get disgusted. I initially used virtual machines, but downloading things is cumbersome with VMs, and VMware Tools just won't install no matter what.\r\nIt's the same with sandboxes; no matter which drive I set the downloads to, they still go into the sandbox folder...\r\nThere's no better method, as long as it doesn't mess up my C drive, I'll let it be."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@1014982466 这些“绿色版”甚至有可能更危险，谁知道下载下来的东西有没有被“加料”。",
          "en": "@1014982466 These \"green versions\" could even be more dangerous; who knows if the downloaded files have been \"tampered with\"."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "wsl2 ，百度网盘跑在 wsl2 中。让它们运行在它们不太适应的环境里。",
          "en": "wsl2, run Baidu Netdisk in wsl2. Let them run in an environment they're not very suited to."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@asdgsdg98 虚拟机里的 win7 由于没有 sha1 的证书补丁，导致安装不上 vmware tools ，这个是安装的时候就有提示的。楼主应该没有留意这个问题。需要手工下载 kb4490628 和 kb4474419 ，放到虚拟机里安装。由于没有 vmware tools ，要装进去还有点麻烦，因为拖曳文件是不行的，可以考虑本地启一个简单的 http 服务（ win 下比较方便的就是 hfs ），然后用虚拟机里的浏览器下载安装它们，装完了 vmware tools 就可以正常安装了。",
          "en": "@asdgsdg98 Win7 in the virtual machine cannot install VMware Tools because it lacks the SHA1 certificate patch; this is prompted during installation. The author probably didn't notice this. You need to manually download kb4490628 and kb4474419 and install them in the virtual machine. Since there are no VMware Tools, installing them is a bit troublesome because dragging and dropping files doesn't work. You can consider starting a simple HTTP service locally (HFS is convenient under Windows), then use the browser in the virtual machine to download and install them. After installing VMware Tools, you can install them normally."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "指右键菜单?那个直接在注册表里删掉就行",
          "en": "Referring to the right-click menu? You can just delete that in the registry."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yyzh 还有在 explorer.exe 里挂两个百度的 dll ，没事就扫进程扫硬盘",
          "en": "@yyzh And also hooks two Baidu DLLs into explorer.exe, scanning processes and hard drives for no reason."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让虚拟机和宿主机共享一个专门用来下载文件的文件夹，让虚拟机就算拉屎也只能拉在这个文件夹里",
          "en": "Let the virtual machine and the host machine share a folder specifically for downloading files, so that even if the virtual machine does its thing, it can only do it in this folder."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DTCPSS 看来只有这个方法了，win7 不知道为什么 vmware tools 装不上，换 virtualbox 试试",
          "en": "@DTCPSS It seems this is the only method. I don't know why VMware Tools won't install on Win7, try VirtualBox."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dyv9 要用安卓模拟器，不能开 hyper-v……",
          "en": "@dyv9 You have to use an Android emulator, can't enable Hyper-V..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我的迅雷都是在 vmware 跑的真实机只留一个 115 ，99.9999%的时候都能解决问题，只有那些刚发布 1 天内的资源，115 没办法离线，才会开迅雷。",
          "en": "My Xunlei is all running in VMware. I only keep 115 on the real machine, which can solve the problem 99.9999% of the time. Only for resources released within 1 day that 115 can't offline, will I run Xunlei."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试试 windows sub-system for linux wsl2 ，给你一个跑在 windows 上的 linux ，很好用，默认没有自启动，需要手工明确配置才有服务启用。用默认配置正合意。",
          "en": "Try Windows Subsystem for Linux WSL2, which gives you a Linux running on Windows, very easy to use. It doesn't auto-start by default, requires manual configuration to enable services. The default configuration is perfect."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ahhui 是 sha2 补丁，说错名字了。",
          "en": "@ahhui It's the SHA2 patch, I got the name wrong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有群晖的话百度和迅雷可用套件解决，电脑上就不用装了",
          "en": "If you have a Synology NAS, you can use packages to solve it, no need to install them on the computer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ahhui 感谢，之前我是用第三方工具访问 vmdk 传文件的，特别麻烦，能装补丁打赏 VMware tools 就方便了",
          "en": "@ahhui Thanks, I was using a third-party tool to access vmdk to transfer files before, which was very troublesome. Installing the patch to get VMware Tools working would be convenient."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@monkey110 nas 版速度跑不满，尤其是百度网盘，不知道是不是做了手脚",
          "en": "@monkey110 The NAS version's speed isn't fully utilized, especially with Baidu Netdisk, I don't know if they've done something sneaky."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拉完屎用 Autoruns 擦下屁股",
          "en": "Wipe your butt with Autoruns after it's done."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试试 Sandboxie ？将下载目录设置为完全访问",
          "en": "Try Sandboxie? Set the download directory to full access."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "百度网盘不是可以用命令行版吗？→ https://github.com/qjfoidnh/BaiduPCS-Go/releases/tag/v3.9.5",
          "en": "Isn't there a command-line version for Baidu Netdisk? → https://github.com/qjfoidnh/BaiduPCS-Go/releases/tag/v3.9.5"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Sandboxie 可以设置仅下载目录直通，不用复制出来啊。虚拟机也是，可以共享一个目录供下载用",
          "en": "Sandboxie can be configured to directly access only the download directory, without copying it out. It's the same with virtual machines, you can share a directory for downloads."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Win7 Win2008 等 安装近两年的 VMTools 需要安装个系统补丁, 名称如下, 自己去下载吧windows6.1-kb4474419-v3-x64_b5614c6cea5cb4e198717789633dca16308ef79c",
          "en": "Win7, Win2008, etc., need to install a system patch for VMTools installed in the past two years. The name is as follows, download it yourself: windows6.1-kb4474419-v3-x64_b5614c6cea5cb4e198717789633dca16308ef79c"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "虚拟机和沙盒性能损失太大，拖慢主系统网盘和迅雷用绿色精简版不就好了吗？https://www.ghxi.com/https://www.423down.com/如果没有绿色版的话，用 Autoruns ，禁止它开机自启就好了",
          "en": "Virtual machines and sandboxes cause too much performance loss. Wouldn't it be better to use the green/simplified versions of cloud storage services and Xunlei, which won't drag down the main system? https://www.ghxi.com/https://www.423down.com/ If there is no green version, use Autoruns to disable its startup."
        }
      ],
      "type": "replies"
    }
  ]
}