{
  "id": 1016704,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "小外甥挑食严重怎么办",
          "en": "What to do if my nephew is a picky eater"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "快 7 岁了，上小学 1 年级，最近寒假在住在我家玩，我发现挑食严重（好多年就知道了只是一直没有改正），只喜欢吃汉堡、香肠、方便面。没有就基本不吃饭，宁愿自己饿着一两天都不带正经吃饭的（真饿了可能会吃一两口不喜欢的）就是不和大家一起吃正餐。感觉孩子已经养废了，V 友们有没有什么好建议。",
          "en": "He is almost 7 years old and in the first grade of elementary school. He's been staying at my house during the recent winter break, and I've discovered that he is a very picky eater (I've known this for many years but he hasn’t corrected it). He only likes to eat hamburgers, sausages, and instant noodles. If he doesn't have those, he basically won't eat, preferring to starve himself for a day or two without eating properly (he might eat a mouthful or two of something he doesn't like if he's really hungry). He just doesn't eat regular meals with everyone else. I feel like the child is ruined. Do any V friends have any good suggestions?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "只有小孩子挑食，没有大人挑食。因为大人只买自己喜欢吃的。",
          "en": "Only children are picky eaters, not adults. Because adults only buy what they like to eat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "狠心 + 耐心，切断所有零食来源，饿就饿几天，饿几天大白米饭都吃得喷香。但是我还是不建议管亲戚的孩子，到时候出事就是你的问题",
          "en": "Be ruthless + patient, cut off all sources of snacks, let him starve for a few days. After a few days of hunger, even plain white rice will taste delicious. But I still don't recommend taking care of your relatives' children, it will be your problem if something goes wrong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪有这种挑食的，会不会只是单纯嫌弃你家里烧菜不好吃？带出去下馆子他爱吃吗？",
          "en": "Who is such a picky eater? Could it just be that he simply dislikes the food cooked at your house? Does he like to eat when you take him out to restaurants?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "又不是你儿子。。。。然后你这个当舅舅的忍心让他饿几顿吗，就算忍心，你姐、姐夫、孩子他外公外婆不揍你吗？",
          "en": "He is not your son.... Then, as his uncle, can you bear to let him starve several meals? Even if you can, wouldn't your sister, brother-in-law, and the child's grandparents beat you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别管，别惹他，他万一去剪头发，你就危险了",
          "en": "Don't bother him, don't provoke him. It's dangerous if he goes to get a haircut."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "教孩子没有捷径, 只有狠心而且要有耐心, 根本不是一次两次能教好的, 要有长期的心理准备",
          "en": "There are no shortcuts to teaching children. You can only be ruthless and patient. It's not something that can be taught in one or two times and requires long-term mental preparation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "重随，或者，换金币吧。",
          "en": "Just follow him, or exchange for gold coins."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就是惯的 不吃正餐就别让他吃别的",
          "en": "He is just spoiled. If he doesn't eat regular meals, don't let him eat anything else."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "打一顿什么？不是你的？不能动？管你啥事",
          "en": "Beat him up? He isn't yours? You can't touch him? What does it have to do with you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "长大了自然就好了",
          "en": "He'll be fine when he grows up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "试试带出去吃中餐馆",
          "en": "Try taking him out to eat at a Chinese restaurant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很大原因是家里面做的东西不好吃，带他去外面好点的中餐馆多吃吃就习惯中餐了。",
          "en": "A big reason is that the food made at home is not tasty. Take him to a better Chinese restaurant and have him eat more, and he will get used to Chinese food."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从小惯的，6 岁以后会越来越不好管教。切断所有零食渠道，只给喝水和饭菜，其他啥都别给吃，包括水果。另外，我比较赞同一楼的，可能只是你家做饭不和他口味，可以带去饭店试试，看他吃不吃。",
          "en": "He's been spoiled since he was young, and it will become more and more difficult to discipline him after the age of 6. Cut off all snack channels, only give him water and meals, and don't give him anything else to eat, including fruit. In addition, I agree with the first comment, maybe it’s just that your cooking doesn’t suit his taste. You can take him to a restaurant and see if he eats there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "目前的条件挑食又能咋地，需要哪个营养现有的食物不能代替吗？又不是大清的时候冬天只有白菜萝卜",
          "en": "Under current conditions, what's the big deal about being a picky eater? Does he need any nutrients that cannot be provided by existing foods? It's not like it was the Qing Dynasty, when there was only cabbage and radish in winter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是挑食，是大人的造成的。",
          "en": "It's not picky eating; it's caused by adults."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以前我也挑食，喜欢吃方便面，但我只在我妈在家的情况下挑食。因为我不吃饭说要吃别的，我爸会立马将我的饭收走，但我妈会给我下方便面。试过有一次我妈旅游了一个礼拜，我挑食的毛病就好不少了。",
          "en": "I used to be a picky eater too, and I liked instant noodles, but I was only picky when my mother was at home. Because if I didn't eat and asked for something else, my dad would immediately take away my meal, but my mom would make me instant noodles. Once, my mom went on a trip for a week, and my picky eating habits improved quite a bit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很大一部分原因是家长宠溺的",
          "en": "A big part of the reason is parental pampering."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Pernalin 春节期间去西安旅游，在外面天天下馆子也是不咋吃，光想着吃肯德基",
          "en": "@Pernalin During the Spring Festival, I traveled to Xi'an, and he didn't eat much even when eating out at restaurants every day. He only wanted to eat KFC."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我倒是不会去管反而还单独给他下泡面，当妈的都不管我肯定是不会多管的",
          "en": "I wouldn't bother to manage, and I would even make him instant noodles separately. Since his mother doesn't care, I certainly won't interfere."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看标题我还以为是小孩子，都七岁了，难道娃没上过幼儿园？上幼儿园天天肯德基？这不就是单纯惯的吗？所有不吃饭的臭毛病没有饿一顿不能解决的，最多饿两顿，吃啥都香。",
          "en": "I thought he was a toddler from the title. He is already seven years old. Hasn't he gone to kindergarten? Does he eat KFC every day in kindergarten? Isn't this simply spoiled? There is no bad habit of not eating that cannot be solved by starving him for a meal. Two meals at most, and everything will taste good."
        }
      ],
      "type": "replies"
    }
  ]
}