{
  "id": 1015488,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "考研真的要买各种资料吗",
          "en": "Do you really need to buy all kinds of materials for the postgraduate entrance exam?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "很怪异，想考研，但是搜索资料全是各种什么老师推荐教辅啥的，然后知乎上全是那种，xxx 政治 xx 分带你考研之类的，有无老哥科普一下",
          "en": "It's weird. I want to take the postgraduate entrance exam, but when I search for materials, it's all recommendations for teaching materials from various teachers. Then, on Zhihu, there's all that stuff like, “xxx Political Science xx points takes you to the postgraduate entrance exam.” Any brothers here to give me some insights?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "数学 就李永乐+王式安+李林最后押题的卷子。",
          "en": "For math, just Li Yongle + Wang Shian + the final exam papers from Li Lin's predictions."
        },
        {
          "zh": "安安分分的买相关的资料 660 330 线代等。",
          "en": "Buy the related materials 660, 330, Linear Algebra, etc. honestly."
        },
        {
          "zh": "真不推荐另外两家的数学。",
          "en": "I really don't recommend the math from the other two."
        },
        {
          "zh": "英语忘了，反正得背单词+刷真题。",
          "en": "I forgot about English, but you definitely need to memorize vocabulary + do practice questions."
        },
        {
          "zh": "政治徐涛的课+在风中劲草记笔记+肖秀荣押题。",
          "en": "For politics, Xu Tao's lectures + taking notes on “Jingcao Zai Fengzhong” + Xiao Xiurong's predictions."
        },
        {
          "zh": "     都搭配相关的百度网盘网课",
          "en": "All paired with related Baidu Netdisk online courses"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@okura 别的乱七八糟的不用买，什么英语短句速记，数学公式，偏题难题。",
          "en": "@okura Don't buy anything else that's messy, like quick memorization of English sentences, math formulas, or difficult and obscure problems."
        },
        {
          "zh": "就买你跟的老师他讲的讲义和他出的练习册就行",
          "en": "Just buy the lecture notes that the teacher you are following gives and the exercise books he publishes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果有人不需要资料就能考上，那他就是保研的",
          "en": "If someone can pass the exam without needing materials, then they are recommended for the postgraduate program."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你跟哪个老师，把专业课用的书还有英语数学要用的给买了，然后找网盘视频课",
          "en": "See which teacher you are following, buy the books used for your major courses, as well as the ones needed for English and math, and then look for video courses on the internet."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我去年考研的时候，数学看的李永乐的线代加上配套的题，高数看的武忠祥也买了配套的学习资料和题；英语的话没看课就是闷头刷真题加每天背单词，考前一个月看了几节石雷鹏的作文课背了几篇模板；政治就没学过，最后一个月刷肖秀荣的那几套题，然后看错题解析。",
          "en": "When I took the postgraduate entrance exam last year, I used Li Yongle's Linear Algebra with the accompanying exercises for math, and for calculus I used Wu Zhongxiang and also bought his accompanying study materials and exercises; for English, I didn't take any courses, just focused on doing practice questions and memorizing words every day. In the month before the exam, I watched a few lessons on essay writing by Shi Leipeng and memorized some templates; I didn't study politics, and in the last month I just did Xiao Xiurong's exam papers and then looked at the error analysis."
        },
        {
          "zh": "我觉得报班没必要但买点资料还是可以的。",
          "en": "I don't think it's necessary to take classes, but buying some materials is still possible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@okura 高数有武忠祥、李永乐和张宇老师等，比如跟武老师学高数，跟李永乐学现代，就买武的高数讲义、李的线代讲义+660 题（两位老师一起出的），跟张宇老师学高数+线代就买他的 18 讲+1000 题。",
          "en": "@okura For calculus, there are teachers like Wu Zhongxiang, Li Yongle, and Zhang Yu. For example, if you study calculus with Teacher Wu and linear algebra with Li Yongle, then buy Wu's calculus lecture notes, Li's linear algebra lecture notes + the 660 questions (published together by the two teachers). If you study calculus + linear algebra with Teacher Zhang Yu, then buy his 18 lectures + 1000 questions."
        },
        {
          "zh": "后面强化阶段还有别的书，基本上在一个系列捆绑起来是能找得到的",
          "en": "There are other books in the later intensive stage; they can basically be found bundled together in a series."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@okura 然后专业课那些就找往届学长学姐要资料，部分辅导机构能买到想报考学校历年的真题，可以去某些二手平台和论坛逛一逛，同院校同专业报考群基本上不会分享，还是别费这个时间加群去问。",
          "en": "@okura Then, for the professional courses, look for materials from senior students from previous years. Some tutoring institutions can sell you past exam questions from the school you want to apply to. You can browse some second-hand platforms and forums. Groups for applicants from the same school and major generally don't share, so don't waste your time joining those groups to ask."
        },
        {
          "zh": "别的备考细节就不赘述了，比如数英政专分配时间，什么时间段干什么，相信你能处理好",
          "en": "I won't go into detail about other preparation details, such as allocating time for math, English, politics, and your major, or what to do at what time. I believe you can handle it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "和高考一样，高考不也做五三吗，也有各种教辅，这只能对高频，热点题目和新增考点进行突击。",
          "en": "It's like the Gaokao (National College Entrance Examination), don't you do “Wu San” (a popular study guide)? There are also various teaching materials, which can only be used to attack high-frequency, hot topics, and new exam points."
        },
        {
          "zh": "并不能解决你因为基础知识薄弱导致的扣分。",
          "en": "They can't solve the deduction of points caused by your weak basic knowledge."
        },
        {
          "zh": "考试很多时候以书为准，我有个表哥在 985 做博导，他之前帮我复习的时候就是把书上他觉得重要的知识点一个一个让我背诵/默写/推导公式。",
          "en": "Exams often rely on the textbooks. I have a cousin who is a doctoral supervisor at a 985 university (top tier university in China). When he helped me review before, he had me recite/dictate/derive formulas for the important knowledge points he thought were important in the books."
        },
        {
          "zh": "虽然我个人不喜欢这样做，但是这样非常有效。",
          "en": "Although I personally don't like doing that, it is very effective."
        },
        {
          "zh": "教辅更多是帮你活泛思路，增加解题技巧。",
          "en": "The teaching materials are more to help you broaden your thinking and increase your problem-solving skills."
        },
        {
          "zh": "总结1. 多看教材，掌握基础知识点2. 买主流教辅，熟练解题3. 视个人能力，报班，或者一对一我还知道很多女同学找学霸工具人“谈恋爱”考研的，当然也不失为一种方法。",
          "en": "Summary: 1. Read the textbooks more and master the basic knowledge points. 2. Buy mainstream teaching materials and become proficient in solving problems. 3. Depending on your personal ability, take classes or consider one-on-one tutoring. I also know that many female students find “tool man” academic masters to “date” for the postgraduate entrance exam; of course, this is also a method."
        },
        {
          "zh": "不过需要你道德水平低下。",
          "en": "However, it requires a low level of morality."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上面的兄弟说的没错，考研是信息战，如果你所有的科目都是公开的统考，那其实无所谓的，主流的课程和书就可以了。",
          "en": "What the brother above said is right. The postgraduate entrance exam is an information war. If all your subjects are open, unified exams, then it doesn't really matter, the mainstream courses and books are enough."
        },
        {
          "zh": "如果是专业课自主命题，还是需要多加注意，尽量多搜集一些资料，比如：该校的教材，期末考试卷，以往的真题，考上的人，以及他们帮忙画的重点，等等等，都非常重要。",
          "en": "If the professional courses are independently set, you still need to pay more attention and try to collect more information, such as: the textbooks of the school, the final exam papers, previous real exam questions, people who have passed the exam, and the key points they have helped to mark, etc. are all very important."
        },
        {
          "zh": "比如数据结构，有的比较难的数据结构，比如图那块，有的学校可能会考大题，有的喜欢考选择题，那这两种难度就差远了，准备的策略也完全不一样。",
          "en": "For example, in data structures, some are more difficult, such as graphs. Some schools may test long answer questions, and some like multiple-choice questions, which is a big difference in difficulty, and the preparation strategies are completely different."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不需要一个百度网盘就够考研了(逃dddd",
          "en": "You only need a Baidu Netdisk to pass the postgraduate entrance exam (escape dddd"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wcnmm 我的意思是那种参考书",
          "en": "@wcnmm I mean those reference books."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wcnmm 我跟的老师的意思是我想考研的学校的科目的教材之类的吗？",
          "en": "@wcnmm Does the teacher I'm following mean the textbooks for the subjects of the school I want to apply to for the postgraduate entrance exam?"
        },
        {
          "zh": "但是英语政治数学不是都说是全国统一出卷的吗？",
          "en": "But aren't English, politics, and math supposed to be nationally unified exams?"
        },
        {
          "zh": "求大佬指点",
          "en": "Please give me some guidance, senior."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "考研是个情报战，你掌握情报（信息）优势，你就能考上。",
          "en": "The postgraduate entrance exam is an intelligence war. If you master the intelligence (information) advantage, you can pass the exam."
        },
        {
          "zh": "如果你不知道怎么获取情报，就花钱",
          "en": "If you don't know how to get intelligence, spend money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "知乎上的别信，妈个鸡到处都是广告。",
          "en": "Don't trust Zhihu, it's full of ads."
        },
        {
          "zh": "买主流的课程就行",
          "en": "Just buy the mainstream courses."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "研究生毕业了工作更难找了",
          "en": "It's harder to find a job after graduating from a postgraduate program."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mason1984 谁给你这个幻觉的？",
          "en": "@mason1984 Who gave you this illusion?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "专业课可花点钱。",
          "en": "You can spend some money on professional courses."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当时买了小上千的书，基本都没写完...",
          "en": "I bought over a thousand books at the time, and basically, I didn't finish writing them..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "研究生毕业后，可能本科就业的同学就是你的 mentor",
          "en": "After graduating from a postgraduate program, classmates who found jobs in their undergraduate studies may become your mentors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "来，跟我唱世界自有公道，付出总有回报明白了吧，我花钱了我付出了，总得有点回报对吧",
          "en": "Come on, sing with me, the world has its own justice, there is always a return for the effort, understand, right? I spent money, and I put in effort, so I have to get something back, right?"
        }
      ],
      "type": "replies"
    }
  ]
}