{
  "id": 1017032,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "等等党哭死,固态 ssd 又涨价了=、=",
          "en": "The waiting party is crying, solid state SSDs have gone up in price again =、="
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "刚才看了一眼，基本上全部都涨了 300..4t 的爱国者 P7000Z 现在已经 1700 多了\r\n前天我看还是 1400 多 而最早的时候是 1000 左右 =。= 那时候我没买，只买了一根 2T 的 540..\r\n后面就一直等着降..估计降不下来了",
          "en": "I just took a look, and basically everything has gone up 300..4t Patriot P7000Z is now over 1700\r\nI saw it was still over 1400 the day before yesterday, and it was around 1000 at the earliest =。= I didn't buy it then, I only bought a 2T 540..\r\nI've been waiting for it to go down.. I don't think it will go down"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "咋回事，不是国产把价格打下来了吗？",
          "en": "What's going on, didn't domestic products bring the price down?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ysc3839 这句话我看几遍没看懂",
          "en": "@ysc3839 I don't understand this sentence after reading it several times"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "国产会越来越贵@Fish1024",
          "en": "Domestic products will become more and more expensive @Fish1024"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么会事呢",
          "en": "What happened"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ssd 价格低谷距离现在有大半年了吧. 这都没买说明没有需求那你关心它降不降干嘛呢.",
          "en": "The low price of SSDs is more than half a year away from now. If you haven't bought one, it means you don't need it, so why do you care if it goes down or not."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "继续等啊，我就不信 2030 年的 1TB 能比 2024 年的 1TB 贵（排除通胀）。等等党永不为奴",
          "en": "Keep waiting, I don't believe that 1TB in 2030 will be more expensive than 1TB in 2024 (excluding inflation). The waiting party will never be slaves"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@innocent245 #16 市场拓展时期，企业通过补贴或者低价促销的形势抢占市场（三星带头的，闪存供应价格特别低），等到市场饱和之后，购买需求下降（说人话就是想买的该买的都买的差不多了，剩下的等等党都是铁公鸡，数量也是最小的那一批了），企业继续用低价策略收益变少甚至亏损，所以放开调控策略迎来涨价。",
          "en": "@innocent245 #16 During the market expansion period, companies grab market share through subsidies or low-price promotions (led by Samsung, the flash memory supply price is particularly low). After the market is saturated, the purchasing demand decreases (in other words, those who want to buy have basically bought what they want, and the remaining waiting party are all stingy, and the number is also the smallest batch). If companies continue to use low-price strategies their profits decrease or even incur losses, so the relaxation of the regulation strategy leads to price increases."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "打个比喻，你长江存储就一小摊位卖菜的，菜地产量有限，我整个市场的摊位集体涨价，你小小长江不涨价，就得面临菜被分分钟清完，后面菜地供不上，你可知道，买长江摊位的可不一定是普通家庭主妇，别的摊位老板也可过来清你的库存呢。",
          "en": "To give an analogy, you're Yangtze Memory, a small stall selling vegetables, and the vegetable production is limited. If all the stalls in the entire market raise prices, you, the small Yangtze, don't raise prices, you will have to face your vegetables being sold out in minutes. Later, the vegetable fields can't keep up with the supply, and you know, the customers who buy from the Yangtze stall are not necessarily ordinary housewives, the other stall owners can also come over to clear your inventory."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "预测还会继续涨 要买趁早",
          "en": "It is predicted that it will continue to rise. Buy it as soon as possible"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "呜呜呜，我想买个 2t 的 sata 盘，也涨了",
          "en": "Wuwuwu, I want to buy a 2t SATA drive, and the price has also gone up"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那就再等等，等的还不够",
          "en": "Then wait a little longer, you haven't waited enough"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这价格简直了，刚准备买个 2T 的 NVme ，上游厂商搞的太难看了。",
          "en": "This price is just ridiculous, I was just about to buy a 2T NVMe, the upstream manufacturers are making it too ugly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Fish1024 打下来了，市场饱和了，需求减少了，那价格就上涨了",
          "en": "@Fish1024 The price has been brought down, the market is saturated, and the demand has decreased, so the price goes up"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "据说内存也要涨了",
          "en": "It is said that the price of memory will also go up"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "新能源车是不是也是这个规律呢",
          "en": "Is this also the pattern for new energy vehicles?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还好我屯了，至今都没有开封。",
          "en": "Fortunately, I hoarded some, and they haven't been opened yet."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Fish1024  现在相比我几年前买的可便宜太多了。几年前 1 元 1G 都感觉不可思议。",
          "en": "@Fish1024 It's much cheaper now than what I bought a few years ago. A few years ago, 1 yuan per 1G felt incredible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我 10 分钟前刚挂掉一个 4t 的爱国者 P7000Z ，然后看到你这个帖子稍微有点欣慰",
          "en": "I just killed a 4t Patriot P7000Z 10 minutes ago, and then I saw this post and felt a little comforted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "便宜的时候还说要出 1899 的 16T SATA 固态，那时候还好多人畅想完全取代 HDD 设计全 SSD NAS",
          "en": "When it was cheap, they also said they would release a 16T SATA SSD for 1899, and at that time many people envisioned completely replacing HDD and designing a full SSD NAS"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看了一下订单记录，去年年中 458 买的 2T 的 P7000Z ，点进去看现在要 929 ，涨的确实厉害",
          "en": "I looked at the order records, and I bought a 2T P7000Z for 458 in the middle of last year. When I clicked in to see, it's now 929, the price increase is really significant"
        }
      ],
      "type": "replies"
    }
  ]
}