{
  "id": 1016551,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "求建议，留深圳 or 回成都 or 去上海？",
          "en": "Seeking suggestions: stay in Shenzhen, return to Chengdu, or go to Shanghai?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "各位好，平时我也就在这儿潜潜水，上次发帖也是 19 年跳槽抉择=。=\r\n\r\n一句话描述：\r\n92 年大龄单身码农，选择留深圳继续卷大厂当大头兵，还是回有房子的成都相亲结婚，还是去上海关系不错的亲戚家的公司做技术管理？\r\n\r\n本硕 985 毕业快 7 年了，在成都工作 3 年去了深圳，现在快 4 年，一直在大厂当开发大头兵，方向也从存储转成了服务器后台。\r\n\r\n随着变成大龄，也在着急成家。去年高强度相亲一年也没有合适的，没找到留在深圳的理由，就在琢磨 24 年年后回成都，毕竟那边有房子\r\n\r\n然后我姨夫的公司在上海刚上市，想要找个信得过的人帮他，问我要不要过去。技术方向也会再次换，说是熟悉业务后安排管理岗。刚去待遇和现在持平。可以一年后落户\r\n\r\n几个选择的优缺点：\r\n\r\n- 留深圳，优点：气候挺好，工作选择多。缺点：完全靠自己，房价高\r\n\r\n- 回成都，优点：安逸，有房，熟悉，同学朋友多。缺点：工作选择相对少\r\n\r\n- 去上海，优点：一些未知的发展前景，抱大腿。缺点：比深圳还难的生活环境；技术方向再次更换\r\n\r\n哎，深刻理解了老祖宗的话，人无远虑必有近忧。\r\n\r\n我可能就像大部分人一样，是个比较好谋无断的人，也没有特别喜好的技术方向。渴求着幸福快乐的日常生活，做着被安排的工作，凭借还算不错的能力，有条不紊的耕耘，希望有一天出人头地。不过说实在的，我已经发现没有强烈的目标的话，又没有机遇的话，这很难很难。",
          "en": "Hello everyone, I usually just lurk here. The last time I posted was in 2019 to decide on a job change.\r\n\r\nOne sentence description:\r\n92-born, single, and a senior coder. Should I choose to stay in Shenzhen and continue working at a big tech company as a regular employee, return to Chengdu (where I have a house) to find a partner and get married, or go to Shanghai to work in a good relative's company in a technical management role?\r\n\r\nI graduated from a 985 university (bachelor's and master's degrees) almost 7 years ago. I worked in Chengdu for 3 years before going to Shenzhen, where I've been for almost 4 years. I've always been a regular developer at a big tech company, and my focus has shifted from storage to server backend.\r\n\r\nAs I get older, I'm also anxious about starting a family. Last year, I went on many dates for a whole year, but I didn't find anyone suitable. I couldn't find a reason to stay in Shenzhen, so I'm considering going back to Chengdu after 2024, since I have a house there.\r\n\r\nThen, my uncle's company in Shanghai has just gone public. He wants to find someone trustworthy to help him and asked me if I wanted to go. The technical direction will change again, and he said that after I'm familiar with the business, I'll be assigned to a management position. The initial salary is the same as what I'm making now. I can apply for permanent residency after a year.\r\n\r\nAdvantages and disadvantages of a few choices:\r\n\r\n- Stay in Shenzhen: Advantages: The climate is good, and there are many job opportunities. Disadvantages: You're completely on your own, and the housing prices are high.\r\n\r\n- Return to Chengdu: Advantages: Comfortable, have a house, familiar, and many classmates and friends. Disadvantages: Relatively few job opportunities.\r\n\r\n- Go to Shanghai: Advantages: Some unknown development prospects, rely on connections. Disadvantages: The living environment is even more difficult than in Shenzhen; the technical direction changes again.\r\n\r\nAlas, I deeply understand the ancient saying: a person without long-term plans must have immediate worries.\r\n\r\nI'm probably like most people, a person who is good at planning but indecisive, and I don't have a particular preferred technical area. I crave a happy, joyful daily life, doing the work I'm assigned to do and, with my decent abilities, working methodically, hoping to succeed one day. But frankly, I've found that if you don't have strong goals and opportunities, it's very, very difficult."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "为啥我感觉这个问题之前看到过，所以 Google 了一波https://imgur.com/rtTy0QU",
          "en": "Why do I feel like I've seen this question before, so I Googled it: https://imgur.com/rtTy0QU"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去上海的话，到时候 @我一下，抱你大腿",
          "en": "If you go to Shanghai, @ me, I'll be leeching off you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "亲戚没啥人品大问题的话，就去上海，你当一辈子大头兵 ，苦干 30 年，没碰上风口公司大规模扩张，晋升就算你在公司干到死 很多时候都轮不上你，辛苦耕耘 都远不如你亲戚一句话提拔的话 - 重要大部分公司 埋头苦干，辛苦耕耘没有任何用，公司分配的方式是金字塔模型，底层零件的可替换性很高，中高层替换性其实也很高，不轻易替换中高层的原因是信任成本太高，也因为其责任承担的大，而不是其工作岗位技能的可替换性，如果假设每个人都是可信的，信任成本近乎 0 ，其实公司里面的 CTO 跟技术经理的工作岗位技能可替换性远高于公司里面的普通码农，决定你收入的因素，从来都不是你干什么，重点是你站在这个金字塔模型哪一层，而决定你站在哪一层的因素重点大多时候不是你贡献了多少，重点你是抱了谁的大腿政治的根本是利益分配，有人的地方就会有江湖，有江湖的地方就会有政治，在公司里面辛苦耕耘，有条不紊的发展，几乎就是做梦，到死都摆脱不了 辛苦打工的命运",
          "en": "If your relative doesn't have any major character flaws, then go to Shanghai. If you work as a regular employee for your whole life and work hard for 30 years, and you don't happen to be in a company that is expanding rapidly, you might not get promoted even if you work until you die. Your hard work is far less important than a promotion from your relative. - Most importantly, in most companies, working hard and diligently is useless. The company's distribution model is a pyramid. The bottom-level components are highly replaceable, and the middle and upper levels are also replaceable. The reason why middle and upper levels are not easily replaced is mainly due to the high cost of trust, and also because of their large responsibilities, rather than the replaceability of their job skills. If we assume that everyone is trustworthy, the cost of trust is almost zero. In fact, the job skills of a CTO and a technical manager in a company are far more replaceable than those of an ordinary coder. The factors that determine your income are never what you do, but the level of the pyramid you are on. The key factor that determines your position is not how much you contribute, but who you're connected with. The essence of politics is the distribution of interests, and where there are people, there is politics. In the company, working hard and developing methodically is almost a dream. You can't escape the fate of working hard until you die."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主已经赢了很多人",
          "en": "The author has already won against many people"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得可以直接摒弃一个错误答案：深圳。工作多年，我感觉，职场上，最重要的是谋求晋升。晋升后，你保持自我修炼想放下身段，下来当员工还是容易的，但是员工想晋升很难。经济不景气，也可以追求人生幸福，难道都等 50-60 岁赚够钱了才享受生活？提前享受不香么？所以，成都也是很好的选择，躺平了也不错，不是非要奋斗上进什么的，也未必就能有所成就。",
          "en": "I think we can directly discard one wrong answer: Shenzhen. After working for many years, I feel that the most important thing in the workplace is to seek promotion. After promotion, it's easy to come down and be an employee if you want to maintain self-cultivation, but it's difficult for an employee to get promoted. Even if the economy is not good, you can still pursue happiness in life. Do you have to wait until you're 50-60 years old to enjoy life after you've earned enough money? Wouldn't it be nice to enjoy it in advance? Therefore, Chengdu is also a good option. It's also good to “lie flat”, and you don't necessarily have to strive to be ambitious, and you may not achieve anything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想拼一把就深圳，反正迟早回成都不如多在高薪城市打拼几年。给亲戚打工很难说的，建议慎重，除非知根知底，家里人也信得过",
          "en": "If you want to give it a shot, go to Shenzhen. Anyway, it's better to work in a high-paying city for a few more years before returning to Chengdu. Working for relatives is hard to say; I suggest you be cautious unless you know them well and can trust your family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去上海",
          "en": "Go to Shanghai"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去上海啊，上市企业还是很稳的吧，技术学就是了，主要是你是皇亲国戚，没准单位里哪个单身妹子就看上你了。就当旅游，一年后不行就回成都结婚。你如果先回成都，怕是以后大龄，就再没机会去沿海城市了。",
          "en": "Go to Shanghai, a listed company is quite stable, right? Just learn the technology. The main thing is you're a royal relative, and maybe some single girl in the company will take a liking to you. Treat it as a trip, and if it doesn't work out after a year, go back to Chengdu and get married. If you go back to Chengdu first, you might not have the chance to go to coastal cities later because of your age."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我感觉去上海比较好，技术不可能是一直不变的，你现在做服务器后台大头兵不可能一辈子的，在上海做一次上市公司的技术管理，方便为后续回老家做铺垫。",
          "en": "I feel that going to Shanghai is better; technology will never stay the same. You can't be a server backend regular employee for your whole life. Being a technical manager at a listed company in Shanghai will make it easier to set the stage for a return home later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "来上海了艾特我，让我抱你大腿",
          "en": "Ping me when you come to Shanghai, let me cling to you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也要抱大腿",
          "en": "I also want to latch onto you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给你介绍深圳的",
          "en": "I'll introduce you to people in Shenzhen."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去上海",
          "en": "Go to Shanghai"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上海，成都深圳什么时候都能去",
          "en": "Shanghai, Chengdu, and Shenzhen you can go anytime"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 如果你一年高强度相亲是在深圳的话，首先排除深圳。那边的女孩可能跟你不适合。2. 上海的话，看你姨父人怎么样，亲戚搭伙工作还是挺看双方能不能磨合的来的。3. 回成都不错，人脉关系都在那里，你的问题只是工作选择少，但是有找到合适的可以回去。不过成都你没去相亲过么？",
          "en": "1. If you've been on many dates for a year in Shenzhen, then first, rule out Shenzhen. The girls there might not be suitable for you. 2. As for Shanghai, see what kind of person your uncle is. Working together with relatives depends on whether you can get along. 3. Going back to Chengdu is not bad; your contacts are there. Your only problem is that there are fewer job choices, but you can go back if you find a suitable one. But haven't you gone on dates in Chengdu?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果是我那我会找到工作回成都，朋友回去一年还没找到工作",
          "en": "If it were me, I would find a job and return to Chengdu. A friend who went back hasn't found a job after a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也是个上海退役的选手，一线不是人干的，现在来二线发展了，再失业就转行当蓝领去了。互联网在中国的环境真的恶心",
          "en": "I am also a retired player from Shanghai. First-tier cities are not places for humans. I am now developing in a second-tier city. If I lose my job again, I will change careers and become a blue-collar worker. The environment of the internet in China is really disgusting."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大厂有没有拼出什么来？出来其他公司还能拼的更好吗？这不是妥妥的有个最优选项：上海",
          "en": "Have you achieved anything in the big tech company? Can you do better in other companies now? Isn't there a clear optimal option: Shanghai?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去上海，都有姨父在了，前提是清楚姨父的人品。",
          "en": "Go to Shanghai. You have your uncle there, provided you know your uncle's character."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去上海的话，到时候 @我一下，抱你大腿",
          "en": "If you go to Shanghai, then @ me, I'll be leeching off you."
        }
      ],
      "type": "replies"
    }
  ]
}