{
  "id": 1013291,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "相亲对象，邀请去她家玩该准备些什么？",
          "en": "What should I prepare when a dating partner invites me to their house?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "如图：\r\n[Imgur]( https://i.imgur.com/um24pCt.png)\r\n\r\n  老家介绍的相亲对象，先加的微信 聊了 3 4 天了吧，本来想着也就回家的时候，一起出去玩玩，先了解一下。这直接邀请我去她玩了，那么问题来了，第一次去准备些什么？注意些啥？",
          "en": "As shown:\r\n[Imgur]( https://i.imgur.com/um24pCt.png)\r\n\r\nA dating partner introduced by family, we've been friends on WeChat for 3 or 4 days. I was originally thinking of just hanging out when I went home to get to know her. She directly invited me to her place, so the question is, what should I prepare for the first visit? What should I pay attention to?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "durex",
          "en": "durex"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "家人们，谁懂啊，我客套一下，他真来我家吃饭啊。",
          "en": "Family, who understands? I was just being polite, and he's really coming to my house for dinner."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "冈本 001",
          "en": "Okamoto 001"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@qzh993 https://bbs.hupu.com/624408357.html",
          "en": "@qzh993 https://bbs.hupu.com/624408357.html"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "带点草莓、车厘子啥的",
          "en": "Bring some strawberries, cherries, and the like."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "会后空翻的猫",
          "en": "A cat that can do a backflip"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "穿喜庆的衣服和茶,中华例如: 旺仔红色衣服, 大瓶冰红茶,大瓶绿茶, 旺旺大礼包,再拿上两个中华牙膏",
          "en": "Wear festive clothes and bring tea, for example: red Wangzai clothes, a large bottle of iced black tea, a large bottle of green tea, a Wangwang gift pack, and two tubes of Zhonghua toothpaste."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微信聊了 3 4 天的相亲对象，没见过面，说句不好听的，你们连朋友都不是。又不是确定关系了上女方家见家长，还带啥烟酒保健品。你带个零食礼盒给她父母，带一捧花就足够了。聊得好年后再带着好东西过来拜年，搞清楚哪些是给她父母的，哪些是给她的，父母和她你都得搞定才能成。",
          "en": "You've been chatting on WeChat with a dating partner for 3 or 4 days and haven't met. Frankly, you're not even friends. It's not like you've confirmed the relationship and are going to meet the parents. Why bring cigarettes, alcohol, and health products? Bring a gift box of snacks for her parents and a bouquet of flowers, that's enough. If you are doing well, bring good things to visit during Chinese New Year. Figure out what's for her parents and what's for her. You have to win over both the parents and her to succeed."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意安全，不要上头，不要强求，最好不要那啥",
          "en": "Be safe, don't get carried away, don't force things, and it's best not to do that."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "虎扑三件套  可乐雪碧芬达",
          "en": "Hupu three-piece set: Coca-Cola, Sprite, Fanta"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "男孩子在外面注意保护好自己",
          "en": "Boys, pay attention to protecting yourselves when you're out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jgh004 你能忍住？反正我是忍不住",
          "en": "@jgh004 Can you hold back? I can't anyway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "榴莲，你别管她吃不吃，也别管以后会不会在一块。至少能保证以后看到这玩意就能想起你",
          "en": "Durian, never mind if she eats it or not, and never mind if you'll be together in the future. At least it can ensure that she will think of you when she sees this thing in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你是湖北的吗",
          "en": "Are you from Hubei?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我擦，这么直接嘛，lz 是彦祖么?",
          "en": "Wow, so direct? Is the author Yan Zu?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能这么快就邀请你去家里说明你有戏呀，建议加速直接去她家里拿下。",
          "en": "To be invited to her house so quickly shows you have a chance. I suggest speeding up and directly take her down at her home."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去她父母家，还是去她自己住的家，要搞清楚",
          "en": "You need to clarify, are you going to her parents' house, or the house where she lives?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你都敢去蹭饭了，真社牛",
          "en": "You dared to freeload a meal, you're really a social butterfly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意安全",
          "en": "Be safe"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "带个 switch 吧，怕没的聊尴尬",
          "en": "Bring a Switch, in case you run out of things to talk about and feel awkward."
        }
      ],
      "type": "replies"
    }
  ]
}