{
  "id": 1017815,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "也许是樊胜美",
          "en": "Maybe it's Fan Shengmei"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我爹真是个奇葩，从我 2016 年毕业开始一直到 2021 年左右，断断续续和我要钱，我之前有算了一下，加一起 30w 了。",
          "en": "My dad is really a weirdo. From when I graduated in 2016 until around 2021, he kept asking me for money intermittently. I calculated it before, and it adds up to 300,000 yuan."
        },
        {
          "zh": "而且刚毕业的时候，我工资只有 5k ，那个时候还要还培训班的钱。<br/>\r\n\r\n一直到 2021 年了，我实在是发毛了，每次一发工资就和我要钱，几年下来我卡里面最高存款都没有超过 3w 。",
          "en": "Moreover, when I first graduated, my salary was only 5,000 yuan, and I had to pay back the training course fees at that time.\n\nBy 2021, I was really getting annoyed. Every time I got paid, he would ask me for money. Over the years, the highest savings in my card never exceeded 30,000 yuan."
        },
        {
          "zh": "要钱的理由奇奇怪怪的，最后一次和我要钱，我一次性给了他 10w ，我说再和我要钱，我就没有了，只能去卖肾卖血了，后来说不要了。",
          "en": "The reasons for asking for money were strange. The last time he asked me for money, I gave him 100,000 yuan at once. I said that if he asked me for money again, I would have nothing left and would have to sell my kidneys and blood. Later, he said he didn't want it."
        },
        {
          "zh": "结果过了半个月，又 tm 和我要，我到厨房拍了一张要用菜刀剁手的照片，说要钱没有，要手有，然后才没有要了。<br/>\r\n\r\n我实在是搞不明白，几十年了他到底在干嘛，我们在农村甚至没有自己的房子，现在住的房子还是我大伯家的。",
          "en": "As a result, half a month later, he asked me again. I went to the kitchen and took a picture of chopping off my hand with a kitchen knife, saying that I didn't have money, but I had a hand. Only then did he stop asking.\n\nI really don't understand what he has been doing for decades. We don't even have our own house in the countryside. The house we live in now still belongs to my uncle's family."
        },
        {
          "zh": "然后说和我要钱是为了还账，但是家里从我小时候就没有富裕过，我甚至记得在九年义务教育的情况下，我小时候为了 100 块钱的书费还是什么费来，我妈让我跑去我姥爷家要钱。<br/>\r\n\r\n在我的印象里面，我们家好像从小就在还账，还什么账，还差多少，一问不说，就是在还账。<br/>\r\n\r\n从 2021 年以后，我爹老实了 2 、3 年，说在外面好好上班，不折腾了。",
          "en": "Then he said that he wanted money to pay off debts, but the family had never been rich since I was a child. I even remember that during the nine-year compulsory education, when I was a child, for 100 yuan for tuition or something, my mother asked me to run to my grandfather's house to ask for money.\n\nIn my impression, our family seems to have been paying off debts since childhood. What debts are we paying off, how much is still owed? When asked, he doesn't say, just that he is paying off debts.\n\nFrom 2021 onwards, my dad was honest for 2 or 3 years, saying that he would work hard outside and not cause trouble."
        },
        {
          "zh": "结果是上了几年班，似乎一分钱没有存下来，不知道上的什么班。",
          "en": "As a result, after working for a few years, he doesn't seem to have saved a single penny. I don't know what kind of job he's doing."
        },
        {
          "zh": "我还发现，她甚至和我妈要钱。",
          "en": "I also found that he even asks my mom for money."
        },
        {
          "zh": "我弟去年高考了，考了个三本，他说没钱供，让我出，我 tm 一算 4 年三本，光一年学费现在三本就 2w 起步了。",
          "en": "My younger brother took the college entrance exam last year and got into a third-tier college. He said he didn't have the money to support him and asked me to pay for it. When I calculated it, 4 years of a third-tier college, just the tuition fee alone is now 20,000 yuan a year."
        },
        {
          "zh": "只能让我弟去复读一年了。<br/>\r\n\r\n\r\n今天我看到我爹又给我发微信，我心里就犯怵，打开语音果然是又要钱，说干不下去了，要回家，和我要 500 块钱回家。",
          "en": "I can only let my younger brother repeat a year.\n\nToday, when I saw my dad sending me a WeChat message again, I felt scared. I opened the voice message and sure enough, he was asking for money again, saying that he couldn't continue working and wanted to go home, asking me for 500 yuan to go home."
        },
        {
          "zh": "tmd ，我们家就隔壁省的，就算高铁也只要 90 块钱而已。\r\n\r\n\r\n<hr>\r\n有点累了，看来继续要钱的循环可能又要开始了。\r\n不过唯一的一点好处就是没有逼我结婚，从来没有被催婚的烦恼，哈哈",
          "en": "Damn it, our family is just in the next province. Even the high-speed rail only costs 90 yuan.\n\nIt's a bit tiring. It seems that the cycle of asking for money may start again.\nBut the only good thing is that they haven't forced me to get married, and I've never had the trouble of being urged to marry, haha."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "不管你是男生还是女生，建议远离这样的原生家庭，微信拉黑，过年不要回家。",
          "en": "Regardless of whether you are a boy or a girl, it is recommended to stay away from such a dysfunctional family, block them on WeChat, and don't go home for the New Year."
        },
        {
          "zh": "没有给你带来任何温暖和帮助。",
          "en": "They haven't brought you any warmth or help."
        },
        {
          "zh": "你可以选择在他法定退休年龄每月给当地标准的抚养费。",
          "en": "You can choose to pay the local standard maintenance fee every month when he reaches the legal retirement age."
        },
        {
          "zh": "不要被道德绑架。",
          "en": "Don't be morally kidnapped."
        },
        {
          "zh": "你得先自己过好了，再慢慢思考。",
          "en": "You have to live your own life well first, and then think about it slowly."
        },
        {
          "zh": "关于别的家庭成员，看你心情，能帮一点是一点。",
          "en": "Regarding other family members, it depends on your mood, help as much as you can."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大概率是赌狗",
          "en": "Most likely a gambling addict"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "几年前的公司一个女同事干瘪瘦弱，某天在公司爆哭，说自己每个月 8K 的工资要给山区家里寄 6K ，每到发工资前几天她的父母就打电话各种质问有没有发工资，不允许她租好点的房子，说每个月 1K 够吃饭了，连口红不允许买，钱都要寄回去给她弟弟，她常常饭都吃不饱。",
          "en": "A few years ago, a female colleague in the company was thin and weak. One day, she burst into tears at the company, saying that she had to send 6,000 yuan of her 8,000 yuan monthly salary to her family in the mountains. A few days before payday, her parents would call and question her about whether she had been paid, and they wouldn't allow her to rent a better house, saying that 1,000 yuan a month was enough for food, and she wasn't even allowed to buy lipstick. The money had to be sent back to her younger brother, and she often didn't have enough to eat."
        },
        {
          "zh": "那天她父母要求把工资卡寄回去，她不干，所以就爆发了。",
          "en": "That day, her parents asked her to send back her salary card, but she refused, so she broke down."
        },
        {
          "zh": "我的建议是这个世界上只有你才会真正爱自己，其他人都不会，包括你的父母，再慈爱的父母都有自己用爱伪装的小算盘，所以面对父母的态度不用太在意“亲”这个字，他们对你好你报以好，如果遇到他们对你不好的时候就记得一句话“做爱生孩子谁不会，真把生育能力当回事了？”",
          "en": "My suggestion is that only you will truly love yourself in this world, and no one else will, including your parents. Even the most loving parents have their own hidden agendas disguised as love, so when dealing with your parents, don't pay too much attention to the word 'kinship'. If they are good to you, you reciprocate with good. If they are not good to you, remember the saying, 'Who can't have sex and have children? Do you really take fertility seriously?'"
        },
        {
          "zh": "你来到这个世界上是他们做爱的副产品，不是他们的功劳，养育你本质上还是出于生物繁衍的利益和养老的利益，本质上爱只是一种利益交换的抽象伪装，只是人出于生物本能会天然选择相信这是爱，不敢去想深层次因素",
          "en": "You came into this world as a byproduct of their sex, not their credit. Raising you is essentially still based on the interests of biological reproduction and the interests of old-age care. Essentially, love is just an abstract disguise for an exchange of interests, but people naturally choose to believe that it is love out of biological instinct and dare not think about deeper factors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很大可能你爸是赌狗。",
          "en": "It's very likely that your dad is a gambling addict."
        },
        {
          "zh": "16 年毕业现在也 30 岁了，这一家之主已经能当了，找机会跟你爸干一架让他别这么放肆（ PS：基于我发小的成功经验）",
          "en": "You graduated in 2016 and are now 30 years old. You can already be the head of the family. Find a chance to fight with your dad and tell him not to be so presumptuous (PS: Based on the successful experience of my childhood friend)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "送你一段话：我现在只在乎三件事：我的钱，我的健康，我内心的平静。",
          "en": "Here's a quote for you: I only care about three things now: my money, my health, and my inner peace."
        },
        {
          "zh": "谁影响我，我就放弃谁，有没有你，我都是我！",
          "en": "Whoever affects me, I will abandon them. With or without you, I am still me!"
        },
        {
          "zh": "接受分道扬镳，接受世事无常，撑把破伞真不如淋雨，坏情绪不会消失，会变成结节，与其内耗长结节，不如发疯骂别人。",
          "en": "Accept parting ways, accept the impermanence of the world. Holding a broken umbrella is not as good as getting caught in the rain. Bad emotions will not disappear, they will become nodules. Instead of internal friction and growing nodules, it is better to go crazy and scold others."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼上很多哥们儿不懂为什么会有女生摊上这样的父亲还愿意当 ATM ，我来告诉你们，因为她们从小就没有被父母真正认可过，但是她们心思单纯，一直记着从小家人零星给的一点点温暖，时刻麻醉自己说家人一直是爱自己的。",
          "en": "Many guys upstairs don't understand why some girls who have such fathers are still willing to be ATMs. Let me tell you, because they have never been truly recognized by their parents since they were little, but they have simple minds and always remember the little bit of warmth that their families gave them when they were little, and constantly anesthetize themselves by saying that their families have always loved them."
        },
        {
          "zh": "长大后为了证明自己是父亲的好女儿，同时被所谓的孝道绑架，就很难挣脱这种原生家庭。",
          "en": "When they grow up, in order to prove that they are their father's good daughters, and at the same time are kidnapped by so-called filial piety, it is difficult to break free from this dysfunctional family."
        },
        {
          "zh": "毕竟要孩子忍心和父母断绝关系，不是动动嘴皮子那么简单的，这意味着要她把这世界上唯一有可能爱她的人剔除掉，尽管在她最深最深的潜意识里，她知道可能从始至终就没有一个人爱她！",
          "en": "After all, asking a child to have the heart to break off relations with their parents is not as simple as just talking about it. It means that she has to remove the only person in this world who might love her, even though in her deepest, deepest subconscious, she knows that no one may have ever loved her from beginning to end!"
        },
        {
          "zh": "这是非常绝望的，但是又是一定要忍痛认识到的真相，只有做到了才有可能浴火重生。",
          "en": "This is very desperate, but it is a truth that must be recognized with pain. Only by doing so is it possible to be reborn from the ashes."
        },
        {
          "zh": "加油吧。",
          "en": "Add oil."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不知道怎么安慰你， 以后还是首先要为自己考虑呀，加油",
          "en": "I don't know how to comfort you. You should consider yourself first in the future. Cheer up"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也觉得挺纳闷的  经典“我家孩子天天玩手机”我每次听到这个言论都觉得很弱智 大人控制不给手机不就行了你这个是一样的  你不转钱难道你的银行账户会自动打给你爹？",
          "en": "I also find it quite strange. The classic 'My child plays with the phone all day long.' Every time I hear this statement, I think it's very idiotic. Adults can control and not give the phone. You are the same. If you don't transfer money, will your bank account automatically transfer it to your dad?"
        },
        {
          "zh": "（言辞激烈只为骂醒你人得考虑你自己的人生",
          "en": "(Harsh words are only to wake you up. You have to consider your own life)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我还没毕业的时候就需要给我妈「养老」了，一毕业就要开始帮她还房贷了，不过现在，我跑了，断绝关系了",
          "en": "I needed to 'support' my mom before I even graduated. As soon as I graduated, I started helping her pay off her mortgage. But now, I've run away and cut off relations."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要自己学会看人，父母不是自己能选择的，但是后期是否一起相处确实自己可以选择的，不要被什么狗屁孝道绑架，如果你的父母属于那种不停索取型，只把你当做一个会产生金币的摇钱树，要学会自己断绝关系，实质上不再联系。",
          "en": "You have to learn to see people for yourself. You can't choose your parents, but you can choose whether to get along with them in the future. Don't be kidnapped by any bullshit filial piety. If your parents are the kind who constantly demand and only treat you as a money tree that produces gold coins, you have to learn to break off relations and effectively stop contacting them."
        },
        {
          "zh": "最多尽到在法律赡养年龄到了后，给予最低的赡养费用我爸是个老赌徒，几十年赌下来欠了一屁股债，家里弄得一地鸡毛。",
          "en": "At most, when the legal age of support is reached, give the minimum amount of support. My dad is an old gambler. After decades of gambling, he owes a lot of debt, and the family is a mess."
        },
        {
          "zh": "在大学时甚至会要我申请的助学基金去赌博。",
          "en": "In college, he would even ask me to use the student aid funds I applied for to gamble."
        },
        {
          "zh": "在毕业一年的时候，我给了一次机会，让他给出所有的借条，我去给他还掉，重头开始，结果也是扭扭捏捏。",
          "en": "In the year after graduation, I gave him one chance to give me all the IOUs, and I would pay them off for him and start over, but the result was also hesitant."
        },
        {
          "zh": "从那时开始就决定彻底断绝关系了，所有联系方式一律拉黑，没有任何往来。",
          "en": "From then on, I decided to cut off relations completely. All contact information was blocked, and there was no communication."
        },
        {
          "zh": "只准备在他到法律养老年纪的时候每月给最低数目，其他的都不管了。",
          "en": "I only plan to give the minimum amount each month when he reaches the legal age of support, and I don't care about anything else."
        },
        {
          "zh": "人生只有自己能做决定，如果你自己不够坚定，把选择权交给别人，可能会过的很难受",
          "en": "You are the only one who can make decisions in life. If you are not firm enough and give the right to choose to others, you may have a very difficult time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不得不说你心态挺好的，不过任何时候自己都是第一位的",
          "en": "I have to say that you have a good attitude, but you should always put yourself first."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "盲猜黄赌毒其中一种，或者都有，你爸不负责任啊，建议远离，有这个钱不如给你弟准备",
          "en": "I blindly guess that it's one of pornography, gambling, or drugs, or all of them. Your dad is irresponsible. I suggest you stay away. It's better to use this money to prepare for your brother."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "农村就是 赌 !",
          "en": "The countryside is all about gambling!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以聊一下你给出 30w 的心理历程吗，我是真的想不通，换我可能发个过街几百块钱红包得了。",
          "en": "Can you talk about the psychological process of giving 300,000 yuan? I really can't understand it. If it were me, I might give a few hundred yuan red envelope to get it over with."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "[√] 黄[√] 赌[√] 毒@x86 交卷，建议给满分！",
          "en": "[√] Pornography [√] Gambling [√] Drugs @x86 Hand in the paper, I suggest giving full marks!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“几年下来我卡里面最高存款都没有超过 3w 。”“最后一次和我要钱，我一次性给了他 10w”How ？",
          "en": "'The highest savings in my card have never exceeded 30,000 yuan in a few years.' 'The last time he asked me for money, I gave him 100,000 yuan at once.' How?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Jimmyisme 从支付宝借呗和京东金条借的",
          "en": "@Jimmyisme Borrowed from Alipay Huabei and JD Baitiao"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不值得。",
          "en": "Not worth it."
        },
        {
          "zh": "要是我爸，我感觉我会把他打一顿。",
          "en": "If it were my dad, I feel like I would beat him up."
        },
        {
          "zh": "并且不会给他钱。",
          "en": "And I wouldn't give him money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "她要是能听得进你们说的 就不会来这发贴了",
          "en": "If she could listen to what you guys are saying, she wouldn't have come here to post."
        }
      ],
      "type": "replies"
    }
  ]
}