{
  "id": 1015395,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "不想回家了",
          "en": "Don't want to go home"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我们这代人好像一直在爬坡，要买房，要买车，要供孩子上好学校，要体面的生活，要中产的头衔，好像从来没有静下来享受下生活，有哪些人是主动内卷，有的人是被家庭裹挟着内卷，其实按照我们很多人收入，欲望放低一点过的其实还是可以很安逸的如果能碰上通情理的另一半，一起过一下散漫的生活其实也不错。",
          "en": "It seems like our generation has been climbing uphill all the time, needing to buy houses, cars, send children to good schools, live decent lives, and get middle-class titles. It seems like we've never slowed down to enjoy life. Some people are proactively engaging in involution, while others are drawn into it by their families. In fact, with the income of many of us, it is actually quite comfortable to live if you lower your desires. It is also quite good to have a relaxed life with a reasonable partner. "
        },
        {
          "zh": "试试放过自己，虽然我也做不到，但我很渴望",
          "en": "Try to let yourself go, although I can't do it either, but I really want to."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本来也没必要回，我都 6 年没回去了，父母这层关系也要看情况，关系好可以维持，关系不好直接不要来往。",
          "en": "There's no need to go back anyway. I haven't gone back for 6 years. The relationship with parents also depends on the situation. If the relationship is good, it can be maintained; if the relationship is not good, don't bother contacting them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "掌控欲极强，个个都是活火山",
          "en": "Extremely controlling, everyone is a volcano."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今天就是初三了，父母生你养你这么多年不容易，早点订票离家，留住这份亲情",
          "en": "Today is the third day of the Lunar New Year. It hasn't been easy for your parents to raise you for so many years. Book tickets to leave home soon and cherish this family relationship."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "抑郁了，给家待着老想去死，明天走了",
          "en": "Depressed, I always want to die when staying at home. I'll leave tomorrow."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我大学找实习过后就再也没主动联系过家里面了，家里条件属于有心但无力，甚至说是就指望我了。",
          "en": "I haven't contacted my family since I found an internship in university. My family's financial situation is willing but unable, or even said to be relying on me."
        },
        {
          "zh": "奈何我目前也是有心无力，不仅不想回家，就连电话都不想接，感觉非常内耗",
          "en": "But I am also powerless now. Not only do I not want to go home, I even don't want to answer the phone. It feels very consuming."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "成家立业这两个问题也是一年见一次亲戚只能问出来的问题，往往他们也并不在乎问题的答案，走个流程而已",
          "en": "The two questions of getting married and starting a career are also questions that can only be asked when seeing relatives once a year. They often don't care about the answers to the questions, just going through the motions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "回来就是问工作问对象，奈何这两样今年都不顺利，实在是被问烦了",
          "en": "When I come back, they ask about work and relationships, but neither of these things went well this year, so I'm really annoyed by the questions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "家里亲人一般也是关心，奈何两代人观念不一样，没有谁可以说服谁，都是已经刻在脑子里的了，只能说敷衍一下，几天很快就过去了，一年也难得回去几趟，还不至于",
          "en": "Family members generally care, but the concepts of two generations are different, and no one can convince anyone. They are already ingrained in their minds. I can only be perfunctory. A few days will pass quickly. It's rare to go back a few times a year, so it's not that bad."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我回家就各种不适，一般廿八才回，初四就走",
          "en": "I feel uncomfortable when I go home. I usually go back on the 28th and leave on the 4th."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那就不回了",
          "en": "Then don't go back."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那就不回，别难为自己",
          "en": "Then don't go back, don't make things difficult for yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderlxm 话虽直，但是很有道理。",
          "en": "@coderlxm Although the words are straightforward, they are very reasonable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "太远了，我也懒得回，太累",
          "en": "It's too far, and I'm too lazy to go back, too tired."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上班 ing",
          "en": "Working ing"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一样 父母都很强势 都是普通上班族 非要按照他们的来 不按照他们的来 就跟我吵哎 有时候蛮累的 现在距离远了 感觉蛮好的",
          "en": "Same. My parents are very strong. They are both ordinary office workers, and they want things done their way. If you don't do it their way, they will quarrel with me. It's quite tiring sometimes. It feels pretty good now that I'm far away."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "连续 7 年春节没回家了，父母和家庭关系都不是自己选的，能远离就远离。",
          "en": "I haven't been home for the Spring Festival for 7 consecutive years. Parents and family relationships are not chosen by oneself. If you can stay away, then stay away."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一样，下年打算旅游了",
          "en": "Same, I plan to travel next year"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "18# 说的有道理，看过一本书上说，有时候亲人问你相亲和工作，就是因为没话题，你可以尝试关心一些他们的事情，让他们的注意力转向其他地方。",
          "en": "18# is right. I read in a book that sometimes relatives ask you about dating and work simply because they don't have anything to talk about. You can try to care about some of their affairs and shift their attention to other things."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SayHelloHi 一样，刚和家里吵完。",
          "en": "@SayHelloHi Same, just had a fight with my family."
        }
      ],
      "type": "replies"
    }
  ]
}