{
  "id": 1014566,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "求推荐 无线鼠标 放电池的不要充电的！",
          "en": "Recommend a wireless mouse that uses batteries, not rechargeable!"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我一直用的罗技 G304,感觉挺好用的。",
          "en": "I've been using Logitech G304, and it feels pretty good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "G304 买过好几个，超过两年就会出现连击问题，其实就是个“计划报废”，知道这一切的我直接换买微动自己换了，二三十块钱买焊好的微动板或热拔插的板子，还送工具，对着视频十来分钟搞定，寿命 x10 不吹牛逼",
          "en": "I've bought several G304s, and they develop double-click issues after more than two years. It's essentially \"planned obsolescence.\" Knowing this, I directly bought replacement microswitches and replaced them myself. You can buy pre-soldered microswitch boards or hot-swappable boards for twenty to thirty yuan, and they even come with tools. It takes about ten minutes to do it by watching a video, and the lifespan is x10, no exaggeration."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "G304+鼠标贴+换微动，手感直接上天。",
          "en": "G304 + mouse stickers + changing the microswitch, the feel is out of this world."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也投 G304 一票，耐用、握感好，价格也合适",
          "en": "I also vote for G304. Durable, good grip, and the price is right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果是办公用，我一直用罗技 M185 ，这是第三个了。",
          "en": "If it's for office use, I've always used Logitech M185; this is my third one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "G304 用了三年了，有个不好的点是用久了橡胶滚轮会膨胀",
          "en": "I've used the G304 for three years. One downside is that the rubber scroll wheel expands over time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 M720",
          "en": "Logitech M720"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 M590",
          "en": "Logitech M590"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感谢分享！ 鼠标就是写代码用，不打游戏，感觉鼠标滚轮用的比较多",
          "en": "Thanks for sharing! The mouse is used for writing code, not for gaming, and I feel like I use the scroll wheel a lot."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "G304 用了会 3 年  还行",
          "en": "I've used G304 for 3 years, it's alright."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "G304 加一票，用了 3 年字都已经磨掉了，很稳",
          "en": "Another vote for G304, I've used it for 3 years and the characters have already worn off, it's very stable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "办公写代码的话 G304 贵了，那款静音的不错，M 开头的，我用第三只了，平均每只用 2 年，换一次电池。",
          "en": "G304 is expensive if you're using it for office work and coding. The silent one is good, the one starting with M, I'm on my third, it lasts an average of 2 years, and I change the battery once."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 M590 电脑 手机 切换方便，刷手机都不用触屏的。",
          "en": "Logitech M590 is convenient to switch between computer and phone, and you don't even need to touch the screen to browse your phone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "雷蛇 毒蝰 V3 极速版太喜欢他的模具了，个人版本最优解",
          "en": "Razer Viper V3 HyperSpeed, I really like its shape, it's the best personal version."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 G603 ，两个电池仓，但我一般只放一个减轻重量，使用起来非常丝滑。家里、公司工位上各一个",
          "en": "Logitech G603, two battery compartments, but I usually only put one in to reduce weight, and it's very smooth to use. One at home and one at the office desk."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 M590 静音 挺好",
          "en": "Logitech M590 silent, pretty good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "八岐大蛇 v2 ，符合我的小手",
          "en": "Orochi V2, it fits my small hands."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "逻辑 M750 ，电池，家里公司各放一个",
          "en": "Logic M750, batteries, one at home and one at the office."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 G304",
          "en": "Logitech G304"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "G304 一块电池用半年",
          "en": "A single battery for G304 lasts half a year."
        }
      ],
      "type": "replies"
    }
  ]
}