{
  "id": 1018272,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "24 年买车，极氪 001 和宝马 3 系怎么选？",
          "en": "How to choose between Zeekr 001 and BMW 3 Series when buying a car in 2024?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "友友们好，我是广州的，今年摇车牌摇中了油车牌，现在在纠结 3 系和 001.",
          "en": "Hello friends, I'm from Guangzhou. This year, I won an oil car license plate. Now, I'm hesitating between the 3 Series and the 001."
        },
        {
          "zh": "\r\n\r\n我对轿车的要求是：",
          "en": "\n\nMy requirements for a sedan are:"
        },
        {
          "zh": "\r\n\r\n安全＞空间＞可以午休睡觉＞外观",
          "en": "\n\nSafety > Space > Can take a nap > Appearance"
        },
        {
          "zh": "\r\n\r\n（ 1 ）安全：目前来看安全上宝马和极氪 001 差不多（智驾），",
          "en": "\n\n(1) Safety: Currently, BMW and Zeekr 001 are similar in safety (smart driving)."
        },
        {
          "zh": "\r\n\r\n（ 2 ）空间：极氪 001 略胜一筹，",
          "en": "\n\n(2) Space: Zeekr 001 is slightly better."
        },
        {
          "zh": "\r\n\r\n（ 3 ）午休睡觉：极氪 001 电车又赢了，",
          "en": "\n\n(3) Napping: Zeekr 001 (electric car) wins again."
        },
        {
          "zh": "\r\n\r\n（ 4 ）外观：两者我都很喜欢。",
          "en": "\n\n(4) Appearance: I like both."
        },
        {
          "zh": "\r\n\r\n现在对极氪唯一担心是：",
          "en": "\n\nNow my only concern about Zeekr is:"
        },
        {
          "zh": "\r\n\r\n听说极氪的售后非常差！",
          "en": "\n\nI heard Zeekr's after-sales service is very poor!"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "001 / tesla model 3 / bmw 3这三个车我都买过，都开了差不多 1 年左右。",
          "en": "I have bought all three cars: 001 / Tesla Model 3 / BMW 3 Series and have driven each for about a year."
        },
        {
          "zh": "上图再说我是水军？---结论：3 系跟 model3 没法比。",
          "en": "Show pictures later and say I'm a shill? --- Conclusion: The 3 Series can't compare to the Model 3."
        },
        {
          "zh": "3 系 180-250 匹，model3 起步 270 匹。",
          "en": "The 3 Series has 180-250 horsepower, while the Model 3 starts at 270 horsepower."
        },
        {
          "zh": "加上无延迟的电门，性能是吊打。",
          "en": "Plus the lag-free electric throttle, its performance is superior."
        },
        {
          "zh": "车身配重和底盘，3 系和 model3 ，各有千秋，一个调教 50:50 ，一个天生 50:50综合操控上，model3 赢面大。",
          "en": "In terms of weight distribution and chassis, the 3 Series and Model 3 each have their strengths and weaknesses. One is tuned to 50:50, the other is naturally 50:50. The Model 3 has a higher chance of winning in terms of overall handling."
        },
        {
          "zh": "日常使用上，3 系一堆配置都没有，需要选配，5AU 辅助驾驶/座椅加热/座椅通风/方向盘电动调节/方向盘加热/自动远近光/远程空调，还有一些记不清了，这些 model3 都是标配的。",
          "en": "In daily use, the 3 Series lacks a lot of features and requires optional upgrades, such as 5AU driving assistant/heated seats/ventilated seats/electric steering wheel adjustment/heated steering wheel/automatic high and low beams/remote air conditioning, and some I can't remember. The Model 3 has all of these as standard equipment."
        },
        {
          "zh": "3 系还阉割了后排座椅放倒和平衡杆，还有一堆东西我也懒得列举了，比如大灯散热组件。",
          "en": "The 3 Series also has rear seat folding and stabilizer bar features removed, plus a lot of other things I'm too lazy to list, such as the headlight heat dissipation components."
        },
        {
          "zh": "model3 ，和 BMW 3 系，完全不是一个时代的产物，也别怪特斯拉粉丝，确实没法比。",
          "en": "The Model 3 and BMW 3 Series are not products of the same era. Don't blame Tesla fans, there's really no comparison."
        },
        {
          "zh": "-----model3 跟极氪 001 没法比。",
          "en": "-----The Model 3 can't compare to the Zeekr 001."
        },
        {
          "zh": "model3 270-550 匹，极氪 001 ，老款 550 匹，新款 790 匹。",
          "en": "The Model 3 has 270-550 horsepower, the Zeekr 001 (old version) has 550 horsepower, and the new version has 790 horsepower."
        },
        {
          "zh": "底盘各有取舍，算平局。",
          "en": "The chassis has its own trade-offs, so it's a draw."
        },
        {
          "zh": "日常使用上，model3 一堆配置没有，极氪又是标配的。。。。",
          "en": "In daily use, the Model 3 lacks a lot of features, while the Zeekr has them all as standard equipment."
        },
        {
          "zh": "HUD ，仪表盘，座椅按摩，空悬除此之外，更大的尺寸和更好的做工用料。。。",
          "en": "HUD, instrument panel, seat massage, air suspension, and more, plus a larger size and better workmanship and materials..."
        },
        {
          "zh": "别怪极氪粉丝，也确实没法比。",
          "en": "Don't blame Zeekr fans, there's really no comparison."
        },
        {
          "zh": "----三台车对应三个时代。",
          "en": "----These three cars represent three different eras."
        },
        {
          "zh": "下个时代是智驾，又没法比了，很正常。",
          "en": "The next era is smart driving, again, there's no comparison, which is normal."
        },
        {
          "zh": "三选一，选极氪 001 ，雷军都怕的定不了价，你说呢？",
          "en": "If I were to choose one in these three, I would choose the Zeekr 001. Lei Jun is also afraid of the price being uncompetitive, what do you think?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不推荐特斯拉，垃圾的一批",
          "en": "I don't recommend Tesla. It's a piece of garbage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有装逼需求直接忽略宝马奔驰这种品牌就行了，各种小的舒适性功能阉割，完全比不过同价车型",
          "en": "If you don't need to show off, just ignore brands like BMW and Mercedes-Benz. They have various small comfort features removed and cannot compare to similarly priced models."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SilentOrFight 车机黑屏，这种不是真车主，纯水军，因为他们能想象到的车机故障，就是黑屏。",
          "en": "@SilentOrFight The infotainment system black screen, these are not real car owners, pure shills, because the only infotainment system failure they can imagine is a black screen."
        },
        {
          "zh": "只有真车主才知道，极氪的车机，那花样可多了去了：1. 座椅记忆失效，HUD 记忆失效。",
          "en": "Only real car owners know that the Zeekr's infotainment system has many problems: 1. Seat memory failure, HUD memory failure."
        },
        {
          "zh": "2. 行驶时座椅自己移动。",
          "en": "2. The seat moves on its own while driving."
        },
        {
          "zh": "3. 音量突然最大。",
          "en": "3. The volume suddenly becomes the maximum."
        },
        {
          "zh": "4. 开不了车门。",
          "en": "4. The car door cannot be opened."
        },
        {
          "zh": "5. 360 延迟。",
          "en": "5. 360 delay."
        },
        {
          "zh": "6. 地图漂移。",
          "en": "6. Map drifting."
        },
        {
          "zh": "7. 变道提醒无效。",
          "en": "7. Lane change warning is invalid."
        },
        {
          "zh": "还有一些我懒得想了。",
          "en": "And some I don't want to think about."
        },
        {
          "zh": "这才是真正极氪车机故障，说什么黑屏，太缺乏想象力了。",
          "en": "These are the real Zeekr infotainment system failures. Talking about a black screen is too lacking in imagination."
        },
        {
          "zh": "以上故障在去年 5 月之前，都是真实存在的，5 月极氪开除了原有的车机团队，才开始修 BUG ，到现在还没完全修完。",
          "en": "All the above failures were real before May of last year. In May, Zeekr fired the original infotainment system team and started to fix the bugs, and they have not been completely fixed yet."
        },
        {
          "zh": "这车的硬件，80 万级，软件，-50 万，所以这车卖 30 万，这就是车友群的真实评价。",
          "en": "The hardware of this car is at the 800,000 level, the software is at the -500,000 level, so this car sells for 300,000, which is the real evaluation of the car owners group."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Takizawa 我都是去采耳按摩的时候充电，你问采耳按摩的钱哪里来？",
          "en": "@Takizawa I charge my car when I go for ear cleaning massage. Where does the money for ear cleaning massage come from?"
        },
        {
          "zh": "油价帮我省的。",
          "en": "The oil price helped me save money."
        },
        {
          "zh": "采耳 200 元，充电 70 元。",
          "en": "Ear cleaning massage costs 200 yuan, and charging costs 70 yuan."
        },
        {
          "zh": "加油 470 元。",
          "en": "Refueling costs 470 yuan."
        },
        {
          "zh": "完了还节省 200 ，吃一顿烤鱼，再看个电影。",
          "en": "After that, I save 200 yuan, eat a grilled fish, and watch a movie."
        },
        {
          "zh": "我开 model3 的时候，每周都这样。",
          "en": "I did this every week when I drove a Model 3."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我这人喜欢说实话，再晒一下采耳的钱，都是油钱省下来的。",
          "en": "I like to tell the truth. I am showing off the ear cleaning money again. It's all saved from the oil money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xbtx3790 为了立场，不愿听真话，我能理解。老中的东西不行。",
          "en": "@xbtx3790 I can understand that you don't want to hear the truth for the sake of your position. Things from the old world aren't good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@goodman111  销量差的新势力的确有风险，但你说，吉利这种老牌车企下的电车，活不过 5 年就不至于了。",
          "en": "@goodman111 There are indeed risks with new, less popular electric vehicle manufacturers, but to say that electric cars from established car companies like Geely won't last more than 5 years is a bit much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "油车党，BMW 3",
          "en": "Oil car enthusiasts, BMW 3"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dxk611 再补充一个点：无论是大规模工业化应用，还是大规模 AI 行业，都需要天量的电力供应。",
          "en": "@dxk611 To add another point: whether it is large-scale industrial application or large-scale AI industry, a huge amount of electricity supply is needed."
        },
        {
          "zh": "谁的电更便宜，谁就会在未来占据更高的生态位。",
          "en": "Whoever has cheaper electricity will occupy a higher ecological position in the future."
        },
        {
          "zh": "在这个前提下，电力相关的一切成本还会继续下降，因为规模还在不断攀升。",
          "en": "Under this premise, all costs related to electricity will continue to decline because the scale is still rising."
        },
        {
          "zh": "你可以不看好中国，美国也不看好？",
          "en": "You may not be optimistic about China, but is the US also not optimistic?"
        },
        {
          "zh": "那就有点厉害啦",
          "en": "Then it's a bit awesome"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@NewMoorj 不敢不敢，再也不碰电车这个话题了，只是说句电池太贵。",
          "en": "@NewMoorj No need to be afraid, I won't touch the topic of electric vehicles again. I was just saying that the battery is too expensive."
        },
        {
          "zh": "您就颅内高潮了，我怕顺着网线过来掐死我",
          "en": "You're having an internal orgasm, I'm afraid someone will come through the internet cable to strangle me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "3 系那种同级垫底的车怎么跟极氪 001 比啊？",
          "en": "How can a car like the 3 Series, which is at the bottom of its class, compare to the Zeekr 001?"
        },
        {
          "zh": "如果你纠结 5 系和 001 还能理解3 系家用纯纯的找罪受，跟豪华不沾边001 可是有很强的豪华感的",
          "en": "If you're hesitating between the 5 Series and the 001, I can understand. The 3 Series purely suffers for home use, and it's not related to luxury. The 001, however, has a very strong sense of luxury."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ramirezyolis808 #11 这个杠太的就很没有水平，加油站的密度和加油的时间成本是充电能比的吗，油车上放一桶油直接续航加倍，电车上放一块电池试试？",
          "en": "@ramirezyolis808 #11 This argument is very poor. Can the density of gas stations and the time cost of refueling compare to charging? You can put a can of oil in the car and double the range, but try putting a battery in an electric car?"
        },
        {
          "zh": "非要拿电车的劣势去跟油车的优势比",
          "en": "You have to compare the disadvantages of electric cars to the advantages of oil cars."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dxk611 少一点屁股和站队，多讨论点实际的。",
          "en": "@dxk611 Less bias and standing, and more discussion of actual things."
        },
        {
          "zh": "您是 BMW 3 系的用户，还是 model3 的用户，还是极氪 001 的用户？",
          "en": "Are you a user of the BMW 3 Series, the Model 3, or the Zeekr 001?"
        },
        {
          "zh": "刷了这么多行，有一行能给楼主提供帮助吗？",
          "en": "After writing so many lines, can any of it help the original poster?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有车就对了，人多就对了？",
          "en": "Having a car is correct, and the majority is correct?"
        },
        {
          "zh": "这逻辑真奇怪。",
          "en": "This logic is really strange."
        },
        {
          "zh": "汽车内饰值钱？",
          "en": "Are car interiors valuable?"
        },
        {
          "zh": "油电判断标准是省采耳钱？",
          "en": "The standard for judging oil or electricity is to save money on ear cleaning?"
        },
        {
          "zh": "市面上真的买的最多依然是油车。",
          "en": "The most bought cars on the market are still oil cars."
        },
        {
          "zh": "人是应该有自己价值基准的，且不应该那么容易被左右的。",
          "en": "People should have their own value benchmarks and should not be so easily influenced."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "特斯拉咋混进来了，楼主的选项里没有它啊",
          "en": "How did Tesla get in here? It's not in the original poster's options."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看你是信楼上的各位云车主，还是信扎扎实实体验过各种车的车主了。",
          "en": "It depends on whether you believe the cloud car owners above or the car owners who have really experienced various cars."
        },
        {
          "zh": "关于楼主提到的车，有很有趣的一个现象，面对那些体验过真车的车主，评论里没开过车的都急了。",
          "en": "Regarding the cars mentioned by the original poster, there is a very interesting phenomenon. Facing the car owners who have experienced real cars, those who have not driven before are anxious in the comments."
        },
        {
          "zh": "回到车的话题：1. 宝马 3 系，刹车点头，pass2. 极氪 001 电门不线性，不太跟脚以上两台车我最少都开过 3 千公里，我推荐极氪 001 ；而且在广州，完全不需要担心充电，没有什么所谓有了一辆油车再去买电车的说法",
          "en": "Back to the topic of cars: 1. BMW 3 Series, braking nods, pass 2. Zeekr 001, the electric throttle is not linear and not responsive. I've driven both cars for at least 3,000 kilometers. I recommend the Zeekr 001; and in Guangzhou, there's no need to worry about charging, there is no need to buy an electric car after having an oil car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@totopper312 别一口一个别人不明白了，我给你 100 万，你给我买一台 700 匹四驱的 BBA 来？",
          "en": "@totopper312 Don't keep saying others don't understand. I'll give you 1 million, can you buy me a 700-horsepower four-wheel-drive BBA?"
        },
        {
          "zh": "电车这只要 27 万，还不够便宜？",
          "en": "The electric car is only 270,000, isn't it cheap enough?"
        },
        {
          "zh": "你是真不知道，还是假装不知道？",
          "en": "Do you really not know, or are you pretending not to know?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "普通人哪里讲究那么多的操控，手感，我开着几万块的合资老车，说真的也是得心应手。",
          "en": "Ordinary people don't care so much about handling and feel. I drive a tens of thousands of dollars joint venture old car, and it's really easy to use."
        },
        {
          "zh": "反正要我选我会这样排序：001 / tesla model 3 / bmw 3",
          "en": "Anyway, if I were to choose, I would sort it like this: 001 / Tesla Model 3 / BMW 3"
        },
        {
          "zh": "油价又要涨了，艸",
          "en": "Oil prices will rise again, damn it"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你有自己的私有充电桩吗？",
          "en": "Do you have your own private charging station?"
        },
        {
          "zh": "没有就不要考虑新能源车了，老老实实油车吧。",
          "en": "If not, don't consider new energy vehicles, just stick with the oil car."
        }
      ],
      "type": "replies"
    }
  ]
}