{
  "id": 1018414,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想问问各位手机双持的多么，类似于一部苹果，一部安卓",
          "en": "Just wondering how many of you dual-wield phones, like an iPhone and an Android?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "两部安卓",
          "en": "Two Android phones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "15pm 1+8P 双持我觉得你这样发帖只能引来同样的人....最后结论就是这样用的人还挺多的",
          "en": "Dual-wielding 15pm and 1+8P, I think posting like this will only attract the same kind of people... The final conclusion is that there are quite a few people using it this way."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "手机安卓，娱乐 ipad 飘过。我有两张手机卡，但我个人觉得没必要用两个手机。在家里平板和手机切着用，足够了。",
          "en": "Android phone, iPad for entertainment. I have two SIM cards, but I personally don't think it's necessary to use two phones. Switching between tablet and phone at home is enough."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@iyaozhen 苹果只能一个微信，而部分人微信是两个，私人号和工作号，所以导致要有两台手机。",
          "en": "@iyaozhen Apple only allows one WeChat account, but some people have two WeChat accounts, one for personal use and one for work, which leads to having two phones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看了一下没有说用 HW 的，看样子都是智商在线",
          "en": "Looking at it, no one mentioned using HW (Huawei), seems like everyone has a decent IQ."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iPhone SE 3 + Google Pixel 4 XL本来是打算 Pixel 主力的，但是每次复制文本后打开淘宝就被强奸了一样，索性买了 iPhone 只安装国产软件，只有一张手机卡，Pixel 用的 giffgaff, 每次在外面用都需要开热点，近期打算再办理一张 sim 卡。",
          "en": "iPhone SE 3 + Google Pixel 4 XL. Originally, I planned to use Pixel as my main phone, but every time I copied text and opened Taobao, it was like being raped. So I bought an iPhone and only installed domestic software. I only have one SIM card, and the Pixel uses giffgaff. Every time I use it outside, I need to turn on the hotspot. I plan to get another SIM card soon."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "出去玩的时候两部手机比充电宝实用多了可以轮着充电，使用iPhone 13Pro+k50",
          "en": "When going out, two phones are more practical than a power bank. You can take turns charging them. I'm using iPhone 13Pro + k50."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "双 iphone ，只能用 iphone ，因为没法用 google play 买东西，搞不定付费。",
          "en": "Dual iPhone, can only use iPhone, because I can't buy anything on Google Play and can't figure out the payment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "出差，非常有必要，最常见的是给没电了或者没流量了时候防备的",
          "en": "For business trips, it is very necessary, the most common being a backup when one phone runs out of battery or data."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一部手机我都嫌多 两部接受不了",
          "en": "I think one phone is already too much, I can't accept two."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "工作小米 14 ，生活 iphone15 peo max 。  工作用安卓还是挺合适的，尤其是文件存储等实用功能，以及到最后迫不得已的通话录音，应用内录音。生活上，有一说一，iPhone 的屏幕，看着是真舒服。",
          "en": "Xiaomi 14 for work, iPhone 15 Pro Max for life. Android is quite suitable for work, especially for practical functions such as file storage, and call recording and in-app recording when you have to. For life, I have to say, the iPhone screen is really comfortable to look at."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "至少得两部，尤其经常科学上网的，你懂得",
          "en": "You need at least two, especially if you frequently use circumvention tools, you know."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "苹果+安卓",
          "en": "Apple + Android"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iPhone 15 Plus + Samsung S23 Ultra",
          "en": "iPhone 15 Plus + Samsung S23 Ultra"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iPhone + hongmi",
          "en": "iPhone + Hongmi"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iphone 15 pro + mi 13 + 红米 K30s",
          "en": "iPhone 15 Pro + Mi 13 + Redmi K30s"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "12mini+Xperia 1V",
          "en": "12mini + Xperia 1V"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "sony pro-i + iphone 13 promax",
          "en": "Sony pro-i + iPhone 13 Pro Max"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "主力机 vivo x90 pro+。戴 Apple watch S9 ，倒计时，指南针，备忘录之类。备机 iPhone 平时不带，就阶段性看看健康检测。",
          "en": "Main phone: Vivo X90 Pro+. Wearing an Apple Watch S9 for countdowns, compass, memos, etc. Backup phone: iPhone, usually don't carry it, just check the health data periodically."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "双持不累么",
          "en": "Isn't it tiring to dual-wield?"
        }
      ],
      "type": "replies"
    }
  ]
}