{"id":1017458,"blocks":[{"chunks":[{"zh":"19 年毕业，大家帮忙看看，我这水平深圳市场值多少钱","en":"Graduated in '19, everyone please help take a look, how much is my level worth in the Shenzhen market?"}],"type":"title"},{"chunks":[{"zh":"> 19 年毕业 12k ，上家公司 14 薪呆两年从 14k 涨到 16k ，去年进外包了 12 薪还转 golang 大半年了到现在一直是 18k ，之前的同事工资早翻番了，怎么我他妈的混成这逼样","en":"> Graduated in '19 with 12k salary, stayed at the previous company for two years with 14 months salary, increasing from 14k to 16k. Last year, I joined an outsourcing company with 12 months salary and switched to Golang for more than half a year, but it's still 18k. My previous colleagues' salaries have doubled a long time ago. How did I end up like this?"},{"zh":"\r\n\r\nhttps://doc.pursue.pub/\r\n\r\nhttps://github.com/pursue-wind\r\n\r\n- Java： 熟练掌握 Java 基础、多线程、JVM","en":"\r\n\r\nhttps://doc.pursue.pub/\r\n\r\nhttps://github.com/pursue-wind\r\n\r\n- Java: Proficient in Java basics, multithreading, JVM"},{"zh":"\r\n- Kotlin： 熟练使用 Kotlin 和 SpringBoot 结合开发，有 IDEA 插件开发经验","en":"\r\n- Kotlin: Proficient in using Kotlin and SpringBoot for development, with IDEA plugin development experience"},{"zh":"\r\n- Go： 转 Go 半年，参与过几个 Golang 项目开发","en":"\r\n- Go: Switched to Go for half a year, participated in the development of several Golang projects"},{"zh":"\r\n- Python： 熟练使用 Python 进行 Scrapy 爬虫开发，平时工作使用 Python 脚本提升效率","en":"\r\n- Python: Proficient in using Python for Scrapy crawler development, using Python scripts to improve efficiency in daily work"},{"zh":"\r\n- Linux： 熟练使用 Linux 常用命令","en":"\r\n- Linux: Proficient in using common Linux commands"},{"zh":"\r\n- 数据库： 熟练掌握 MySQL 、Redis 等常用数据库","en":"\r\n- Databases: Proficient in common databases such as MySQL and Redis"},{"zh":"\r\n- 框架： 熟练掌握 Spring 、SpringMVC 、SpringBoot 、SpringSecurity 、SpringWebFlux 、JPA 、MyBatis 等主流开发框架","en":"\r\n- Frameworks: Proficient in mainstream development frameworks such as Spring, SpringMVC, SpringBoot, SpringSecurity, SpringWebFlux, JPA, MyBatis"},{"zh":"\r\n- 分布式： 熟练使用 SpringCloudNetflix 、SpringCloudAlibaba 、Dubbo","en":"\r\n- Distributed: Proficient in using SpringCloudNetflix, SpringCloudAlibaba, Dubbo"},{"zh":"\r\n- 大数据： 熟练使用 Hadoop 、Hive 、Presto 、Trino 等常用大数据组件","en":"\r\n- Big Data: Proficient in common big data components such as Hadoop, Hive, Presto, Trino"},{"zh":"\r\n- 搜索引擎： 熟练使用 ElasticSearch","en":"\r\n- Search Engine: Proficient in using ElasticSearch"},{"zh":"\r\n- 消息队列： 熟练使用 Kafka 、RocketMQ 等常用消息队列","en":"\r\n- Message Queue: Proficient in common message queues such as Kafka, RocketMQ"},{"zh":"\r\n- 工具： 熟练使用 Git 、Maven 、Gradle 、Docker","en":"\r\n- Tools: Proficient in Git, Maven, Gradle, Docker"},{"zh":"\r\n- CICD： 熟练使用 GitLab CI 、Jenkins 、云效流水线、Coding 持续集成","en":"\r\n- CICD: Proficient in GitLab CI, Jenkins, Alibaba Cloud Pipeline, Coding Continuous Integration"},{"zh":"\r\n- 云原生： 了解 kubernetes 的使用","en":"\r\n- Cloud Native: Understands the use of Kubernetes"},{"zh":"\r\n- 前端： 熟练使用 Vue 全家桶、jQuery 、微信小程序，有实际开发经验","en":"\r\n- Frontend: Proficient in Vue family, jQuery, WeChat Mini Programs, with actual development experience"}],"type":"content"},{"chunks":[{"zh":"@pursuewind #12 你这反问态度就挺奇怪的，大家想说的就是简历上写的熟练别人不知道你掌握多少，你这边 12 楼谈多线程看不起会起线程池的，11 楼谈 git 又表示 rebase 和 cherrypick 就够，让人感觉我会的就是好的，我不会的就是不需要的，你是不是想听别人回复 “rebase 和 cherrypick 也叫会 git 啊，这种 reflog  filter-branch format-patch blame 不是最基本的么”","en":"@pursuewind #12 Your rhetorical attitude is quite strange. What everyone wants to say is that others don't know how much you've mastered when you write 'proficient' on your resume. You, in comment 12, look down on those who can create thread pools when talking about multithreading, and comment 11 says that rebase and cherrypick are enough for Git. It gives people the feeling that what you know is good, and what you don't know is unnecessary. Do you want to hear someone reply, 'Rebase and cherrypick are also called knowing Git? Aren't reflog, filter-branch, format-patch, and blame the most basic things?'"}],"type":"replies"},{"chunks":[{"zh":"随便问一个：熟练使用 git 有多熟练？有没有了解过 git reflog 、git bisect 、git range-diff ？还是单纯的 git add .、git commit 、git push 一键三连？平时用 merge 还是 rebase 还是 squash ？为什么？研发模式用的是哪种 flow ？为什么？有没有了解过 Trunk Base ？","en":"Just asking: How proficient are you in using Git? Have you ever heard of git reflog, git bisect, git range-diff? Or is it just a one-click sequence of git add ., git commit, git push? Do you usually use merge, rebase or squash? Why? Which flow is used for the development model? Why? Have you ever heard of Trunk Base?"}],"type":"replies"},{"chunks":[{"zh":"工作久了我发现其实工资跟能力并不是强相关的能拿多少钱只是这家公司愿意为这个岗位付出多少钱而已","en":"After working for a long time, I found that salary is not strongly related to ability. How much you can get depends on how much the company is willing to pay for the position."}],"type":"replies"},{"chunks":[{"zh":"我跟他们不一样，我仔细读了首页几个项目的代码。","en":"I'm different from them, I read the code of several projects on the homepage carefully."},{"zh":"tldr: 你现在的工资低于你的代码表现出来的能力，不过低的不多。","en":"TLDR: Your current salary is lower than the ability shown by your code, but not by much."},{"zh":"只看你写的代码本身我觉得 20-30K 。","en":"Just looking at the code you wrote, I think it's worth 20-30K."},{"zh":"你的项目几乎都没有测试，所以注定不会长期维护，就是玩具项目。","en":"Your projects have almost no tests, so they are destined not to be maintained for a long time, they are just toy projects."},{"zh":"另外我发现你特别喜欢用函数式和 lambda 表达式，明明正常写代码的地方一定要用一个 Kotlin 的函数对象：val toCamelCase: (String) -> String = {    val builder = StringBuilder()    var upperCase = false    for (i in it.indices) {        val c = it[i]        upperCase = if (c == ' ' || c == '-' || c == '_') {            true        } else {            builder.append(if (upperCase) c.uppercaseChar() else c)            false        }    }    builder.toString()}```在我看来这是过度使用函数式编程了。","en":"Also, I found that you especially like to use functional and lambda expressions. You must use a Kotlin function object in a place where you can write normal code: ```val toCamelCase: (String) -> String = {    val builder = StringBuilder()    var upperCase = false    for (i in it.indices) {        val c = it[i]        upperCase = if (c == ' ' || c == '-' || c == '_') {            true        } else {            builder.append(if (upperCase) c.uppercaseChar() else c)            false        }    }    builder.toString()}```In my opinion, this is excessive use of functional programming."},{"zh":"你完全可以声明成一个正常的函数然后用方法引用传参：```fun toCamelCase() {}chineseCheck(postfixData.psiElementName, ::toCamelCase)```不只是这么一个地方，很多其他地方过度使用，不是说不行，给人的感觉怎么说呢，稍微有点 naive 。","en":"You can declare it as a normal function and pass parameters with method references: ```fun toCamelCase() {}chineseCheck(postfixData.psiElementName, ::toCamelCase)```It's not just this one place, there are many other places of overuse. It's not that it's impossible, but the feeling it gives is, how should I put it, a little naive."}],"type":"replies"},{"chunks":[{"zh":"的确技术栈没那么重要有时候。","en":"Indeed, the technology stack is not that important sometimes."},{"zh":"我在澳洲，大厂面试流程都是三轮 pair coding ，一轮 system design ，一轮 behaviour 。","en":"I'm in Australia, and the interview process for big companies is three rounds of pair coding, one round of system design, and one round of behavior."},{"zh":"跟们没有机会给你展示你的技术栈，全是基本功。","en":"There is no chance to show your technology stack, it's all basic skills."},{"zh":"而且技术栈想学快的很，我们组的大佬，入职前都没写过 java ，但是又如何。","en":"Moreover, the technology stack is very quick to learn. The boss in our group hadn't written Java before joining the company, but so what?"},{"zh":"啥问题都能解决。","en":"Any problem can be solved."},{"zh":"所以技术栈不重要，解决问题的能力才重要。","en":"So the technology stack is not important, the ability to solve problems is important."}],"type":"replies"},{"chunks":[{"zh":"云面试？这种简历啥也看不出来，只能说技术栈匹配的话可能会给个面试机会再一个一个展开问","en":"Cloud interview? You can't see anything from this kind of resume, you can only say that if the technology stack matches, you may be given an interview opportunity to ask questions one by one."}],"type":"replies"},{"chunks":[{"zh":"现在熟练都不让用了？都得用了解吗各位？","en":"Are we not allowed to use 'proficient' anymore? Do we all have to use 'understand' now, everyone?"}],"type":"replies"},{"chunks":[{"zh":"熟练掌握 C++是不是漏写了？","en":"Did you forget to write 'Proficient in C++'?"}],"type":"replies"},{"chunks":[{"zh":"昨天看直播，大专培训俩月，简历包装 4 年，20k 拿下了主播还当场面试了一波，经验缺失不足，但是人家自信，能举一反三就不错","en":"Yesterday I watched a live broadcast. A person with a college degree and two months of training, packaged a resume for 4 years, and got 20k. The streamer also interviewed him on the spot. There was a lack of experience, but the person was confident and could draw inferences, so it was pretty good."}],"type":"replies"},{"chunks":[{"zh":"没写学校一律为非 985,211 。","en":"If the school is not written, it is not a 985 or 211 university."},{"zh":"说实话，现在有份工就不错了。","en":"To be honest, it's good to have a job now."},{"zh":"市场行情不好，和你个人没什么关系。","en":"The market is not good, and it has nothing to do with you personally."}],"type":"replies"},{"chunks":[{"zh":"看起来比我强 不过现在大环境不好 不像以前这么容易了","en":"Looks stronger than me, but the overall environment is not good now, it's not as easy as before."}],"type":"replies"},{"chunks":[{"zh":"@AoEiuV020JP 不是面试，只是放一下技术栈看能值多少钱","en":"@AoEiuV020JP It's not an interview, just putting the technology stack here to see how much it's worth."}],"type":"replies"},{"chunks":[{"zh":"@lsk569937453 没学历，垃圾本科","en":"@lsk569937453 No good degree, garbage undergraduate."}],"type":"replies"},{"chunks":[{"zh":"非 985,211, 有工作就不错了...","en":"Not a 985 or 211, it's good to have a job..."},{"zh":"要赚钱 , 打工是不行滴...","en":"If you want to make money, working for others is not the way..."},{"zh":"大厂没几个能进...","en":"Few people can get into big companies..."}],"type":"replies"},{"chunks":[{"zh":"@thulof 我是一键三连","en":"@thulof I use one-click three steps."}],"type":"replies"},{"chunks":[{"zh":"可以去初创公司，多面手更好点","en":"You can go to a startup company, a versatile person is better."}],"type":"replies"},{"chunks":[{"zh":"你这个写的太宽泛了，如果有更详细的更好评价比如熟悉 Java 多线程，是怎么给熟悉法？能不能独立完成复杂的高 IO 多线程场景，还是只是在简单业务里面起一个线程池进行批处理？熟悉 JVM ，是知道几个概念，知道内存模型这种。","en":"What you have written is too broad. If there were more details, it would be better to evaluate, for example, how familiar are you with Java multithreading? Can you independently complete complex high IO multithreaded scenarios, or just create a thread pool for batch processing in simple businesses? Are you familiar with JVM in the sense of knowing a few concepts and the memory model?"},{"zh":"还是能做到，给一份生产环境的内存快照、GC 日志能定位解决问题。","en":"Or can you give a memory snapshot and GC log of the production environment to locate and solve the problem?"}],"type":"replies"},{"chunks":[{"zh":"@thulof git 不是结合 idea 更好用么，你说的这几个平时基本用不上，rebase 和 cherrypick 满足大部分提交需求了","en":"@thulof Isn't Git easier to use in conjunction with IDEA? Those you mentioned are basically not used in normal times, rebase and cherrypick meet most submission needs."}],"type":"replies"},{"chunks":[{"zh":"@Mrun 起一个线程池也叫会多线程啊，这种根据 heap dump 日志导入到软件查看内存不是最基本的么","en":"@Mrun Is creating a thread pool also called knowing multithreading? Isn't importing heap dump logs into software to view memory the most basic thing?"}],"type":"replies"},{"chunks":[{"zh":"值 50k.  可以去腾讯华为报道了","en":"Worth 50k. You can go to Tencent or Huawei."}],"type":"replies"}]}
