{
  "id": 1018994,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "久坐怎么护腰呀兄弟们",
          "en": "How to protect your lower back when sitting for long periods, brothers?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "最近开始腰疼了，兄弟们你们是怎么解决久坐腰疼的。",
          "en": "My lower back has started hurting recently, brothers, how do you solve lower back pain from sitting for long periods?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "久坐怎么护腰?问就是不久坐~",
          "en": "How to protect your lower back when sitting for long periods? The answer is: don't sit for long periods~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别等到椎间盘破裂，里面的液体流到全身，压倒腰椎后面的神经再后悔哦～",
          "en": "Don't wait until the intervertebral disc ruptures and the fluid inside flows throughout your body, pressing on the nerves behind the lumbar spine, before you regret it~"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我一天喝八杯水，上厕所六七次每次起来去接水，从来不顺便上厕所都是接完水端回工位，再出去上厕所多走一点是一点",
          "en": "I drink eight glasses of water a day, go to the toilet six or seven times, and get up to get water each time. I never go to the toilet on the way. I always bring the water back to my workstation and then go to the toilet. Every little bit of walking helps."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐 20 分钟就起来手扶桌子把腰前后往复锻炼 4x6 个节拍",
          "en": "Sit for 20 minutes, then get up, hold the table with your hands, and exercise your waist back and forth with 4x6 beats."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wclebb 刚开始 1 个月有效，后面习惯了腰又开始难受。还得平时多锻炼。",
          "en": "@wclebb It's effective for the first month, but then you get used to it and your back starts to hurt again. You still need to exercise more often."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "站着，因为站着说话不腰疼",
          "en": "Stand, because standing and talking doesn't hurt your back."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "毛毯卷着垫着 冷了还能盖",
          "en": "Roll up a blanket and pad it, you can also cover yourself with it when it's cold."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "阻绝+恢复阻绝就是不久坐，勤去接水勤去撒尿恢复就是金刚功或者瑜伽，让腰部恢复下",
          "en": "Prevention + Recovery. Prevention means not sitting for long periods, going to get water frequently, and urinating frequently. Recovery means practicing King Kong exercises or yoga to help the waist recover."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "用公司的百元款办公椅（反正很垃圾的那种），就很容易腰疼。后来自己买了宜家家居，但 400 款的那种也不行，虽然有所缓解，但不撑腰。后来同事买了金豪 B 人工椅，说实话金豪这两个字充满了土味，但设计本身确实 OK 。我咋也不懂，但确实坐上去就觉得很舒服，就冲这坐感我也跟进买了。从此没腰疼。",
          "en": "It's easy to get back pain using the company's cheap office chairs (they are garbage anyway). Later, I bought IKEA furniture myself, but the 400 model didn't work either, although it provided some relief, it didn't support the waist. Then a colleague bought a Gold Hao B ergonomic chair. To be honest, the words 'Gold Hao' are full of tackiness, but the design itself is OK. I don't understand why, but it actually feels very comfortable to sit on, so I bought one too for the sake of the sitting experience. I haven't had back pain since."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正确的坐姿+不久坐+规律运动",
          "en": "Correct sitting posture + not sitting for long periods + regular exercise"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "山羊挺身",
          "en": "Back extensions"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wclebb 我是永艺沃克那款，500 多感觉很鸡肋。下次试试你这款。",
          "en": "@wclebb I have the Yongyi Walker model, which cost over 500 and feels pretty useless. I'll try your model next time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@AboPlus 金刚功，听着很牛皮呀，我去做做攻略。",
          "en": "@AboPlus King Kong exercises, sounds awesome, I'll look into it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首先不能翘二郎腿，其次淘宝或者多多买个米乔同款的腰靠也可以（米乔卖得太贵，买过，和淘宝款差异不大）",
          "en": "First of all, don't cross your legs. Secondly, you can also buy a Mi Qiao-style lumbar support on Taobao or Pinduoduo (Mi Qiao sells them too expensive, I bought one, and there is little difference from the Taobao models)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@perbugwei #7 兄弟，2k+",
          "en": "@perbugwei #7 Bro, 2k+"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个腰靠电脑定时提醒或者买个手环，坐半个小时起来走一下",
          "en": "Buy a lumbar support, set a timer on your computer to remind you, or buy a bracelet. Get up and walk around every half hour."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不久坐，像正常人一样工作生活。不久坐的意思是至少 1 小时走动一圈。我去专家门诊问过，根因是职业，我说是久坐，医生还是强调是职业的问题，其实反思一下可以理解，只有这种职业会强制让你久坐，否则身体发出不舒适信号的时候，人会本能活动放松。我自己每天会锻炼核心和臀部，锻炼是为了核心肌肉减轻腰部压力，帮助维持腰椎稳定。建议挂号咨询医生。",
          "en": "Don't sit for long periods, live and work like a normal person. Not sitting for long periods means walking around at least once an hour. I went to a specialist clinic and asked, and the root cause is the occupation. I said it was sitting for long periods, but the doctor still emphasized the problem of the occupation. In fact, reflecting on it, it can be understood that only this kind of occupation will force you to sit for a long time, otherwise when the body sends uncomfortable signals, people will instinctively move to relax. I exercise my core and glutes every day. Exercise is to reduce the pressure on the lumbar spine with core muscles and help maintain lumbar stability. It is recommended to make an appointment to consult a doctor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去 b 站学几个拉伸动作，每天回家拉伸一下，再锻炼锻炼腰背部肌肉。",
          "en": "Go to Bilibili to learn some stretching exercises, stretch every day when you get home, and then exercise your lower back muscles."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@thfurior iwatch 定时站立那个提醒，不忙的时候还有用，忙起来顾不上了。",
          "en": "@thfurior The iWatch's timed standing reminder is useful when you're not busy, but you can't take care of it when you're busy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@express 确实是总翘二郎腿，现在开始有意识的控制了。",
          "en": "@express Indeed, I always cross my legs. I'm now consciously controlling it."
        }
      ],
      "type": "replies"
    }
  ]
}