{
  "id": 1016412,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "做外包新年开工第一天，工位被取缔",
          "en": "The first day back at work for outsourcing after the new year, the workstations were abolished"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "银行外包，今天回来开工第一天，原来在办公区仅存的 3 个工位被其他项目组占用，现在自己项目组全部挤在会议室办公。",
          "en": "Outsourcing for a bank, today is the first day back to work. The only 3 workstations left in the office area were occupied by other project teams. Now, the entire project team is squeezed into the meeting room to work."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "都做外包了，这种事没什么大不了，只要按时发工资就行，其他无所谓，放宽心就好了。",
          "en": "You're all doing outsourcing, it's no big deal. As long as the salary is paid on time, everything else is irrelevant. Just relax."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "身为外包，要有觉悟，没工位也能干活，就是蹲门口也干活，",
          "en": "As an outsourcer, you have to be aware. You can work even without a workstation, even squatting at the door to work,"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本来今天上班挺难受的，看到你的帖子好了一点。怎么回事？",
          "en": "I was feeling quite down at work today, but I feel a little better after seeing your post. What happened?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这也没啥，可能你们项目重要程度不高，分配的工位少，就只能苦一苦外包了。还见过些有钱的组，不仅工位大你一倍，还预留超多空位，相当于 4 个工位 1 个人用了，工位用来当货架都堆不满，非常奢侈。外包离谱的我就遇到过大厅找块空地搬个小桌子给你当工位的，一开始就几个人贼显眼尴尬，不过后面拼桌的人把空地也挤满了，有时候来救火的正式员工也要来和我们挤，习惯了就不觉得这工位有什么。说到会议室让我想到以前华为的会议室也是时有被霸占做为 xx 项目作战室(关程序员小黑屋)，你们这是也搞了个 xx 作战吧（#狗头",
          "en": "It's nothing much. Maybe your project isn't that important, so you have fewer workstations allocated, and the outsourcers have to suffer. I've also seen some rich teams whose workstations are not only twice the size, but also have lots of extra space. It's like one person using 4 workstations. The workstations are used as shelves but not even enough space to put things on, very extravagant. As for outrageous outsourcing experiences, I've encountered situations where they found an empty space in the hall and brought a small table for you to use as a workstation. In the beginning, a few people were very conspicuous and embarrassed, but later, the people who shared tables also filled the empty space. Sometimes the formal employees who came to the rescue also had to squeeze with us; after getting used to it you don't think much of the workstation. Speaking of the meeting room, it reminds me of how Huawei's meeting rooms used to be occupied as combat rooms for xx projects (locking programmers in a black room). You guys are also doing some xx combat, right? (#dog head"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "会议室还好吧，只要是闲置的，不会因为甲方要开会的时候，把你们撵出来那么尴尬。。。有一次我去现场协助，发现在那边驻场的同事在仓库搞张桌子办公。。",
          "en": "The meeting room is alright, as long as it's idle, you won't be kicked out when the client needs to hold a meeting, which would be embarrassing... Once I went to the site to assist, and found that my colleagues stationed there were working at a table in the warehouse."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Ma4cus #37 先忍忍过度，趁早上岸就好了 。",
          "en": "@Ma4cus #37 Just bear with it for now, and it'll be better to get a job elsewhere soon."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "钱够不够？还够的话，忍住；不够的话，马上找下家。",
          "en": "Is the money enough? If it is, endure; if not, find another job immediately."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还得是前司，外包就是爸爸，自有的新来了都没地儿坐。乙方丙方还天天叼我们甲方，真的是离谱......领导睁一只眼闭一只眼，也不知道项目回扣吃了多少。",
          "en": "It's still the previous company. Outsourcing is like the boss, even new internal employees don't have a place to sit. The B and C parties also nag our client every day; it's really outrageous... The leaders turn a blind eye, and it's unknown how much the project rebates have eaten."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "然后呢？",
          "en": "And then?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "汇丰是吧",
          "en": "HSBC, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@42joker 不是汇丰。汇丰外包很多？经常有人提起",
          "en": "@42joker Not HSBC. Does HSBC outsource a lot? People mention it often"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Ma4cus 国内移动工位 外包 想到汇丰比较多",
          "en": "@Ma4cus Thinking of HSBC more often for domestic mobile workstations and outsourcing"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "外包就这点不好，没有人权，所以才不建议大家去做外包",
          "en": "That's the bad thing about outsourcing; there are no human rights, so I don't recommend everyone to do outsourcing"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@42joker 汇丰反而不怎么要求驻场，办公室正式员工都不够坐",
          "en": "@42joker HSBC doesn't even require on-site presence that much. There aren't enough seats for the formal employees in the office."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "办公室独立的空间不是挺好的吗？",
          "en": "Isn't having an independent space in the office great?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DAMNYOU 会议室一张大方桌，围着坐，很拥挤，不舒服",
          "en": "@DAMNYOU A large square table in the meeting room, sitting around it is crowded and uncomfortable"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jimmyczm 真的没人权，纯纯三等公民",
          "en": "@jimmyczm Really no human rights, pure third-class citizens"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sbldehanhan 打大伙当小丑",
          "en": "@sbldehanhan Treat everyone like clowns"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看起来你们外包不止 3 个人吧，，那原来 3 个工位怎么坐的？？一个工位坐两个人？？",
          "en": "It looks like there are more than 3 of you outsourced people, right? How did you sit in those 3 workstations before?? Two people sharing one workstation??"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这个叫项目室，是福利",
          "en": "You have a project room, that's a perk"
        }
      ],
      "type": "replies"
    }
  ]
}