{
  "id": 1015208,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "问个支持 LTE/5G 的笔记本",
          "en": "Ask for a laptop that supports LTE/5G"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "1.支持 SIM 卡上网。热点太麻烦了，有时候搜不到；经常带着笔记本出门，人暂时离开电脑时，手机也不能一块带走，以免断网。不内置模块的话，起码是可加模块的。\r\n2.支持 WIFI6 。\r\n3.内存/硬盘支持插槽，而不是完全的板载。\r\n4.支持 TypeC 口给笔记本充电。\r\n5.分辨率 1920×1080 以上。\r\n\r\n查了一下，联想 ThinkPad X1 Carbon 2023 不错，但板载内存。华为的 matebook E 也板载。surface 好像也不合适。预算不超过 1.5 万",
          "en": "1. Supports SIM card internet access. Hotspots are too troublesome; sometimes they can't be found. I often take my laptop out, and when I leave the computer temporarily, I can't take my phone with me to avoid disconnection. If it doesn't have a built-in module, at least one that can be added.\r\n2. Supports WIFI6.\r\n3. Supports memory/hard drive slots, rather than being completely onboard.\r\n4. Supports Type-C port to charge the laptop.\r\n5. Resolution of 1920×1080 or above.\r\n\r\nI checked, the Lenovo ThinkPad X1 Carbon 2023 is good, but it has onboard memory. Huawei's Matebook E is also onboard. Surface doesn't seem suitable either. Budget is no more than 15,000."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@EVJohn 理论上手机没 cpe 稳定，手机会限制热点的功耗使用。",
          "en": "@EVJohn Theoretically, mobile phones are not as stable as CPE, and mobile phones will limit the power consumption of hotspots."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "GPD Win Max2 2023   支持 4GLTE  但屏幕只有 10 英寸，内存可以扩展建议你买个 5GCPE  虽然个头大了，但是稳定",
          "en": "GPD Win Max2 2023 supports 4GLTE, but the screen is only 10 inches, and the memory can be expanded. It is recommended that you buy a 5GCPE, although it is larger, it is stable"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "hp 的战 X 。可以直接买有 5g 模块的，也可以买没有 5g 模块的，便宜好多，然后 taobao 上买个拆机的模块自己装",
          "en": "HP's Zhan X. You can buy one with a 5G module directly, or you can buy one without a 5G module, which is much cheaper, and then buy a disassembled module on taobao and install it yourself"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Carbon 2024",
          "en": "Carbon 2024"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://www.fujitsu.com/hk/imagesgig5/Fujitsu_LIFEBOOK_U94A_brochure.pdf可以开增值税发票",
          "en": "https://www.fujitsu.com/hk/imagesgig5/Fujitsu_LIFEBOOK_U94A_brochure.pdf Can issue VAT invoices"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "国内好像生产这种的还真不多，多数还是买个 5g mifi 棒子",
          "en": "There don't seem to be many such products produced domestically. Most people still buy a 5g mifi stick"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SenLief 宝贵的 USB 口啊",
          "en": "@SenLief Precious USB ports"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ThinkPad T14",
          "en": "ThinkPad T14"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@abc8678 也有那种自带电源的，不过话说回来现在的电脑接口太少了，估计都得上拓展钨",
          "en": "@abc8678 There are also those with their own power supply, but come to think of it, the current computer interfaces are too few, and it is estimated that expansion would be necessary."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SenLief 我尝试过光影猫，在上面装了 XX 上网插件，当做随身软路由。结果不知是固件还是硬件问题，开机一下下就自动死机了。不断换固件也还是没解决",
          "en": "@SenLief I tried Guangying Cat, installed XX internet access plugin on it, and used it as a portable soft router. As a result, I don't know if it's a firmware or hardware problem, but it automatically crashes shortly after booting. Constantly changing the firmware didn't solve the problem either"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能不能装硬盘位上？",
          "en": "Can it be installed on the hard drive slot?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我那天看到有能放上面的拓展件",
          "en": "I saw an expansion component that can be placed on top the other day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SenLief 拖着一根线，拿着个\"吊针\"出门……",
          "en": "@SenLief Dragging a cable and going out with a \"drip\"..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还不如买台手机，一台 5g 手机比 5g 随身 WiFi 便宜，还可以双卡",
          "en": "It's better to buy a mobile phone. A 5G mobile phone is cheaper than a 5G portable WiFi, and it can also be dual SIM"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@abc8678 老哥光影猫卖吗",
          "en": "@abc8678 Bro, are you selling the Guangying Cat?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不知道你需求是什么样的。我是一个 surface go 2 lte 版的。 平时远程有个电脑 24 小时开机，我就拿来远程用。",
          "en": "I don't know what your needs are. I have a surface go 2 LTE version. I usually have a computer running 24 hours remotely, and I use it for remote access."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@abc8678 超能牛，500 左右，但是不建议，玩了那么久 cpe 之后才发现手机更稳定些",
          "en": "@abc8678 Chaoneng Niu, around 500, but not recommended. After playing with CPE for so long, I found that mobile phones are more stable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ThinkPad X1 Carbon AI 2024 ，送一年的免费 5G 流量",
          "en": "ThinkPad X1 Carbon AI 2024, offers one year of free 5G data"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "5G 模块还是比较贵，估计不低于 1500 ，4G 的估计百十块，记得 T14 是有 4G 的版本",
          "en": "5G modules are still relatively expensive, probably not less than 1500, 4G is estimated to be around a hundred, remember that T14 has a 4G version"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@lucifer9 好的，选这个了，感谢老哥！",
          "en": "@lucifer9 OK, I'll choose this, thank you bro!"
        }
      ],
      "type": "replies"
    }
  ]
}