{
  "id": 1016167,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "预算五六万买二手车",
          "en": "Budget of 50,000 to 60,000 yuan for a used car"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "坐标成都\r\n\r\n驾照拿了有十年，但基本没有开过车\r\n\r\n想着开车应该算一个基本技能\r\n\r\n30 岁了 好像也该有辆车\r\n\r\n就想着买辆二手车来练练手（也不想开别人的车来练 怕麻烦\r\n\r\n也利于交友、扩大出行半径\r\n\r\n----\r\n\r\n关于车型：\r\n\r\n好像就相中了`高尔夫 7 的 1.6`（知道肉。\r\n\r\n关于渠道：\r\n\r\n身边有个朋友是专门卖二手车的，也一直关注 B 站一个 UP 主`合肥 94 看车`，感觉挺靠谱，从放心的角度的来看就想从这两个渠道看看，就是不知道异地购二手车麻不麻烦。\r\n\r\n\r\n看看 V 友们有其它建议没有",
          "en": "Location Chengdu\r\n\r\nI've had my driver's license for ten years, but I basically haven't driven.\r\n\r\nI think driving should be considered a basic skill.\r\n\r\nI'm 30 years old and it seems I should have a car.\r\n\r\nSo I'm thinking of buying a used car to practice (I don't want to practice driving other people's cars, it's troublesome.\r\n\r\nIt's also conducive to making friends and expanding the radius of travel.\r\n\r\n----\r\n\r\nAbout the car model:\r\n\r\nI seem to have taken a liking to the `Golf 7 1.6` (I know it's sluggish.\r\n\r\nAbout the channels:\r\n\r\nI have a friend who specializes in selling used cars, and I have also been following a B station UP host `Hefei 94 Car` , who feels quite reliable. From the perspective of peace of mind, I want to look at these two channels, I just don't know if it's troublesome to buy a used car from another location.\r\n\r\n\r\nSee if V friends have other suggestions"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "秦 plus 798 ，不用 8w ，还买二手烂油车？",
          "en": "Qin plus 798, don't need 80,000, why buy a used gas guzzler?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 稍微加点买新车2. 如果为了练手买二手车的话 一两万买个就行",
          "en": "1. Add a little more to buy a new car. 2. If you want to practice driving, buy a used car for 10,000 to 20,000 yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看到某个楼层，去年刚买的车，玻璃水都不知道哪里加就搁那推荐，我笑死阿特吱为啥卖不好，真没有数吗？我家三台车，一台合资，两台国产，那唯一的合资就是二手的，买来中控影像是好的，一年不够就坏了，修起来麻烦还不便宜，就一直没修，没人想开，但又卖不出啥价格，就放那，啥配置没有，但又放不坏，打不着搭搭电就可应急用我老婆开惯我的领克，过年开她亲戚的丰田，嫌弃的一批，说又慢又吵方向盘又玩具，一堆遗老围着我的 03 说我的胎没气，开烂鬼两田的没见过我那扁平比的轮胎以为没气了海豚两万五公里了，连异响都没，领克还有点异响，当然比亚迪的烂鬼底盘真垃圾，抛开底盘感受，三台车我还是最喜欢海豚，纯电随踩随有的动力实际太爽了随便说一下车子的里程：二手合资十万公里（买来就是 8w 公里）、领克 03 六万五公里，海豚两万公里",
          "en": "I saw a certain floor, the car was bought last year, and the windshield washer fluid didn't even know where to add it, and they were recommending. I'm laughing. Why doesn't Atiz sell well? Do they really not know? I have three cars at home, one joint venture and two domestic brands. The only joint venture is a used one. The central control image was good when I bought it, but it broke down in less than a year. It's troublesome and not cheap to repair, so I haven't repaired it. No one wants to drive it, but it can't be sold at a good price, so I just leave it there. It has no configuration, but it won't break down. It can be used in an emergency by jump-starting. My wife is used to driving my Lynk & Co, and she was very disgusted when she drove her relatives' Toyota during the Chinese New Year, saying it was slow, noisy, and the steering wheel was a toy. A bunch of old-timers surrounded my 03 and said my tires were flat. They drove the rotten two fields car and had never seen my low-profile tires, thinking they were flat. The Dolphin has traveled 25,000 kilometers and doesn't even have any abnormal noises. The Lynk & Co has a little bit of abnormal noise. Of course, the rotten chassis of BYD is really junk. Aside from the chassis experience, I still like the Dolphin the most among the three cars. The power of pure electricity that can be applied at any time is really great. Just to mention the mileage of the cars: used joint venture cars have 100,000 kilometers (80,000 kilometers when bought), Lynk & Co 03 has traveled 65,000 kilometers, and the Dolphin has traveled 20,000 kilometers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "https://github.com/commaai/openpilot/blob/master/docs/CARS.md列表里选个预算内的(",
          "en": "Select one within the budget from the https://github.com/commaai/openpilot/blob/master/docs/CARS.md list"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果预算 5 6 万,你问 94 他一定会跟你说,这个价格直接加点钱买新车!  我建议在降低预算到 3 万左右。",
          "en": "If the budget is 50,000 to 60,000, if you ask 94, he will definitely tell you to buy a new car for this price! I suggest reducing the budget to around 30,000."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "反正以练手为目的，几千块买个雪铁龙，撞到稀巴烂都不用心痛。至于什么朋友 UP 主，反正我个人是不相信的，朋友是用来坑的，除非是身边仅有的几个说心底话那种。",
          "en": "Anyway, with the goal of practicing, buy a Citroen for a few thousand yuan. You won't feel heartbroken even if it crashes into pieces. As for friends and UP hosts, I personally don't believe them. Friends are for tricking you, unless they are the few who speak from their hearts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总之要相信科学，科学 =>价格就是几乎是真理。5w 的二手车，可以看看我的帖子，我去年买了。我比较推荐你买 5-7w 的阿特兹。那些啥秦，不要买了，驾驶质感跟 B 级不是一个档次的。可以考虑 2 田的车，全球车型这些 都是整个地球人帮你赛选过的，不会踩啥大坑。你想可以话 8w 完全买到 B 级的凯美瑞，雅阁，阿特兹那些。当然秦的混动经济好一些。买车 5w 跟 6w 是完全不一样的。新手买车一定要主打省心，我目前还不知道玻璃水在哪里加。。。除非你平常时间很多，喜欢折腾研究，就可以扩大下范围，总之相信科学，相信老人言。",
          "en": "In short, believe in science, science => price is almost the truth. For a 50,000 yuan used car, you can check my post, I bought one last year. I recommend you buy an Atz for 50,000-70,000 yuan. Don't buy those Qin models, their driving feel is not on the same level as B-class cars. You can consider 2 Toyota cars, global models, these are all selected by people all over the world, you won't step on any big pit. If you want, you can completely buy B-class Camrys, Accords, and Atzs for 80,000 yuan. Of course, Qin's hybrid is more economical. Buying a car for 50,000 and 60,000 is completely different. Beginners must focus on peace of mind when buying a car, I still don't know where to add the windshield washer fluid... Unless you have a lot of free time and like to tinker and research, you can expand your scope, in short, believe in science, believe in the elders' words."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 有选择了 帮忙更新一下，同想法小白一枚，感谢感谢",
          "en": "OP has made a choice, please help update. I'm a newbie with the same thoughts, thank you"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不知道建议买 1-2W 二手车的朋友自己买过没，不是买完以后出事故你修不修，是车到你手了以后你就开始修车之旅了。1-2W 的二手车，只建议日系、手动，并且不建议小白买这种二手车，买车会被坑，修车也会被坑。比较建议 4S 店卖的官方二手车，或者车龄一两年，公里数少的准新车，起码省个税钱。至于纯电、混动，我没考虑过，也不会考虑。",
          "en": "I don't know if friends who suggest buying a 10,000-20,000 yuan used car have bought one themselves. It's not about whether you repair it after an accident, it's that you will start your car repair journey after the car is in your hands. For a 10,000-20,000 yuan used car, I only recommend Japanese cars, manual transmission, and I don't recommend newbies to buy this kind of used car. You will be cheated when buying the car, and you will also be cheated when repairing the car. I recommend officially certified used cars sold by 4S stores, or almost new cars with a car age of one or two years and low mileage, at least saving some tax money. As for pure electric and hybrid, I haven't considered them and won't consider them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在新车降价这么多，为什么要考虑二手车？",
          "en": "With new cars dropping prices so much now, why consider used cars?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "5/6 万买个新车也够了，二手车不值得",
          "en": "50,000/60,000 is enough to buy a new car. Used cars are not worth it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Victor215 预算在那，想着二手车有些性价比，不想花个十万左右去买辆车，现在很多新车的中控不喜欢。",
          "en": "@Victor215 The budget is there, considering that used cars have some cost-effectiveness, I don't want to spend around 100,000 yuan to buy a car, and I don't like the central control of many new cars now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jeristiano 老哥说的有道理 我去和他们聊聊看",
          "en": "@jeristiano What the old man said makes sense, I'll go talk to them and see"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "秦 plus 7.98 万，比二手旧油车好开太多",
          "en": "Qin plus 79,800 yuan, is much easier to drive than a used gasoline car"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "整一个 7.98 万的秦 dmi 吧，对长时间没摸过车的人来说自动挡其实是更好的选择。没有换挡的手忙脚乱，开 5 公里就明白怎么开了",
          "en": "Get a 79,800 yuan Qin dmi, automatic transmission is actually a better choice for people who haven't driven for a long time. There's no fumbling around with gear changes, you'll know how to drive after 5 kilometers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别买本田特定的那几款车，容易被盗",
          "en": "Don't buy those specific Honda models, they are easy to be stolen"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wetalk 哪几款？我倒是看上思域了",
          "en": "@wetalk Which models? I'm interested in the Civic"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "稍微加点买新的秦或者艾瑞泽 5 多好。",
          "en": "Add a little more to buy a new Qin or Arrizo 5, it's better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同 30  年轻交给了房贷，同样也新手，觉得二手价格不香，看了科鲁泽、秦、轩逸、宝来   还在纠结中，觉得还会有价格空间",
          "en": "Also 30, my youth was given to the mortgage, also a newbie, feel that the used car price is not good, looked at Cruze, Qin, Sylphy, Bora still tangled, feel that there will be price room"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这价位选双田，主打就是一个省心",
          "en": "Choose Toyota and Honda at this price point, the main thing is peace of mind"
        }
      ],
      "type": "replies"
    }
  ]
}