{
  "id": 1018755,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "[外卖] 哪家的粥能吃？胃不好就吃粥，结果闹肚子了……",
          "en": "[Takeout] Which brand of congee is safe to eat? I ate congee because I have a sensitive stomach, but it gave me diarrhea..."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "前阵子吃辣太多，胃一段时间都感觉很难受，吃老乡鸡时肚子会痛，就想着吃个粥。不冷、不辣，让胃修养修养，完美！",
          "en": "I ate too much spicy food recently, and my stomach felt uncomfortable for a while. My stomach would hurt when I ate at Laoxiangji, so I thought about eating congee. Not cold, not spicy, let my stomach rest, perfect!"
        },
        {
          "zh": "\r\n\r\n然后吃了三米粥铺，直接闹肚子了……一个字，绝！",
          "en": "\r\n\r\nThen I ate Sanmi Congee and got diarrhea directly... One word, amazing (in a bad way)!"
        },
        {
          "zh": "\r\n\r\n曼玲比三米干净点，部分店好点，部分店也会闹肚子。",
          "en": "\r\n\r\nManling is cleaner than Sanmi, some stores are better, but some stores also cause diarrhea."
        },
        {
          "zh": "\r\n\r\n在杭州时，吃了个地方的粥铺，几次了都没闹过肚子，倒挺好。",
          "en": "\r\n\r\nWhen I was in Hangzhou, I ate at a local congee shop, and I didn't get diarrhea a few times, which was pretty good."
        },
        {
          "zh": "\r\n\r\n就来问问，大家有什么推荐的“外卖粥店”",
          "en": "\r\n\r\nSo I'm asking, does anyone have any recommendations for 'takeout congee shops'?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "送过外卖的来回答一下，三米、曼玲这种纯外卖连锁粥店是我见过最脏的一类，能别点就别点。商家详情看看有实体店的潮汕砂锅粥一类的店会好一些",
          "en": "Let someone who has delivered takeout answer this. Sanmi and Manling, these pure takeout chain congee shops are the dirtiest I've ever seen. Don't order if you can. Check the store details and look for Chaoshan casserole congee shops with physical stores, they will be better."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "胃不好更不应该吃粥啊",
          "en": "You shouldn't eat congee if you have a bad stomach."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "胃不好吃粥？吃粥伤胃！",
          "en": "Eat congee with a bad stomach? Eating congee hurts the stomach!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不如吃点药",
          "en": "Better to take some medicine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己买点小米做呗，粥做起来多简单的",
          "en": "Why not buy some millet and make it yourself? Making congee is so simple."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉没有哪个品牌能保证所有的店品质一致，这个主要还是看店里老板的良心…哪一家不闹肚子下次可以只点这一家。",
          "en": "I feel that no brand can guarantee the consistent quality of all its stores. It mainly depends on the conscience of the store owner... Next time, only order from the one that doesn't give you diarrhea."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那肯定是选实质上有实体店铺，而不是只是装个门面实际纯外卖的店啊",
          "en": "Of course, choose a store that actually has a physical store, rather than just a facade for a purely takeout operation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "肯德基的早餐粥应该没问题",
          "en": "KFC's breakfast congee should be fine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "究极解决方案是自己熬，其次是肯德基的粥，再次是本地的小早餐店。曼玲这种是纯外卖店，里面环境一言难尽。",
          "en": "The ultimate solution is to cook it yourself. Next is KFC congee, then local small breakfast shops. Manling is a pure takeout shop, and the environment inside is indescribable."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你说的这俩店..都是黑作坊.建议寻找 有实体门店的连锁快餐店",
          "en": "The two stores you mentioned are all black workshops. It is recommended to look for chain fast food restaurants with physical stores."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "粥养胃本身就是伪科学，胃不好多吃蔬菜，清淡的食物。",
          "en": "Congee nourishing the stomach is a pseudo-science. If you have a bad stomach, eat more vegetables and light food."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "胃不好不要喝粥，多吃熟菜，水果，饮食清淡，细嚼慢咽",
          "en": "If you have a bad stomach, don't drink congee. Eat more cooked vegetables, fruits, eat a light diet, and chew slowly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "曼玲的线下店铺照你看过以后就知道有多脏多乱了粥想喝的话，建议还是肯德基了，卫生还算好一些，或者酒楼的早茶餐厅因为粥的利润不高，很少有店铺专门做的，也只有曼琳这种早餐点做了你吃老乡鸡肚子痛，是因为你可能吃不了辣，胃痛也不适合吃粥，吃粥反而让胃酸分泌加剧#6 楼建议非常中肯    潮汕砂锅粥还卫生一点，就是贵很多，分量也多，而且晚上才有",
          "en": "After you see the photos of Manling's offline stores, you will know how dirty and messy they are. If you want to drink congee, I suggest KFC, the hygiene is better, or the morning tea restaurant in the restaurant because the profit of congee is not high, very few shops specialize in it, and only breakfast points like Manling do it. You eat Laoxiangji Your stomach hurts because you may not be able to eat spicy food, and stomach pain is not suitable for eating porridge, and eating porridge will increase gastric acid secretion. # 6 The floor suggestion is very pertinent Chaoshan casserole porridge is more hygienic, but it is much more expensive and more quantity. Also only available at night."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "胃不好先去医院检查下是什么问题，有问题就治疗，真要是胃不好也不建议喝粥，还是要吃有营养的东西",
          "en": "If you have a bad stomach, first go to the hospital to check what the problem is. If there is a problem, treat it. If you really have a bad stomach, it is not recommended to drink congee. You still have to eat nutritious things."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喝粥吃面不养胃![喝粥吃面不养胃，关于胃的几个误区]( https://mp.weixin.qq.com/s/36CkpgvCJIiCbcYfln2Zgw)",
          "en": "Drinking congee and noodles does not nourish the stomach! [Drinking congee and noodles does not nourish the stomach, several misunderstandings about the stomach] (https://mp.weixin.qq.com/s/36CkpgvCJIiCbcYfln2Zgw)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "点外卖先看看是不是城中村的店铺，城中村的店铺那种卫生条件菌落超标，别说肠胃不好的人，正常人都能给你干趴下。",
          "en": "When ordering takeout, first check whether it is a shop in a village in the city. The sanitary conditions and colony counts of such shops in villages in the city exceed the standards. Let alone people with bad stomachs, normal people can be knocked down."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拉肚子应该吃干的啊。。 还喝粥。。其次粥不是跟好做吗 4 分之一米饭的米量狂加水 加到你满意为止外卖点榨菜或着萝卜你喜欢的菜这种难度堪称没有难度。。。",
          "en": "You should eat dry food when you have diarrhea. . Still drinking congee. . Secondly, isn't congee easy to make? Add a quarter of the amount of rice you would use for rice, add water wildly until you are satisfied, and order pickled mustard or radish. The difficulty of the dishes you like is simply not a difficulty at all. . ."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "刚去世的瞎书，就因为吃曼玲导致上吐下泄，具体你上网找找相关的内容吧。",
          "en": "The recently deceased Blind Book, due to eating Manling, had vomiting and diarrhea. For details, please search online for related content."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这玩意不是看当地有啥选的就一家家试的么？例如在深圳我就觉得\"米已成粥\"这牌子的店的东西不错",
          "en": "Isn't this about trying each store based on what's available locally? For example, in Shenzhen, I think the food at \"Mi Yi Cheng Zhou\" is good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己煮",
          "en": "Cook it yourself."
        }
      ],
      "type": "replies"
    }
  ]
}