{
  "id": 1018024,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "3 月 1 日起快递不得擅自放驿站：违者将被罚款",
          "en": "Express deliveries must not be placed at stations without authorization from March 1: violators will be fined."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "是不是以后上门的快递得延迟几天了？",
          "en": "Will door-to-door deliveries be delayed by a few days from now on?"
        },
        {
          "zh": "或者快递会普遍涨价？",
          "en": "Or will express delivery prices generally increase?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "挺好的，本来就该这样，默认没有让放驿站和快递柜就该送上门，而且送上门时至少应该做到好好放门口并且敲门或者按门铃之后再走。",
          "en": "Good, it should be like this. By default, if there's no permission to leave it at a station or in a locker, it should be delivered to the door. And when delivering to the door, at least put it properly at the door, knock, or ring the doorbell before leaving."
        },
        {
          "zh": "没有规则限制，不自觉的人的底线只会越来越低。",
          "en": "Without rules, the bottom line for those who lack self-awareness will only get lower and lower."
        },
        {
          "zh": "现在有些快递员就没点职业素养，要么不管是什么东西、收件信息写没写要求送上门，直接放驿站就不管了，联系电话直接关机；要么是走到你门口还有一段距离的位置直接把包裹往门口一丢，拍个照就走了，就离谱…",
          "en": "Some couriers nowadays lack professionalism. Either they put everything directly at the station regardless of what it is or whether the recipient information specifies delivery to the door, and then don't care anymore, turning off their contact phone; or they throw the package towards the door from a distance away and take a photo before leaving, which is ridiculous..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@locoz #32 您看，這就來了，說得多麼的居高臨下啊，是他自己不選擇高薪的工作（潛臺詞：所以活該）。",
          "en": "@locoz #32 Look, here it comes, speaking with such condescension. It was his own choice not to choose a high-paying job (implied: so he deserves it)."
        },
        {
          "zh": "有沒有想起來那句話：門是開着的，是他們自己不跑。",
          "en": "Does it remind you of the saying: the door is open, they just don't run."
        },
        {
          "zh": "也說得真輕巧，快遞員可以選擇有空了再送上門。",
          "en": "It's said so lightly, that couriers can choose to deliver to the door when they have time."
        },
        {
          "zh": "快遞員還有空嗎？",
          "en": "Do couriers have any time?"
        },
        {
          "zh": "有去真正蹲下身子去瞭解過人家的生活狀態嗎？",
          "en": "Have you ever really stooped down to understand their living conditions?"
        },
        {
          "zh": "即便是送快遞櫃，都常常要幹道凌晨去，然後一早又要起牀重複前一日的生活。",
          "en": "Even delivering to lockers often requires working until the early hours of the morning, and then getting up early to repeat the previous day's life."
        },
        {
          "zh": "甚至很多人根本就沒有牀，就蹲在快遞遞送點眯着對付一下。",
          "en": "Many people don't even have a bed, they just squat at the delivery point and doze off."
        },
        {
          "zh": "還有，說什麼打電話本身並不需要一直等着，連一點基本的常識都沒有，你自己倒是去試試在派送的路上邊走邊打電話啊！",
          "en": "Also, saying that making a phone call doesn't require waiting all the time shows a lack of basic common sense. Why don't you try making calls while walking on the delivery route yourself!"
        },
        {
          "zh": "帶着一車快遞，一個一個地方跑到位了，從車裏拿出快遞來，開始打電話，打不通，然後奔赴下一個地方，再重複同樣的過程，這叫不需要時間來同步等待是吧？",
          "en": "Carrying a carload of deliveries, running to each place one by one, taking out the delivery from the car, starting to call, and not getting through, then rushing to the next place, repeating the same process, this is called not needing time to wait, right?"
        },
        {
          "zh": "你以爲送快遞的都是摸魚的程序員呢，沒人送那些快遞就能自己送出去，還可以通過糊弄寫報表找老闆給自己邀功？",
          "en": "Do you think couriers are all programmers who slack off? That those deliveries can send themselves out if no one delivers them, and can also get credit from the boss by fooling around with reports?"
        },
        {
          "zh": "我覺得閣下恰恰很好地論證了我 post 中的論點，你很好地展示了一個典型的身處社會“高層”、卻根本不具備任何人文關懷、不具備任何對公平、公正的人性追求的精緻利己主義者的形象。",
          "en": "I think you have very well demonstrated the argument in my post. You have very well demonstrated the image of a typical sophisticated egoist who is in the 'upper class' of society, but does not have any humanistic care, or any pursuit of fairness and justice."
        },
        {
          "zh": "你之所以維護那所謂的法律、條例，僅僅是因爲它對你目前有利而已，並不是因爲它具有什麼公正可言。",
          "en": "The reason you uphold the so-called laws and regulations is only because they are currently beneficial to you, not because they have any fairness."
        },
        {
          "zh": "對了，相信你確實沒有聽說過什麼“無知之幕”，對吧？",
          "en": "By the way, I believe you have never heard of the 'veil of ignorance', right?"
        },
        {
          "zh": "利益完全不相關，我自己並不從事快遞行業。",
          "en": "Completely unrelated to the interests, I am not engaged in the express delivery industry myself."
        },
        {
          "zh": "所有快遞員給我提前打電話，我都會直接告訴他們，下次用不着提前給我說，直接給我丟到快遞櫃去就行，等我空了再去取，我一定不會投訴。",
          "en": "Whenever a courier calls me in advance, I will tell them directly that they don't need to tell me next time, just throw it in the locker, and I will pick it up when I'm free, and I will definitely not complain."
        },
        {
          "zh": "不再回覆。",
          "en": "No further replies."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个政策的目的并不是取缔快递柜和驿站，而是给用户选择权，有些快递员现在电话都不打一个就放柜子了。",
          "en": "The purpose of this policy is not to abolish express lockers and stations, but to give users a choice. Some couriers now put things in the locker without even making a phone call."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "快递默认放驿站从程序员的思维来看是正确的，快递放驿站跟上门当面送收货人的区别其实就相当于是异步与同步的区别，cpu 不需要同步等待上一段代码执行完才执行下一段代码，而是告诉某个线程你有空就去执行某个任务，完成了通知 cpu ，cpu 再回调，这是异步执行，不会因为某段程序没执行完卡在那里耽误时间。",
          "en": "From a programmer's perspective, it is correct to put the express delivery at the station by default. The difference between putting the express delivery at the station and delivering it to the recipient in person is actually equivalent to the difference between asynchronous and synchronous. The CPU does not need to synchronously wait for the previous piece of code to be executed before executing the next piece of code, but instead tells a certain thread to execute a certain task when you have time, and notifies the CPU when it is completed, and the CPU then calls back. This is asynchronous execution, and it will not be stuck there and delay time because a certain piece of program is not executed."
        },
        {
          "zh": "快递放驿站，同时发个短信通知收件人，收件人收货后扫描收货码自动签收，这就是异步，可以大幅提高快递系统的效率，收件人也可以选择在方便的时候自行取件；",
          "en": "The express delivery is placed at the station, and a text message notification is sent to the recipient at the same time. After the recipient receives the goods, they scan the receipt code to automatically sign for it. This is asynchronous, which can greatly improve the efficiency of the express delivery system, and the recipient can also choose to pick up the goods by themselves when it is convenient."
        },
        {
          "zh": "送货上门等待用户当面签收这是同步，快递员要通知收件人在某个时间段送货，收件人需要随时留意快递员的电话不能错过，效率下降成本提升，这是二十年前电商刚起步阶段的模式。",
          "en": "Delivery to the door and waiting for the user to sign in person is synchronous. The courier has to notify the recipient to deliver the goods at a certain time, and the recipient needs to pay attention to the courier's phone at any time and cannot miss it. The efficiency decreases and the cost increases. This is the model of the early stage of e-commerce 20 years ago."
        },
        {
          "zh": "初代计算机都是同步的，所以速度慢，执行简单任务也会卡顿，现代计算机都是异步的，所以速度快，即使是大型程序也能运行流畅。",
          "en": "The first generation computers were all synchronous, so they were slow, and even performing simple tasks would be slow. Modern computers are asynchronous, so they are fast, and even large programs can run smoothly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Terry166 驿站要是开在楼下那确实是提高效率，要是离你一公里你就不这么想了",
          "en": "@Terry166 If the station is downstairs, it really improves efficiency. You wouldn't think so if it's a kilometer away from you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那些因爲自己給快遞員付了不到一元錢，就自任上帝，堅持認爲快遞員必須得上門，且認爲快遞員的收入低與自己無關的人，我的看法是，他或許身處社會的頂層，但很難稱得上真正的人，因爲在他的心中並不存在對“公正”、“人性”這類人類價值觀的追求，當然也並不可能聽說過“無知之幕”。",
          "en": "For those who consider themselves God because they paid the courier less than one yuan, insist that the courier must deliver to the door, and believe that the courier's low income has nothing to do with them, my view is that they may be at the top of society, but it is difficult to call them a real person, because they have no pursuit of human values such as 'justice' and 'humanity' in their hearts, and of course it is impossible to have heard of the 'veil of ignorance'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@redmoonisnil 驿站做免费迷你仓放快递正合我意呢，送上门我还嫌麻烦，还要在家等他们，开门慢一点那脸色贼难看，更离谱的还有直接扔门口电话也不打。",
          "en": "@redmoonisnil It's just right for me to have the station as a free mini-warehouse to put the express delivery. I find it troublesome to have it delivered to the door. I have to wait for them at home, and their faces are very ugly if I open the door a little slowly. What's even more outrageous is that they throw it directly at the door without calling."
        },
        {
          "zh": "不过上有政策，下有对策，我觉得没那么容易就送上门。",
          "en": "However, there are policies above, and countermeasures below. I don't think it will be so easy to deliver to the door."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@efcndi #28 快递员的收入低确实与收件人无关，做快递员是很多他自己的选择产生的结果，接受在一个低薪资的公司干活也是他自己的选择。",
          "en": "@efcndi #28 The courier's low income really has nothing to do with the recipient. Being a courier is the result of many of his own choices, and accepting to work in a low-paying company is also his own choice."
        },
        {
          "zh": "收件人可以去体谅快递员因为快递数量多、忙不过来的难处，主动允许快递员不用送上门或等有空了再送上门，甚至在快递送上门时递上一瓶水、一个红包，但这是情分，不是本分。",
          "en": "The recipient can understand the courier's difficulties because of the large number of deliveries and being too busy, and actively allow the courier to not deliver to the door or wait until they have time to deliver to the door, or even hand over a bottle of water or a red envelope when the delivery is delivered to the door, but this is a favor, not a duty."
        },
        {
          "zh": "收件人没有任何与快递员共情的义务，在没有允许选择其他方案的时候快递员就应该送上门，这是最基本的规则，是快递员本就有的义务。",
          "en": "The recipient has no obligation to empathize with the courier. When there is no permission to choose other options, the courier should deliver to the door. This is the most basic rule and the courier's inherent obligation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这算多数人的暴政吗，收快递的人倒是高兴了，送快递的人就苦了",
          "en": "Is this the tyranny of the majority? The people who receive the express delivery are happy, but the people who deliver the express delivery are suffering."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在送一单快递到快递员手里可能就五六毛钱，这个政策的结果就是要么快递涨价，要么积压在网点。",
          "en": "Now the courier may only get five or six cents for delivering a single express delivery. The result of this policy is either that the express delivery price will increase or that it will be backlogged at the stations."
        },
        {
          "zh": "之前三通一达就有不少网点承包不下去快递直接积压。",
          "en": "Previously, many stations of STO, Yunda, and YTO could not contract and the express delivery was directly backlogged."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "典型的懒政。",
          "en": "Typical lazy governance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "政策的目的1.讓非正常的低郵費漲價2.增加就業",
          "en": "The purpose of the policy is 1. to increase abnormally low postage rates 2. to increase employment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让市场调节就能解决的问题，下单时候显示上门比驿站多 1 元钱，让用户自己选择，商家可以包邮包上门",
          "en": "The problem can be solved by market regulation. When placing an order, show that door-to-door delivery costs 1 yuan more than station delivery, so that users can choose themselves. Merchants can offer free shipping and free door-to-door delivery."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@efcndi #37 有些人之所以只能做快递员且难以换工作，本质上是因为没有能力做其他工作，但这个世界上其他门槛并不高的工作有一大堆，比快递员相对轻松或薪资更高的也有一大堆， [做不了] 本来就是自己的问题。",
          "en": "@efcndi #37 The reason why some people can only be couriers and have difficulty changing jobs is essentially because they don't have the ability to do other jobs, but there are a lot of other jobs in this world that don't have high barriers to entry, and there are a lot of them that are relatively easier or pay better than couriers. [Not being able to do it] is originally their own problem."
        },
        {
          "zh": "别扯什么环境原因之类的，条件差的也有凭借自己的能力改变生活的，我认识的人里都有很多案例。",
          "en": "Don't talk about environmental reasons or anything like that. There are also people with poor conditions who have changed their lives with their own abilities. I know many cases."
        },
        {
          "zh": "送快递柜都要经常干到凌晨说明是网点安排的人手数量根本就不足以满足这片区域的要求，这是快递员跟公司之间的问题，跟收件人没有任何关系，快递员不爽可以不干，要么就想办法让公司加人手。",
          "en": "Having to work until the early hours of the morning to deliver to lockers shows that the number of people arranged by the station is not enough to meet the requirements of this area. This is a problem between the courier and the company, and has nothing to do with the recipient. If the courier is unhappy, they can quit, or find a way to get the company to add manpower."
        },
        {
          "zh": "以我这边区域的快递员为例，除了申通和中通以外，其他家的快递员普遍都是能做到白天把可以放代收点的单给放了，剩下的需要送上门的都送上门，晚上正常下班，甚至像极兔的在白天就主动打电话联系问详细地址，最迟傍晚就送上门了，何来的没空？",
          "en": "Taking the couriers in my area as an example, except for STO and ZTO, the couriers of other companies can generally put the orders that can be placed at the collection points during the day, and deliver the rest that need to be delivered to the door. They get off work normally at night, and even J&T proactively calls to ask for detailed addresses during the day, and delivers to the door by the evening at the latest. How can they not have time?"
        },
        {
          "zh": "你可以自己白天去快递网点和各种代收点观察一下，哪个快递员做不到一边打电话一边放/整理快递或者拖着拖车往某栋楼走的？",
          "en": "You can go to the express delivery stations and various collection points during the day to observe. Which courier can't call while putting/organizing express delivery or dragging a trailer to a building?"
        },
        {
          "zh": "谁 TM 会到了地方拿出快递包裹才打电话，都是到目标地点之前就开始打了，负责指定小区的快递员通常都是提前两三栋打电话确认的，有些更是在网点整理小区域的包裹的时候（通常为 8 点左右）就会开始打电话确认，这不是一件很难做到的事情。",
          "en": "Who the hell takes out the express delivery package and then calls when they arrive at the place? They all start calling before they arrive at the destination. The couriers responsible for designated communities usually call to confirm two or three buildings in advance, and some even start calling to confirm when sorting packages in a small area at the station (usually around 8 o'clock). This is not a difficult thing to do."
        },
        {
          "zh": "---从你的言论中可以看出，你才是真的没有了解过人家的生活状态，只是看了网上所谓的“快递员很辛苦”就自以为自己已经了解快递员了，嘴上说着关怀，但实际却压根没有做过什么对快递员有实际帮助、给他们减轻负担的事情。",
          "en": "---It can be seen from your remarks that you really don't understand other people's living conditions. You just saw the so-called 'couriers are very hard' online and think that you already understand couriers. You talk about concern, but in fact you have never done anything to actually help couriers and reduce their burden."
        },
        {
          "zh": "你所谓的快递员给你打电话你会告诉他们不用跟你说、直接放快递柜就行，看起来好像很高尚，但实际上只要你直接在收件信息上写个“放驿站/快递柜”，人家哪还需要打你电话？",
          "en": "You said that the courier calls you and you tell them that you don't need to tell you, just put it in the locker, which seems very noble, but in fact, as long as you directly write 'Leave at station/locker' in the recipient information, why would they need to call you?"
        },
        {
          "zh": "你真的有替快递员着想过吗？",
          "en": "Have you really thought about the couriers?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这有什么好吵的，早该这样了，没驿站的时候快递不就是送上门吗？",
          "en": "What's there to argue about? It should have been like this long ago. Wasn't express delivery delivered to the door when there were no stations?"
        },
        {
          "zh": "不送上门那是物流！",
          "en": "If it's not delivered to the door, it's logistics!"
        },
        {
          "zh": "甚至现在有些物流都送上门。",
          "en": "Even now, some logistics are delivered to the door."
        },
        {
          "zh": "快递从一开始的定义就是门到门。",
          "en": "The definition of express delivery from the beginning is door-to-door."
        },
        {
          "zh": "这个门是到你家不是到驿站门。",
          "en": "This door is to your house, not to the station door."
        },
        {
          "zh": "喜欢驿站的-->直接地址填驿站放门口怕丢的-->直接地址填驿站公司不能收快递的-->直接地址填驿站怕泄露地址隐私的-->直接地址填驿站还有什么奇奇怪怪的不想送上门的-->统一地址填驿站剩下的，送上门啊！",
          "en": "Those who like the station --> fill in the station address directly. Those who are afraid of losing it when it's placed at the door --> fill in the station address directly. Those who can't receive express delivery at the company --> fill in the station address directly. Those who are afraid of leaking address privacy --> fill in the station address directly. Those who have any strange reasons for not wanting it delivered to the door --> fill in the same station address. The rest, deliver to the door!"
        },
        {
          "zh": "我家 24 小时有人，之前住没电梯的 6 楼，只要快递楼下按门铃，我都会走到 5 楼去接。",
          "en": "There is someone at my house 24 hours a day. Before, I lived on the 6th floor without an elevator. As long as the courier rings the doorbell downstairs, I will walk to the 5th floor to pick it up."
        },
        {
          "zh": "我付了快递费，凭什么给我丢驿站？",
          "en": "I paid the express delivery fee, why should I be left at the station?"
        },
        {
          "zh": "别跟我扯什么包邮，敢情包邮的钱不是我出的？",
          "en": "Don't tell me about free shipping, isn't the money for free shipping paid by me?"
        },
        {
          "zh": "有这种想法的人是真幼稚。",
          "en": "People who have this kind of thinking are really naive."
        },
        {
          "zh": "最近搬家换了隔壁小区，小区里没有驿站，快递勤快的送上楼，放门口敲个门就走了。",
          "en": "Recently, I moved to the next community, and there is no station in the community. The courier diligently delivered it upstairs, put it at the door, knocked on the door and left."
        },
        {
          "zh": "懒点的，就放在一楼楼梯，小区物业应该是给快递配了通用钥匙。",
          "en": "The lazier ones put it on the stairs on the first floor. The community property should have provided the courier with a universal key."
        },
        {
          "zh": "放一楼楼梯也能理解，经常晚上 10 点快递还在派件。",
          "en": "It's understandable to put it on the stairs on the first floor. The express delivery is often still being delivered at 10 pm."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@mumbler 我让快递公司不加钱了吗？",
          "en": "@mumbler Did I not let the express delivery company add money?"
        },
        {
          "zh": "快递费在快递公司内部怎么分，作为用户你能干涉得到吗？",
          "en": "How the express delivery fee is distributed within the express delivery company, can you, as a user, interfere?"
        },
        {
          "zh": "哪怕快递费涨十倍，只要快递公司觉得一单给几毛钱就能招到快递员，那它们依然可以一单就给几毛钱。",
          "en": "Even if the express delivery fee increases tenfold, as long as the express delivery company thinks that it can recruit couriers by paying a few cents per order, they can still pay a few cents per order."
        },
        {
          "zh": "反过来，哪怕不涨价，当它发现现有待遇招不到人时，自然也会提高工资，或者干脆撤点不做。",
          "en": "Conversely, even if the price doesn't increase, when it finds that it can't recruit people with the existing treatment, it will naturally increase wages, or simply withdraw the point and not do it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@redmoonisnil 你要是干餐饮，你是不是也会觉得食品安全法也是大多数人的暴政，做餐饮在人苦了",
          "en": "@redmoonisnil If you were in the catering industry, would you also feel that the food safety law is also the tyranny of the majority, and that it is hard for people in the catering industry?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既没有取缔驿站，也没有要求必须上门，仅仅是禁止未经同意擅自放驿站。",
          "en": "It neither abolishes stations nor requires delivery to the door, it only prohibits unauthorized placement at stations without consent."
        },
        {
          "zh": "禁止一刀切把选择权还给用户这件事怎么能有这么大的反对声音？",
          "en": "How can there be such a big opposition to banning a one-size-fits-all approach and returning the right to choose to the user?"
        },
        {
          "zh": "到现在在 V 站搜索驿站关键字，几乎所有贴子都是骂得、想方设法禁止送驿站的、去邮政局投诉的。",
          "en": "Up to now, when you search for the keyword 'station' on V station, almost all the posts are scolding, trying to ban delivery to the station, and complaining to the post office."
        },
        {
          "zh": "在今天之前我从未见过这么多支持驿站一刀切的声音",
          "en": "Before today I have never seen so many voices supporting a one-size-fits-all approach for stations"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dongtq #7 没时间在家里等快递并且家里也没别人常在的话，可以直接在收件信息里注明放驿站/放快递柜，这并不影响。",
          "en": "@dongtq #7 If you don't have time to wait for the express delivery at home and there is no one else at home often, you can directly indicate in the recipient information to put it at the station/put it in the locker, which does not affect it."
        },
        {
          "zh": "批评快递员不送上门的也并不是没法在家等快递的人群，而是人就在家里却碰到快递员不好好送上门的人群…",
          "en": "The people who criticize couriers for not delivering to the door are not the people who can't wait for the express delivery at home, but the people who are at home but encounter couriers who don't deliver to the door properly..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SenLief 对 放就算了 甚至没有一个提货码短信发来 如果不是登录银行 app 想起来之前申请过 不知道在驿站放多久",
          "en": "@SenLief Yes, even if it's put there, there isn't even a pick-up code text message sent. If I hadn't logged into the bank app and remembered that I had applied for it before, I wouldn't know how long it had been left at the station."
        }
      ],
      "type": "replies"
    }
  ]
}