{
  "id": 1016467,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "你说拜新年到底图个啥",
          "en": "What's the point of New Year's greetings?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "op 去年结的婚，今年过年是新人拜新年，是我们小两口自己提着礼物去主要亲戚长辈家拜年，然后长辈要包大红包。\r\n看着老婆前两天拆开所有红包一张张数钱，我就问她：两瓶酒一条中华烟，其实也千八百块了，收到红包也是 600 、1000 的。等于我们是保本，亲戚是花钱买了烟和酒。那这有什么意义呢？合着东西过来过去，就是给烟酒商赚钱，他们把货卖出去了呗\r\n我可以重视亲情，毕竟平时在外地就过年回来一趟，装也可以装的热情点。我也没指望收红包赚什么钱，虽然实际收到的钱肯定比买烟酒的钱多。过个年，各个家里多了那么多的烟、酒、奶、水果等等等等，特别是年纪较大的长辈，送也送不完，吃也吃不掉，这种这种消费图个啥\r\n这种面子工程我实在是提不起兴趣，也看不到意义，但大家又都这么做，好像理所当然",
          "en": "OP got married last year, so this year's New Year is the first time we're doing the New Year's greetings as a newlywed couple. We personally bring gifts to the homes of key relatives and elders, and then the elders give us big red envelopes.\r\nWatching my wife unpack all the red envelopes a few days ago and count the money, I asked her: Two bottles of wine and a carton of Chunghwa cigarettes actually cost about 1,800 yuan, and the red envelopes we receive are only 600 or 1,000 yuan. So, we're just breaking even, and the relatives are spending money to buy cigarettes and alcohol. What's the point of this? It's just making money for the tobacco and alcohol merchants, who are selling their goods.\r\nI can value family ties, especially since I'm usually away from home and only come back for New Year's. I can even pretend to be enthusiastic. I don't expect to earn any money from receiving red envelopes, although the actual amount of money received is definitely more than the cost of the cigarettes and alcohol. After celebrating the New Year, every family has so much more cigarettes, alcohol, milk, fruit, etc., especially the older elders, who can't finish giving them away or eating them. What's the point of this kind of consumption?\r\nI really can't get interested in this kind of face-saving project, and I don't see any meaning in it, but everyone is doing it, as if it's a matter of course."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "大部分人行事并不是靠理性，而是靠惯性，以前怎么做之后就怎么做，别人怎么做自己就怎么做，不用动脑自然没烦恼。",
          "en": "Most people don't act based on reason, but on inertia. They do what they did before, and they do what others do. If they don't use their brains, they naturally have no worries."
        },
        {
          "zh": "而当人开始动脑思考的时候，也就是麻烦的开始，比较发现问题不难，解决问题才难，还得承担风险。",
          "en": "But when people start to think, that's when the trouble begins. It's not difficult to discover problems, but it's difficult to solve them, and you have to take risks."
        },
        {
          "zh": "也就是想送礼，不想送烟酒，你得给出更好的选择，即实用又有面子，起码不会让对方认为你在敷衍，其实挺难的，毕竟对方也是靠惯性在接受礼物和给你红包。",
          "en": "In other words, if you want to give gifts but don't want to give cigarettes and alcohol, you have to give a better choice that is both practical and presentable, and at least doesn't make the other party think you're being perfunctory. It's actually quite difficult, because the other party is also relying on inertia to accept gifts and give you red envelopes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "噢，不介意的话，和你抬一下杠。",
          "en": "Oh, if you don't mind, let me argue with you a bit."
        },
        {
          "zh": "其实你的问题是：“拜新年有什么意义”那你结婚有什么意义呢？",
          "en": "Actually, your question is: 'What's the point of New Year's greetings?' Then what's the point of getting married?"
        },
        {
          "zh": "为了爱情吗，那爱情又有什么意义。",
          "en": "Is it for love? Then what's the point of love?"
        },
        {
          "zh": "那我们人类活着什么意义？ 100 年左右必死无疑。",
          "en": "Then what's the point of us humans living? We're bound to die in about 100 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我反而特别喜欢拜年，去亲戚家坐坐，拉拉家常。",
          "en": "On the contrary, I especially like New Year's greetings, going to relatives' homes to sit and chat."
        },
        {
          "zh": "很久没见的表弟、表妹也可以聊聊天。",
          "en": "I can also chat with cousins I haven't seen in a long time."
        },
        {
          "zh": "这样也是休息，不一定躺家里才是休息（每周躺两天还不够嘛）。",
          "en": "This is also a way to rest, it's not necessarily resting only when lying at home (two days of lying down every week is not enough?)."
        },
        {
          "zh": "话说回来，可能习俗不一样或者你家族大，我买的礼品也就 200 左右。",
          "en": "That being said, maybe the customs are different or your family is big, but the gifts I buy are only around 200 yuan."
        },
        {
          "zh": "平常工作已经很累了，各种要看 KPI 、ROI ，追求意义，有些事情就不要问什么意义了，随心所欲一点，不喜欢就不做吧",
          "en": "Usually, work is already very tiring, with all kinds of KPIs and ROIs to look at and chasing meaning. Don't ask what the meaning is for some things, just do whatever you want, and don't do it if you don't like it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@paradoxs 你这抬的没意思，直接快进到虚无主义那没得聊了",
          "en": "@paradoxs This argument of yours is meaningless, it directly fast-forwards to nihilism, and there's nothing to talk about."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以拉进人与人之间的距离，年都不拜了，还有啥来往",
          "en": "It can bring people closer together. If you don't even do New Year's greetings, what kind of interaction is there?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@taresky #8 OP 不是说了吗，“长辈要包大红包”各地风俗不同，不能搞出“送钱给长辈包大红包”这种无厘头的事。",
          "en": "@taresky #8 Didn't OP say that 'elders want to give big red envelopes'? Customs vary from place to place, and you can't come up with the nonsense of 'giving money to elders to give big red envelopes'."
        },
        {
          "zh": "OP 最反感的是，拜年就拜年，花这么大钱搞面子工程让烟酒商赚钱不合理。",
          "en": "What OP dislikes the most is that New Year's greetings are just New Year's greetings, and it's unreasonable to spend so much money on a face-saving project to make money for tobacco and alcohol merchants."
        },
        {
          "zh": "那么解决问题的办法是，设法减少这种铺张浪费的行为，让拜年双方更舒适。",
          "en": "So the solution is to try to reduce this extravagance and make both parties more comfortable with the New Year's greetings."
        },
        {
          "zh": "建议平日交流时旁敲侧击跟长辈提出来，比如从礼品是怎么处理的，引申到下次送什么更好。",
          "en": "It is recommended to subtly suggest it to the elders during normal communication, such as how the gifts are handled, and what would be better to give next time."
        },
        {
          "zh": "像满足心愿那样让大家都开心。",
          "en": "Make everyone happy like fulfilling a wish."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个春节假期最大的感受：世俗的规则让本就贫穷的我更加贫穷",
          "en": "The biggest feeling during this Spring Festival holiday: secular rules make me, who is already poor, even poorer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所以广东人的红包都很“小”，而且结婚后就是发红包而不是收红包，哈哈我们亲戚之间拜年，送的都是“富余”的东西，不会特意买，特意买的金额都不高，只是心意。",
          "en": "So Cantonese red envelopes are very 'small', and after marriage, you give red envelopes instead of receiving them. Haha, during New Year's greetings among our relatives, we give away 'extra' things. We don't buy them specifically, and the amount of money specially bought is not high, just a token of appreciation."
        },
        {
          "zh": "而且这个双方都是知道的，也默认对方也是这样做。",
          "en": "And both parties know this and assume that the other party is doing the same."
        },
        {
          "zh": "相当于“资源交换”而已，涉及金额的问题，就变成“买卖”了我个人默认不拜年，但约出去饮茶是可以的，为这事老妈对我意见很大",
          "en": "It's just an 'exchange of resources'. If it involves money, it becomes a 'transaction.' I personally don't like New Year visits but going out for afternoon tea is fine. Because of this, my mother has a strong opinion about it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“你说拜新年到底图个啥”“现在过年真的越来越没有年味儿了”",
          "en": "'What's the point of New Year's greetings?' 'Now the New Year is losing its festive atmosphere.'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "人情就像是刷墙，你刷一轮我刷一轮，你来我往，这墙面就越来越厚。",
          "en": "Human relationships are like painting a wall. You paint a layer, I paint a layer, back and forth, and the wall becomes thicker and thicker."
        },
        {
          "zh": "凡事算太清就没有人情了。",
          "en": "If you calculate everything too clearly, there will be no human touch."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就正文中的问题而言，基本踏入人类学的领域了。",
          "en": "As for the question in the main text, it basically enters the field of anthropology."
        },
        {
          "zh": "现代人类学开山之作《西太平洋上的航海者》，讨论的就是“库拉圈”这种礼物在一定范围内流转的“意义”——同一件物品转了一圈又转回到自己手上，那为什么要花费代价、承担风险一直做这件事呢。",
          "en": "The pioneering work of modern anthropology, 'Argonauts of the Western Pacific,' discusses the 'meaning' of the 'Kula ring,' in which gifts circulate within a certain range - the same item goes around in a circle and returns to your own hands. Why spend the cost and take the risk to keep doing this?"
        },
        {
          "zh": "就这个话题更加理论化的讨论有莫斯的《礼物》，这两本都属于人类学最经典的作品",
          "en": "A more theoretical discussion on this topic can be found in Mauss's 'The Gift.' Both books are among the most classic works of anthropology."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@LaGeNanRen 除夕给的红包，老婆特地挑了个漂亮的红包皮，她妈看着很喜欢，就把红包一直留着没拆，放在自己房间的开放格。",
          "en": "@LaGeNanRen The red envelope given on New Year's Eve, my wife specially picked a beautiful red envelope cover, her mother liked it very much, so she kept the red envelope unopened, and put it in the open shelf in her room."
        },
        {
          "zh": "初四接了奶奶到家里团聚，晚上出去看电影留老人家一个人在家。",
          "en": "On the fourth day of the new year, we picked up grandma to reunite at home, and went out to watch a movie in the evening, leaving the old woman alone at home."
        },
        {
          "zh": "初七打电话来说红包只剩皮了，急得团团转，差点以为家里招贼了，还骂我是不是泄露了家庭密码，但是想着也不对，哪个贼还把红包皮留着？",
          "en": "On the seventh day, she called and said that only the cover of the red envelope was left. She was so anxious that she was running around in circles, and almost thought that a thief had broken into the house. She also scolded me if I had leaked the family password, but then she thought it was wrong, which thief would keep the red envelope cover?"
        },
        {
          "zh": "在即将出门报警的前一刻，她奶奶说她拿了。",
          "en": "Just before she was about to go out to call the police, her grandma said she took it."
        },
        {
          "zh": "全程都是槽点。",
          "en": "The whole process was full of ridiculous points."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "观念的冲突  与社会的发展有关吧以前人与人需要多沟通互助 现代生活水平上来了 并不需要这些来维系关系人情",
          "en": "The conflict of ideas is related to the development of society. In the past, people needed more communication and mutual assistance. Now that the level of modern life has increased, these things are no longer needed to maintain relationships and emotional connections."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老一辈的人际关系和年轻人不一样，而且社会也在变，我小时候拜年要去的地方比较多，后来也是越来越少，将来大概率拜年活动会逐渐减少。（但以前拜年，在当时的时代背景下是有意义的）",
          "en": "The interpersonal relationships of the older generation are different from those of the younger generation, and society is also changing. When I was a child, there were more places to go for New Year's greetings, but later there were fewer and fewer. In the future, New Year's greetings will likely gradually decrease. (But in the past, New Year's greetings were meaningful in the context of the times.)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所以老一辈互相送的是自己包的包子饺子大馒头反而更有意义",
          "en": "So it's more meaningful for the older generation to give each other homemade steamed buns, dumplings, and large steamed buns."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "长辈在意这个的，就哄哄他们开心。",
          "en": "If the elders care about this, then make them happy."
        },
        {
          "zh": "不在意的也就无所谓了。",
          "en": "If they don't care, then it doesn't matter."
        },
        {
          "zh": "每一代人习惯不同，观念慢慢会变。",
          "en": "Each generation has different habits, and ideas will gradually change."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "部分习俗已经在慢慢改变了，早年间买白糖、荔枝桂圆、烟酒；后来改成买些商超里面的礼盒、水果、牛奶；再后来这些东西平时家里都多得很，压根吃不掉；现在我去舅舅家拜年都是直接给红包，不给中间商赚差价了。",
          "en": "Some customs are slowly changing. In the early years, we bought white sugar, lychees, longans, cigarettes, and alcohol; later, we changed to buying gift boxes, fruits, and milk from supermarkets; later, these things were usually plentiful at home and couldn't be eaten at all; now when I go to my uncle's house for New Year's greetings, I directly give red envelopes and don't let middlemen make the difference."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "确实直接送钱比较好。",
          "en": "It's indeed better to give money directly."
        },
        {
          "zh": "那么你送了多少钱给长辈。",
          "en": "So how much money did you give to the elders?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拜新年这个是个习俗，在创立之初可能具有它的意义，随着时代更迭逐渐失去了曾经的意义罢了，要么赋予它新意义，要么它将逐渐消失",
          "en": "New Year's greetings are a custom, and may have had its meaning when it was first created, but has gradually lost its former meaning as times change. Either give it a new meaning, or it will gradually disappear."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是没什么意义，不喜欢可以渐渐不做，刚结婚么走几次吧，我现在过年自己休息为主",
          "en": "It's not very meaningful. If you don't like it, you can gradually stop doing it. Since you just got married, do it a few times. Now I mainly rest during the New Year."
        }
      ],
      "type": "replies"
    }
  ]
}