{
  "id": 1013559,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "各位还要上几天班？",
          "en": "How many more days of work do you all have?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "4 号放假，再上两天就歇了",
          "en": "Vacation on the 4th, work for two more days and then rest."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "上到除夕.求你们了，别发了，我生活再难再穷我都不会觉得难过，只有你们发这种东西炫耀的时候，我的心像被刀割一样痛，打个字泪水都止不住的往下流",
          "en": "Working until New Year's Eve. Please, stop posting this. No matter how difficult or poor my life is, I won't feel sad. But when you guys post this kind of stuff to show off, it hurts my heart like a knife. As I type, tears keep flowing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上到除夕哥，这条删了吧，我是无所谓的，没那么容易的，不轻易破防的，但是我一个朋友可能有点汗流浃背了，他不太舒服想睡了，当然不是我哈，我一直都是行的，以一个旁观者的心态看吧，也不至于破防吧，就是想照顾下我朋友的感受，他有点破防了，还是建议删了吧，当然删不删随你，我是没感觉的，就是为朋友感到不平罢了，也不是那么简单破防的",
          "en": "Working until New Year's Eve, bro, delete this post. I don't care, I'm not that easily affected. But a friend of mine might be a bit overwhelmed, he's not feeling well and wants to sleep. Of course, it's not me, I'm always fine. I'm watching this from the perspective of an observer, so it's not too hard to handle, but I just want to take care of my friend's feelings, he's a bit upset. I still suggest deleting it. Of course, whether you delete it or not is up to you, I don't care, I just feel unfair for my friend, and it's not so easy to be broken."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "领导今天上完就休假了，约等于我也休假了",
          "en": "The leader is going on vacation after today, which is equivalent to me also going on vacation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "羡慕，，，9 号才放假",
          "en": "Envious,,, only on vacation on the 9th."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今天最后一天班上到 15:00 ，开始放假",
          "en": "Today is the last day of work, until 15:00, and then start the vacation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "明天休息  6 号下午就放假了",
          "en": "Rest tomorrow, then vacation on the afternoon of the 6th."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "8 号的默默路过",
          "en": "Silently passing by on the 8th."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "5 天",
          "en": "5 days"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "6 号，不少人已经回去了，上班路上车比平时少，能提前 10 分钟",
          "en": "On the 6th, many people have already gone back. There are fewer cars on the way to work than usual, and you can arrive 10 minutes earlier."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今天,周日,周一,周二, 如果明天上班哪还有周六",
          "en": "Today, Sunday, Monday, Tuesday, if working tomorrow, where's Saturday?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上到 8 号",
          "en": "Working until the 8th"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "7 天",
          "en": "7 days"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "7 号",
          "en": "7th"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同上到 4 号",
          "en": "Same as working until the 4th."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今天年会，开完就跑。请 4 天假",
          "en": "Today's annual meeting, run after it's over. Taking a 4-day leave."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "今天最后一天了 这班上的生无可恋",
          "en": "Today is the last day, so unwilling to work this shift"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上到 7 号",
          "en": "Working until the 7th"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "请假一天，年三十放",
          "en": "Taking a day off, and vacation on New Year's Eve."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上到今天，明天开始 16 天假期",
          "en": "Working until today, starting tomorrow with a 16-day vacation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "内部转岗带薪学习一个月了，算是半休假状态吧",
          "en": "I've been internally transferred to a paid study for a month, which is considered a semi-vacation state."
        }
      ],
      "type": "replies"
    }
  ]
}