{
  "id": 1111995,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "果粉们， Mac 和 iPhone 上，微信输入法是不是最佳选择？",
          "en": "Apple fans, is WeChat Input Method the best choice on Mac and iPhone?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "虽然微信输入法存在违禁词审查，导致记不住这些词库，但我搜了下网友评价，大部分是好评",
          "en": "Although WeChat Input Method has censorship of prohibited words, which makes it difficult to remember these vocabularies, I searched for netizens' comments, and most of them are positive."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "原生输入法很好用啊为啥都这么喜欢第三方输入法(￣▽￣\")",
          "en": "The native input method is very easy to use. Why do you all like third-party input methods so much? (￣▽￣\")"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我搞不懂为什么微信输入法，那么大，其他输入法都没那么大",
          "en": "I don't understand why WeChat Input Method is so large, while other input methods are not so large."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以前用搜狗，现在换微信输入法了，多端同步剪切板很方便，还有常用语可以任何地方直接添加编辑，不像搜狗一定要打开软件才行",
          "en": "I used to use Sogou, but now I switched to WeChat Input Method. It's very convenient to synchronize the clipboard across multiple devices. Also, frequently used phrases can be added and edited directly anywhere, unlike Sogou, which requires opening the software."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "李彦宏说得对，中国人喜欢用隐私换取便利",
          "en": "Robin Li is right. Chinese people like to trade privacy for convenience."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "反正企鹅家的东西你就别指望人家做公益，人家是要做生态的，只要用户数起来了，肯定要收割，功能只会越来越多，越来越臃肿和占资源，打算长期使用就不建议",
          "en": "Anyway, don't expect anything from Tencent to be public service. They want to build an ecosystem. As long as the number of users increases, they will definitely start monetizing. The functions will only become more and more bloated and resource-intensive. I wouldn't recommend planning to use it long-term."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多端复制过于好用",
          "en": "Multi-device copy is too convenient to use."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以前用 Gboard 似乎很久不更新了，当下就自带的凑合用吧。",
          "en": "I used to use Gboard, but it seems like it hasn't been updated for a long time. So, I'll just make do with the built-in one for now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微信输入法词库感觉很烂，还不能挂载附加词库，甚至不如配置好的 rime 。",
          "en": "The WeChat Input Method's vocabulary feels terrible, and it can't mount additional vocabularies, even worse than a well-configured rime."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在是全平台微信输入法了，电脑上备着搜狗输入法，移动设备上只保留微信输入法",
          "en": "Now I'm using WeChat Input Method on all platforms. I keep Sogou Input Method on my computer, and I only keep WeChat Input Method on my mobile devices."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bigbugbag #21 不常用的词基本打个一两次它就记住了啊",
          "en": "@bigbugbag #21 It basically remembers infrequently used words after you type them once or twice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微信输入法的剪贴板同步，可以多端复制粘贴文字、图片。多部 iOS 、安卓、PC 设备的福音。",
          "en": "WeChat Input Method's clipboard synchronization allows multi-device copy and paste of text and images. A boon for multiple iOS, Android, and PC devices."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "搜狗输入法，之前每次调出来键盘都要卡一下。 多少年都这样， 甚至最新款 iPhone 都免不了。 真的搞不懂这是什么疑难 bug 。",
          "en": "Sogou Input Method, the keyboard would lag every time I brought it up. It's been like this for many years, even the latest iPhone can't avoid it. I really don't understand what kind of difficult bug this is."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在什么平台上，微信输入法都不是最佳选择。",
          "en": "On any platform, WeChat Input Method is not the best choice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@surfin9 更多是姓名、身份证、银行卡、密码之类的，兴趣爱好，日常购买的商品之类的，不想给人掌握就这么简单，经过我同意我可以告诉你，但不能没经过我允许总想着偷偷拿我的",
          "en": "@surfin9 It's more about names, ID cards, bank cards, passwords, hobbies, daily purchases, etc. It's as simple as not wanting people to have control of this information. I can tell you after I agree, but you can't always think about secretly taking mine without my permission."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微信無法擺脫，卻又在有選擇下使用同公司其他產品，無法理解。或許這就是有這樣的用戶就有這樣的產品吧。",
          "en": "I can't understand why people can't get rid of WeChat, but use other products from the same company when they have a choice. Perhaps this is why there are such products because there are such users."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "沾上 微信 这两个字的玩意，劝你别用。除非腾讯不再垄断",
          "en": "Anything that has the words 'WeChat' in it, I advise you not to use it. Unless Tencent no longer has a monopoly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "李彦宏：中国用户喜欢用隐私换方便含金量还在上升",
          "en": "Robin Li: Chinese users like to trade privacy for convenience, and the value is still increasing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "rime-rice 。如果不是不得已连微信都不用……",
          "en": "rime-rice. If it weren't absolutely necessary, I wouldn't even use WeChat..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得是。原生输入法：太笨，记不住词汇，常见词汇也打不出来，难以忍受。搜狗输入法：非常聪明好用，只是有点丑微信输入法：非常聪明好用，且 UI 与原生一样漂亮。",
          "en": "I think so. Native Input Method: Too stupid, can't remember words, can't even type common words, unbearable. Sogou Input Method: Very smart and easy to use, just a bit ugly. WeChat Input Method: Very smart and easy to use, and the UI is as beautiful as the native one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很好奇，你们日常都经常输入什么违禁词，又是怎么审查的。",
          "en": "I'm curious, what prohibited words do you often enter in your daily life, and how are they censored?"
        }
      ],
      "type": "replies"
    }
  ]
}