{
  "id": 1108695,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "亲戚，肺癌晚期，想去看看，送什么比较好啊？",
          "en": "A relative has terminal lung cancer and I want to visit. What's a good gift to bring?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "营养品？不知道买什么比较好，谢谢",
          "en": "Nutritional supplements? I don't know what to buy, thanks."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@fields 都是晚期了 要是会抽烟的话就别管了 买点好烟",
          "en": "@fields It's already terminal stage. If they smoke, just buy them some good cigarettes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@F798 #7 @fields 都肺癌晚期了还送烟，你俩也是卧龙凤雏，不被亲戚轰出去算你脸白",
          "en": "@F798 #7 @fields You're giving cigarettes to someone with terminal lung cancer? You two are a match made in heaven. You're lucky if your relatives don't kick you out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "晚期还要啥啊，买个水果篮，人去看看表达一个心意就行了。",
          "en": "What else do you need at a late stage? Just buy a fruit basket and visit to express your sympathy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不论患者家庭是什么经济条件，送钱最好，再带上些新鲜时令水果。补品和营养品只会给别人带来麻烦，最终一般不是送其他人就是扔垃圾堆。",
          "en": "Regardless of the patient's family's financial situation, it's best to give money, along with some fresh seasonal fruits. Tonics and nutritional supplements will only cause trouble for others and usually end up being given away or thrown in the trash."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红包",
          "en": "Red envelope (money gift)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给家属包个红包得了",
          "en": "Give the family a red envelope (money gift)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红包",
          "en": "Red envelope (money gift)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "烟",
          "en": "Cigarettes"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "中华",
          "en": "Chunghwa (brand of cigarettes)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我们这儿都送钱。500-2000 不等，多数是 1000",
          "en": "We all give money here. It varies from 500-2000, but mostly 1000."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接给钱就行了，这是最实在的。",
          "en": "Just give money directly, it's the most practical."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fields 这是想被亲戚和家人喷啊",
          "en": "@fields You're just asking to be scolded by relatives and family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红包最实在",
          "en": "Red envelope is the most practical."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给人带篮子花，给家属包个红包。",
          "en": "Bring a basket of flowers for the patient, and a red envelope for the family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果是长辈，跟随父母你添点钱就行了，不需要自己送礼如果是单独去，礼是小，意思意思，对方如果不是有矿的家庭，红包则是必须的，家属治病花费巨大如果不是太亲的长辈，最好不要单独去，不亲的话就是场面活，单独去不好处理，说话等等都非常讲究，不小心就会说错话了",
          "en": "If it's an elder, just add some money to your parents' gift, you don't need to bring your own gift. If you're going alone, the gift is small, just a gesture. If the family isn't wealthy, a red envelope is a must, as the family faces huge medical expenses. If it's not a very close elder, it's best not to go alone. If you're not close, it's just a formality, and it's difficult to handle going alone. Speaking and everything else is very important, and you can easily say the wrong thing if you're not careful."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关系很好，且他还想着延续生命的话。我觉得可以往保住生命的思路去送礼"
        },
        {
          "zh": "1 、 买个口罩新风机（远大移动肺宝）可能会还有点用。 让肺呼吸最干净的气体，减少继续伤害"
        },
        {
          "zh": "2 、买修复细胞的微量营养素：维生素 D （大部分晒太阳不到位）、鱼油（肯定缺）， 其他元素就看他的饮食情况"
        },
        {
          "zh": "3 、如果身体消瘦，吃不下东西。那就是买蛋白粉，补充蛋白质。",
          "en": "If you have a good relationship, and they are thinking of prolonging their life, I think you can give gifts with the idea of preserving life.\n1. Buy a mask air purifier (Broad Mobile Lung Treasure) which may be useful. Let the lungs breathe the cleanest air and reduce further damage.\n2. Buy micronutrients to repair cells: Vitamin D (most people don't get enough sun), fish oil (definitely deficient), other elements depend on their diet.\n3. If they are thin and can't eat, then buy protein powder to supplement protein."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接送钱，家属需要",
          "en": "Give money directly, the family needs it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "送烟的也太抽象了",
          "en": "Giving cigarettes is too absurd."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "补品的话全安素吧",
          "en": "For supplements, try Ensure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "送钱，想去看的话要尽快去，去晚了可能见不到了",
          "en": "Give money, and if you want to visit, go as soon as possible, you might not see them if you go late."
        }
      ],
      "type": "replies"
    }
  ]
}