{
  "id": 1111860,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "这么多相亲又是彩礼的贴，我给大家看看办一场婚礼需要多少钱？ 开源一份结婚预算。",
          "en": "With so many posts about blind dates and betrothal gifts, I'll show you all how much it costs to hold a wedding? Here's an open-source wedding budget."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "发生时间：2023 年 地点： 江苏地区",
          "en": "Time: 2023 Location: Jiangsu Province"
        },
        {
          "zh": "\r\n\r\n原文记录在博客，这里为了方便大家看直接复制过来。",
          "en": "\r\n\r\nThe original record is on the blog, but I'm copying it here for everyone's convenience.\r\n"
        },
        {
          "zh": "\r\n\r\n没啥文化，字丑文拙，大家就当看流水帐看吧...",
          "en": "\r\n\r\nI don't have much education, my writing is ugly and clumsy, just treat it as a running account...\r\n"
        },
        {
          "zh": "\r\n\r\n恬不知耻的贴上链接：",
          "en": "\r\n\r\nShamelessly posting the link:\r\n"
        },
        {
          "zh": "> https://coala.top/archives/%E5%8A%9E%E4%B8%80%E5%9C%BA%E5%A9%9A%E7%A4%BC%E9%9C%80%E8%A6%81%E5%A4%9A%E5%B0%91%E9%92%B1%E6%88%91%E6%9D%A5%E5%BC%80%E6%BA%90%E6%88%91%E7%9A%84%E7%BB%93%E5%A9%9A%E8%AE%A1%E5%88%92",
          "en": "> https://coala.top/archives/%E5%8A%9E%E4%B8%80%E5%9C%BA%E5%A9%9A%E7%A4%BC%E9%9C%80%E8%A6%81%E5%A4%9A%E5%B0%91%E9%92%B1%E6%88%91%E6%9D%A5%E5%BC%80%E6%BA%90%E6%88%91%E7%9A%84%E7%BB%93%E5%A9%9A%E8%AE%A1%E5%88%92\r\n"
        },
        {
          "zh": "\r\n-------------------------------------------------------------------\r\n\r\n序\r\n\r\n目前这个时代，婚礼宴作为上一代人精神需求和收回人情成本的必要流程，似乎是年轻人逃不掉的劫。",
          "en": "\r\n-------------------------------------------------------------------\r\n\r\nPreface\r\n\r\nIn this era, wedding banquets, as a necessary process for the spiritual needs of the older generation and to recover the cost of favors, seem to be an inescapable ordeal for young people.\r\n"
        },
        {
          "zh": "\r\n\r\n虽然家族这个概念在我们这个时代开始消失。",
          "en": "\r\n\r\nAlthough the concept of family has begun to disappear in our era.\r\n"
        },
        {
          "zh": "\r\n\r\n苦于大多数人只能经历一次，所谓的档次更是更多来自身边的对比，如何准确的找到自己的需求和预算呢？",
          "en": "\r\n\r\nSince most people can only experience it once, and the so-called level is more based on comparisons with those around them, how can you accurately find your own needs and budget?\r\n"
        },
        {
          "zh": "\r\n\r\n希望我的经历给你一些小小的帮助。",
          "en": "\r\n\r\nI hope my experience can give you some small help.\r\n"
        },
        {
          "zh": "\r\n\r\n注： 信息具有时效性，仅供参考。",
          "en": "\r\n\r\nNote: The information is time-sensitive and for reference only.\r\n"
        },
        {
          "zh": "\r\n\r\nWARING：不适合家中有矿人士阅读。",
          "en": "\r\n\r\nWARNING: Not suitable for people with rich families.\r\n"
        },
        {
          "zh": "\r\n\r\n## 婚纱照",
          "en": "\r\n\r\n## Wedding Photos\r\n"
        },
        {
          "zh": "\r\n\r\n严格来说，这不是婚礼宴的一环，但是婚礼一般需要播放照片，也就是在办婚礼晚宴前，需要拍好婚纱照。",
          "en": "\r\n\r\nStrictly speaking, this is not part of the wedding banquet, but weddings generally require photos to be played, which means that wedding photos need to be taken before the wedding dinner.\r\n"
        },
        {
          "zh": "\r\n\r\n### 拍摄流程",
          "en": "\r\n\r\n### Shooting Process\r\n"
        },
        {
          "zh": "一般摄像工作室的工作流程是这样的：",
          "en": "The general workflow of a photography studio is like this:\r\n"
        },
        {
          "zh": "\r\n\r\n1. 女方需要化妆，时间 1 ~ 3 小时，男方约 10 分钟，不得不说他们这个行业也是高度分工的，女方的化妆师只给女性化妆。",
          "en": "\r\n\r\n1. The woman needs makeup, which takes 1-3 hours, and the man takes about 10 minutes. I have to say that this industry is also highly specialized, and the woman's makeup artist only does makeup for women.\r\n"
        },
        {
          "zh": "\r\n2. 然后需要摄影师，摄影助理，一位负责协调 | 补妆的人士等，3 到 4 人协助完成室内和外景的拍摄。",
          "en": "\r\n2. Then you need a photographer, a photography assistant, and someone in charge of coordination | makeup touch-ups, etc., 3 to 4 people to assist in completing indoor and outdoor shooting.\r\n"
        },
        {
          "zh": "\r\n3. 一天时间，基本会忙到天黑，后期就是修图，选照片，打相框这些后期流程。",
          "en": "\r\n3. It takes a day, and you will basically be busy until dark. The later stage is retouching, selecting photos, and making photo frames.\r\n"
        },
        {
          "zh": "\r\n\r\n### 工作室挑选",
          "en": "\r\n\r\n### Studio Selection\r\n"
        },
        {
          "zh": "\r\n本地找个口碑较好的工作室，最好尝试在各种社区寻找大量真实的评价选择， 一般价格在 8000 - 15000 不等，我觉得选便宜的就好，因为一天时间就那么多，加钱也无法拍到更多的照片，除非对方愿意给你拍两天。",
          "en": "\r\nFind a local studio with a good reputation, and it is best to try to find a lot of real reviews in various communities to choose. The general price ranges from 8,000 to 15,000. I think it is better to choose a cheaper one, because there is only so much time in a day, and you can't take more photos by adding money, unless the other party is willing to take pictures for you for two days.\r\n"
        },
        {
          "zh": "\r\n\r\n如果想去外地拍摄，比如青岛，云南，直接找目的城市的本地工作室，价格应该还是类似的，想去外地拍，直接连着休息几天去，岂不美哉？异地拍摄如果你找同城的工作室去外地拍摄，则会贵了非常多，毕竟工作室需要付出时间和交通费用。",
          "en": "\r\n\r\nIf you want to go to other places to shoot, such as Qingdao, Yunnan, directly find a local studio in the destination city, the price should be similar, if you want to go to other places to shoot, just take a few days off to go, wouldn't it be wonderful? If you find a studio in the same city to shoot in other places, it will be much more expensive, after all, the studio needs to pay time and transportation costs.\r\n"
        },
        {
          "zh": "\r\n\r\n拍摄时间定在工作日是最好的，因为工作日外景人少，很好拍，还有就是工作人员工作日上班肯定是比较开心的，因为大量的人都想在周末。",
          "en": "\r\n\r\nThe best time to shoot is on weekdays, because there are fewer people in the outdoor scene on weekdays, which is easy to shoot, and the staff must be happier to work on weekdays, because a lot of people want to be on weekends.\r\n"
        },
        {
          "zh": "\r\n\r\n### 照片冲印",
          "en": "\r\n\r\n### Photo Printing\r\n"
        },
        {
          "zh": "\r\n也就是 “洗照片”， 首先摄影工作室肯定会有相册相框之类的，但是其实淘宝打印照片和带木框的很便宜，7 寸的摆台只要几十元。 网上你可选的种类比摄影工作室提供的丰富的多。",
          "en": "\r\nThat is, \"developing photos\", first of all, the photography studio will definitely have photo albums and photo frames, but in fact, printing photos and wooden frames on Taobao is very cheap, and a 7-inch stand only costs a few dozen yuan. There are many more types you can choose online than the photography studio provides.\r\n"
        },
        {
          "zh": "\r\n\r\n安利一家照片打印店： 富士冲印，打印 6 寸的照片只需要 1 元一张，效果比摄影工作室给的打印效果好多了，也可能是我这家工作室找的冲印商不太行。",
          "en": "\r\n\r\nRecommend a photo printing shop: Fuji Printing, printing 6-inch photos only costs 1 yuan each, and the effect is much better than the printing effect given by the photography studio, or maybe the printing merchant I found in this studio is not very good.\r\n"
        },
        {
          "zh": "\r\n\r\n## 烟 酒 糖",
          "en": "\r\n\r\n## Cigarettes, Alcohol, Candy\r\n"
        },
        {
          "zh": "\r\n\r\n### 糖腻",
          "en": "\r\n\r\n### Candy\r\n"
        },
        {
          "zh": "\r\n\r\n糖的大头是巧克力，包装，感觉还是看需求，有人觉得无所谓，有人就是想弄好的，单份价格一般到 10 元以上就是非常好的了，控制在 10 元以下也是可行的。",
          "en": "\r\n\r\nThe bulk of the candy is chocolate, packaging, it still depends on the needs, some people don't care, some people just want to make it good, the price per serving is generally more than 10 yuan is very good, it is also feasible to control it below 10 yuan.\r\n"
        },
        {
          "zh": "\r\n\r\n### 酒苦",
          "en": "\r\n\r\n### Alcohol\r\n"
        },
        {
          "zh": "白酒，红酒，啤酒",
          "en": "Baijiu, red wine, beer"
        },
        {
          "zh": "\r\n\r\n啤酒价格便宜，大家也似乎不怎么挑剔。",
          "en": "\r\n\r\nBeer is cheap, and everyone doesn't seem to be very picky.\r\n"
        },
        {
          "zh": "\r\n\r\n红酒的水很深啊，我觉得红酒就是外国人的啤酒，莫不要趟浑水，15 元一瓶不要吃惊，40 元一瓶也不是不行，上百那就是妥妥智商税了。而且会喝的人也很少，比如我这片区域就是干红配雪碧喝，完全无醒酒这种概念。",
          "en": "\r\n\r\nThe water in red wine is very deep, I think red wine is the foreigner's beer, don't wade into the muddy water, don't be surprised if it is 15 yuan a bottle, 40 yuan a bottle is not impossible, hundreds of yuan is a proper IQ tax. Moreover, there are very few people who can drink it, for example, in my area, dry red wine is drunk with Sprite, and there is no concept of sobering up at all.\r\n"
        },
        {
          "zh": "\r\n\r\n白酒还是依据长辈精神需求选择合适的档次吧，我的价格参考渠道是京东一年内的历史最低价，拿这个价位去和线下的店去谈。江苏地区这边直接化身洋河酒厂粉丝，海天梦、海天梦。",
          "en": "\r\n\r\nBaijiu should still be based on the spiritual needs of the elders to choose the appropriate grade, my price reference channel is the historical lowest price within a year of Jingdong, take this price to talk to offline stores. In Jiangsu area, I directly transformed into a fan of Yanghe Winery, Haitian Dream, Haitian Dream.\r\n"
        },
        {
          "zh": "\r\n\r\n小知识：酒摆在柜台上，有个东西叫陈列费，酒厂是要给钱，才会摆在好位置的，也算是一种广告吧。",
          "en": "\r\n\r\nLittle knowledge: When wine is placed on the counter, there is a thing called display fee, and the winery has to pay money to be placed in a good position, which is also a kind of advertisement.\r\n"
        },
        {
          "zh": "\r\n\r\n### 烟呛",
          "en": "\r\n\r\n### Cigarettes\r\n"
        },
        {
          "zh": "烟，这件事似乎各地的选择出奇的一致：华子，华子，还他妈是华子。",
          "en": "Cigarettes, it seems that the choices in various places are surprisingly consistent: China Tobacco, China Tobacco, it's still China Tobacco."
        },
        {
          "zh": "\r\n\r\n正常情况还是选择硬盒中华，零售价：45/包，如财力雄厚那就应该是软华子。本地区也会搭配几条红双喜香烟，各个地方不知是否有不同。",
          "en": "\r\n\r\nUnder normal circumstances, choose the hard-boxed Zhonghua, retail price: 45 / pack, if you are rich, it should be soft Zhonghua. This area will also be matched with a few Red Double Happiness cigarettes, I don't know if there are any differences in various places.\r\n"
        },
        {
          "zh": "\r\n\r\n香烟价格按条买都有优惠，我拿到的华子价格是 415/条。",
          "en": "\r\n\r\nThere are discounts on cigarettes when you buy them by the strip, and the price I got for Zhonghua is 415 / strip.\r\n"
        },
        {
          "zh": "\r\n\r\n推荐一个香烟价格查询网站，这里你甚至能看到批发价，我觉得参考性挺不错的。",
          "en": "\r\n\r\nRecommend a cigarette price query website, here you can even see the wholesale price, I think the reference is pretty good.\r\n"
        },
        {
          "zh": "\r\n\r\n> https://www.cnxiangyan.com/",
          "en": "\r\n\r\n> https://www.cnxiangyan.com/\r\n"
        },
        {
          "zh": "\r\n\r\n## 餐标",
          "en": "\r\n\r\n## Meal Standard\r\n"
        },
        {
          "zh": "\r\n\r\n餐标指的是一餐一桌的价格，一般 10 人一桌，餐标为 2000 ，就是 200 元/人 了。",
          "en": "\r\n\r\nMeal standard refers to the price of a table for one meal, generally 10 people per table, meal standard is 2000, which is 200 yuan / person.\r\n"
        },
        {
          "zh": "\r\n\r\n餐标肯定不同地区有较大的差异（人力，场地成本，当地经济水平）。",
          "en": "\r\n\r\nMeal standards must vary greatly from region to region (labor, site costs, local economic level).\r\n"
        },
        {
          "zh": "\r\n\r\n评价标准就是好吃和价格，好吃吗这个问题，你如果附近吃的少，只能多问问人，参考大量的评价。价格上的评价主要是看菜单，但是看菜单也是个技术活。很遗憾，我没有做好这件事，或者说我没有主导饭店的选择，也没有摸到如何确定底价。",
          "en": "\r\n\r\nThe evaluation criteria are delicious and price. If you don't eat much nearby, you can only ask people more and refer to a lot of reviews. The evaluation of the price is mainly to look at the menu, but looking at the menu is also a technical job. Unfortunately, I didn't do this well, or I didn't take the lead in the choice of the restaurant, and I didn't figure out how to determine the bottom price.\r\n"
        },
        {
          "zh": "\r\n\r\n## 婚礼策划",
          "en": "\r\n\r\n## Wedding Planning\r\n"
        },
        {
          "zh": "\r\n婚礼策划，也就是婚庆公司，是当天体验比较重要的一环，装饰和节奏把控都由婚庆公司负责。",
          "en": "\r\nWedding planning, also known as wedding company, is a very important part of the day's experience, and the decoration and rhythm control are the responsibility of the wedding company.\r\n"
        },
        {
          "zh": "\r\n\r\n人上就是所谓 4 大金刚，主持，化妆，摄影，摄像。值得注意的是 500 元一天的主持也有，2000 元一天的也有，其他人同理， 一定小心婚礼策划在人力环节缩水，婚礼策划可是很贵的一环。",
          "en": "\r\n\r\nPeople on the stage are the so-called 4 King Kongs, host, makeup, photography, video. It is worth noting that there are also hosts for 500 yuan a day, and there are also hosts for 2000 yuan a day, and the same is true for others. Be careful that the wedding planning is reduced in the manpower link, wedding planning is a very expensive link.\r\n"
        },
        {
          "zh": "\r\n\r\n餐标和婚礼策划我都没有找到如何确定底价的方法，而且也有点面向女方销售的意味在其中。",
          "en": "\r\n\r\nI have not found a way to determine the bottom price for meal standards and wedding planning, and it also has a bit of a meaning to sell to women.\r\n"
        },
        {
          "zh": "\r\n\r\n只能建议是都多看几家，有的城市比如南京，据说奇贵无必，甚至不如你去附近的城市找，包车票回来都比南京的便宜...",
          "en": "\r\n\r\nI can only suggest that you look at a few more, some cities such as Nanjing, it is said that it is extremely expensive, even better than you go to nearby cities to find, and the chartered fare back is cheaper than Nanjing...\r\n"
        },
        {
          "zh": "\r\n\r\n不要过早做决定，多看！多看！",
          "en": "\r\n\r\nDon't make a decision too early, watch more! Watch more!\r\n"
        },
        {
          "zh": "\r\n\r\n另外我觉得最好对婚礼当天的跟拍和照片不要有太多期待，",
          "en": "\r\n\r\nAlso, I think it is best not to have too many expectations for the follow-up shots and photos on the wedding day,\r\n"
        },
        {
          "zh": "\r\n\r\n拍照的要诀是什么？",
          "en": "\r\n\r\nWhat is the key to taking pictures?\r\n"
        },
        {
          "zh": "\r\n\r\n**光线，光线，还是他妈的光线！**",
          "en": "\r\n\r\n**Light, light, or the fucking light!**\r\n"
        },
        {
          "zh": "\r\n\r\n可是，吃饭的地方采光是不够的，你也没有时间摆姿势，也没办法去选景。",
          "en": "\r\n\r\nHowever, the lighting in the place where you eat is not enough, you don't have time to pose, and you can't choose the scene.\r\n"
        },
        {
          "zh": "\r\n\r\n## 酒店住宿",
          "en": "\r\n\r\n## Hotel Accommodation\r\n"
        },
        {
          "zh": "\r\n\r\n如有外地朋友需要住宿，我参考的是美团价格。要知道，美团这种垄断地位的企业，抽成是绝对不会少的，20% 30% 也不要惊讶，试着让酒店方吐出这个抽成变成优惠也不是难事。",
          "en": "\r\n\r\nIf foreign friends need accommodation, I refer to the Meituan price. You must know that Meituan, a company with a monopoly position, will definitely not have less commission, don't be surprised if it is 20% 30%, it is not difficult to try to get the hotel to spit out this commission and turn it into a discount.\r\n"
        },
        {
          "zh": "\r\n\r\n## 费用清单",
          "en": "\r\n\r\n## List of Expenses\r\n"
        },
        {
          "zh": "\r\n\r\n杂乱无章的费用清单，不含盖所有费用，参考价值有限。",
          "en": "\r\n\r\nA disorderly list of expenses, not covering all expenses, the reference value is limited.\r\n"
        },
        {
          "zh": "\r\n\r\n![image.png]( https://coala.top/upload/2023/6/image-8c043873d91748e48f7b80558aee1a08.png)",
          "en": "\r\n\r\n![image.png]( https://coala.top/upload/2023/6/image-8c043873d91748e48f7b80558aee1a08.png)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我这北方农村, 全办下来差不多是 OP 的零头, 我们这餐标差不多是 800 一桌, 不含饮料烟酒.餐标降了, 配套的烟酒自然也不会选太贵的, 这样一来光酒席差不多花了不到 3 万.",
          "en": "I'm from a rural village in the north, and the whole thing costs about a fraction of OP's budget. Our meal standard here is about 800 per table, excluding drinks, cigarettes, and alcohol. If the meal standard is reduced, the matching cigarettes and alcohol will naturally not be too expensive, so the banquet alone costs less than 30,000."
        },
        {
          "zh": "糖我是置办了两三百份那样子, 一共就花了几百块钱.",
          "en": "I prepared two or three hundred servings of candy, which cost a few hundred yuan in total."
        },
        {
          "zh": "我婚纱照是在工作地拍的, 所以价格和 OP 差不多, 婚庆这边是选的村里的人操办, 拢共花了一万多, 不到两万.",
          "en": "I took my wedding photos at my workplace, so the price is similar to OP's. The wedding arrangements were handled by people in the village, which cost more than 10,000, less than 20,000 in total."
        },
        {
          "zh": "不过我们这还要放烟花, 差不多花了小一万. 因为外地朋友来的少, 加上村里都有大炕能住不少人, 酒店也没花几个钱.",
          "en": "However, we also have to set off fireworks, which cost almost 10,000. Because few friends from other places came, and the village has large kang beds that can accommodate many people, the hotel didn't cost much."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还好我结的早，2011 年，结婚的时候老婆刚南航毕业，南京就一桌，老家三四桌。没有彩礼没拍婚纱照。看起来给我省了起码十几万啊",
          "en": "Fortunately, I got married early, in 2011. When I got married, my wife had just graduated from China Southern Airlines. There was one table in Nanjing and three or four tables in my hometown. No betrothal gifts, no wedding photos. It looks like it saved me at least hundreds of thousands."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我一同学结婚快 4 年了还没办婚宴，一直跟所有人说很快就办，这很快已经 4 年了，属实是最高端的理财，赚了至少十几万",
          "en": "A classmate of mine has been married for almost 4 years and hasn't held a wedding banquet yet. He keeps telling everyone that it will be held soon, but it's already been 4 years. It's really the most high-end financial management, earning at least hundreds of thousands."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "常年在外的打工人，说实话，去年回老家（坐标汕头）吃了 3 次结婚席，都问了，没有一个是单价 3000/桌以下的，还不包烟酒水，最贵的一次是 5000/桌，不禁感叹经济如此落后的地方，操办宴席如此大手大脚",
          "en": "As a migrant worker who is away from home all year round, to be honest, I went back to my hometown (located in Shantou) last year and ate at 3 wedding banquets. I asked all of them, and none of them were less than 3000/table, excluding cigarettes, alcohol, and drinks. The most expensive one was 5000/table, which makes me sigh that in such an economically backward place, the banquet is handled so lavishly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有钱人啊，酒席白酒直接用的 M6+，NBplus",
          "en": "Rich people, the baijiu for the banquet directly used M6+, NBplus."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总结：不结婚",
          "en": "In conclusion: Don't get married."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "10 几 w 其实都算便宜的了，我同事结婚彩礼都要拿 10 几 w ，加上酒席，差不多要 40 多 w 了",
          "en": "Hundreds of thousands are actually considered cheap. My colleague's wedding required hundreds of thousands for the betrothal gifts, plus the banquet, it was almost four hundred thousand."
        },
        {
          "zh": "不过他都是家里面出钱帮衬现在这年头都是老一辈想要下一辈结婚，然后出钱出力实际上新一代没几个想花而且能花那么多钱结婚",
          "en": "However, his family paid for it. Nowadays, the older generation wants the younger generation to get married, and then they pay for it. In fact, few of the newer generation want to spend, and can spend so much money to get married."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我就在想收份子能挣回来不？我之前看别人说结婚还赚钱不知道真假。",
          "en": "I was wondering if I could earn back the money from the monetary gifts? I saw someone say before that getting married makes money, I don't know if it's true."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "从餐标上看 感觉 op 是不是苏北那边的， 苏北现在的酒席都用 M6+了吗",
          "en": "Looking at the meal standard, I feel like OP is from northern Jiangsu? Are banquets in northern Jiangsu now using M6+?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好夸张但是每一项都符合当代大部分人的结婚要求，这钱花在自己小家上不知道多爽啊",
          "en": "It's so exaggerated, but every item meets the marriage requirements of most people today. I don't know how great it would be to spend this money on your own little family."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同江苏地区，婚礼的钱基本上份子钱都能赚回来。结婚主要还是彩礼和买房的钱",
          "en": "Same as Jiangsu area, the money for the wedding can basically be earned back from the monetary gifts. The main money for marriage is still the betrothal gifts and the money to buy a house."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bk201 现在份子钱一般都退回去了，不知道其他地方是不是这样。",
          "en": "@bk201 Now the monetary gifts are generally returned, I don't know if this is the case in other places."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "江浙地区还是富裕，我大湖南农村，一桌基本都是几百块，上千的可花不起啊",
          "en": "The Jiangzhe area is still rich, in my rural Hunan, a table is basically a few hundred yuan, I can't afford to spend thousands."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "啥雪碧啊，这么贵",
          "en": "What Sprite? That's so expensive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bk201 按 OP 说的，10 人一桌，办了 24 桌。算平均 600 份子钱，一共 144000",
          "en": "@bk201 According to OP, 10 people per table, 24 tables were held. Calculate an average of 600 monetary gifts, a total of 144000"
        },
        {
          "zh": "考虑江浙地区，份子钱应该只大不小，应该是不亏的",
          "en": "Considering the Jiangzhe area, the monetary gifts should only be larger, it should not be a loss."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "策划+酒席就 10W+了，再加华子和 M6 ，席数 20+，价格确实比北方贵多了",
          "en": "Planning + banquet is 10W+, plus China Tobacco and M6, number of tables 20+, the price is indeed much more expensive than in the north."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "婚礼这么办确实要花这些钱，我觉得这是该有的仪式感",
          "en": "It really costs this much to have a wedding like this, I think this is the sense of ceremony that should be there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我朋友今年婚礼，他简单算了一下，把各种费用算进去，一桌 1w ，10 个人左右，然后请 20 多桌。光一个婚礼就 25w 了，换成我，加点钱都上 brz 了 。",
          "en": "My friend's wedding this year, he simply calculated it, including all kinds of expenses, 1w per table, about 10 people, and then invited more than 20 tables. The wedding alone cost 25w, if it were me, I would get a brz with a little more money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@misaki321 我们这份子钱都是按家庭为单位给, 但是吃饭的一般是全家一起上, 一家三到六个人一份份子钱全家来吃席都很正常.",
          "en": "@misaki321 We give the monetary gifts by family, but the people who eat are generally the whole family, it is normal for a family of three to six people to come to the banquet with one monetary gift."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jstony #10 不是",
          "en": "@jstony #10 No"
        }
      ],
      "type": "replies"
    }
  ]
}