{
  "id": 1111170,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "初次去香港的一些见闻和感受",
          "en": "Some first impressions and feelings about visiting Hong Kong"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "这次去的目的是办卡，总共就呆了两天。\r\n\r\n感受如下：",
          "en": "The purpose of this trip was to get a bank card, and I stayed for a total of two days.\r\n\r\nMy impressions are as follows:"
        },
        {
          "zh": "1.出了西九龙高铁站抬头一眼看见了几个巨幅大字\"耶稣是主\"，这算是第一个冲击，在内地不可能见到如此直白的宗教宣传，所以很明显感受到这个地方和内地真的不一样",
          "en": "1. As soon as I exited the West Kowloon High-Speed Rail Station and looked up, I saw huge characters saying 'Jesus is Lord.' This was the first shock. It's impossible to see such blatant religious propaganda in mainland China, so I clearly felt that this place is really different from the mainland."
        },
        {
          "zh": "2.城市确实很老旧，但是，他们的大部分设施只是老，但是功能没有任何问题。和内地比起来我觉得是金玉其外和金玉其内的区别（关于这点后面会有更深的感受）。",
          "en": "2. The city is indeed very old, but most of their facilities are just old, but the functions are not problematic at all. Compared with the mainland, I think it's the difference between being superficially attractive and intrinsically valuable (I will have a deeper feeling on this point later)."
        },
        {
          "zh": "3.交通方面并没有想象的方便，之前以为香港地方不大人口密度那么高，地铁应该会很方便，但情况并不是这样，地铁通常要走挺远，公交站（好像分大巴小巴之类的）密度应该挺大，但车辆的频率并不高，我坐的那次（小巴）等了快半小时。",
          "en": "3. Transportation is not as convenient as I imagined. I thought that Hong Kong is not a large place and the population density is so high, the subway should be very convenient, but the situation is not like this. The subway usually requires a long walk. The density of bus stops (seems to be divided into large buses and minibuses) should be quite high, but the frequency of vehicles is not high. The time I took the minibus, I waited for almost half an hour."
        },
        {
          "zh": "还有可能是我自己的原因，他们的公交站牌我没看懂。",
          "en": "It's also possible that it's my own reason, I didn't understand their bus stop signs."
        },
        {
          "zh": "另外，坐小巴如果乘客不按铃是不停站的，我坐的那次就坐过了，是到了下一站有个女士按了铃我才跟着下去的，这方面我觉得是为了节省时间。",
          "en": "In addition, if passengers don't press the bell on the minibus, it won't stop. I missed my stop that time. A lady pressed the bell at the next stop, and I followed her down. I think this is to save time."
        },
        {
          "zh": "总体第一天因为赶时间和不熟悉路况等原因，感受挺差的。",
          "en": "Overall, the first day was quite bad due to rushing for time and not being familiar with the road conditions."
        },
        {
          "zh": "但是接下来就完全颠覆了我的感受。",
          "en": "But what followed completely subverted my feelings."
        },
        {
          "zh": "1.几顿饭都是随便进的小饭店吃的，价格平均大概 50 左右，都很好吃，吃得出来食材质量都很好（对比国内的预制菜），分量也很足",
          "en": "1. I ate several meals in small restaurants that I just walked into. The average price was about 50, and they were all delicious. I could tell that the quality of the ingredients was very good (compared to pre-prepared meals in China), and the portions were also very filling."
        },
        {
          "zh": "2.车上车流人流那么密集，但是两天下来我只听到 3 次按喇叭（特意留心数的），都是很短暂的滴一下那种，很不可思议。",
          "en": "2. The traffic and pedestrian flow on the road are so dense, but in two days I only heard the horn 3 times (I paid special attention to counting), and it was just a short beep, which is incredible."
        },
        {
          "zh": "而且好像没看到过堵车的情况，路上车速都很快，即使在中环这种市中心区域。",
          "en": "And it seems that I haven't seen traffic jams. The speed of the cars on the road is very fast, even in the central area like Central."
        },
        {
          "zh": "我猜测原因可能是严格的人车分流以及大家都遵守规则，路两边都有护栏，只在红绿灯位置开放给行人，所以香港的道路几乎全是快速路。",
          "en": "I guess the reason may be the strict separation of people and vehicles and everyone abide by the rules. There are guardrails on both sides of the road, only open to pedestrians at traffic lights, so almost all roads in Hong Kong are expressways."
        },
        {
          "zh": "3.每个红绿灯路口都有盲人导航用的那种滴滴滴的声音，而且声音很大。",
          "en": "3. Every traffic light intersection has that beep beep beep sound for blind people navigation, and the sound is very loud."
        },
        {
          "zh": "一开始听着还觉着有点刺耳且觉得有这个必要吗，直到我看到有一个盲人单独拿着一根导盲杖在路上行走，我才感受到这个城市对障碍人士的用心。",
          "en": "At first, I felt a little harsh and wondered if it was necessary, until I saw a blind person walking alone on the road with a cane, and I realized the city's care for people with disabilities."
        },
        {
          "zh": "路上有很多坐轮椅的人，他们几乎可以顺利通行任何地方。",
          "en": "There are many people in wheelchairs on the road, and they can almost pass any place smoothly."
        },
        {
          "zh": "4.关于香港本地人歧视说普通话的内地人，我个人的感受是这是个误会。",
          "en": "4. Regarding the discrimination against mainlanders who speak Mandarin by local Hong Kong people, my personal feeling is that this is a misunderstanding."
        },
        {
          "zh": "举个例子，我第一次办卡的那个分行，客户经理跟我说话非常客气，然后中间我在填表格的时候来了个本地人用粤语跟他说一些事情（我完全听不懂），他们俩对话就跟吵架似的，然后中途时不时客户经理会弯下腰小声非常客气地跟我指导\"x 先生，您 xxx\"，然后站起来接着跟那位本地大街\"吵架\"，那种感觉就像面对家里来的客人。",
          "en": "For example, in the branch where I first applied for the card, the account manager spoke to me very politely. Then, while I was filling out the form, a local person came to him and said something in Cantonese (I couldn't understand at all). The two of them talked like they were arguing. Then, in the middle, the account manager would bend down and whisper very politely to guide me, 'Mr. X, you xxx', then stand up and continue to 'argue' with the local person, that feeling is like facing guests at home."
        },
        {
          "zh": "也的确遇到过几次态度不好，一次是坐小巴我问了下司机这车是不是到 xx ，对方是个五六十岁的大叔，非常不耐烦地说了几句，我没听懂，然后我就下车了。",
          "en": "I did encounter a few times with a bad attitude. Once, I took a minibus and asked the driver if the bus was going to xx. The other party was an uncle in his fifties or sixties, and he said a few words very impatiently. I didn't understand, and then I got off the bus."
        },
        {
          "zh": "还有饭店老板大部分不会像内地这样笑脸相迎，更多的是面无表情的滴给你菜单，但他们面对说粤语的本地人也就那样。",
          "en": "Also, most restaurant owners don't greet you with a smile like in the mainland. More often, they give you the menu expressionlessly, but they are the same way to local people who speak Cantonese."
        },
        {
          "zh": "我个人的感觉是，第一他们的商家和消费者是更平等的关系，而不是像内地这样好像去消费就是大爷。",
          "en": "My personal feeling is that, first, their merchants and consumers have a more equal relationship, rather than like in the mainland, where it seems that going to consume is being the boss."
        },
        {
          "zh": "还有他们做事更讲究按规则办事，所以人和人之间显得比较冷漠。",
          "en": "They also pay more attention to following the rules, so people seem more indifferent to each other."
        },
        {
          "zh": "我个人不觉得这有什么问题。",
          "en": "I personally don't think there's anything wrong with this."
        },
        {
          "zh": "总结，这次去有好的感受也有不好的，但总体我觉得还是感受到了发达经济体和发展中经济体的区别。",
          "en": "In summary, there were good and bad feelings during this trip, but overall I felt the difference between a developed economy and a developing economy."
        },
        {
          "zh": "我觉得香港的文明程度还是很高的，感觉在那边**不用总提防着如何不被坑蒙拐骗，这种能够放心的感觉太棒了。**",
          "en": "I think Hong Kong's civilization is still very high. I feel that I **don't always have to be on guard against being scammed, and this feeling of being able to relax is great.**"
        },
        {
          "zh": "香港对我们内地这些 8090 后来说是一个太特殊的存在了，想说的话挺多的，所以内容组织可能有点混乱。",
          "en": "Hong Kong is too special for us mainland 80s and 90s, there are a lot of things I want to say, so the content organization may be a bit chaotic."
        },
        {
          "zh": "最后真心希望香港可以保持自己的独特性，千篇一律的世界真的很没意思。",
          "en": "Finally, I sincerely hope that Hong Kong can maintain its uniqueness. A monotonous world is really boring."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "自适应能力挺强",
          "en": "The adaptability is quite strong"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "通篇都是我猜测，我的原因...不知道的还以为看意林",
          "en": "The whole article is my guess, my reason... I thought I was reading Yi Lin"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Bazingal 你说的是自适应商家的态度吗？我个人的话宁愿选择态度差一点但东西是好东西，也不选择没进门就大哥大姐叫着但东西是烂的。",
          "en": "@Bazingal Are you talking about the adaptive attitude of merchants? Personally, I would rather choose a slightly worse attitude but the things are good, than choose someone who calls you big brother and big sister as soon as you enter the door, but the things are bad."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看到有人说 OP“你第 4 项里写的感受是错误的”，感受本身就是一个纯粹主观的东西，这也能分对错吗？",
          "en": "Seeing someone say that OP 'The feelings you wrote in item 4 are wrong', feelings themselves are a purely subjective thing, can this be divided into right and wrong?"
        },
        {
          "zh": "感受到痛苦，人都是错的吗？",
          "en": "If you feel pain, are people wrong?"
        },
        {
          "zh": "这种人太可怕，总想着“纠正”别人",
          "en": "This kind of person is terrible, always thinking about 'correcting' others"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Gezqh 只说吃的，你可以不做攻略查询轻松走进任何一家饭馆吃饭而不用担心食品质量问题吗？",
          "en": "@Gezqh Just talking about food, can you easily walk into any restaurant without doing any research and not worry about food quality issues?"
        },
        {
          "zh": "更不用说街边的小吃？",
          "en": "Not to mention street snacks?"
        },
        {
          "zh": "这不是一种“骗”吗？",
          "en": "Isn't this a kind of 'deception'?"
        },
        {
          "zh": "油罐车等等事件过去多久？",
          "en": "How long has it been since the oil tanker and other incidents?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "滤镜还是挺重，就和平时把自家人的好认为理所当然，一些小问题就揪着不放。",
          "en": "The filter is still quite heavy, just like taking the good of your own people for granted, and dwelling on some minor problems."
        },
        {
          "zh": "然后遇到陌生人对你一点点的善意就感觉人家很好，觉得比自家人好多了。",
          "en": "Then, when you meet strangers who show you a little bit of kindness, you feel that they are very good and think that they are much better than your own people."
        },
        {
          "zh": "楼主很典型了，然后还强调自己客观",
          "en": "The poster is very typical, and then emphasizes that he is objective"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "之前在香港迷路了，问一个路人，那人只会粤语和英语，她特地跟她一个会说普通话的朋友视频通话，给我翻译带路，我当时挺感动的。",
          "en": "I got lost in Hong Kong before and asked a passerby. That person only spoke Cantonese and English. She specially had a video call with a friend who spoke Mandarin to translate and lead the way for me. I was very touched at the time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "七八年前去过巴黎，去之前预期很低，都说巴黎人比较 diao ，不友好，治安不好，等等。",
          "en": "I went to Paris seven or eight years ago. My expectations were very low before I went. Everyone said that Parisians are more arrogant, unfriendly, the public security is not good, etc."
        },
        {
          "zh": "去了之后感觉巴黎还挺好的，当地人普遍很友好的，问路之类的都很热心，（我一句法语不会说）全程说英语，并没有网上说的那种说英语会被甩脸色的情况。",
          "en": "After I went, I felt that Paris was pretty good. The locals were generally very friendly. They were very enthusiastic about asking for directions, etc. (I don't speak a word of French) I spoke English throughout the whole process, and there was no situation where I would be snubbed for speaking English as the internet said."
        },
        {
          "zh": "当然我就在巴黎待了五六天，只是简单的感受了一下。",
          "en": "Of course, I only stayed in Paris for five or six days and just had a simple experience."
        },
        {
          "zh": "说实话有一点我比较认同楼主的看法，很多时候只是其他地方的人相互更尊重而已（同时也更尊重自己）。",
          "en": "To be honest, I agree with the poster's view that in many cases, people in other places just respect each other more (and also respect themselves more)."
        },
        {
          "zh": "咱们很多时候更习惯于人之间有阶层区别（要么高人一等，要么低人一等），对方没表现出来低自己一等，就觉得人家态度不好甚至乳化，其实对方很大概率对其他人也是这个态度。。",
          "en": "Very often we are more accustomed to having class differences between people (either being superior or inferior). If the other party does not show that they are inferior to themselves, they feel that the other party's attitude is bad or even insulting China. In fact, the other party is very likely to have the same attitude towards other people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@evan9527 何必呢，你想证明啥？",
          "en": "@evan9527 Why bother, what do you want to prove?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当自己的经历和网上大量案例不同的时候，一般人会感觉自己是个例或者网上的说的是个例，但是绝对用“误会”这个说法。",
          "en": "When one's own experience is different from a large number of cases online, most people will feel that they are an individual case or what is said online is an individual case, but definitely use the term 'misunderstanding'."
        },
        {
          "zh": "别人是误会，你就去了一次两天就能理解了，可能是你理解能力太强了。",
          "en": "Others are misunderstandings, and you can understand it after only going there once for two days. Maybe your understanding is too strong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有 HK 没有坑蒙拐骗？",
          "en": "Also, there is no scamming in HK?"
        },
        {
          "zh": "知道空头支票诈骗，HK 叫 “弹票” 么？",
          "en": "Do you know about bad check fraud, HK calls it 'bounced check'?"
        },
        {
          "zh": "专门逮着大陆人宰。",
          "en": "Specially catching mainlanders to rip off."
        },
        {
          "zh": "真的，你才去一次，给这个地方加了太多的滤镜了，多去 xhs 看看，HK 那边是怎么宰大陆人的。",
          "en": "Really, you've only been there once and added too many filters to this place. Go to xhs and see how mainlanders are ripped off in HK."
        },
        {
          "zh": "本人身为在港资企业工作的，经常深港两地出差来回跑的人，对这地方没有啥好感",
          "en": "As someone who works in a Hong Kong-funded company and often travels back and forth between Shenzhen and Hong Kong, I don't have a good impression of this place"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近三年从疫情结束前至今都住在 HK ，很同意楼主的大部分感受，但是也请不要过于放松警惕，HK 的“坑蒙拐骗”很多方面比内地有过之而无不及得多，短暂的旅行没有遇到很正常。",
          "en": "I have been living in HK for the past three years since before the end of the epidemic. I agree with most of the poster's feelings, but please don't relax your vigilance too much. HK's 'scams' are in many ways more than those in the mainland. It's normal not to encounter them during a short trip."
        },
        {
          "zh": "非常喜欢最后一句，“希望香港可以保持独特性，千篇一律的世界真的很没意思”，:)附一些个人的感想，1.",
          "en": "I really like the last sentence, 'I hope Hong Kong can maintain its uniqueness, a monotonous world is really boring', :) Attached are some personal thoughts, 1."
        },
        {
          "zh": "高铁站一出来就能看到的巨幅”耶稣是主“我每次路过都会有同样的感概；2.",
          "en": "The huge 'Jesus is Lord' that you can see as soon as you exit the high-speed rail station, I have the same feeling every time I pass by; 2."
        },
        {
          "zh": "金玉其外/其内的表述简直不能同意更多，我甚至也同样和朋友谈到过； HK 表面上陈旧混乱，实则事事皆有规矩，尽管有时繁文缛节多，但总体来说是便捷好用的；不过没有完美的，可能随着不可逆的时代变迁，有些东西终将失去；3.",
          "en": "I couldn't agree more with the statement of superficially attractive/intrinsically valuable, I even talked about it with my friends; HK looks old and chaotic on the surface, but in fact everything has rules, although sometimes there are many red tapes, but in general it is convenient and easy to use; but there is no perfect thing, maybe with the irreversible changes of the times, some things will eventually be lost; 3."
        },
        {
          "zh": "交通基本还是很方便，毕竟地方也不大，熟悉了巴士和小巴，会用 APP （ google map 不太准，有 HK GoV 的官方 APP 很准）看时间的话，会好很多；对初来乍到的人确实不特别友好，非常可以理解；4.",
          "en": "Transportation is basically still very convenient, after all, the place is not too big. If you are familiar with buses and minibuses and use the APP (google map is not very accurate, there is an official APP of HK GoV that is very accurate) to check the time, it will be much better; it is indeed not particularly friendly to newcomers, which is very understandable; 4."
        },
        {
          "zh": "普通话歧视倒是真有的，只不过疫情之后随着某法令的颁布执行等等一系列变化，表面上能遇到的体感逐渐在变少；对内地游客来说是好事，但某种意义上也是 HK 失去的一部分“个性”（中性，无关褒贬，不同意就是你对）",
          "en": "There is indeed discrimination against Mandarin, but after the epidemic, with the promulgation and implementation of a certain law and a series of changes, the sensory experience that can be encountered on the surface is gradually decreasing; it is a good thing for mainland tourists, but in a sense, it is also part of the 'personality' that HK has lost (neutral, irrelevant to praise or criticism, if you don't agree then you are right)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "带着有色眼镜和双重标准去看待两个地方，那你肯定得到的就是你心里的答案，没什么讨论的。",
          "en": "Looking at two places with colored glasses and double standards, then you will definitely get the answer in your mind, there is nothing to discuss."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fancy2020 #6 他在嘲讽你，不过算了，屁股决定脑袋，他摆明了立场和你不一样，不要理这种人就好，不管是现实中还是网络里。",
          "en": "@fancy2020 #6 He is mocking you, but forget it, your position determines your mindset, he has made it clear that his position is different from yours, just ignore this kind of people, whether in reality or online."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fancy2020 #77 吃屎吧你 还给臭港洗白？",
          "en": "@fancy2020 #77 Eat shit, you’re still whitewashing stinky Hong Kong?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你可以说你没遇到歧视，但不要说是个误会，你不知道别人的经历。",
          "en": "You can say that you didn't encounter discrimination, but don't say it's a misunderstanding, you don't know other people's experiences."
        },
        {
          "zh": "我多年前的经历，不谈普通市民，就服务行业人员对大陆人的态度区别都很明显（我印象比较好的是迪士尼工作人员）",
          "en": "My experience many years ago, not to mention ordinary citizens, the attitude of service industry personnel towards mainlanders was very different (I have a good impression of Disney staff)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Livid 138 楼，人身攻击",
          "en": "@Livid 138th floor, personal attack"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@evan9527 噗，楼主的感受就是楼主的感受，这还有对错之分。",
          "en": "@evan9527 Pfft, the poster's feelings are the poster's feelings, is there a distinction between right and wrong here?"
        },
        {
          "zh": "我感觉一包康师傅红烧牛肉面太辣了，我的感受是对还是错的",
          "en": "I feel that a pack of Master Kong braised beef noodles is too spicy, are my feelings right or wrong?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你试试只说英文再去体验一下。",
          "en": "Try speaking only English and experience it again."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得你如果真的觉得哪个商家态度差，你转头走就是了。",
          "en": "I think if you really think a merchant has a bad attitude, you can just turn around and leave."
        },
        {
          "zh": "我通篇强调的都是“个人感受”，就我在那吃的那几顿饭来说，商家最多就是表情冷漠，没啥被冒犯的感觉，但同样也不会有“被推销”的感觉。",
          "en": "I have been emphasizing 'personal feelings' throughout the whole article. As far as the meals I ate there, the merchants at most had a cold expression, and I didn't feel offended, but there was also no feeling of being 'promoted to'."
        },
        {
          "zh": "这对我来说也挺好，因为我也懒得对别人回笑。",
          "en": "This is also good for me, because I am too lazy to smile back at others."
        },
        {
          "zh": "就简单的吃饭给钱走人，不挺好吗？",
          "en": "Just simply eat, pay, and leave, isn't that great?"
        }
      ],
      "type": "replies"
    }
  ]
}