{
  "id": 1108579,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "讲讲为什么认为自己是一个失败者",
          "en": "Talk about why you think you are a failure"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "1. 初一第一天报道，老师莫名让我做班长和体育委员，我个性软弱，只坚持了半个学期就被老师换人。\r\n2. 初中体育老师让我和另一个男生在操场画「 T 」字，用来帮助同学每一列站的很齐，但是我画的「 T 」每一列都歪歪扭扭没有对齐，最终体育老师怀恨在心，只给我 60 分。\r\n3. 有一次三人成游，朋友 A 一直在问我去某个景点行不行，我有纠结恐惧症，然后盆友 B 直接生气说：你别问他，他根本没有主意！\r\n4. 成年以后工作总是面试表现非常优秀，进入公司以后就露馅，被冷眼相待，甚至辞退。\r\n\r\n随便说了几点，不止如此，总觉得自己是个失败者，性格软弱，老实巴交，讨好型人格，工作能力差，一事无成。",
          "en": "1. On the first day of seventh grade, the teacher inexplicably asked me to be the class monitor and sports committee member. My personality was weak, and I only lasted for half a semester before the teacher replaced me.\r\n2. My junior high school PE teacher asked me and another boy to draw a 'T' on the playground to help the students stand in neat rows, but the 'T' I drew was crooked and misaligned in every row. In the end, the PE teacher held a grudge and only gave me a score of 60.\r\n3. Once, when three of us were traveling together, friend A kept asking if I wanted to go to a certain attraction. I have decision-making phobia, and then friend B directly said angrily: Don't ask him, he has no opinion at all!\r\n4. After adulthood, my job interviews are always excellent, but after entering the company, I am exposed, treated coldly, and even fired.\r\n\r\nI just mentioned a few points, but it's not just that. I always feel like a failure, with a weak personality, honest and simple, a people-pleasing personality, poor work ability, and accomplishing nothing."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "学生时代的事建议翻篇。",
          "en": "It's best to move on from your student days."
        },
        {
          "zh": "恕我直言，学生伢都是傻逼。",
          "en": "Frankly speaking, students are stupid."
        },
        {
          "zh": "社会上面试包装好，进去后实力不符的事太多了，表情包都见到几个。",
          "en": "There are too many cases in society where people are well-packaged for job interviews, but their abilities don't match after they get in. I've seen several memes about it."
        },
        {
          "zh": "这个得自己调整心态，比如“你自己招进来的难道怪我”。",
          "en": "You have to adjust your mentality yourself, such as thinking 'You hired me, is it my fault?'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "包袱有点重，别太在意别人看法。",
          "en": "You're carrying too much baggage, don't pay too much attention to what others think."
        },
        {
          "zh": "能包装自己过面试也是本事",
          "en": "Being able to package yourself to pass an interview is also a skill."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你得有明确的目标才能谈论成功和失败，只有所有的目标都失败才是失败者。",
          "en": "You need to have clear goals to talk about success and failure. Only when all goals fail is one a failure."
        },
        {
          "zh": "我不认为楼主的目标包括讨十几年前的老师同学喜欢。",
          "en": "I don't think the original poster's goal includes pleasing teachers and classmates from more than ten years ago."
        },
        {
          "zh": "工作顺利可以被当成一个目标，但是不应该是唯一的目标。",
          "en": "Smooth work can be considered a goal, but it shouldn't be the only one."
        },
        {
          "zh": "我感觉楼主就是因为工作不顺利，导致陷入自我怀疑开始胡思乱想。",
          "en": "I feel that the original poster is doubting themselves and overthinking because of work problems."
        },
        {
          "zh": "但是现在大环境不好，工作本身就不是一个好目标。",
          "en": "But with the current bad environment, work itself is not a good goal."
        },
        {
          "zh": "建议楼主多关注一些工作之外的事，自我实现的方式有很多，没必要选择最拥挤的赛道。",
          "en": "I suggest the original poster pay more attention to things outside of work. There are many ways to achieve self-realization, and there's no need to choose the most crowded track."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你被中国式教育荼毒太深了，以及一个心理学现象“冒名顶替综合征”在你身上看起来很严重。",
          "en": "You have been poisoned too deeply by Chinese-style education, and a psychological phenomenon called 'imposter syndrome' seems to be very serious in you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "讨好人格改改就行，剩下无所谓，普通人大家都这样，工作上再加强点业务能力就行了。",
          "en": "Just change your people-pleasing personality, the rest doesn't matter. Everyone is like this, just strengthen your business skills at work."
        },
        {
          "zh": "太讨好的话找对象小心别被爆金币",
          "en": "If you are too much of a people-pleaser, be careful not to be exploited when finding a partner."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "懦夫的反面不是有勇气，这个默认思路错了，是死路。",
          "en": "The opposite of a coward is not courage; this default thinking is wrong and a dead end."
        },
        {
          "zh": "没人比其他人更有勇气。",
          "en": "No one is more courageous than anyone else."
        },
        {
          "zh": "懦夫的反面是把这个世界当真了，被唯物主义，实用主义洗脑了。",
          "en": "The opposite of a coward is taking this world seriously and being brainwashed by materialism and utilitarianism."
        },
        {
          "zh": "所谓的有勇气的人，只是更加信任这个现实，更加放轻松，不把很多东西“当真”",
          "en": "So-called courageous people just trust this reality more, relax more, and don't take many things 'seriously'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是学生时代彻底的 loser初中开始成绩从来没进过班级前十我也没当过班长跟你一样，硕士笔试面试都过了，进组就漏馅，被导师多次威胁辞退但是，过了三年，我改变了我那懦弱的性格我拼了命科研和恶补本科知识我拿到了这颗星球前十的航天实验室的全奖博士 offer跟我一个实验室的全是及其牛逼的存在（什么前宝马工程师，NASA 兰利中心高级研究员等我都行你为啥不行",
          "en": "I was a complete loser in my student days. Since junior high school, my grades have never been in the top ten of the class, and I have never been a class monitor like you. I passed the master's written and interview exams, but I was exposed after joining the group and was threatened with dismissal by my supervisor many times. However, after three years, I changed my cowardly personality. I desperately worked on scientific research and crammed undergraduate knowledge. I got a full scholarship PhD offer from a top ten aerospace laboratory on this planet. Everyone in my lab is extremely awesome (like former BMW engineers, senior researchers at NASA Langley, etc.). If I can do it, why can't you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过分向内归因以前我也是，后来明白了，相信自己，别人才能相信你，别害怕，世界就是个草台班子",
          "en": "I used to attribute things excessively to myself, but later I understood that you need to believe in yourself so that others can believe in you. Don't be afraid, the world is just a makeshift troupe."
        },
        {
          "zh": "建议看看心理学方面的书籍自己的认知模式其实很难改变，我这么多年来也一直努力在改变",
          "en": "I suggest reading books on psychology. It's actually difficult to change your own cognitive patterns. I've been working hard to change mine for many years."
        },
        {
          "zh": "另外，别太关注其他人对自己的看法，那是其他的课题，不要过度猜测别人怎么看你的，我们每个人最关注的都是自己，其他人根本不关心你，所以你没必要关注别人怎么看你，别人都没有闲时间关注你",
          "en": "Also, don't pay too much attention to what others think of you. That's another topic. Don't over-guess what others think of you. We are all most concerned about ourselves; others don't care about you, so you don't need to care about what others think of you. Others don't have time to pay attention to you."
        },
        {
          "zh": "冯唐成事法则：管我屁事，管你屁事",
          "en": "Feng Tang's Methodology for Success: None of my business, none of your business."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@geseacoEX 不对哦，我不是独生子~也没被溺爱过，只是在成长过程中很「孤单」，所以好多事都不懂。",
          "en": "@geseacoEX That's not right, I'm not an only child~ and I wasn't spoiled. I was just very 'lonely' growing up, so I don't understand a lot of things."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "武艺扎实的士兵上了战场才有机会活下去，把日常基础小事，专业技能基础打扎实吧。",
          "en": "Only well-trained soldiers have a chance to survive on the battlefield. Lay a solid foundation for everyday basic things and professional skills."
        },
        {
          "zh": "个性软弱不是借口，专注自己有实力的人没这个烦恼。",
          "en": "A weak personality is not an excuse; people who focus on their own strengths don't have this problem."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "学会拒绝，只做自己喜欢的，做对一样就行，不必什么都去计较。",
          "en": "Learn to refuse, only do what you like, and just do one thing right. You don't have to worry about everything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "啊？做你自己就好了，永远不要在自己心里把自己当失败者，那你就永远不是失败者。",
          "en": "Huh? Just be yourself. Never consider yourself a failure in your heart, then you will never be a failure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你都这样想了，你不是失败者谁是？",
          "en": "You already think this way, who else is a failure if not you?"
        },
        {
          "zh": "你如果想要改变，先改掉认为自己是失败者的观念你应该打工能挣一点钱了吧，既然有钱，在保证安全的情况下，可以多去找找小姐姐，让别人多夸夸你，建立自己的信心",
          "en": "If you want to change, first change your perception that you are a failure. You should be able to earn some money working. Since you have money, in a safe situation, you can go see some 'miss sisters' and have them praise you to build up your confidence."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "失败、成功取决于你的度量标准比如有些农村人觉得“生了儿子”就成功，生了女儿就失败所以你可以选一个让自己自信一点的标准",
          "en": "Failure and success depend on your standard of measurement. For example, some rural people think that 'having a son' is a success, and having a daughter is a failure, so you can choose a standard that makes you feel more confident."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是不疼不痒的小事  别在意就没啥",
          "en": "They're all trivial things that don't hurt or itch. Don't worry about them, and it's nothing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dji38838c 问题就在于我没有做成的事儿，我唯一自信的可能就是很善良？？共情能力强？",
          "en": "@dji38838c The problem is that I haven't accomplished anything. The only thing I might be confident about is being kind?? And having strong empathy?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说明你年纪还轻 还在纠结初中的事情 等你四十岁 受尽磨难 就会学着让自己释怀了 只为心安 但求活着",
          "en": "It shows that you are still young and still struggling with junior high school issues. When you are forty years old and have suffered enough, you will learn to let go, just for peace of mind and just to survive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议：做自己就好，所有让你不开心的人和事，不计代价当场干回去，不管对方是谁。",
          "en": "Suggestion: Just be yourself. For all the people and things that make you unhappy, fight back on the spot regardless of the cost, no matter who the other party is."
        },
        {
          "zh": "或许你现在做不到，以后等你吃的亏越多，你必然会这么做。",
          "en": "Perhaps you can't do it now, but the more losses you suffer in the future, the more you will do so."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说明你还有上进心啊，我进社会以后或者说离开了学校那种绩效主义环境基本就没什么奋斗的想法了。",
          "en": "It shows that you still have ambition. After I entered society, or rather, left the performance-based environment of school, I basically had no desire to strive for anything."
        },
        {
          "zh": "生活上自己爽是第一位的，消费到了一定水平边际收益就不高了，再高都是装逼的需求；次要的是找个自己的爱好或者理想做梦。",
          "en": "Being happy in life is the first priority. After consumption reaches a certain level, the marginal benefits are not high, and anything higher is just for showing off. The secondary thing is to find your own hobbies or dream ideals."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "鸡汤：将压力看作是挑战。",
          "en": "Words of encouragement: See pressure as a challenge."
        },
        {
          "zh": "“我想我要我可以”，而不是 “不 XXX, 就完蛋了”",
          "en": "'I think I want it, I can do it,' instead of 'If I don't XXX, I'm finished'."
        }
      ],
      "type": "replies"
    }
  ]
}