{
  "id": 1113693,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "你们招人的时候需求一个人但是招 2 个试用期实行末尾淘汰吗",
          "en": "When you recruit, do you need one person but hire 2 on probation and implement last-place elimination?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "这样做有什么好处",
          "en": "What are the benefits of doing this?"
        },
        {
          "zh": "这样做是不是很不道德",
          "en": "Isn't this very unethical?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "特别道德，能把咱公司名字发一下吗我想去",
          "en": "So ethical, can you send me the name of your company? I want to go."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这么说的我就举报一个把，转正前让走人但没有赔偿的。上海创合汇教育科技，希望 v 友别进坑",
          "en": "Seeing this, I'll report one case. They let people go before their official employment and without compensation. Shanghai Chuanghehui Education Technology, I hope V2EX users don't fall into the trap."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@darksword21 我是被淘汰的那个",
          "en": "@darksword21 I was the one who got eliminated."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "事实证明，程序员现在比保洁还好招。",
          "en": "It turns out that programmers are now easier to recruit than cleaners."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@milala 欲骂又止",
          "en": "@milala Wanting to scold but stopping."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zuosiruan #14 现在的人是这样， 怂的一批，侵犯利益了，都只能叫一叫，真要<实名>一下，又觉得“不敢”“不好” 哈哈哈哈",
          "en": "@zuosiruan #14 People are like this now, a bunch of cowards. When their interests are infringed, they can only complain a little. But if you really want them to <use their real name>, they feel \"scared\" and \"bad,\" hahaha."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你是狗么",
          "en": "Are you a dog?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@alexsz 不同在于买的衣服穿了半年要退货。",
          "en": "@alexsz The difference is like buying clothes, wearing them for half a year, and then returning them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@alexsz 如果同时买两双来试穿，然后退掉不合适的，这是面试，不是试用期。",
          "en": "@alexsz If you buy two pairs of shoes at the same time to try them on, and then return the ones that don't fit, that's an interview, not a probationary period."
        },
        {
          "zh": "你要说两个鞋子都穿七天，然后七天到期之前退掉其中一双，那和 OP 这个美没什么不同",
          "en": "If you wear both pairs of shoes for seven days, and then return one of them before the seven days are up, then there is not much difference from what OP mentioned."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@milala #2 那更应该发一下公司名字了",
          "en": "@milala #2 Then you should definitely post the company name."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得应该把现有领导层和 HR 淘汰掉这样的做法是完全的懒和坏招人应该是要招合适的，符合要求的，从面试到试用期都应该是在考察这个人是不是符合要求、满足岗位需求，符合就留，不符合就走",
          "en": "I think the current leadership and HR should be eliminated. This approach is completely lazy and bad. Recruitment should be about finding the right people who meet the requirements. The interview and probation period should be about assessing whether the person meets the requirements and fulfills the job needs. If they meet the requirements, they stay; if they don't, they leave."
        },
        {
          "zh": "如果面试和试用期都不能考察的出来，只能靠末位淘汰来择优的话，那领导层直接走好了，这点能力都没有，当什么领导",
          "en": "If the interview and probation period can't assess this, and you can only rely on last-place elimination to select the best, then the leadership should just leave. If they don't even have this ability, what kind of leaders are they?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@matrix1010 一点也不理性。\"确保高人才密度\" 是要靠非常合理的面试策略、高水平的面试官外加足够好的薪资水平来保证的。",
          "en": "@matrix1010 Not rational at all. \"Ensuring a high density of talent\" depends on very reasonable interview strategies, high-level interviewers, plus sufficiently good salary levels."
        },
        {
          "zh": "末位淘汰是非常非常偷懒的决策方式，要么是把“招人”的优先级放的过低，要么是对人的使用不当。",
          "en": "Last-place elimination is a very, very lazy decision-making method. Either the priority of \"recruiting\" is placed too low, or people are used improperly."
        },
        {
          "zh": "对创业公司来说，沾上这两条，离死不远了。",
          "en": "For startups, getting involved in these two things is not far from death."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 说了公司名称不是立刻就暴露了自己吗，骂人的是什么心态",
          "en": "Doesn't OP expose themself immediately by saying the company name? What is the mentality of the person scolding?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@iMiata 法国劳动法禁止试用期末位淘汰，这种案例一告一个准",
          "en": "@iMiata French labor law prohibits last-place elimination during the probationary period. These cases always win if you sue."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "公司名字发一下",
          "en": "Post the company name."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "遇到过，我直接走了",
          "en": "I've encountered this before, I left directly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "合理赔偿了吗，不合理直接仲裁",
          "en": "Was there reasonable compensation? If not, directly apply for arbitration."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我司，但赔了 1 个月",
          "en": "My company, but they compensated for 1 month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接放他们鸽子不去",
          "en": "Just don't go and give them the cold shoulder."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "OP 好惨",
          "en": "OP is so miserable."
        }
      ],
      "type": "replies"
    }
  ]
}