{
  "id": 1108623,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "又一个闲鱼受害者,还是一个自以为很懂的垃圾佬",
          "en": "Another Xianyu victim, and a trash picker who thinks he knows a lot."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "买了个 T480S.准备 40G 内存插满装个 linux 以后当上网开发本用.\r\n本来寻思了一下,这种货按理说应该全都是商家走私进来的洋垃圾,那么就无所谓商家还是个人卖家了.然后这一寻思,就坏事了.",
          "en": "I bought a T480S, planning to max out the 40GB of RAM and install Linux to use it for web browsing and development.\nI initially thought that these kinds of goods should all be smuggled foreign garbage, so it wouldn't matter whether it was a merchant or an individual seller. But this thought led to trouble."
        },
        {
          "zh": "买之前还专门确认了两遍,是不是全原装,来自广州的商家也确认了是全原装.那我寻思你既然都这么明确的告诉我说全原装那就没问题了,让商家发了个没硬盘(我也不想要商家那边发的垃圾硬盘)的空机过来.,还提前要了他拍视频把机器的序列号拍了发过来.",
          "en": "Before buying, I specifically confirmed twice whether it was all original, and the merchant from Guangzhou also confirmed it was all original. Since you explicitly told me it was all original, I thought there was no problem, so I asked the merchant to send an empty machine without a hard drive (I didn't want the garbage hard drive they would send), and I even asked him to take a video of the machine's serial number beforehand and send it to me."
        },
        {
          "zh": "到手立马拍了拆包到拆机的全程视频对 SN 码,越对越心凉,主板,网卡,后盖,全部都不是原装的.屏幕和键盘不好拆就先没看,估计也够呛.",
          "en": "As soon as I received it, I immediately took a full video from unpacking to disassembly, checking the SN code. The more I checked, the colder my heart became. The motherboard, network card, and back cover were all not original. The screen and keyboard were difficult to disassemble, so I didn't look at them yet, but I guess they're probably not original either."
        },
        {
          "zh": "然后就去找商家,说好的全原装,你卖我一组装机,那么你得给我退货啊.",
          "en": "Then I went to the merchant and said, \"You promised it was all original, but you sold me an assembled machine, so you have to give me a refund.\""
        },
        {
          "zh": "商家表示,虽然你拍了视频,但是一定是你偷偷换了我的零件.我一看你这还倒打一耙,那就找闲鱼客服呗.",
          "en": "The merchant said, \"Although you took a video, you must have secretly replaced my parts.\" Seeing that he was turning the blame on me, I went to Xianyu customer service."
        },
        {
          "zh": "客服总不能不认我拍的视频.",
          "en": "The customer service couldn't deny the video I took."
        },
        {
          "zh": "结果还真就不认.\r\n闲鱼客服电话里表示虽然商家发给你的是没装硬盘开不了机的组装机,但是你没有经过商家同意就拆机,那么你的一切售后要求不可能,无脑判卖家赢.",
          "en": "But they really didn't acknowledge it.\nXianyu customer service said on the phone that although the merchant sent you an assembled machine that couldn't be turned on without a hard drive, you disassembled it without the merchant's consent, so all your after-sales requests are impossible, and they blindly judged the seller as the winner."
        },
        {
          "zh": "那我寻思以后以后在闲鱼买的一切数码产品都可以默认是组装机了.",
          "en": "I think that from now on, all digital products bought on Xianyu can be assumed to be assembled machines."
        },
        {
          "zh": "如果你没拆机,那么你无法验证是否是原装.",
          "en": "If you don't disassemble the machine, you can't verify whether it's original."
        },
        {
          "zh": "如果你拆机了,那么即使商家卖的是组装机,因为你未经过卖家同意就拆机你依然无法要求退货.",
          "en": "If you disassemble the machine, then even if the merchant sells an assembled machine, you still can't request a refund because you disassembled it without the seller's consent."
        },
        {
          "zh": "QED,逻辑毫无漏洞.",
          "en": "QED, the logic is flawless."
        },
        {
          "zh": "又一个新的致富道路出现了.",
          "en": "A new way to get rich has appeared."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "闲鱼你只要不确认收货，无论对错都是向着买家的。肯定能退。确认收货了就麻烦了，客服就会变成卖家的帮凶跟你和稀泥。最后比的是你的毅力，而不是对错。也就是在时间成本面前慢慢耗尽你，你会发现，奸商，闲鱼，12315 ，工商部，市政部，警察，网络法庭，乃至整个洼地都在嘲笑你的认真。我以前痴迷老 thinkpad （ ibm ，和 ibm 到联想过渡时期的系列）的时候，从来不在乎原装的，thinkpad 玩的就是缝合，哪坏换哪。那时候还是实体店卖二手 thinkpad 的，我看到一台键盘比我要的那台键盘好，就叫老板拆了另台换到我这台。",
          "en": "As long as you don't confirm receipt on Xianyu, it will favor the buyer regardless of who is right or wrong. A refund is guaranteed. Once you confirm receipt, it becomes troublesome, and customer service will become the seller's accomplice and try to mediate. In the end, it's a contest of your perseverance, not who is right or wrong. In other words, they slowly wear you down with time costs. You'll find that unscrupulous merchants, Xianyu, 12315, the Administration for Market Regulation, municipal departments, the police, online courts, and even the entire \"洼地\" (derogatory term for China) are laughing at your seriousness. When I used to be obsessed with old ThinkPads (IBM, and the series during the transition from IBM to Lenovo), I never cared about original parts. ThinkPads are all about patchwork, replacing whatever is broken. Back then, there were still physical stores selling used ThinkPads. I saw a keyboard on another machine that was better than the one I wanted, so I asked the boss to remove it and put it on my machine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ThinkPad 洋垃圾就没有原装。石牌那边翻新一条龙，都要吃饭的。想买原装找论坛个人转手的那种，缺点是成色参差不齐，没人给你翻新。",
          "en": "ThinkPad foreign garbage doesn't have original parts. The renovation process in Shipai is a complete chain; everyone needs to eat. If you want to buy original parts, look for individual transfers on forums. The disadvantage is that the condition varies, and no one will renovate it for you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@falcon05 是的,所以我总结一下我的错误:1. 不要找贩子,闲鱼的贩子一定是骗子,否则他没有理由来闲鱼开店,PDD 至少客服还会向着买家,闲鱼则相反.2. 不要从广东的卖家那里买电子产品.",
          "en": "@falcon05 Yes, so I summarize my mistakes: 1. Don't look for dealers. The dealers on Xianyu are definitely scammers, otherwise, they have no reason to open a store on Xianyu. PDD's customer service at least favors the buyer, while Xianyu is the opposite. 2. Don't buy electronic products from sellers in Guangdong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "经常去石牌那边买机器，这事情的水并不深。这些公司淘汰下来的洋垃圾笔记本，正常来说不会有原装机器到你手上。商家那边进货是整机进的，原机器能直接开机进系统的不多，为了省事和避免售后扯皮，他们工作流上就是要全部拆开，挑能用的部分重新组装起来再卖的。那边每个店都是一条三五个人的简易流水线，同一型号的机器这头拆了下一头检查装机，或者有单来了再装起来，除了一些集成度比较高的机器，或者是货量比较少的店，全原装组回去的概率不高。商家也是默认你知道这一点，所谓的全原装就是每一个零件都是原装拆机的，他不会觉得自己有问题。",
          "en": "I often go to Shipai to buy machines, and the situation isn't that complicated. These discarded foreign garbage laptops from companies will normally not have original machines in your hands. The merchants import entire machines, but not many of the original machines can be turned on and boot directly into the system. To save trouble and avoid after-sales disputes, their workflow is to disassemble everything, pick out the usable parts, and reassemble them for sale. Each store there has a simple assembly line of three to five people. Machines of the same model are disassembled at one end and inspected and assembled at the other end, or assembled when an order comes in. Except for some machines with high integration or stores with small inventory, the probability of reassembling with all original parts is not high. Merchants also assume you know this. The so-called all-original means that every part is a genuine part that were disassembled from other units; they don't think there's anything wrong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@k9982874 在帖子里没有任何一个人提外国的前提下,你主动提出这个话题.请问是在闲鱼工作的朋友吗?放假了还要加班怪不容易的.",
          "en": "@k9982874 No one mentioned foreign countries in the post, yet you brought up this topic proactively. Are you a friend who works at Xianyu? It must be hard to work overtime during the holidays."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ntedshen 玩洋垃圾的,没有人会对交学费没有心理准备.既然敢玩,就是做好心理准备交学费的.所以我并没有对于卖家说太多,他骗到我是他的本事,我不被骗是我的本事.我的重点是闲鱼这样无耻的无视证据,毫无底线的站在商家这边.我算是玩了有七八年洋垃圾的,在拍好拆箱视频的情况下都能被闲鱼这样无耻的打败.那么有什么办法可以遏制住骗子?没有.因为商家和平台是穿一条裤子的.买家就是纯水鱼,上桌就被宰.",
          "en": "@ntedshen No one who plays with foreign garbage isn't mentally prepared to pay tuition (being scammed). Since you dare to play, you should be prepared to pay the price. So I didn't say too much to the seller. It's his ability to scam me, and it's my ability not to be scammed. My focus is on Xianyu shamelessly ignoring evidence and standing on the side of the merchant without any bottom line. I've been playing with foreign garbage for seven or eight years, and I can still be shamelessly defeated by Xianyu even with a well-shot unboxing video. So is there any way to stop scammers? No. Because the merchants and the platform are in cahoots. The buyer is just a sucker, slaughtered as soon as they're at the table."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SmithJohn 不是闲鱼跟贩子一起坑你，是你不懂闲鱼规矩。闲鱼不是那种无理由偏向买家的平台，尤其是二手的电子产品，你只要描述你拆过机，必输。你如果收到东西一眼看着不对劲，要求退货，那是可以的，但你只要拆机，基本上就必输。",
          "en": "@SmithJohn It's not that Xianyu is collaborating with the dealers to scam you, it's that you don't understand Xianyu's rules. Xianyu is not the kind of platform that favors buyers without reason, especially for used electronics. As long as you describe that you disassembled the machine, you will definitely lose. If you receive something that looks wrong at a glance and request a refund, that's possible, but as long as you disassemble the machine, you'll basically lose."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Remember 你这一说我就好受很多,大家都被坑,显得我没有那么蠢.但是那些公司淘汰下来的机器到哪去了呢?",
          "en": "@Remember What you said makes me feel much better. Everyone gets scammed, so I don't seem so stupid. But where do those machines discarded by companies go?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jiaoyidongxi 这就是我帖子里没说的点了.我发现这台电脑是拼装机后,申请退款,卖家拒绝.然后我申请客服介入.客服因为我已拆机的理由判定卖家赢,在我没有进行任何操作的情况下,自动帮我收货了.这个时间点距离我下单仅仅过去了五天,甚至没有到自动收货的时间.",
          "en": "@jiaoyidongxi This is the point I didn't mention in my post. After I discovered that the computer was an assembled machine, I applied for a refund, but the seller refused. Then I applied for customer service intervention. The customer service judged the seller as the winner because I had disassembled the machine, and automatically helped me to confirm receipt without me taking any action. This point in time was only five days after I placed the order, not even the time for automatic receipt confirmation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最关键的价格没说，如果是原装价格买了组装机那是商家坑人，如果组装价格想占",
          "en": "The most important thing is the price wasn't mentioned. If you bought an assembled machine at the price of an original, then the merchant is scamming you. If you wanted to take advantage of the assembly price,"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "黑猫投诉，12315 投诉，什么拆机，这叫验货！",
          "en": "Complain to Black Cat Complaints, 12315 complaints, what disassembly, this is called inspection!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果组装价格想占便宜那只能说，打眼了自己认栽。如果你非要犟国素差外国圆，那就是你对，建议你直接陈胜吴广",
          "en": "If you wanted to take advantage of the assembly price, then you can only say that you misjudged it and take the hit yourself. If you stubbornly insist that Chinese things are inferior to foreign things, then you are right, I suggest you directly become Chen Sheng and Wu Guang (lead a rebellion)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@falcon05 纯粹的浪费时间吗这不是.",
          "en": "@falcon05 Isn't this just a waste of time?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SmithJohn 看你是不是想较真了，有时候维权的成本比得到的赔偿还要高。",
          "en": "@SmithJohn It depends on whether you want to take it seriously. Sometimes the cost of protecting your rights is higher than the compensation you get."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "原装+好成色 = 组装原装+核爆成色 = 真原装 or 核爆配件组装说到底一台机器要原装还成色完好那根本到不了二道贩子那，凑个十几几十台好成色卖二线政企不是更好赚钱？这帮人票证俱全的方法可是要多少有多少。。。所以说别对二手机抱有任何程度的处女情结，万一人真是哥布林巢穴里出来的，贩子给你配件换一圈你还得谢谢他呢。。。",
          "en": "Original + good condition = assembled. Original + nuclear explosion condition = true original or nuclear explosion component assembly. In the end, if a machine needs to be original and in good condition, it won't even reach the second-hand dealers. Isn't it more profitable to collect a dozen or dozens of machines in good condition and sell them to second-tier government and enterprises? These people have countless ways to get all the necessary documents... So don't have any virginity complex about used phones. If someone really came out of a goblin's nest, and the dealer replaced all your parts, you would have to thank him..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SmithJohn 你要觉得求原装叫有本事那我真的建议你别跟那帮垃圾佬学。。。不开玩笑的。。。。。。。。。。。。这个就是实体店标准操作，无非就是现在搬网上来了，你不上门闹那打死了都不会给你退，你就是退成了他们也要想尽办法恶心一下你才行。。。说实话主要是“原装”这个词实在是毫无实际意义，毕竟人又不是给你的山寨件。。。还不如直接投诉 sn 对不上，货不对板，但是你买的准系统又肯定要拆的，平台那边凭什么只信你呢。。。无解，建议别捡垃圾。。。",
          "en": "@SmithJohn If you think pursuing originality is a skill, then I really suggest you don't learn from those trash pickers... I'm not kidding... This is the standard operation in physical stores. It's just been moved online now. If you don't go to their door and make a scene, they won't give you a refund even if you get a refund, they will find ways to disgust you... To be honest, the word \"original\" is really meaningless because after all its not like they are giving you counterfeit parts... It's better to directly complain that the SN doesn't match and the goods are not as described, but since you bought a barebones system you definitely need to disassemble it, the platform will not believe your word just because you said so... No solution, suggest don't pick up trash..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ntedshen 你在说什么?我不是太理解你的意思.",
          "en": "@ntedshen What are you talking about? I don't quite understand what you mean."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SmithJohn 没啥意思。。。就是千万不要相信在新消法没有完全覆盖并执行的领域里出现的任何形容词，包括但不限于原装、正品、进口、美版、女生自用、本地自提等。。。大家都是这么踩坑踩过来的，欢迎来到《大战咸鱼》 2.0 。。。",
          "en": "@SmithJohn It doesn't mean much... it's just that you must never believe any adjectives that appear in fields where the new Consumer Protection Law is not fully covered and implemented, including but not limited to original, genuine, imported, American version, used by girls, local pickup, etc... Everyone has stepped on the pit in this way, welcome to 《War of Xianyu》2.0..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ntedshen  我已经说了玩洋垃圾的都是对卖家可能是骗子有心理准备了的.我这次的问题很明显在于闲鱼明显在和贩子一起坑买家的钱,而不是卖家是骗子.",
          "en": "@ntedshen I already said that those who play with foreign garbage are mentally prepared for the seller to be a scammer. My problem this time is obviously that Xianyu is clearly colluding with the dealers to scam buyers' money, rather than the seller being a scammer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@SmithJohn 看来你没有经历过因为能用所以不给退的洗礼。。。没事，后面总会被洗的。。。",
          "en": "@SmithJohn It seems you haven't experienced the baptism of not being refunded because it works... It's okay, you'll always be washed later..."
        }
      ],
      "type": "replies"
    }
  ]
}