{
  "id": 1113730,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "父母没和我讨论直接下订一套无法分期付款的房子但又负担不起全款",
          "en": "My parents didn't discuss it with me and directly ordered a house that cannot be paid in installments, but they also can't afford the full amount."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "事情是这样的，父母突然说他们下订了一套房，这套房无法分期付款，父母也无法负担全款，就在这种情况下他们下了订，昨天直接突然就说了这件事问我讨论要我拿钱给他们二十多万，我也不知道该说什么了",
          "en": "The situation is this: my parents suddenly said they had put a deposit on a house. This house cannot be paid in installments, and my parents can't afford the full amount either. They put down the deposit in this situation. Yesterday, they suddenly told me about this and asked me to give them over 200,000 yuan. I don't know what to say."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "总价 40 多万能买得到的房子，以后大概率 10 万都卖不掉",
          "en": "A house that can be bought for more than 400,000 yuan is very likely to not even sell for 100,000 yuan in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "傻吧 你再把问题丢回去不就好了 难不成要卖血",
          "en": "Are you silly? Just throw the problem back at them. Are you going to sell blood?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能这么操作，说明还把你当小孩，没考虑到你的想法",
          "en": "The fact that they can do this shows they still treat you like a child and haven't considered your feelings."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "给你买的还是给你弟买的？",
          "en": "Is it bought for you or your brother?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "房价 40 万大概率是小地方的房子，按照小地方的情况后续大概率还会继续贬值，贬值的钱肯定大于目前的定金。",
          "en": "The house price of 400,000 is likely a house in a small place. According to the situation in small places, it is very likely to continue to depreciate in the future, and the depreciated money will definitely be greater than the current deposit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "盲猜，OP 过年期间应该经历过一波催婚，OP 对婚姻的状态令父母近期看不到希望，二老决定 push 一把，干脆一不做二不休，不商量就把未来的婚房给订了",
          "en": "I'm guessing that OP probably experienced a wave of marriage urging during the Chinese New Year. OP's state of marriage makes the parents not see hope in the near future. The two elders decided to push it a bit and simply go all out. Without discussing it, they booked the future wedding house."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你应该说: 没钱",
          "en": "You should say: No money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没钱，顶多赔掉定金",
          "en": "No money, at most lose the deposit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在银行贷款很容易的，农民也能贷款，让他们贷款把房款付了；银行那边贷款再慢慢还咯",
          "en": "It is easy to get a bank loan now, even farmers can get a loan. Let them take out a loan to pay the house payment; then slowly repay the loan from the bank."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很多家长都这样，替孩子做决策做惯了。",
          "en": "Many parents are like this, they are used to making decisions for their children."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kk2syc 不是给我买的，我是独生子",
          "en": "@kk2syc It's not bought for me, I'm an only child."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果自己是财产继承者，就可以考虑支持；如果房子价值远大于 20 万，只是用你钱补一些空缺，可以考虑；如果明确是买了房子给另一个子女，可以考虑借；（实话实说，所有吐槽父母的，我潜意识认为这人比较自私，当然这是我的偏见）",
          "en": "If you are an heir to the property, you can consider supporting it; if the value of the house is much greater than 200,000, and you are just using your money to fill some gaps, you can consider it; if it is clear that the house is bought for another child, you can consider lending it; (To be honest, everyone who complains about their parents, I subconsciously think this person is more selfish, of course this is my prejudice)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Kaisar 太无语了",
          "en": "@Kaisar Speechless."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那就按照下了订，但是买不起的程序来解决就是啦",
          "en": "Then just follow the procedure of having placed an order but not being able to afford it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Messmer 你是独生子，但是又不是给你买的，啥情况？",
          "en": "@Messmer You are an only child, but it's not bought for you? What's the situation?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DigitaIOcean 房子现在价格是 40 多万，父母存款只有 20 多万，我是独生子，是财产继承者，是突然跟我说了这件事，而且没跟我讨论直接下订了",
          "en": "@DigitaIOcean The house currently costs over 400,000, my parents only have over 200,000 in savings, I am an only child, I am the heir to the property, they suddenly told me about this, and they put down the deposit directly without discussing it with me."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Messmer #12 确实有点尴尬这情况。",
          "en": "@Messmer #12 This situation is indeed a bit awkward."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没商量确实是他们不对，不过既然是继承者，说明是父母给了你一笔钱哦",
          "en": "It's true that they were wrong not to discuss it, but since you are the heir, it means your parents gave you some money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Messmer #12 一种可能的参考，你没有钱或者不想出钱，但房子你也看得上。 就先买了，然后房屋抵押贷款(利率很低的)，让父母或者自己支付分期款。",
          "en": "@Messmer #12 One possible reference, you don't have the money or don't want to pay, but you like the house. Just buy it first, then get a mortgage (low interest rate), and let your parents or yourself pay the installments."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@loooooong2023 但我实在是无语没跟我讨论商量就直接下订了，而且无法分期付款又没能力付全款的情况",
          "en": "@loooooong2023 But I am really speechless that they put down the deposit directly without discussing it with me, and in a situation where they cannot pay in installments and are unable to pay the full amount."
        }
      ],
      "type": "replies"
    }
  ]
}