{
  "id": 1109524,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "想创业\"少儿编程\"的机构有没有好的建议？",
          "en": "Are there any good suggestions for institutions that want to start a \"children's programming\" business?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "2025 年过年期间和朋友聊到少儿编程+Ai 赛道的趋势，觉得这个是一个不错的想法，我想在三四线城市开设一所 7-12 岁的少儿编程培训班，课时定价也就 2k-3k 的样子，但是现在我的困难点如下：\r\n- 没有课程体系\r\n- 三四线城市教师资源少\r\n- 对三四线城市用户画像模糊\r\n有没有大佬在这个领域有过深究讨论一下？",
          "en": "During the 2025 Chinese New Year, I talked with friends about the trend of children's programming + AI, and I thought it was a good idea. I want to open a 7-12-year-old children's programming training class in a third- or fourth-tier city, with a class hour price of about 2k-3k, but now my difficulties are as follows:\r\n- No curriculum system\r\n- Few teacher resources in third- and fourth-tier cities\r\n- Vague user profiles for third- and fourth-tier cities\r\nAre there any experts in this field who have discussed it in depth?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "想法很好，房东最喜欢你们这种了，开业半年就倒闭了你先去了解一下那些还活着的培训机构都是教什么的吧。。。",
          "en": "The idea is good, the landlord likes you the most, you will be closed down half a year after opening. You should first understand what those surviving training institutions are teaching..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你在一个三四线城市，会花三四千送你儿子去学少儿编程吗？有这功夫还不如学个跆拳道防身。",
          "en": "If you were in a third- or fourth-tier city, would you spend three or four thousand to send your son to learn children's programming? You might as well learn Taekwondo for self-defense instead."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "达内改名叫童程童美了，年前刚暴雷",
          "en": "Tarena has been renamed Tongcheng Tongmei, and it just exploded before the new year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主你这相当于还没锤子呢就看谁都像钉子，这还不如用用自己的锤子，看好少儿编程+Ai ，那就弄个网站或者 app 吧，失败了赔的也少点。",
          "en": "You're basically seeing everyone as a nail before you even have a hammer. You might as well use your own hammer. If you're optimistic about children's programming + AI, then create a website or app, and you'll lose less if it fails."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自嗨赛道",
          "en": "Self-entertainment track"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议先兼职看看...     按 2000 一个学期算      一节课 100  2.5 小时,  你算算要怎么样才能回本。",
          "en": "I suggest you try part-time first... Assuming 2000 per semester, 100 per class for 2.5 hours, you calculate how you can recover the cost."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是要教学科类。语文数学英语物理化学历史政治",
          "en": "It is still necessary to teach subjects like Chinese, mathematics, English, physics, chemistry, history, and politics."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不如做\"少儿大模型\"",
          "en": "Why not do \"children's large models\"?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "儿童还是应该以文化课，体育课为主。你说有些很想学编程的怎么办？这么天才的儿童不会自己网上学习么？买个 199 的课就应该会飞天了吧",
          "en": "Children should still focus on cultural and sports classes. What if some really want to learn programming? Wouldn't such talented children learn online by themselves? Buying a 199 course should be enough to fly to the sky, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我的建议是不要创业",
          "en": "My suggestion is not to start a business."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "培训一律先兼职做做看，有客源再做大。",
          "en": "Always start training part-time, and expand when you have customers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我在一个机构当过兼职，给小朋友教 python ，一节课一二百块钱，每周日两到三节课，机构大部分学生都是附近学校的学生，从一年级都开始上学，一年级的学 scratch ，后来学习机器人编程，软件到硬件的结合，去参加各种比赛，三四年级开始学校编程，刚开始上我教的 python ，后来学校要参见各种竞赛，竞赛要求的是 C++，我就不上了。有些学生上课是真来玩的的，自己不感兴趣家长非让来，学了就忘，有些会感兴趣会学但很少。这些学生学到最后还是要参加各种竞赛，竞赛取得名次都升初中高中都有优势",
          "en": "I used to work part-time at an institution, teaching Python to children. One class costs one or two hundred yuan, and there are two to three classes every Sunday. Most of the students in the institution are from nearby schools, and they start attending from the first grade. First graders learn Scratch, then robot programming, combining software and hardware, and participate in various competitions. Third and fourth graders start learning school programming. At first, they took Python, which I taught, but later the school had to participate in various competitions, and the competition required C++, so I stopped teaching. Some students really come to play in class. They are not interested, but their parents insist on them coming. They learn and forget. Some are interested and will learn, but very few. In the end, these students still have to participate in various competitions, and getting good rankings in the competition has advantages in entering junior high school and high school."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "办学许可证，教师资格证‌等等",
          "en": "School operating permit, teacher qualification certificate, etc."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都已经倒闭了那么多家了，你还要玩？我帮你省下几十万吧，我一个官二代表弟几年前投资开了，几个人合共投资几十万没了",
          "en": "So many have already closed down, and you still want to play? Let me save you hundreds of thousands. A few years ago, a cousin of mine, who is a second-generation government official, invested in opening one, and a few people invested hundreds of thousands in total, and it's all gone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "？你找找去年前年的 noip 的题你都能做出来么",
          "en": "? Can you solve the NOIP problems from the past two years?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所有的课外教培，基本都是面向证书和比赛的，少儿编程不过是另一种形式的艺术培训。家长不懂什么 AI/逻辑思维，他们只关心能不能考级，参不参加比赛。你跟他说孩子 python3 学的不错，他问你什么时候教 python4 。",
          "en": "All extracurricular education and training are basically aimed at certificates and competitions. Children's programming is just another form of art training. Parents don't understand AI/logical thinking. They only care about whether they can take exams and participate in competitions. You tell them that their child is doing well in Python 3, and they ask you when you will teach Python 4."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐标苏北，我儿子上的小学，不敢说全市前几，但是也属于第二梯队，其中学校要求报名社团活动，因为我的职业缘故，我推荐儿子报名编程趣味课，他也同意了(之前教过他一阵子 Swift playground)，结果线上报名那天，其他诸如篮球、街舞、羽毛球之类的刚开始就全部满员了，编程课到最后都没满员，然后班主任还在群里说，有几个课因为没有招满名额，所以有机会从其他课转过来，其中就有编程课。所以要真的从编程角度出发，我觉得是没有搞头，但是从信息竞赛出发，我觉得是有搞头的，尤其是那些喜欢鸡娃的父母，你跟他说这是为了增加思维啥的，他们听不进去，但是跟他们说信息竞赛得奖，可以加分啥的，立马两眼放光了。",
          "en": "Located in northern Jiangsu, the elementary school my son attends, I wouldn't say it's one of the top schools in the city, but it's in the second tier. The school requires registration for club activities. Because of my profession, I recommended my son to sign up for a programming fun class, and he agreed (I had taught him Swift playground for a while). As a result, on the online registration day, other classes such as basketball, street dance, and badminton were all full at the beginning. The programming class was not full until the end. Then the homeroom teacher said in the group that a few classes had the opportunity to transfer from other classes because they had not filled the quota, including the programming class. So, if you really start from the programming point of view, I don't think it's feasible, but from the perspective of information competitions, I think it is feasible, especially for those parents who like to push their children hard. If you tell them that this is to increase thinking, they won't listen, but if you tell them that winning awards in information competitions can add points, their eyes will light up immediately."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "达内做了很长时间大学生培训，还赴美上市了。后来转行专做少儿编程，现在已经处于跑路阶段。",
          "en": "Tarena has been training college students for a long time and has been listed in the United States. Later, it switched to specialize in children's programming, and now it is in the running-away stage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "被割韭菜赛道",
          "en": "Being a韭菜 (leek - someone who gets exploited) track"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "回老家发现老家县城也有，没见有人去，大多数家长愿意让孩子学体育运动或者琴棋书画啥的，不了解编程的人不大愿意让孩子学这个，再一个，还是有很多家长不愿意让孩子接触电子产品的。",
          "en": "When I returned to my hometown, I found that there are such classes in the county town, but I haven't seen anyone go. Most parents are willing to let their children learn sports or music, chess, calligraphy, and painting. People who don't understand programming are not willing to let their children learn this. Also, there are still many parents who are unwilling to let their children be exposed to electronic products."
        }
      ],
      "type": "replies"
    }
  ]
}