{
  "id": 1112820,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "不抽烟，每次去女朋友家的时候要对每个人发烟吗",
          "en": "I don't smoke. Do I have to offer cigarettes to everyone when I go to my girlfriend's house?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "去过很多次了，前几次每个人都发了",
          "en": "I've been there many times, and I gave one to everyone the first few times."
        },
        {
          "zh": "\r\n\r\n最近去了被她姐说我不发烟，每次来就算自己不抽烟也要带一包烟",
          "en": "\r\n\r\nRecently, her sister said I didn't offer cigarettes. She thinks that even if I don't smoke, I should bring a pack of cigarettes every time I come."
        },
        {
          "zh": "\r\n\r\n感觉这个习俗很离谱，对一个不抽烟的人来说",
          "en": "\r\n\r\nI feel this custom is outrageous for a non-smoker."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@LAN1111 不当着不抽烟的人面抽烟，这是礼貌",
          "en": "@LAN1111 It's polite not to smoke in front of non-smokers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zy0829 sb",
          "en": "@zy0829 sb"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让这些烟鬼都早点死吧，现在公共场所到处都是抽烟的，烦死了",
          "en": "Let these smokers die sooner. There are smokers everywhere in public places now, it's so annoying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不抽烟，也不发烟，结婚 10 来年了",
          "en": "I don't smoke, nor do I offer cigarettes. I've been married for over 10 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你一开始就不该发，惯的这些矫情逼。",
          "en": "You shouldn't have offered them in the first place. You've spoiled these pretentious people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不抽烟就不要发，发了对方就默认你抽，这个逻辑和酒局上不喝酒就不要敬酒一个道理。当地如果认为不抽烟也要发烟，那就是瞎胡闹 PUA ，不用理睬这种服从测试",
          "en": "If you don't smoke, don't offer cigarettes. If you do, the other party will assume you smoke. This logic is the same as not toasting if you don't drink at a banquet. If the locals think you should offer cigarettes even if you don't smoke, that's just nonsense PUA. Don't pay attention to this kind of obedience test."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zy0829 这么爷们，你应该一人做是一人当的，不吐烟出来的，争取早日飞升尼古丁星球，逍遥快活。",
          "en": "@zy0829 Since you are so manly, you should take responsibility for your actions, don't spit out the smoke, and strive to ascend to the nicotine planet as soon as possible and live a carefree life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没必要，没抽烟干嘛要派烟，ps:我是老烟民",
          "en": "There's no need. Why offer cigarettes if you don't smoke? ps: I'm a long-time smoker."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没想到的是竟然评论区也有这么多人认为不抽烟也要发烟",
          "en": "I didn't expect that so many people in the comments would think that non-smokers should also offer cigarettes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这问题取决于你女朋友咋想，而不是她姐…",
          "en": "This question depends on what your girlfriend thinks, not her sister..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "为什么要发一级致癌物，跟对方有仇吗",
          "en": "Why offer a Group 1 carcinogen? Do you have a grudge against the other person?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不抽烟也不发烟，还被一个长辈说过“见了长辈连根烟都不发”，我没理他",
          "en": "I don't smoke or offer cigarettes, and an elder once said to me, 'You don't even offer a cigarette when you see an elder.' I ignored him."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Cooky 你怎么娘们儿唧唧的",
          "en": "@Cooky Why are you being so girly?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个东西对咱们这个时代的人是比较难理解的，咱们这个时代的人是原子的人，每个人都独立，基本上是不怎么依靠宗族和亲戚的。",
          "en": "This is difficult for people of our time to understand. People of our time are atomic people, each independent, and basically do not rely on clans and relatives much."
        },
        {
          "zh": "但是再往上一辈，基本上都是要依靠宗族和亲戚互相帮忙的，一个人单打独斗日子根本过不下去。",
          "en": "But one generation up, they basically rely on clans and relatives to help each other. A person can't survive on their own."
        },
        {
          "zh": "所以才有了逢年过节见面要走动啊，喝酒的习俗，见面之后哪怕不抽烟也要揣两包互相发烟这种习俗。",
          "en": "That's why there is a custom of visiting each other during festivals and drinking, and the custom of carrying two packs of cigarettes to offer each other even if they don't smoke."
        },
        {
          "zh": "我的建议是，如果你够 nb ，你不发烟没人敢说你；如果你够强大，别人说了你当没听见。",
          "en": "My suggestion is, if you're strong enough, no one will dare to say anything if you don't offer cigarettes; if you're powerful enough, you can pretend you didn't hear it when others say something."
        },
        {
          "zh": "如果都不是，就买几包烟带着，见人就发，也没多少钱的事情，毕竟人嘛，不如意十之八九。",
          "en": "If neither is the case, just buy a few packs of cigarettes and offer them to people you meet. It's not a lot of money. After all, life is mostly unsatisfactory."
        },
        {
          "zh": "唉，谁还不向社会拖鞋啊。",
          "en": "Alas, who doesn't give in to society?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "四项基本原则：1. 自己不要抽烟2. 自己不要买烟3. 自己不要送烟4. 自己不要发烟",
          "en": "Four basic principles: 1. Don't smoke yourself. 2. Don't buy cigarettes yourself. 3. Don't give cigarettes as gifts yourself. 4. Don't offer cigarettes yourself."
        },
        {
          "zh": "抽烟的都是敌人，十六字诀：1. 敌抽我躲：敌人抽烟离我近，我躲开避难2. 敌送我拒：敌人送烟做礼品，我拒绝收受3. 敌发我声：敌人发烟一块抽，我声明不喜4. 敌病我劝：敌人呼吸道生病，我劝他戒烟",
          "en": "Smokers are enemies. Sixteen-character formula: 1. If the enemy smokes, I hide: If the enemy smokes near me, I hide to avoid disaster. 2. If the enemy gives, I refuse: If the enemy gives cigarettes as gifts, I refuse to accept them. 3. If the enemy offers, I declare: If the enemy offers cigarettes to smoke together, I declare my dislike. 4. If the enemy is sick, I advise: If the enemy has a respiratory illness, I advise him to quit smoking."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不抽当然不发，就看你自己心理内核稳不稳，稳的人在 “拒绝做一件自己认为离谱” 的事情的时候，是压根不在意外人眼光的。",
          "en": "Of course, you don't offer cigarettes if you don't smoke. It depends on whether your psychological core is stable. A stable person doesn't care about other people's opinions when 'refusing to do something they consider outrageous.'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这是农村的臭毛病，你想带就带不想带就拉倒，凭什么总要想着他们抽烟",
          "en": "This is a bad habit in the countryside. If you want to bring them, bring them; if you don't want to bring them, then don't. Why should you always think about them smoking?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "她姐的问题，别惯着她这臭毛病，什么都说三道四的，长舌妇",
          "en": "It's her sister's problem. Don't indulge her in this bad habit. She's always gossiping and meddling."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不抽烟，不发烟，不懂烟，要抽烟？请离我远点，谢谢。30 多年一直如此。",
          "en": "I don't smoke, I don't offer cigarettes, and I don't understand cigarettes. Want to smoke? Please stay away from me, thank you. It's been like this for over 30 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我不抽烟，我为什么因为你爱抽烟就给你发烟？莫名其妙，我爱吃鸡腿，你见到我给我发个鸡腿吗",
          "en": "I don't smoke, so why should I offer you cigarettes just because you love to smoke? It's inexplicable. I love to eat chicken legs. Do you offer me a chicken leg when you see me?"
        }
      ],
      "type": "replies"
    }
  ]
}