{
  "id": 1109889,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "最近同事疯狂安利要去看哪吒 2，只有我一个人一看那造型就反感欣赏不来吗，为什么这么火啊实在是搞不明白",
          "en": "Recently, my colleagues have been enthusiastically recommending Nezha 2. Am I the only one who dislikes the character design at first glance and can't appreciate it? I really don't understand why it's so popular."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "喜欢的没问题，不喜欢的也没问题。觉得别人为啥喜欢的才有问题",
          "en": "It's okay to like it, and it's okay not to like it. The problem is when you question why others like it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同行衬托的好。一帮没阅片量的人评价说明不了什么，上 mtc 拿媒体评价说话。",
          "en": "It's good because of the comparison to its peers. The opinions of a group of people who haven't seen many movies don't mean anything. Go to MTC and use the media reviews."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本贴是抱团取暖文，真棒，OP 终于找到同伴了幸亏世界有也有异类，不然都去看哪吒 2 ，票房不得 200 亿呀",
          "en": "This post is a 'band together for warmth' post, great. The OP finally found companions. Luckily, there are also outliers in the world, otherwise everyone would be watching Nezha 2, and the box office would be over 20 billion!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有啥搞不明白，就是同事觉得好，想推荐给你，分享给你，想跟你有共同话题而已至于你想不想去看，感不感兴趣是你自己的事情就像听歌一样，有些歌符合某个群体的氛围，那就容易被这个群体喜欢，你不喜欢，那就不喜欢，也没必要强求的每个人的经历都不一样，对自己的口味的东西，还是自己比较了解的所以我都很少推荐别人听什么歌之类的，你觉得好听，对方反而不喜欢，没什么意思",
          "en": "What's so hard to understand? It's just that your colleagues think it's good and want to recommend it to you, share it with you, and have a common topic with you. As for whether you want to see it or not, whether you are interested is your own business. It's like listening to music. Some songs fit the atmosphere of a certain group, so they are easily liked by this group. If you don't like it, then you don't like it, and there is no need to force it. Everyone's experience is different, and you are the most aware of what you like. That's why I rarely recommend what songs to listen to to others. If you think it sounds good, but the other person doesn't like it, it's meaningless."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DigitaIOcean 有些人吧，总要体现的自己与众不同，但是呢，遇到苹果特斯拉之类的，就又不这样了这是为什么呢？",
          "en": "@DigitaIOcean Some people always want to show that they are different, but when it comes to Apple or Tesla, they are not like this. Why is that?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "每个人的审美是独特的，包括菜品是否好吃、冷热是否合适，这些都是个性化的，当然也会有品味相似的。你不喜欢，就不喜欢，一些人跟你一样不喜欢；另一部分人很喜欢，还有一部分人一般般喜欢，还有一部分人受影响跟随着喜欢，他们占了多数，就火起来……",
          "en": "Everyone's aesthetic is unique, including whether a dish is delicious, whether the temperature is suitable, these are all personalized, of course, there will also be similar tastes. If you don't like it, then you don't like it, some people don't like it like you; another part of people like it very much, another part of people like it so-so, another part of people are influenced and follow to like it, they account for the majority, so it becomes popular..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总觉得自己品味高人一等，其他在座各位的审美都是垃圾的，这是病，得治!",
          "en": "Always feel that your taste is superior, and the aesthetics of all the others here are garbage. This is a disease and needs to be treated!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也没去看，不是它多优秀，而是竞品实在都太垃圾了至于票房，每年票价都在涨，加上竞品垃圾，更容易使得某一部片子一骑绝尘。如果这个档期有流量地球，那你想想还能有这个票房记录么？",
          "en": "I didn't go to see it either, not because it's so excellent, but because the competing products are really too garbage. As for the box office, ticket prices are rising every year, and the garbage competition makes it easier for a movie to stand out. If there was 'The Wandering Earth' in this period, do you think it could still have this box office record?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "终于看到一个和我有同感的了。真欣赏不来，我更喜欢小时候连环画的风格",
          "en": "Finally seeing someone who feels the same as me. I really can't appreciate it, I prefer the style of comic books from my childhood."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "同#3 ，国内物质建设发展如火如荼，精神建设反而大步倒退，尤其是现在的文娱作品，跟优秀完全不占边，很多时候全是在比烂，一句话全靠同行衬托，脱离群众太久了。哪吒 1 之前也看过，剧情普通，内核俗套，没啥出彩之处，私以为熊出没这几年动画电影都比现在贺岁片做的强。",
          "en": "Same as #3, the material construction in China is developing vigorously, but the spiritual construction is regressing greatly, especially the current cultural and entertainment works, which are not excellent at all, and many times it is all about comparing who is worse. In a word, it all depends on the comparison to its peers, and it has been separated from the masses for too long. I had seen Nezha 1 before, the plot is ordinary, the core is clichéd, there is nothing outstanding, I personally think that the animated films of 'Boonie Bears' in recent years are better than the current New Year films."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "战狼也很火票房大卖，好看吗哪吒我看了，特效还行，剧情只能够到及格线，编剧文学水平不行只能编出些让人尬笑的低级笑点和情节，儿童看看就算了，成年人就别浪费时间和钱了。",
          "en": "Wolf Warrior was also very popular and sold well at the box office, is it good? I watched Nezha, the special effects are ok, the plot can only reach the passing line, the screenwriter's literary level is not good and can only compile some low-level jokes and plots that make people awkwardly laugh. Children can watch it, adults should not waste time and money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "无非就是找认同而已，op 你不是也来 v 站找认同来了",
          "en": "It's just looking for recognition, OP, aren't you also coming to V2EX to find recognition?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "LZ 和楼里的这些言论其实很好的衬托了电影里的台词：人心中的成见是一座大山。----------------你不喜欢就不喜欢呗，为啥要去弄懂为什么？你试试讲讲你喜欢的电影或者歌曲，看看有没有出来杠你的品味的",
          "en": "LZ and the comments in the thread actually set off the lines in the movie very well: 'Prejudice in people's hearts is a mountain.' ---------------- If you don't like it, then you don't like it, why do you have to understand why? You try talking about your favorite movies or songs, and see if anyone comes out to argue with your taste."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不过是一群跪久了的人不愿意承认国内的也好起来了，不如你也举例你最喜欢的电影，看看是不是所有人都喜欢。",
          "en": "It's just a group of people who have been kneeling for too long and are unwilling to admit that things are getting better in China. Why don't you also give an example of your favorite movie and see if everyone likes it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那证明你是少数反感的那部份，很多东西，无论如何优秀，总有不认可的部份人",
          "en": "That proves that you are in the minority who dislike it. No matter how excellent something is, there are always people who don't approve of it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@blueboyggh #39  帖子里还有吹唐氏少年呢",
          "en": "@blueboyggh #39 There are also people praising 'I Am What I Am' in the post."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@blueboyggh 因为大家都喜欢国外的东西就是大家都有品味，如果大家有喜欢国产的东西那就是品味有问题了。",
          "en": "@blueboyggh Because everyone likes foreign things, it means everyone has taste. If everyone likes domestic things, then there is a problem with their taste."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你知道中国网民挺傻逼，为什么这么说，比如在哪吒中的人物，申公豹几个，是下巴修长脑袋短，还都是眯眯眼，不过电影很火；但同样是类似造型的《雄狮少年》就被人讨伐，说是辱华、汉奸。 这个傻逼国家早晚会毁在这些爱国网民手里。",
          "en": "You know Chinese netizens are quite stupid, why do I say that? For example, the characters in Nezha, Shen Gongbao and others, have long chins and short heads, and they all have squinted eyes, but the movie is very popular; but the similarly shaped 'I Am What I Am' was criticized and said to be insulting to China and a traitor. This stupid country will be destroyed by these patriotic netizens sooner or later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "BTC 还是庞氏骗局呢，喜欢的人不是更多",
          "en": "BTC is still a Ponzi scheme, but aren't there even more people who like it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "让生活热闹些罢了",
          "en": "Just to make life more lively."
        }
      ],
      "type": "replies"
    }
  ]
}