{
  "id": 1113156,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "已婚的来说下，每个月给老婆/家庭多少钱。",
          "en": "Married people, please share how much money you give to your wife/family each month."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我管钱。老婆给我上交的。。。",
          "en": "I manage the money. My wife turns it over to me..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你要想想等你失业了，你老婆娘家会给你钱吗，还是他们会怂恿你老婆跟你离婚。",
          "en": "You should think about whether your wife's family will give you money when you lose your job, or whether they will encourage your wife to divorce you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "各付各的",
          "en": "We split everything."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不给钱，花老婆的",
          "en": "I don't give money, I spend my wife's."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "彩礼 2 万，上班后从来没拿过自己的工资卡，都是交给老婆。要是失业了，没钱了，老婆要走也理解，也不想请律师，确实是自己不中用，怨天尤人不如自己加油",
          "en": "Bridal gift was 20,000. I haven't taken my own salary card since I started working, it's all given to my wife. If I lose my job and don't have money, I understand if my wife wants to leave, and I don't want to hire a lawyer. It's indeed because I'm useless. Instead of blaming others, I should cheer myself up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老婆赚的比我多，偶尔补贴我点...",
          "en": "My wife earns more than me, and occasionally subsidizes me a little..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "0 元，我只管房贷、水电、燃气、自己的开销，有余钱就全部转给老婆。",
          "en": "0 yuan. I only manage the mortgage, water, electricity, gas, and my own expenses. I transfer all the remaining money to my wife."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@remrem 西格玛男人",
          "en": "@remrem Sigma male"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只留 3.5k ，剩下全给。1.3k 房租，1.2k 生活费，还能偷偷攒 1k 私房钱",
          "en": "I only keep 3.5k, and give the rest. 1.3k for rent, 1.2k for living expenses, and I can secretly save 1k as pocket money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我和我老婆每年轮换管钱，去年我打她卡里，今年到我掌管财政，突出一个男女平等，公平公正，但是理财基本是在做，记账也是我记。",
          "en": "My wife and I take turns managing the money every year. Last year I transferred it to her card, and this year it's my turn to manage the finances, highlighting gender equality, fairness, and justice. However, I'm basically doing the financial management, and I'm also keeping the accounts."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "各自管钱，都不上交。租房、买菜、大额消费我来，其他日常消费我大头她小头；偶尔会互发红包，年底会合计下家庭总资产。",
          "en": "We each manage our own money and don't turn it in to the other. I take care of the rent, groceries, and large expenses. For other daily expenses, I pay the majority and she pays a small portion. We occasionally send each other red envelopes, and at the end of the year, we calculate the total family assets."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我负责家里基本所有的开销，人挣的自己存着，我的我自己打理",
          "en": "I am responsible for almost all the expenses in the family. People earn their own money and save it themselves, and I manage my own money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@vanpeisi7 帅？否则写个 PPT 给咱培训下，感谢！！！",
          "en": "@vanpeisi7 Handsome? Otherwise, write a PPT to train us, thank you!!!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老夫老妻了，还了信用卡后，剩下的都上交",
          "en": "We are an old married couple. After paying off the credit card, the rest is turned in."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "全部都给, 自己花信用卡",
          "en": "Give it all, I spend on credit card."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "全部给老婆打理，我是冲动消费的人，管不住钱，老婆反而持家有道，每年能把我的工资收入存下来不少，舍得在我身上花钱，自己缺舍不得花。",
          "en": "All given to my wife to manage. I am an impulsive spender and can't control money. My wife is good at managing the household and can save a lot of my salary income every year. She is willing to spend money on me, but she is reluctant to spend it on herself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我赚的比我老婆多，但是她每个月还给我 2500 。",
          "en": "I earn more than my wife, but she still gives me back 2500 every month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@remrem 午觉起来这么多赞。主要也是我老婆互相信任，加上 我对于金钱控制力稍强些（因为早年也做过些荒唐事，现在对金钱看淡了些，一家人平安健康就就好），喜欢研究各种东西（家里的智能家居， 都是我亲手装的），而且也舍得给家人买东西（之前 老婆手机买的 苹果 14 pro ，电脑买的 126kf+3080 ，她用着还是比较舒服，就比较相信你），不会乱投资，或者有的没的。她拿着钱，会乱花（容易被小红书的姐妹忽悠），我拿钱，就是存着，只做最基本的理财收益。 她拿工资的一半给我固定储蓄（固定 4.5K ），一半她自己花销或者干嘛（实际也就是买吃的，穿的）。家里全部东西都是我选购（除了衣服，这个是真的看个人审美）。包括给双方父母添置的电器，吃喝，给娃的任何东西。所以她基本都不用操心，我都能办好。（我也乐于去办，感觉顺手的事情），所以这也就造成了家里的钱都上交在我这（虽然也没多少）",
          "en": "@remrem So many likes after waking up from a nap. The main reason is that my wife and I trust each other, plus I have a slightly stronger control over money (because I did some absurd things in my early years, and now I have a lighter view of money. As long as the family is safe and healthy, that's good), I like to research various things (the smart home in the house was all installed by me), and I am willing to buy things for my family (before my wife bought an Apple 14 pro mobile phone, and a 126kf+3080 computer, she is still more comfortable using it, so she believes you more), and will not invest randomly, or anything else. When she has money, she spends it randomly (easily fooled by the sisters on Little Red Book). When I have money, I just save it and only do the most basic financial management returns. She takes half of her salary for fixed savings (fixed 4.5K), and the other half for her own expenses or whatever (actually just buying food and clothes). I choose all the things in the house (except clothes, which really depends on personal taste). Including appliances, food and drink for both parents, and anything for the baby. So she basically doesn't need to worry, I can handle everything (and I am happy to do it, it feels effortless), so this has resulted in all the money in the family being turned over to me (although there is not much)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ChefIsAwesome #8 任性是这样。 但不能往坏了想， 得想好的，老婆开心幸福，丈母娘家也更喜欢你，其乐融融。要是凡事都要人性考验就完蛋了， 都注孤生了",
          "en": "@ChefIsAwesome #8 Being willful is like this. But you can't think badly, you have to think well, your wife is happy and happy, and your mother-in-law's family likes you even more. If everything is a test of human nature, it's over, and you will be single forever."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好多理财书上都有说这种情况，连一点钱都赚不了的人，是没有资格管钱的。",
          "en": "Many financial books say this, people who can't even earn a little money are not qualified to manage money."
        }
      ],
      "type": "replies"
    }
  ]
}