{
  "id": 1111890,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "第一辆车，买自己喜欢的，还是懂车的推荐的？",
          "en": "First car, buy what you like, or what car experts recommend?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "人生中第一辆车，对电车相对抵触，能接受合资燃油车、或者小米，其他品牌比较抗拒。",
          "en": "First car in my life, relatively resistant to electric cars, can accept joint venture fuel cars, or Xiaomi, but resist other brands."
        },
        {
          "zh": "\r\n\r\n单身，28 ，房贷 3k ，个人存款 25w ，计划 15~20w 用于购车。",
          "en": "\n\nSingle, 28, mortgage 3k, personal savings 25w, plan to use 15~20w for car purchase."
        },
        {
          "zh": "\r\n\r\n平时上班住在办公室隔壁房间也不用车，节假日回家 150km ，一般会租车回家，连续 4 年租过：荣威 I5 、丰田雷凌、大众朗逸，个人计算也就是一年 1500km 的水平。",
          "en": "\n\nUsually live in the room next to the office for work and don't need a car. I go home for holidays 150km away, and usually rent a car to go home. I have rented: Roewe I5, Toyota Levin, Volkswagen Lavida for 4 consecutive years. My personal calculation is about 1500km a year."
        },
        {
          "zh": "\r\n因为身高接近 190 ，A 级小轿车座椅拉到最后还是有点不够用，所以目标放在 B 级车/中型 SUV 上。",
          "en": "Because my height is close to 190, the A-class car seat is still a bit insufficient even when pulled to the end, so the target is placed on B-class cars/mid-size SUVs."
        },
        {
          "zh": "\r\n\r\n过年期间在家没事干，汽车城各大品牌试驾了一个礼拜，一眼相中 别克 昂科威 PLUS 2025 款。",
          "en": "\n\nDuring the Chinese New Year, I had nothing to do at home, so I test drove various brands in the auto city for a week, and immediately fell in love with the Buick Envision PLUS 2025 model."
        },
        {
          "zh": "\r\n堂姐夫从事汽车管理维护相关工作，表示别克 4w 公里之后小毛病会比较多，推荐 丰田荣放。",
          "en": "My cousin-in-law is engaged in automobile management and maintenance-related work, saying that Buick will have more minor problems after 40,000 kilometers, and recommends Toyota RAV4."
        },
        {
          "zh": "\r\n另一个堂姐夫从事汽车零配件供应，没提任何意见，只说买自己喜欢的就行。",
          "en": "Another cousin-in-law is engaged in automobile parts supply, and did not make any comments, only saying to buy what you like."
        },
        {
          "zh": "\r\n\r\n个人感觉丰田的内饰让我无法接受，但是口碑就是耐用和省油。",
          "en": "\n\nPersonally, I feel that Toyota's interior is unacceptable, but the reputation is durable and fuel-efficient."
        },
        {
          "zh": "\r\n别克的车坐上去就感觉很舒服，驾驶体验也很舒适，缺点就是不保值、小毛病多、油耗高。",
          "en": "Buick's cars feel very comfortable to sit in, and the driving experience is also very comfortable. The disadvantages are that they are not valuable, have many minor problems, and have high fuel consumption."
        },
        {
          "zh": "\r\n或者干脆换个赛道，咬咬牙上小米，排队 8 个月还有希望年底开回家。",
          "en": "Or simply change the track, grit your teeth and get Xiaomi, and there is still hope to drive home at the end of the year after queuing for 8 months."
        },
        {
          "zh": "\r\n\r\n大家庭汽车品牌情况：本田 x2 丰田 x1 奥迪 x1 大众 x1 长城 x1 马自达 x1 林肯 x1 别克 x1 福特 x1 理想 x1 比亚迪 x1",
          "en": "\n\nFamily car brand situation: Honda x2 Toyota x1 Audi x1 Volkswagen x1 Great Wall x1 Mazda x1 Lincoln x1 Buick x1 Ford x1 Li Auto x1 BYD x1"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你这个身高买小米坑死你，我没你高也差不多，驾驶位遮阳板附近上蹭的全是头油。",
          "en": "Buying Xiaomi with your height will kill you. I'm not as tall as you, but about the same. The area near the sun visor in the driver's seat is covered with head grease."
        },
        {
          "zh": "买空间大的，多试驾，国产车也很好，我觉得这价格吉利星越 L 最香了。",
          "en": "Buy a car with a lot of space, test drive more, domestic cars are also very good, I think Geely Xingyue L is the best at this price."
        },
        {
          "zh": "大众开过同事的途观，空有一副皮囊和标不如坦克香。",
          "en": "I have driven a colleague's Tiguan, which is just an empty shell and the brand is not as good as Tank."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "RAV4 就是那个坐满人以后踩油门像没踩到一样的动力猛兽吗",
          "en": "Is the RAV4 the power beast that feels like you haven't stepped on the accelerator when it's full of people?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这情况根本不需要买车，但是你单独说了 小米，那就买小米吧",
          "en": "You don't need to buy a car at all in this situation, but since you mentioned Xiaomi specifically, then buy Xiaomi."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@dynastysea 你不会以为二手小米可以半价买吧？",
          "en": "@dynastysea You don't think you can buy a used Xiaomi for half price, do you?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己喜欢的选择是应该建立在自己熟悉的基础上没有熟悉说喜欢，就是任由社会偏见的碎片在自己的脑海中作威作福",
          "en": "Choosing what you like should be based on your own familiarity. If you say you like something without being familiar with it, you are just letting fragments of social prejudice wreak havoc in your mind."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@leonme #56 今年因为临过年去外地出差，不确定什么时候能回来，租车比较晚，喜欢的车都租出去了常用的租车平台只剩下一堆电车没人租，插空刷新到一辆燃油车，大众途岳 1 月 25 日~2 月 4 日，12 天，满额保险 3372 元，但是续租 200 元/天比较贵，而且提车距离 60km （火车站），就取消订单了",
          "en": "@leonme #56 This year, because I went on a business trip to another place near the Chinese New Year, I was not sure when I could come back. The car rental was late, and all the cars I liked were rented out. The commonly used car rental platforms only had a bunch of electric cars that no one rented. I refreshed and found a fuel car, Volkswagen T-Roc, from January 25th to February 4th, 12 days, full insurance 3372 yuan, but the renewal is 200 yuan/day which is more expensive, and the pick-up distance is 60km (train station), so I cancelled the order."
        },
        {
          "zh": "在另一个平台上，租了大众朗逸新锐，1 月 24 日~2 月 9 日，16 天，满额保险 4335 元，提车距离 5km （万达广场）",
          "en": "On another platform, I rented a Volkswagen Lavida XR, from January 24th to February 9th, 16 days, full insurance 4335 yuan, and the pick-up distance is 5km (Wanda Plaza)."
        },
        {
          "zh": "租的车都是 2 年内新车，取车前店里已经提前做了一次保养，未遇到任何故障",
          "en": "The rented cars are all new cars within 2 years, and the store has done maintenance in advance before picking up the car, and no failures have been encountered."
        },
        {
          "zh": "PS：以前租车遇到过使用过程中车胎扎了钉子，但是只是轻微泄压，不影响使用，也没赔付",
          "en": "PS: I used to encounter nails in the tires during the use of a rented car, but it was only a slight pressure release, which did not affect the use, and there was no compensation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "懂车的人 不懂你。",
          "en": "People who know cars don't understand you."
        },
        {
          "zh": "要知道买东西是买给自己的",
          "en": "You need to know that buying things is for yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "crv 或者 model y",
          "en": "CRV or Model Y"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买啊，必须买。",
          "en": "Buy it, you must buy it."
        },
        {
          "zh": "建议不买的人，都是买过了 忘了第一辆车对于一个男人的意义。",
          "en": "Those who advise not to buy it have all bought it and forgotten the meaning of the first car to a man."
        },
        {
          "zh": "忘了自己第一次买车时候的冲动。",
          "en": "Forgot the impulse when I bought my first car."
        },
        {
          "zh": "有些路得自己走过了，尝试过了才知道。",
          "en": "Some roads have to be walked by yourself, and you only know after trying them."
        },
        {
          "zh": "有用还是没用。",
          "en": "Useful or not."
        },
        {
          "zh": "而且别看 1500km 的年公里数。",
          "en": "And don't look at the annual mileage of 1500km."
        },
        {
          "zh": "op 在#22 中强调了 大龄单身肥宅了。",
          "en": "op emphasized in #22 that he is an older single fat man."
        },
        {
          "zh": "有车对于泡妹子是有加分的。",
          "en": "Having a car adds points for picking up girls."
        },
        {
          "zh": "建议楼主直接 BB+保时米，A 都不用看了。",
          "en": "It is recommended that the poster directly get BB+Porsche Rice, and don't even look at A."
        },
        {
          "zh": "毕竟还没结婚 现在正是需要品牌价值给自己加分找对象的时候。",
          "en": "After all, you are not married yet, and now is the time to need brand value to add points to yourself to find a partner."
        },
        {
          "zh": "早买早享受！",
          "en": "Buy early and enjoy early!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "是我是你的话，我会参考懂车的人的意见（主要是要关注哪些点，以及各种品牌的特点），然后自己选择自己喜欢的车。",
          "en": "If I were you, I would refer to the opinions of people who know cars (mainly to pay attention to which points, and the characteristics of various brands), and then choose the car I like."
        },
        {
          "zh": "不过我自己以为还是比较懂车的，所以直接自己选了，我选了领克 01 ，目前快三年了，没有任何抱怨，依旧非常喜欢。",
          "en": "However, I myself think I know more about cars, so I chose it directly. I chose Lynk & Co 01. It has been almost three years now, and there are no complaints, and I still like it very much."
        },
        {
          "zh": "所以结论就是：一定要选自己喜欢的，但是要储备一些知识避免跳坑。",
          "en": "So the conclusion is: you must choose what you like, but you must reserve some knowledge to avoid jumping into the pit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不是刚需就不买，要买就买 10w 以下的，就 25w 存款 买 30w 车不要命了？",
          "en": "If it is not a necessity, don't buy it. If you want to buy it, buy one for less than 100,000. With 250,000 savings, buying a 300,000 car is not worth it?"
        },
        {
          "zh": "后面日子还过不过了",
          "en": "How will you live your life in the future?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买自己喜欢的就行。",
          "en": "Just buy what you like."
        },
        {
          "zh": "另外用公司东西不算白嫖",
          "en": "In addition, using company things does not count as freeloading."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "修车推荐的会好点买了台自己喜欢的代步海豹 06 ，现在主驾驶门有点异响。",
          "en": "The car recommended by the repair shop will be better. I bought a Sealion 06 for commuting that I liked. Now the driver's door has some abnormal noise."
        },
        {
          "zh": "续航以及油耗也没有网上说的那么好！",
          "en": "The battery life and fuel consumption are not as good as what is said online!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你排除了电车，却单独加了小米，说明对小米还是比较满意的；但是你换个想法，要是今年没有大的支出，小米也是可以考虑的，毕竟 8 个月的时间，你的存款不会不涨",
          "en": "You excluded electric cars, but added Xiaomi separately, indicating that you are quite satisfied with Xiaomi; but if you change your mind, Xiaomi can also be considered if there are no major expenses this year, after all, in 8 months, your savings will not fail to increase."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加钱小米，买自己喜欢的",
          "en": "Add money for Xiaomi, buy what you like"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个二手小米吧，你这情况买油车是图啥呢",
          "en": "Buy a used Xiaomi, what are you trying to do buying a gasoline car in this situation?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "开的少，买电车确实不划算，美系车确实可以，配置比日系德系好，空间大，保值就别提了，现在就没有保值的车，油耗确实高，不过本来你就开的不多，综上，推荐你买别克",
          "en": "If you drive less, it is indeed not cost-effective to buy an electric car. American cars are indeed okay. The configuration is better than Japanese and German cars, the space is large, don't mention the value retention, there is no value-retaining car now, the fuel consumption is indeed high, but you don't drive much anyway, in summary, I recommend you to buy Buick."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "身高一样，我建议你花点时间把目标车型都试驾、试乘一下，有些车看着大，但是主驾头部空间很小，因为天窗等一些设计原因，我个人买的某紧凑 SUV ，但实际上头部空间还不如没有天窗的桑塔纳，且堵一次就漏一次水",
          "en": "With the same height, I suggest you take some time to test drive and ride in all the target models. Some cars look big, but the headroom in the main driver's seat is very small due to the design of the sunroof, etc. I personally bought a compact SUV, but in fact the headroom is not as good as Santana without a sunroof, and it leaks every time it is blocked."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买自己喜欢的，别人推荐的，万一不顺心，以后会一直后悔的……",
          "en": "Buy what you like, and you will always regret it if you are not happy with what others recommend..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没养过车的都体会不了修车痛苦，亏还是得吃过后才能明白。",
          "en": "Those who have never owned a car can't understand the pain of repairing a car, and you have to suffer a loss to understand."
        }
      ],
      "type": "replies"
    }
  ]
}