{
  "id": 1111315,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "求/许愿/求偶 灵魂 partner",
          "en": "Seeking/Wishing/Looking for a soul partner"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "老板 90 年的\r\n15 年日本留学回国创业\r\n行业 跨境 电商\r\n现在要做 erp\r\nai 自动上品，数据清洗，审核，上传\r\n现在只有后端我自己(我自己独裁)，自己写了几个月，目前只公司内部用\r\n使用效果很好,跑通了,盈利了\r\n使用效果很好,跑通了,盈利了\r\n使用效果很好,跑通了,盈利了\r\n重要的事情说三遍\r\n\r\n老板很看好这个项目过年都没闲着, 一直开会说这个事, 老板手里握着很多客户,很多资源都等着用\r\n\r\n要求:\r\n1. 后端吃饭语言 py, 以后也会一直用 py,主语言不会变了,有电商 erp 经验最好\r\n2. 需要是杂家,什么都要懂, 本人厌蠢, 下到操作系统编译器 GUI 三大浪漫, 上到商业策略、市场运营、用户心理、资本运作、人类社会、\r\n3. 懂点前端的知识,写过前端的东西, html css js 三件套, 三大框架撸过任意一个 demo,起码做到脑子里有货,哪怕是 localhost 运行玩过框架\r\n4. 英语好,英语好,英语好,看英文文档没问题,写个英文 comment 没问题 (或者有其他第二语言,日语/韩语/西语/德语) 不能只会简体中文\r\n5. 我是金牛座 INTJ, 所以要求 mbti 类型最好 且依次为:ENFP=ENTJ>ENTP>INFJ>INTP>INTJ. \r\nI 人韧性比较低,会打退堂鼓,就算有天大本事,不做=0, 我已经过了这个阶段,开始变的有点 E 了,明白自己会把自己累死,缺点已经改正,眼里也能容得下沙子了,执行力很高.\r\n处于事业上升期, 且多次试错体悟进化后的 INTJ ， 看山还是山,看水还是水\r\n6. 八字得合，紫薇斗数盘要合， 大运最好要同步。\r\n本人不相信个人努力，因为不是稀缺资源太廉价了，只相信命运, 你说我是神棍也好,SB 也好,i dont fxxking care, 阅历和悟性足够的,且有幸有耐心看到这一条的,希望能和你内心共鸣\r\n7. 三年内没去过医院,身体要好,气血足, 不要药罐子病秧子, 本人会九阳神功(我没开玩笑),5 年没得过病(感冒 1 天就好), 不喝酒 不抽烟 没纹身 \r\n\r\n想到哪写到哪,许愿贴\r\n有意请[发到这里](mailto:bwijn218@gmail.com)",
          "en": "The boss is from the 90s.\r\nReturned to China in 2015 after studying in Japan and started a business.\r\nIndustry: Cross-border e-commerce.\r\nNow wants to develop an ERP system.\r\nAI: Automatic product listing, data cleaning, auditing, and uploading.\r\nCurrently, I am the only backend developer (I am dictatorial), and I have been writing it myself for several months, and it is currently only used internally by the company.\r\nIt works very well, it's running, and it's profitable.\r\nIt works very well, it's running, and it's profitable.\r\nIt works very well, it's running, and it's profitable.\r\nImportant things said three times.\r\n\r\nThe boss is very optimistic about this project and didn't even rest during the Chinese New Year, constantly holding meetings to discuss it. The boss has many customers and resources waiting to be used.\r\n\r\nRequirements:\r\n1. The backend programming language is Python and will continue to be Python in the future. The main language will not change. E-commerce ERP experience is preferred.\r\n2. Must be a jack-of-all-trades, understand everything. I dislike stupidity. From operating systems, compilers, GUI (the three great romances), to business strategy, marketing operations, user psychology, capital operation, human society.\r\n3. Understand some frontend knowledge, have written some frontend things, HTML, CSS, JS trio, have built at least one demo with any of the three major frameworks, at least have something in your brain, even if you have only run the framework on localhost.\r\n4. Good English, good English, good English. No problem reading English documents, no problem writing English comments (or have other second languages, Japanese/Korean/Spanish/German). Cannot only know simplified Chinese.\r\n5. I am a Taurus INTJ, so the preferred MBTI types are in the following order: ENFP=ENTJ>ENTP>INFJ>INTP>INTJ.\r\nI-types have low resilience and will give up easily. Even if they have great abilities, doing nothing = 0. I have passed this stage and am starting to become a bit E. I understand that I will exhaust myself to death. The shortcomings have been corrected, and I can tolerate minor imperfections, and I have high execution power.\r\nIn a career upswing, and after multiple trials and errors and evolutionary upgrades as an INTJ, I see mountains as mountains and water as water.\r\n6. The Bazi must match, the Zi Wei Dou Shu chart must match, and the major luck cycles must be synchronized. \r\nI do not believe in personal effort, because it is not a scarce resource and is too cheap. I only believe in fate. You can call me a fortune teller or an idiot, I don't fxxking care. Those with enough experience and understanding, and who are lucky enough to have the patience to see this, hopefully can resonate with my heart.\r\n7. Have not been to the hospital in the past three years, good health, sufficient Qi and blood, not a medicine jar or sickly person. I know Nine Yang Divine Skill (I'm not kidding). Have not been sick for 5 years (common cold recovers in 1 day), do not drink, do not smoke, no tattoos.\r\n\r\nWriting wherever my thoughts go, a wishing post.\r\nIf interested, please [send it here](mailto:bwijn218@gmail.com)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "想骂最脏的话但是又舍不得这个账号。",
          "en": "I want to curse with the dirtiest words but I can't bear to throw away this account."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要求这么多，工资一定很高吧。",
          "en": "With so many requirements, the salary must be very high."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "许愿池里的王八",
          "en": "A turtle in a wishing well."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不对啊，5 年没得病？之前全国人民都在阳，你没参加？",
          "en": "That's not right, you haven't been sick for 5 years? Weren't all the people in the country infected before? Didn't you participate?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能把 星座 + MBTI + 紫微斗数 + 九阳神功 都写在一篇创业组队 node 下的帖子，你是这个",
          "en": "To be able to write about Astrology + MBTI + Zi Wei Dou Shu + Nine Yang Divine Skill all in one entrepreneurial team-up node post, you are something."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "快来看啊，这里有个小丑",
          "en": "Come and see, there's a clown here."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这帖子怕不是喝多了的时候写的。。。。",
          "en": "This post was probably written when drunk..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "AI 都写不出来这种，这是人工智能杀死人类前的最后一道门槛。尊称一声：碳基文明的守门员。",
          "en": "AI can't even write this. This is the last threshold before artificial intelligence kills humanity. Respectfully called: The Gatekeeper of Carbon-Based Civilization."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上次我去面试对面老板也是这么说的，我直接在他的屌上重重的打了两拳",
          "en": "The last time I went to an interview, the boss on the other side said the same thing, and I directly punched him hard in his dick."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "猪鼻子插大葱",
          "en": "A pig's nose with scallions inserted (idiom for pretending to be something you're not)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@NoobNoob03 「紫微斗数」你敲对了，楼主敲错了，莫名喜感 233333",
          "en": "@NoobNoob03 You typed \"Zi Wei Dou Shu\" correctly, but the original poster typed it wrong, which is inexplicably funny 233333."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "《你有这么高速运转的机械进入中国》《黄龙江一派全都带蓝牙》",
          "en": "《You Have Such High-Speed Machinery Entering China》《The Huanglongjiang Faction Are All Equipped with Bluetooth》 (These are internet slang, difficult to translate directly without more context)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“5 年没得过病(感冒 1 天就好)”就这一条，据说长期不得病的人，一旦得病，那就 XXX 。非咒，有科学道理的。",
          "en": "\"Haven't been sick for 5 years (common cold recovers in 1 day)\", just this one point, it is said that people who have not been sick for a long time, once they get sick, then XXX. Not a curse, there is scientific reason."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "楼主虽然抽象，但还挺有趣，举报一波",
          "en": "Although the original poster is abstract, they are quite interesting. Reporting them anyway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没绷住。感觉有种旧社会地主老爷，高高在上挑奴隶的感觉。。。。。",
          "en": "Couldn't hold it in. Feels like an old society landlord, picking slaves from on high..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "神经病",
          "en": "Crazy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“... 目前只公司内部用 ... 跑通了,盈利了 ...”，按照我的理解，盈利了是赚的公司内部人的钱？",
          "en": "\"... currently only used internally ... running, profitable ...\", according to my understanding, profitable means making money from the company's internal people?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以详细说一下：九阳神功 吗",
          "en": "Can you explain in detail: Nine Yang Divine Skill?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看标题我还以为要找对象, 进来才发现是要招牛马..",
          "en": "Looking at the title, I thought you were looking for a partner, but when I came in, I found out you were recruiting laborers..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哥们 https://img.oneself.icu/uploads/67af0aa66070f_da31b2ccc11170a1.png 快来看看，能接受 10 二进制性别吗？ GPT 第一个说马斯克比较符合你，我觉得也是，你嫁给他一定会幸福",
          "en": "Dude, https://img.oneself.icu/uploads/67af0aa66070f_da31b2ccc11170a1.png come and take a look, can you accept 10 binary genders? GPT said that Elon Musk is more suitable for you, and I think so too. If you marry him, you will be happy."
        }
      ],
      "type": "replies"
    }
  ]
}