{
  "id": 1112208,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "23 年毕业至今 20 个月跳槽四家公司三个公积金账户，简历花成狗，又想跳了，唉，干一段时间就烦",
          "en": "Graduated in '23, and in 20 months, I've jumped to four companies with three different housing fund accounts. My resume is a mess, and I want to jump again. Sigh, I get bored after working for a while."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "挺好的，我刚毕业的时候在第一家公司干了 4 年，出来才发现工资翻倍了(远低于市场价在那呆四年，亏麻了)。 你这一直都紧跟市场行情走，亏不了一点",
          "en": "That's good. When I first graduated, I worked at my first company for 4 years. When I came out, I realized my salary had doubled (but it was still far below market price after staying there for four years, a huge loss). You've been keeping up with market conditions all along, so you won't lose out at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我发现评论区很多人还在拿过往几年的经验，继续在做线性外推，这个想法很危险。",
          "en": "I've noticed that many people in the comments section are still using their experiences from the past few years to continue doing linear extrapolation, which is a very dangerous idea."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "挺正常的，我毕业之后五年换了四家公司。你要觉得沉不下心来上班是个不健康的状态，那我有个很简单的方法帮你治好。你现在去掏空存款，首付 15%买套房，马上就治好了。",
          "en": "It's pretty normal. I changed four companies in five years after graduation. If you think not being able to settle down and work is an unhealthy state, then I have a very simple way to cure you. Go empty your savings now and put down 15% for a house, and you'll be cured immediately."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "换不交五险一金的公司",
          "en": "Change to a company that doesn't pay the five social insurances and one housing fund."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我毕业后在一家大厂呆了 8 年，在一家小公司呆到现在，好像放弃，直接躺平",
          "en": "After graduating, I stayed in a large factory for 8 years, and now I'm in a small company. I feel like giving up and just doing nothing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总结：工资肯定也涨的一塌糊涂。程序员就靠着跳槽涨工资呢",
          "en": "In conclusion: your salary must have increased tremendously. Programmers rely on job hopping to increase their salary."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "《如何找到想做的事》八木仁平的一本小书，很薄，可能对你有用吧。",
          "en": "'How to Find What You Want to Do' is a small book by Jinpei Yagi, it's very thin, and might be useful to you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也是 23 年毕业的，但是我大四实习转正到现在没跳过，一直在同一家公司，也没涨过薪，没跳槽的勇气。",
          "en": "I also graduated in '23, but I haven't jumped since my internship in my senior year became a full-time position. I've been in the same company all along, and I haven't gotten a raise either. I don't have the courage to change jobs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总结：年轻",
          "en": "In conclusion: young."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "总结：毫无压力",
          "en": "In conclusion: no pressure."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "换远程或者自由职业",
          "en": "Switch to remote work or freelance."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议反思一下自己，我不是说你待的公司没问题。但是这样频繁跳槽，你的心态肯定是有问题的，这种心态对你的发展肯定不好。",
          "en": "I suggest you reflect on yourself. I'm not saying there's no problem with the companies you've been in. But with such frequent job hopping, there's definitely something wrong with your mindset, and this mindset is definitely not good for your development."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ymz 那我推荐郑州或者长沙",
          "en": "@ymz Then I recommend Zhengzhou or Changsha."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jeepc 公司都不错",
          "en": "@jeepc The companies are all good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要不查查是不是 ADHD ？感觉有点符合，一般 ADHDer 一份工作都不超 6 个月",
          "en": "Why not check if you have ADHD? It feels a bit like it. Generally, ADHDers don't stay in a job for more than 6 months."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yvyvyv 「紧跟市场行情」",
          "en": "@yvyvyv 'Keeping up with market conditions'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我比你惨，毕业工作半年，换了三家公司，三个公积金账户，还在三个不同省份",
          "en": "I'm worse than you. I worked for half a year after graduation, changed three companies, have three housing fund accounts, and they're in three different provinces."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "每次工资都在涨 跳也就跳了",
          "en": "Every time the salary increases, so job hopping is fine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ajaxgoldfish #9 心态调整好，不要给自己太多压力，一点点做起",
          "en": "@ajaxgoldfish #9 Adjust your mentality, don't put too much pressure on yourself, and start little by little."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跟我刚毕业有一拼 后来要还房贷就老实了",
          "en": "Similar to me when I just graduated. Later, after I had to pay the mortgage, I became well-behaved."
        }
      ],
      "type": "replies"
    }
  ]
}