{
  "id": 1110493,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "84 岁姥爷肺癌晚期，是否需要做穿刺确认类型？",
          "en": "84-year-old grandfather has late-stage lung cancer, is it necessary to do a puncture to confirm the type?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我姥爷今年 84 岁，最近身体一直不太舒服，食欲也很差。",
          "en": "My grandfather is 84 years old this year and has been feeling unwell recently with a very poor appetite."
        },
        {
          "zh": "去医院检查后，医生看了片子说是肺癌晚期。",
          "en": "After going to the hospital for examination, the doctor looked at the film and said it was late-stage lung cancer."
        },
        {
          "zh": "治疗方案上，医生建议做穿刺来确认癌症类型，然而家人们担心穿刺手术有一定的风险，怕做完后老人身体会变得更虚弱，所以倾向于选择保守治疗。",
          "en": "Regarding the treatment plan, the doctor suggested doing a puncture to confirm the type of cancer, but the family members are worried that the puncture surgery has certain risks and are afraid that the elderly will become weaker after the procedure, so they tend to choose conservative treatment."
        },
        {
          "zh": "但这让我们陷入了两难，不知道是否该让老人承受穿刺的风险，还是选择保守治疗。",
          "en": "But this puts us in a dilemma, not knowing whether to let the elderly bear the risk of puncture or choose conservative treatment."
        },
        {
          "zh": "我们真的不希望姥爷再受罪，但又不希望错过可能有效的治疗机会。",
          "en": "We really don't want my grandfather to suffer anymore, but we don't want to miss potentially effective treatment opportunities."
        },
        {
          "zh": "但医生明确表示，如果不做穿刺，无法确认癌症类型，很多药物就无法使用，无法给出具体的治疗方案。",
          "en": "However, the doctor clearly stated that without a puncture, the type of cancer cannot be confirmed, many drugs cannot be used, and a specific treatment plan cannot be given."
        },
        {
          "zh": "请问大家有没有类似经验，或者有什么建议能帮助我们做出更合适的决策？",
          "en": "Does anyone have similar experience or any suggestions to help us make a more appropriate decision?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "算了别折腾了，84 岁也活够本了，除非你家老爷子是体制内的看病不要钱，而且全家都没出息，就指望靠老头子的退休金养活你们全家几口人，吊着也要把老人吊一口气，不然还不如让老人体面点离开",
          "en": "Forget it, don't bother, 84 years old is enough, unless your grandfather is in the system and doesn't need to pay for medical treatment, and the whole family is useless and relies on the old man's pension to support your whole family, even if you have to hang on to the elderly, otherwise it's better to let them leave with dignity."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本人肿瘤外科医生，非胸外肿瘤，1 要看目前影像学分期，是否考虑局部及远处转移 2.看经济 3.看身体（现代社会 84 岁其实并不算特别老，年龄不是唯一限制因素），如果 III 、IV 期有远处转移可能比较棘手（后期生存质量会比较差），如果不是远处转移，现在很多肺癌的靶向和免疫治疗药物已经进医保了（相对化疗来说副作用较小）。",
          "en": "I am a tumor surgeon, non-thoracic tumor. 1. It depends on the current imaging staging, whether to consider local and distant metastasis. 2. Look at the finances. 3. Look at the body (in modern society, 84 years old is not particularly old, age is not the only limiting factor). If it's stage III or IV with distant metastasis, it may be relatively tricky (the quality of life in the later stage will be relatively poor). If it is not distant metastasis, many targeted and immunotherapy drugs for lung cancer have been included in medical insurance (relatively smaller side effects compared to chemotherapy)."
        },
        {
          "zh": "如果经济情况还不错，且没有太多基础疾病，我个人认为可以考虑做穿刺，明确病理和分子分型，以便更精准的选择治疗方案。",
          "en": "If the financial situation is good and there are not too many underlying diseases, I personally think you can consider doing a puncture to clarify the pathology and molecular subtype in order to choose a more precise treatment plan."
        },
        {
          "zh": "当然即使有远传转移，这些药物还是能在一定程度上改善生存质量及预期寿命。",
          "en": "Of course, even with distant metastasis, these drugs can still improve the quality of life and life expectancy to a certain extent."
        },
        {
          "zh": "另外如有必要可就近咨询国内最好肿瘤医院：医科院肿瘤医院、中肿、复旦肿瘤、北大肿瘤、天肿、上海肺科等。",
          "en": "In addition, if necessary, you can consult the best domestic oncology hospitals nearby: Cancer Hospital, Chinese Academy of Medical Sciences, Sun Yat-sen University Cancer Center, Fudan University Cancer Hospital, Peking University Cancer Hospital, Tianjin Medical University Cancer Hospital, Shanghai Pulmonary Hospital, etc."
        },
        {
          "zh": "国际上大概就是 MD 安德森、纪念斯凯隆了（约 15-30 万刀）。",
          "en": "Internationally, it's probably MD Anderson and Memorial Sloan Kettering (approximately $150,000-$300,000)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@b4115Z4mRAz9P8EA #6 为什么总是喜欢贴 AI 回复, 你老实说, 这一大串, 你自己读了一遍没有?",
          "en": "@b4115Z4mRAz9P8EA #6 Why do you always like to post AI replies? Be honest, have you read through this whole bunch yourself?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看老人个人意见。",
          "en": "See the elderly person's personal opinion."
        },
        {
          "zh": "有些话晚辈不好说。",
          "en": "Some things are hard for the younger generation to say."
        },
        {
          "zh": "家里不缺钱的话你也不会犹豫了。",
          "en": "If the family doesn't lack money, you wouldn't hesitate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@b4115Z4mRAz9P8EA #6 你号没了，社区有制度，不能发 AI 的回答",
          "en": "@b4115Z4mRAz9P8EA #6 Your account is gone. The community has a system and cannot post AI answers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老人吸烟吗?",
          "en": "Does the elderly person smoke?"
        },
        {
          "zh": "如果吸烟,大概率是肺鳞癌,肺鳞癌没有靶向药(2020 年时没有,现在不清楚),穿刺意义就不大了",
          "en": "If they smoke, it is likely to be squamous cell lung cancer. Squamous cell lung cancer has no targeted drugs (it didn't in 2020, not sure now), so the puncture is not very meaningful."
        },
        {
          "zh": "如果不吸烟,就很有可能是肺腺癌或小细胞癌,这种有靶向药,穿刺比较有意义",
          "en": "If they don't smoke, it is likely to be adenocarcinoma or small cell carcinoma, which have targeted drugs, so the puncture is more meaningful."
        },
        {
          "zh": "另外,有氩氦刀可以伴随穿刺同时做,就是在穿刺的同时,冷冻针孔周边,防止穿刺后扩散",
          "en": "In addition, there is an argon-helium knife that can be used simultaneously with the puncture, that is, freezing the area around the needle hole during the puncture to prevent diffusion after the puncture."
        },
        {
          "zh": "穿刺后会咳血一段时间",
          "en": "There will be coughing up blood for a period of time after the puncture."
        },
        {
          "zh": "仅供参考,还是要找大医院问一下",
          "en": "For reference only, you should still ask a major hospital."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "医学院教生物信息的路过。",
          "en": "Passing by, teaching bioinformatics at a medical school."
        },
        {
          "zh": "肺癌晚期，晚期的意思就是癌症已经扩散，无法通过手术切除肿瘤。",
          "en": "Late-stage lung cancer, late-stage means the cancer has metastasized and the tumor cannot be surgically removed."
        },
        {
          "zh": "化疗是一个合理的选择，有助于延长生存期、改善生活质量。",
          "en": "Chemotherapy is a reasonable choice, which helps to prolong survival and improve quality of life."
        },
        {
          "zh": "癌症的分型有助于更好地用药。",
          "en": "Cancer typing helps to use drugs better."
        },
        {
          "zh": "肺癌有很多靶向药，选择靶向药效果好，副作用少。",
          "en": "There are many targeted drugs for lung cancer. Choosing targeted drugs has good effects and fewer side effects."
        },
        {
          "zh": "穿刺创伤很小，把一根大号的针插到肺里，取一些肺组织，恢复很快的，风险很小。",
          "en": "The puncture trauma is very small. Insert a large needle into the lung, take some lung tissue, and recover quickly with very little risk."
        },
        {
          "zh": "-------------另一个经常被问的问题，体检发现癌症早期，手术切除之后，问做不做基因检测。",
          "en": "-------------Another frequently asked question is, after finding early-stage cancer during a physical examination and surgically removing it, ask whether to do genetic testing."
        },
        {
          "zh": "因为体检的进步，发现身体里有一些微小的肿瘤会越来越多，医生会建议观察。",
          "en": "Because of the advancement of physical examinations, it is found that there are more and more tiny tumors in the body, and doctors will recommend observation."
        },
        {
          "zh": "如果肿瘤继续增大，可能会建议手术切除，送病理检测。",
          "en": "If the tumor continues to grow, surgical removal may be recommended for pathological testing."
        },
        {
          "zh": "可能是良性的，也可能是恶性的。",
          "en": "It may be benign or malignant."
        },
        {
          "zh": "因为肿瘤没有扩散，切除之后，不进行化疗。",
          "en": "Because the tumor has not spread, no chemotherapy is performed after removal."
        },
        {
          "zh": "如果不需进行化疗（划重点：无须下一步治疗），基因检测没有必要做，弄懂了癌症的分型，也没有指导意义。",
          "en": "If chemotherapy is not required (highlight: no further treatment is required), genetic testing is not necessary, and understanding the cancer type has no guiding significance."
        },
        {
          "zh": "基因检测价格不便宜，还需要自费。",
          "en": "Genetic testing is not cheap and needs to be paid for out of pocket."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "肺癌是目前所有癌症中靶向药和免疫治疗方案最多的癌症。",
          "en": "Lung cancer currently has the most targeted drugs and immunotherapy options of all cancers."
        },
        {
          "zh": "如果基因检测结果显示是对靶向药比较敏感的腺癌或者对化疗比较敏感的小细胞肺癌，那收益还是很大的，可能可以大大减轻病人的痛苦，增加生存期。",
          "en": "If the genetic testing results show adenocarcinoma that is more sensitive to targeted drugs or small cell lung cancer that is more sensitive to chemotherapy, then the benefits are still great, which may greatly reduce the patient's pain and increase survival time."
        },
        {
          "zh": "肺癌晚期，集采后可选择的靶向药很多，报销后的费用可能比你预想的要低得多。",
          "en": "In late-stage lung cancer, there are many targeted drugs to choose from after centralized procurement, and the cost after reimbursement may be much lower than you expected."
        },
        {
          "zh": "非常不赞同楼上连病型都没搞清楚就直接放弃老人生命的建议。",
          "en": "I strongly disagree with the suggestion to give up on the elderly person's life without even figuring out the type of disease."
        },
        {
          "zh": "84 岁虽然年纪不小了，但如果身体底子不差，再争取几年生存期，对子女和孙辈来说也是一种安慰。",
          "en": "Although 84 years old is not young, if the body is not in bad shape, striving for a few more years of survival is also a comfort to children and grandchildren."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@b4115Z4mRAz9P8EA 来论坛目的就是问真人，要问 ai 不能自己去问吗更便捷。",
          "en": "@b4115Z4mRAz9P8EA The purpose of coming to the forum is to ask real people. If you want to ask AI, can't you just ask yourself more conveniently?"
        },
        {
          "zh": "另外 ai 也可能爬这个站来训练，全是 ai 回答这是要让 ai 循环吃屎，或者会被降 SEO 。",
          "en": "In addition, AI may also crawl this site to train, and if all the answers are AI, it will make AI cycle eating shit, or it will be downgraded in SEO."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "本人肿瘤外科医生，非胸外肿瘤，1 看经济 2 看身体，现代社会 84 岁其实并不算特别老，现在很多肺癌的靶向和免疫治疗药物已经进医保了。",
          "en": "I am a tumor surgeon, non-thoracic tumor. 1. Look at the finances. 2. Look at the body. In modern society, 84 years old is not particularly old. Many targeted and immunotherapy drugs for lung cancer have been included in medical insurance now."
        },
        {
          "zh": "如果经济情况还不错，且没有太多基础疾病，我个人认为可以考虑做穿刺，明确病理和分子分型，以便更精准的选择治疗方案。",
          "en": "If the financial situation is good and there are not too many underlying diseases, I personally think you can consider doing a puncture to clarify the pathology and molecular subtype in order to choose a more precise treatment plan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我还是建议你问下当事人，他的态度，治疗需要花费很多钱，但是这个年龄效果很差。",
          "en": "I still suggest you ask the person involved, his attitude. The treatment costs a lot of money, but the effect is very poor at this age."
        },
        {
          "zh": "他可能根本扛不住放疗，我爷爷是胃癌晚期，因为是农村来城市看病，医生一眼就看出来没多少钱，医生直接说回去吃好喝好，别想太多。",
          "en": "He may not be able to withstand radiotherapy at all. My grandfather had late-stage stomach cancer. Because he came from the countryside to the city for treatment, the doctor could tell at a glance that he didn't have much money. The doctor directly said to go back and eat and drink well, and don't think too much."
        },
        {
          "zh": "我本身也是做医疗软件的，后面跟一些医生交流，他们的意思：如果不是干部退休医保全报，一般家庭没必要折腾了。",
          "en": "I myself also work on medical software. Later, I communicated with some doctors. Their meaning is: If it's not cadre retirement medical insurance that covers all the costs, there is no need for ordinary families to bother with it."
        },
        {
          "zh": "晚期吃不下饭很痛苦，如果他愿意活着，就去医院输白蛋白（营养液），全自费但是不是很贵。",
          "en": "It is painful to be unable to eat in the late stage. If he wants to live, go to the hospital to infuse albumin (nutrient solution), which is all at your own expense but not very expensive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yqf0215 发 AI 答案要封禁哦",
          "en": "@yqf0215 Posting AI answers will be banned."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yqf0215 穿刺后的确定了癌症类型，用药很昂贵（靶向药），印版的也要几大千，而且 84 岁时扛不住穿刺的，想要走的舒服点就是什么都不做，该吃吃该喝喝。",
          "en": "@yqf0215 After the puncture confirms the type of cancer, the drugs are very expensive (targeted drugs), and even the Indian version costs several thousand, and 84 years old cannot withstand the puncture. If you want to leave comfortably, just do nothing, eat and drink as you should."
        },
        {
          "zh": "到后期要走的那几个月，身上会很痛，和当地的医院的医生，打好关系，开点管制止痛药。",
          "en": "In the last few months, the body will be very painful. Have a good relationship with the doctors in the local hospital and prescribe some controlled painkillers."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "换个医院，换个专家，让 84 岁的老人穿刺，水平堪忧。",
          "en": "Change to another hospital, change to another expert. Performing a puncture on an 84-year-old is worrying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@b4115Z4mRAz9P8EA #19 sb",
          "en": "@b4115Z4mRAz9P8EA #19 sb (son of a bitch)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去年外公肺癌晚期最后也做了穿刺，其实如果你不打算做继续积极治疗的话，穿刺好像没什么用，当时我们也做了穿刺，其实就是知道了下是腺癌还是鳞癌好像，不管是哪个，医生给了两条路：保守治疗（其实回家吃止痛药等死）或者化疗。",
          "en": "Last year, my grandfather also had a puncture at the end of his late-stage lung cancer. In fact, if you don't plan to continue active treatment, the puncture doesn't seem to be of much use. We also did a puncture at the time. In fact, we just found out whether it was adenocarcinoma or squamous cell carcinoma. No matter which one, the doctor gave two options: conservative treatment (actually go home to take painkillers and wait to die) or chemotherapy."
        },
        {
          "zh": "外公也是 80 多岁，旁边床位的人做了化疗身体越来越差后来直接回家了，外公选择了保守治疗，那时是清明节，我从杭州回去在医院陪护他，五一我也回去看了，才没过多久，人已经明显不行了，在医院的时候还能下楼去食堂吃饭，去玩一趟医院在家里话已经说不了了，说好十一的时候我再回来看他，但是还没到十一人就走了。",
          "en": "My grandfather was also in his 80s. The person in the next bed had chemotherapy, and his body became worse and worse, and then he went straight home. My grandfather chose conservative treatment. It was Qingming Festival at that time. I went back from Hangzhou to the hospital to take care of him. I went back to see him on May Day, and it wasn't long before he was obviously not doing well. When he was in the hospital, he could go downstairs to the cafeteria to eat. After a trip from the hospital to the house, he couldn't speak anymore. We agreed that I would come back to see him again at the National Day, but he passed away before the National Day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我奶奶 82 ，前年发现的，锁骨上方还是脖子还有个包，拿这个包做的淋巴穿刺。",
          "en": "My grandma is 82. It was discovered the year before last. There is a lump above the collarbone or on the neck. A lymph node puncture was done on this lump."
        },
        {
          "zh": "前年吃了几个月一代靶向药后就耐药，去年吃了一整年的三代靶向药，三代效果很好副作用还没一代大，现在基本是自理自己做饭洗澡那些都没啥问题 。",
          "en": "After taking first-generation targeted drugs for a few months the year before last, she became resistant. Last year, she took third-generation targeted drugs for a whole year. The effect of the third generation is very good and the side effects are not as big as the first generation. Now she is basically self-sufficient and has no problem with cooking and bathing herself."
        },
        {
          "zh": "农村老人家没有社保退休金，只有新农合，今年 400 一年，药去年一万五一盒，大病基金报销后自费两千一个月。",
          "en": "The elderly people in the countryside have no social security pension, only the New Rural Cooperative Medical Scheme, which costs 400 yuan a year this year. The medicine cost 15,000 yuan a box last year. After reimbursement by the critical illness fund, it costs 2,000 yuan a month out of their own pocket."
        },
        {
          "zh": "今年药便宜了三千接近一万三一盒。",
          "en": "This year the medicine is 3,000 yuan cheaper, nearly 13,000 yuan a box."
        },
        {
          "zh": "自费未到大病报销额度，目前新农合报销后三千一盒。",
          "en": "The amount paid out of her own pocket has not reached the critical illness reimbursement limit. Currently, it is 3,000 yuan a box after reimbursement by the New Rural Cooperative Medical Scheme."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我不是很理解楼上一大串不要穿刺的，穿刺本身是个非常小的手术，几乎就是扎了一针，哪儿有那么夸张？",
          "en": "I don't quite understand the long list of people above saying not to do a puncture. The puncture itself is a very small procedure, almost just like getting an injection. Where is it so exaggerated?"
        },
        {
          "zh": "我太姥姥九十岁阑尾炎还做了手术呢，确实恢复不容易，但是多活了好几年。",
          "en": "My great-grandmother had surgery for appendicitis at the age of ninety. It is indeed not easy to recover, but she lived for several more years."
        },
        {
          "zh": "八十多岁身体差异很大，有的完全起不来，然而钟南山也是八十多。",
          "en": "There are great differences in the bodies of people in their eighties. Some can't get up at all, but Zhong Nanshan is also in his eighties."
        },
        {
          "zh": "去一个靠谱的相关医院，看医生意见，不行就多看两个，综合判断医生的意见。",
          "en": "Go to a reliable relevant hospital, see the doctor's opinion, and if it doesn't work, see two more, and comprehensively judge the doctor's opinion."
        },
        {
          "zh": "别在这听网友瞎说。",
          "en": "Don't listen to the nonsense of netizens here."
        },
        {
          "zh": "@Jinnrry +1.不了解这么多让放弃的。",
          "en": "@Jinnrry +1. Don't understand so much, give up."
        },
        {
          "zh": "至少仔细分析下情况啊？",
          "en": "At least analyze the situation carefully?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@livid #6 ai",
          "en": "@livid #6 ai"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1.咨询自己能够得着的最好的专科医院，大于等于 2 家，2.了解穿刺具体怎么做的 创伤是不是那么大，还是类似一根针仅供参考",
          "en": "1. Consult the best specialist hospitals you can reach, greater than or equal to 2. 2. Understand how the puncture is done specifically. Is the trauma so great, or is it similar to a needle for reference only."
        }
      ],
      "type": "replies"
    }
  ]
}