{
  "id": 1110500,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "炒股有什么需要注意的",
          "en": "What should I pay attention to when investing in stocks?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "听了昨天 V 友的推荐开了户准备小玩下，看是否能转移注意力缓解情绪...",
          "en": "I opened an account based on a recommendation from a V2EX user yesterday and plan to play around a bit to see if it can distract me and relieve my emotions..."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "注意留 3k 购买电动车",
          "en": "Be sure to keep 3k for buying an electric scooter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既然来问了，我就不劝你不开户了",
          "en": "Since you're asking, I won't advise you against opening an account."
        },
        {
          "zh": "我这几年从亏 50% 到现在平均年化不到 15%的一点小经验",
          "en": "Here's a little experience from my past few years, going from losing 50% to now averaging less than 15% annually:"
        },
        {
          "zh": "别短线，买入一支股票的时候要做好止盈止损的计划，并且严格按照计划执行",
          "en": "Don't day trade. When buying a stock, have a take-profit and stop-loss plan in place and strictly follow it."
        },
        {
          "zh": "不懂的东西不碰，宁可空仓也不要追涨",
          "en": "Don't touch things you don't understand. It's better to be out of the market than to chase the highs."
        },
        {
          "zh": "买在无人问津时，卖在人声鼎沸时",
          "en": "Buy when no one cares and sell when everyone is excited."
        },
        {
          "zh": "不挣最后一个铜板",
          "en": "Don't try to make the last cent."
        },
        {
          "zh": "其实都是很简单的道理，执行起来很难",
          "en": "These are all simple principles, but they are difficult to execute."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意: 不要炒股",
          "en": "Note: Don't invest in stocks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意进厂时机",
          "en": "Pay attention to the timing of entering the factory (i.e., getting a job)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个 v 友跟你有杀父之仇吗 推荐你炒股",
          "en": "Does this V2EX user have a grudge against you? Recommending you to invest in stocks?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "笑死, 看了一下 V 友明显在开玩笑.",
          "en": "LOL, I looked at it and the V2EX user was clearly joking."
        },
        {
          "zh": "按照你容易上头的特点, 如果在大 A 开户,  你之后可能还容易上天台 https://v2ex.com/t/1110181#r_15881906",
          "en": "Given your tendency to get carried away, if you open an account in the A-share market, you might end up on the roof afterward. https://v2ex.com/t/1110181#r_15881906"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议直接投美股或者港股，港股买银行的，美股定投标普 500 和纳斯达克 100",
          "en": "I suggest investing directly in US stocks or Hong Kong stocks. Buy bank stocks in Hong Kong and dollar-cost average into the S&P 500 and Nasdaq 100 in the US."
        },
        {
          "zh": "如果开的 a 股账户，尽量买这些对应的场内基金，个股少碰，新手很容易拿不住，受情绪跟风影响比较多",
          "en": "If you open an A-share account, try to buy the corresponding ETFs. Avoid individual stocks. It's easy for novices to lose their grip and be influenced by emotions and trends."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "听我的，满仓黄金，想风险小点就黄金 ETF ，五年后财产翻三倍",
          "en": "Listen to me, go all-in on gold. If you want less risk, buy gold ETFs. Your assets will triple in five years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "劝人炒股 天打雷劈",
          "en": "Advising someone to invest in stocks is like being struck by lightning."
        },
        {
          "zh": "如果一定要进 请千万做好预期管理 拉好风控线 不 allin 不抄底 不上杠杆 尽量不持有个股 一点一点进 不要按天炒股 买了就别老看盘",
          "en": "If you must enter, please be sure to manage your expectations, set up risk control lines, don't go all-in, don't buy the dip, don't use leverage, try not to hold individual stocks, enter little by little, don't day trade, and don't keep watching the market after you buy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "注意不要炒股",
          "en": "Note: Don't invest in stocks."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不怕你赚钱，就怕你不玩",
          "en": "I'm not afraid of you making money, I'm afraid of you not playing (the game)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@bjfane 保留 3k 还有后路，买电动车美团饿了么送外卖以图东山再起",
          "en": "@bjfane Keeping 3k leaves you a way out. Buy an electric scooter and deliver food for Meituan or Ele.me to make a comeback."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "快逃",
          "en": "Run away!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "留几百块吃饭",
          "en": "Keep a few hundred yuan for food."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "入市有风险，投资需谨慎",
          "en": "There are risks in the market, invest with caution."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去正规市场",
          "en": "Go to a regulated market."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "什么情况也不要买 A 股",
          "en": "Don't buy A-shares under any circumstances."
        },
        {
          "zh": "情绪不稳的不要债基以上投资",
          "en": "If you are emotionally unstable, don't invest in anything beyond bond funds."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议销户",
          "en": "I suggest closing the account."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "模拟 炒一年（上点心学习透），上手一年（交一年学费），准备挣钱（不一定能挣到，看方法了）",
          "en": "Simulate trading for a year (study it thoroughly), then trade live for a year (pay your tuition), then prepare to make money (not guaranteed, depends on your method)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想想赌场，转移注意力是可以的，缓解情绪是不能的，只会增加情绪波动。",
          "en": "Think of a casino. Distracting yourself is possible, but relieving emotions is not. It will only increase emotional fluctuations."
        }
      ],
      "type": "replies"
    }
  ]
}