{
  "id": 1109490,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "三十几岁的人了，仍要谈一下梦想",
          "en": "In my thirties, still want to talk about dreams."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "最近这三年经常在 V 站分享旅行游记和房车体验，这源于很早之前的一个想法，或者说是那个叫“梦想”的东西",
          "en": "In the past three years, I have often shared travelogues and RV experiences on V2EX, which stems from an early idea, or rather, something called 'dream'."
        },
        {
          "zh": "这几天上线了一个页面，将之前杂乱的旅行游记给按照省/市/区县目的地三级整理，同时加入了点亮地图的游戏元素，个人还挺满意，于是在冲动之下写了这个话题，算是多年的想法公之于众了",
          "en": "These days, I launched a page to organize the previously messy travelogues according to the three levels of province/city/district destination, and added the game element of lighting up the map. I am quite satisfied with it, so I wrote this topic on impulse, which is considered to make many years of ideas public."
        },
        {
          "zh": "https://blog.ops-coffee.cn/r/the-dream-of-my-life.html",
          "en": "https://blog.ops-coffee.cn/r/the-dream-of-my-life.html"
        },
        {
          "zh": " ![]( https://i.imgur.com/IyEqrl3.png)",
          "en": " ![]( https://i.imgur.com/IyEqrl3.png)"
        },
        {
          "zh": " ![]( https://i.imgur.com/DCJ4S3s.png)",
          "en": " ![]( https://i.imgur.com/DCJ4S3s.png)"
        },
        {
          "zh": "同时也想发个帖子问下大伙，你现在还有梦想吗？",
          "en": "I also want to post a question to everyone: do you still have dreams now?"
        },
        {
          "zh": "还记得曾经的梦想是什么吗？",
          "en": "Do you remember what your dream used to be?"
        },
        {
          "zh": "如果有关于梦想的故事分享那就更好了，如果方便的话留下年龄段，做个参考",
          "en": "It would be even better if you have a dream story to share. If it is convenient, leave your age group for reference."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "小时候想娶刘亦菲，目前还没有实现",
          "en": "When I was a child, I wanted to marry Liu Yifei, but it has not been realized yet."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所以你的梦想是打卡吗？",
          "en": "So, your dream is to check in?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "三十多了，梦想才开始，刚毕业的时候，懵懵懂懂，对于这个社会的运作一概不知。",
          "en": "In my thirties, dreams are just beginning. When I just graduated, I was ignorant and knew nothing about the operation of this society."
        },
        {
          "zh": "稀里糊涂的凭着本能上班到现在，该是时候去追寻自己的梦想了",
          "en": "I have been working based on instinct until now, and it is time to pursue my dreams."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上高中的时候和同桌说梦想着自己开一家网吧，自己当网管，想着只要有游戏玩有泡面吃就足够了。",
          "en": "When I was in high school, I told my deskmate that I dreamed of opening an internet cafe and being the webmaster myself, thinking that as long as I had games to play and instant noodles to eat, it would be enough."
        },
        {
          "zh": "现在十年之后网吧已经在凑备了，刚和领导提了离职。",
          "en": "Now, ten years later, the Internet cafe is already in preparation, and I have just submitted my resignation to the leader."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fusi 你这个比我的难多了",
          "en": "@fusi Your dream is much harder than mine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "关注 OP 博客很久了，因房车结缘。",
          "en": "I have been following OP's blog for a long time, and I became acquainted with him because of RVs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去过这么多地方",
          "en": "Been to so many places"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "羡慕你们这些有梦想又能去实行的人",
          "en": "I envy you people who have dreams and can put them into practice."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "梦想是在住上独栋别墅，有一个足够大的院子，养一只大黄狗，工作压力不大，周末带着一家老小和要好的朋友去露营，野餐，夏天时找地方玩水，最好离海边也近一些，可以看看日出或者日落，看着女儿慢慢长大，给她人生的经验，并从她身上获得启发",
          "en": "My dream is to live in a detached villa, have a large enough yard, raise a big yellow dog, have little work pressure, take my family and good friends camping and picnicking on weekends, find a place to play in the water in summer, and it is best to be close to the beach, so you can watch the sunrise or sunset, watch your daughter grow up slowly, give her life experience, and be inspired by her."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "100 年后，我一定死了，所以我有 梦想或者幻想 有一点实现一点",
          "en": "In 100 years, I will definitely be dead, so I have dreams or fantasies and realize a little bit."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@katwalk #46 你这保护树木的心是好的，不过。。。我还是没想到竟然会问出这样的问题，超出预料",
          "en": "@katwalk #46 Your heart to protect trees is good, but... I didn't expect you to ask such a question, it's unexpected."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这是我近期在中文内容看到最感动和最赏心悦目的内容。",
          "en": "This is the most touching and pleasing content I have seen in Chinese content recently."
        },
        {
          "zh": "照片和文字都好好。",
          "en": "The photos and text are both very good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "梦想坐邮轮去南极溜一圈",
          "en": "Dream of taking a cruise to Antarctica for a spin."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "支持。",
          "en": "Support."
        },
        {
          "zh": "不过我对旅游袪魅了，去哪都差不多，心态不如你。",
          "en": "However, I am demystified by tourism. It is almost the same to go anywhere, and my mentality is not as good as yours."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fusi 小时候想娶？",
          "en": "@fusi You wanted to marry her when you were a kid?"
        },
        {
          "zh": "我现在也想娶之前有一段时间，在 B 站看了好久房车旅行的 vlog ，感觉最大的困难还不是钱的问题。",
          "en": "I also want to marry her now. Some time ago, I watched RV travel vlogs on Bilibili for a long time, and I felt that the biggest difficulty was not the money issue."
        },
        {
          "zh": "而是旅行途中一堆繁琐的小事，估计我这种懒人是坚持不了这种长线计划的",
          "en": "But a lot of trivial things during the trip, I guess a lazy person like me can't stick to this long-term plan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哇，大佬，和你想法一样，我也专门做了一个页面来记录： https://www.likehide.com/photograph/",
          "en": "Wow,大佬, just like your idea, I also made a page to record: https://www.likehide.com/photograph/"
        },
        {
          "zh": "但是我这个很丑啊，感觉大佬这个好漂亮，想问一下大佬的页面可以开源吗？",
          "en": "But mine is very ugly. I feel that 大佬's page is so beautiful. I want to ask if 大佬's page can be open sourced?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "up 吃住都在车上吗",
          "en": "Up, do you live and eat in the car?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很赞，看完俺也准备搞个类似的页面把记录给归归类",
          "en": "Great, after reading it, I am also preparing to create a similar page to classify the records."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小时候想当主席",
          "en": "When I was a kid, I wanted to be the chairman."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我现在真没啥梦想了，能找个合适的人结婚过一辈就行了",
          "en": "I really don't have any dreams now, it would be good to find someone suitable to marry and live a lifetime."
        }
      ],
      "type": "replies"
    }
  ]
}