{
  "id": 1108934,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "牛马怎样减肥",
          "en": "How do overworked people lose weight?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "真牛马即没时间和精力运动，又需要食物来缓解工作带来的压力，能减肥大多是得了糖尿病。",
          "en": "Truly overworked people have neither the time nor the energy to exercise and need food to relieve the stress from work. If they lose weight, it's probably because they have diabetes."
        },
        {
          "zh": "所以先努力摆脱牛马吧，到时候可以去运动，节食也不会多难受。",
          "en": "So, first, try to get out of the overworked state. Then you can exercise, and dieting won't be too difficult."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "饮食，运动，睡眠，压力管理，生活方式，肠道菌群。",
          "en": "Diet, exercise, sleep, stress management, lifestyle, gut microbiota."
        },
        {
          "zh": " 如何让自己具备上述框架的知识，然后逐步完善？",
          "en": "How can one acquire knowledge of the above framework and gradually improve it?"
        },
        {
          "zh": "唯有看书先看四本科学减肥的书，做笔记，然后输出自己的减肥计划《吃出健康好身材》 范志红的《你是你吃出来的（慢病怎么吃）》 夏萌的《你是你吃出来的（吃对少生病）》夏萌的《冯雪科学减肥法》 冯雪的别人的**碎片经验**，不足以支撑你未来 50 年的健康出书的更**系统性**，能支撑你有质量的人生",
          "en": "The only way is to read books. Start with four scientific weight loss books, take notes, and then output your own weight loss plan: 'Eat Your Way to a Healthy Body' by Fan Zhihong, 'You Are What You Eat (How to Eat with Chronic Diseases)' by Xia Meng, 'You Are What You Eat (Eat Right to Get Sick Less)' by Xia Meng, and 'Feng Xue Scientific Weight Loss Method' by Feng Xue. Other people's **fragmented experiences** are not enough to support your health for the next 50 years. Books are more **systematic** and can support you in having a quality life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zhangyou1010 都牛马了  哪还有时间跑步",
          "en": "@zhangyou1010 If you're overworked, where do you find the time to run?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实很简单，只要有毅力就可以。",
          "en": "Actually, it's very simple, as long as you have perseverance."
        },
        {
          "zh": "实现起来无非就是：1. 清淡饮食，拒绝高热量食品，多吃膳食纤维丰富的东西，饱腹感强还不长肉。",
          "en": "Achieving it is nothing more than: 1. Eat a light diet, refuse high-calorie foods, and eat more things rich in dietary fiber that are filling and don't cause weight gain."
        },
        {
          "zh": "比如我之前的经验就是：    - 早餐吃个欧包或全麦面包，配合牛奶或咖啡（大概在 200 卡以内）    - 午餐吃轻食，热量控制在 300 卡以内（可能比较苛刻，一般来说 400 卡以内都可以）    - 晚餐继续吃轻食，或者有时候干脆不吃（热量摄入 300 卡以内）2. 适度运动，每天保证 30 分钟运动即可。",
          "en": "For example, my previous experience was: - Breakfast: an European bread or whole wheat bread, with milk or coffee (about 200 calories) - Lunch: a light meal, with calories controlled within 300 calories (maybe a bit strict, generally 400 calories is fine) - Dinner: continue with a light meal, or sometimes just don't eat (calorie intake within 300 calories) 2. Moderate exercise, ensure 30 minutes of exercise per day."
        },
        {
          "zh": "条件允许就去健身房跑步举铁，条件不允许的话在家搞个瑜伽垫也可以做 HIIT （也就 20 多分钟的事）。",
          "en": "If conditions allow, go to the gym to run and lift weights. If conditions don't allow, you can do HIIT at home with a yoga mat (which only takes 20 minutes or so)."
        },
        {
          "zh": "我之前是每天去健身房 1 个半小时，比较卷，但见效更快。",
          "en": "I used to go to the gym for 1.5 hours every day, which was quite intense, but it was more effective."
        },
        {
          "zh": "没了，真的就是上面两条，能坚持做 2 个月，至少能瘦 10 斤。",
          "en": "That's it, really just the two points above. If you can stick to it for 2 months, you can lose at least 10 pounds."
        },
        {
          "zh": "我三个月瘦了 30 斤，170 斤减到 140 。",
          "en": "I lost 30 pounds in three months, going from 170 to 140."
        },
        {
          "zh": "3 个月下来你会发现你的饮食习惯完全发生了变化。。。",
          "en": "After 3 months, you will find that your eating habits have completely changed..."
        },
        {
          "zh": "我之前喜欢吃甜食，喜欢吃重辣的食物。",
          "en": "I used to like sweets and very spicy food."
        },
        {
          "zh": "3 个月清淡饮食之后我发现原来我喝的饮料甜到令人发指，完全喝不下去了。",
          "en": "After 3 months of light diet, I found that the drinks I used to drink were ridiculously sweet and I couldn't drink them at all."
        },
        {
          "zh": "吃辣的也退化了，稍微一点点麻辣的菜我就被呛到不行。",
          "en": "My tolerance for spiciness also decreased. I get choked by even a little bit of spicy food."
        },
        {
          "zh": "但瘦下来的感觉还是很好的。",
          "en": "But the feeling of losing weight is still very good."
        },
        {
          "zh": "后来健身中腰部受了伤，被迫终止。",
          "en": "Later, I injured my waist during exercise and was forced to stop."
        },
        {
          "zh": "最近一年我没有继续上面的生活方式，而是随心所欲了一下，就又胖了 20 斤回来，所以我决定今年开春天气暖和之后重启减肥之路。",
          "en": "In the past year, I haven't continued the above lifestyle and have been indulging myself, so I've gained 20 pounds back. I've decided to restart my weight loss journey after the weather warms up this spring."
        },
        {
          "zh": "发这么多话在这里也是为了跟楼主共勉，希望新的一年我们都可以实现自己的目标。",
          "en": "I am writing so much here to encourage the original poster, and I hope we can all achieve our goals in the new year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跑步试试",
          "en": "Try running"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "运动的时间成本挺高的，减肥首推少吃",
          "en": "The time cost of exercise is quite high. Eating less is the best suggestion for losing weight."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "饮食控制，戒掉饮料夜宵，平时吃饭六七分饱。",
          "en": "Control your diet, quit drinks and midnight snacks, and eat only 60-70% full at meals."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "少吃 其他啥都不用变 就只需要做到这点就行了",
          "en": "Eat less. You don't need to change anything else, just do this."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "换种生活方式，自己做饭，适当运动。",
          "en": "Change your lifestyle, cook your own meals, and exercise appropriately."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一天吃一顿饭..",
          "en": "Eat one meal a day..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "减糖 减脂",
          "en": "Reduce sugar and reduce fat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "睡眠也挺重要的，大概占三成因素",
          "en": "Sleep is also very important, accounting for about 30% of the factors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Light3 那顶不住啊",
          "en": "@Light3 That's hard to handle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@beixiao 想的是快速减肥",
          "en": "@beixiao Thinking about losing weight quickly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "少吃，曾经一年中午外卖吃手撕鸡+瘦叉烧，晚上只吃青菜加室内健身环大冒险 20 分钟左右。",
          "en": "Eat less. I used to order shredded chicken + lean char siu for lunch for a year, and eat only green vegetables plus about 20 minutes of indoor fitness ring adventure at night."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@arron2022 不吃宵夜  平时吃的可能有点多",
          "en": "@arron2022 Don't eat midnight snacks. I probably eat a little too much at other times."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Skifary  少吃是对的",
          "en": "@Skifary Eating less is right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要晚上保持饥饿感入睡，指定能瘦 。",
          "en": "As long as you go to bed feeling hungry at night, you will definitely lose weight."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "先戒掉零食和饮料，不吃加工食品，比如肠啊、午餐肉啊这些。",
          "en": "First quit snacks and drinks, and don't eat processed foods, such as sausages and luncheon meat."
        },
        {
          "zh": "再调整饮食结构，多蛋白质、膳食纤维，尽量让饮食丰富一些，不要只炫碳水，碳水包括但不限于米面、土豆红薯这些杂粮，同理也少吃主食加工的食品，什么粉啊啥的。",
          "en": "Then adjust your diet, eat more protein and dietary fiber, and try to make your diet richer. Don't just eat carbs. Carbs include but are not limited to rice, noodles, potatoes, sweet potatoes, and other grains. Similarly, eat less processed staple foods, like noodles."
        },
        {
          "zh": "然后找个自己喜欢的运动，坚持下来。",
          "en": "Then find a sport you like and stick to it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "少吃，周末运动，工作日下班室内半小时徒手无氧总有时间吧。",
          "en": "Eat less, exercise on weekends, and you should always have time for half an hour of indoor bodyweight anaerobic exercise after work on weekdays."
        }
      ],
      "type": "replies"
    }
  ]
}