{
  "id": 1113997,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "分享一下你最喜欢的动画/动漫电影吧？",
          "en": "Share your favorite animation/anime movie?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我先来，心中的 TOP1 是寻梦环游记",
          "en": "Let me start, my TOP1 is Coco."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "凡人修仙传 TOP1",
          "en": "A Record of a Mortal's Journey to Immortality TOP1"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不良人系列",
          "en": "The Degenerate series"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "疯狂动物城",
          "en": "Zootopia"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "饺子的两部哪吒",
          "en": "Two Nezha movies by Jiaozi"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "魁拔",
          "en": "Kwai Boo"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有最，宫崎骏的我喜欢《风之谷》",
          "en": "No absolute favorite, for Miyazaki Hayao's work, I like 'Nausicaä of the Valley of the Wind'"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "魁拔马达加斯加的企鹅",
          "en": "Kwai Boo, Penguins of Madagascar"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前两天一模一样的热门贴子。https://www.v2ex.com/t/1109751",
          "en": "The exact same popular post from a few days ago. https://www.v2ex.com/t/1109751"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "仙逆",
          "en": "Renegade Immortal"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "clannad 看一次哭一次",
          "en": "Clannad, I cry every time I watch it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "来自深渊",
          "en": "Made in Abyss"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正义联盟：闪点悖论",
          "en": "Justice League: The Flashpoint Paradox"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上小学时候，开始看火影，就是电视台点播视频（点一次 5 块钱还是 3 块钱，，反正是被老爹发现后打爆了），小学同学哥哥有火影漫画书，漫画更新比较快，当时还和同桌（他哥有漫画书）前后桌讨论卡卡西的写轮眼是哪里来的，当时有人说是卡卡西的媳妇的（后来发现是朋友的）。上初中高中基本上不看了，大学时候，去隔壁宿舍串门发现在看火影，我又开始续上了，，追了几百集，，但是到现在火影结局还是没看完。大四找到工作以后，没啥事了，把越狱看完，开始追海贼王，昏天黑地追了几天。。。 黑色四叶草，仙逆，凡人修仙（很用心的动漫），，，，全职高手，，转生史莱姆后来发现这些动漫主角要不是隐藏实力二代，要不就是运气爆炸 。当动漫剧情快走向结局的时候，心里总会有一些失落感。感叹时间好快，剧中的角色都成长了，而我却没有真正的长大。。。。",
          "en": "When I was in elementary school, I started watching Naruto through on-demand videos on TV (5 or 3 yuan per view, anyway, my dad found out and beat me up). The older brother of my elementary school classmate had Naruto manga books, which updated faster. Back then, my deskmate (whose brother had the manga) and I discussed where Kakashi's Sharingan came from. Someone said it was from Kakashi's wife (later found out it was a friend's). I basically didn't watch it in junior high or high school. In college, I went to visit the dorm next door and found them watching Naruto, so I started again and watched a few hundred episodes, but I still haven't finished the ending. After finding a job in my senior year, I had nothing to do, so I finished watching Prison Break and started chasing One Piece, watching it day and night for a few days... Black Clover, Renegade Immortal, A Record of a Mortal's Journey to Immortality (very dedicated anime), The King's Avatar, That Time I Got Reincarnated as a Slime. Later I found that the protagonists of these anime are either hidden powerful second generations or have explosive luck. When the anime plot is about to reach the end, I always feel a sense of loss. I sigh how fast time flies, the characters in the play have grown up, but I have not really grown up...."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看了这么多评论，怎么没人说《一人之下》啊。",
          "en": "After reading so many comments, how come no one mentioned 'Under One Person'?"
        },
        {
          "zh": "剧情设定都很吊的。",
          "en": "The plot setting is awesome."
        },
        {
          "zh": "我目前在追的就每周五一话的《一人之下》和周六的《凡人修仙》。",
          "en": "I'm currently following 'Under One Person' which updates every Friday, and 'A Record of a Mortal's Journey to Immortality' on Saturdays."
        },
        {
          "zh": "前阵子一口气看了：全职猎人、石纪元",
          "en": "I recently binged: Hunter x Hunter, Dr. Stone"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "佩恩死之前的火影忍者，七龙珠",
          "en": "Naruto before Pain died, Dragon Ball"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喜欢的动画:辉夜大小姐想让我告白笨蛋, 测试, 召唤兽Kill la Kill (斩服少女)旋风管家魔法禁书目录某科学的超电磁炮足球小子K-ON (轻音少女)魔法少女小圆银魂齐木楠雄的灾难RelifeNEW GAME!白箱迷糊餐厅加速世界物语系列动漫电影:千与千寻, 风之谷, 猫的报恩哪吒 1, 哪吒 2,你的名字",
          "en": "Favorite anime: Kaguya-sama: Love Is War, Baka and Test: Summon the Beasts, Kill la Kill, Hayate the Combat Butler, A Certain Magical Index, A Certain Scientific Railgun, Captain Tsubasa, K-ON!, Puella Magi Madoka Magica, Gintama, The Disastrous Life of Saiki K., ReLIFE, NEW GAME!, Shirobako, Wagnaria!!, Accel World, Monogatari series. Anime movies: Spirited Away, Nausicaä of the Valley of the Wind, The Cat Returns, Nezha 1, Nezha 2, Your Name."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "穿越时空的少女，20 年前看得时候泪流满面，20 年后的今天再电影院又看一遍，20 年的人生仿佛只花了 1 小时 38 分钟就过去了。",
          "en": "The Girl Who Leapt Through Time, I was in tears when I watched it 20 years ago. Today, 20 years later, I watched it again in the cinema, and 20 years of life seemed to have passed in just 1 hour and 38 minutes."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "幽灵公主，银魂",
          "en": "Princess Mononoke, Gintama"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最喜欢的就算过了 20 年也还是 eva 了",
          "en": "My favorite is still Evangelion even after 20 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "鲁鲁修 看了快 5 遍了吧，可能有着入坑第一部番的滤镜在，也可能喜欢 CLAMP 大妈们勾勒的角色原案，也可能喜欢大河内的编剧，甚至从这部里能看到很多后续作品从这里借鉴的桥段，从而产生对初代原型的膜拜和赞叹也是反复观看的原因之一，亦或者是对悲剧里大量因果论的喜爱",
          "en": "I've watched Lelouch of the Rebellion almost 5 times, maybe it has the filter of being the first anime I got into, maybe I like the character drafts outlined by the CLAMP grandmas, maybe I like Okouchi's screenwriting, and I can even see many subsequent works borrowing from it, thus generating a sense of admiration and praise for the original prototype is one of the reasons for repeated viewing, or it is the love of a lot of causality in the tragedy"
        }
      ],
      "type": "replies"
    }
  ]
}