{
  "id": 1108755,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "如何委婉告诉父母其实我找不到对象",
          "en": "How to tactfully tell my parents that I actually can't find a partner?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "每次催为了不丢面子，我都高冷地回复：忙着奋斗",
          "en": "Every time they urge me, to save face, I reply with a cool and aloof tone: Busy striving."
        },
        {
          "zh": "这似乎给了他们错觉：觉得我认真了就能找到",
          "en": "This seems to give them the illusion that as long as I'm serious, I can find someone."
        },
        {
          "zh": "事实上我已经非常努力地在各种交友 app 上狂舔了。。",
          "en": "In fact, I've been working very hard, simping like crazy on all kinds of dating apps..."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "别舔了，大部分臭婆娘都是为了让你爆金币的，少部分的好货你遇不到的。",
          "en": "Stop simping, most of those bitches just want you to spend money on them. You won't encounter the few good ones."
        },
        {
          "zh": "不如攒钱去 pc 和摸摸看，平时对父母好点就行，反正也不经常回家。",
          "en": "You might as well save money for prostitution and sexual massage, just be nice to your parents when you see them, since you don't go home often anyway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在家还要撑面子会不会有点太累了？",
          "en": "Isn't it a bit tiring to keep up appearances at home?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1 、优化外在：脸身高这些先天因素无法改变的也就无所谓，但是牙可以调整，眼镜可以摘掉，发型可以挑选，服装可以搭配，身材可以锻炼等等；",
          "en": "1. Optimize your appearance: Don't worry about unchangeable innate factors like face and height, but teeth can be adjusted, glasses can be removed, hairstyles can be chosen, clothing can be matched, body can be exercised, etc."
        },
        {
          "zh": "2 、内心修为：多读爱情、心理方面的书籍，提高自己对人性和社会的认知，增强情绪控制能力，做一个情绪稳定、能拿捏住自己内心小世界的强者；",
          "en": "2. Inner Cultivation: Read more books on love and psychology to improve your understanding of human nature and society, enhance your emotional control abilities, and become a stable person who can control your own little inner world."
        },
        {
          "zh": "3 、扩圈：给自己找点喜欢的事情做，比如健身、滑雪、冲浪、滑板、潜水、狼人杀等等，找到自己喜欢的兴趣爱好，圈子越多，接触认识异性的概率越大；",
          "en": "3. Expand your social circle: Find something you like to do, such as fitness, skiing, surfing, skateboarding, diving, werewolf killing, etc. Find your favorite hobbies. The more circles you have, the greater the probability of meeting and getting to know the opposite sex."
        },
        {
          "zh": "每一条做起来都需要日复一日的坚持，但是只要你坚持下去，你会发现自己变得越来越有魅力，吸引力也会越来越大，只是提醒一下等你发现身边不缺异性了，不要沉迷于激情四射，长久健康的亲密关系才是人生幸福的稳定源泉，祝你成功！",
          "en": "Each of these requires day-after-day persistence, but as long as you persist, you will find that you become more and more attractive, and your attraction will become greater and greater. Just a reminder: when you find that you are not short of the opposite sex, don't be addicted to passion. Long-term and healthy intimate relationships are the stable source of happiness in life. I wish you success!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真是造孽啊，其实不用管父母的，你又不跟你父母过一辈子。",
          "en": "It's really a sin. Actually, you don't need to care about your parents, you're not going to live with them for the rest of your life."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "再催就和他们说最近被一个二婚带娃的甩了，没心情再谈，一来可以避免被他们误会你性取向，二来可以让他们了解到你确实在努力找",
          "en": "If they urge you again, tell them that you were recently dumped by a divorced person with a child and you are not in the mood to date. Firstly, this can prevent them from misunderstanding your sexual orientation, and secondly, it can let them know that you are indeed trying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我以前也一样，后面健身大半年瘦了三四十斤，也开始学会穿搭了，聊了三四个都成了，信念很重要，你越自信女方就越容易被你拿捏",
          "en": "I used to be the same. After working out for more than half a year, I lost 30-40 pounds and started learning how to dress. I successfully dated three or four girls. Belief is very important. The more confident you are, the easier it is for the girls to be manipulated by you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找不到是好事，一个人舒服。",
          "en": "It's a good thing you can't find one, it's comfortable to be alone."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jaya2024 根本没聊到线下的，看完照片就 G",
          "en": "@jaya2024 Didn't even get to meet offline, it's 'G' (Game Over) after they saw the photo."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "问题就出在「舔」字上啊，你得学会若即若离，保持距离才行，舔是舔不来的。",
          "en": "The problem lies in the word 'simping'. You have to learn to be aloof and keep your distance, you can't get anywhere by simping."
        },
        {
          "zh": "不展露自己交友的目的，想办法扩大自己认识新人的数量，自然会吸引到合适的人。",
          "en": "Don't reveal your purpose of making friends, try to expand the number of new people you meet, and you will naturally attract the right person."
        },
        {
          "zh": "三国杀里郭嘉为什么无解，就是因为过牌量大。",
          "en": "Why is Guo Jia in the Three Kingdoms Kill unbeatable? Because he has a large card draw."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没事，自从相亲对象主动拉黑我导致我爸妈破防后，他们再也不指望我找到对象了。",
          "en": "It's okay, since my matchmaker date blocked me, causing my parents to have a mental breakdown, they no longer expect me to find a partner."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@shylockhg #7 是找不到好的, 不太好的有的是你当他们不存在",
          "en": "@shylockhg #7 It's that you can't find a good one, there are plenty of not-so-good ones, you just pretend they don't exist."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "交友 app 上面还是抠脚大叔或者 bot 多吧。。还是要线下相亲，频率不能怕多。。。",
          "en": "Dating apps are still full of smelly foot uncles or bots... you still need to do offline matchmaking, and don't be afraid of the frequency..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "多大了？是觉得年龄大了还是想找一个了",
          "en": "How old are you? Do you feel like you're getting old, or do you just want to find someone?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所以是楼主父母手里是有大把合适的女生，但是怕耽误楼主奋斗所以没介绍给楼主吗？",
          "en": "So, do the original poster's parents have a lot of suitable girls, but they are afraid of delaying the original poster's hard work, so they didn't introduce them to the original poster?"
        },
        {
          "zh": "如果不是的话，没必要说啊，说了顶多让父母从着急变成了担心+着急，还是自己努力去舔吧，一直舔不到可以适当放低点要求。",
          "en": "If not, there's no need to say it. At most, it will make your parents go from anxious to worried + anxious. You should still try simping, and if you can't get anywhere, then appropriately lower your standards."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hefish 我比较宅基本很少出门",
          "en": "@hefish I'm quite a homebody and rarely go out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MAVETRICK pc 不用，我都用手，主要是找个老了能陪一下的，年轻时候都无所谓",
          "en": "@MAVETRICK No need for prostitution, I just use my hand. The main thing is to find someone to accompany me when I'm old; I don't care about when I'm young."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liuzimin 自尊比较强",
          "en": "@liuzimin My self-esteem is quite strong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderlxm 那倒不是我也挺担心老了一个人太孤独",
          "en": "@coderlxm That's not it, I'm also quite worried about being lonely when I'm old."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan 没有我父母没啥资源",
          "en": "@coderluan No, my parents don't have any resources."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有见过一面的狂聊，事后会觉得浪费时间...",
          "en": "Chatting a lot with someone you've never met makes you feel like a waste of time afterwards..."
        }
      ],
      "type": "replies"
    }
  ]
}