{
  "id": 1111487,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "记一次与相亲对象爸爸的聊天",
          "en": "A chat with the father of a blind date."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "中午接到老家远房亲戚的电话，说给我介绍一个女孩，女孩跟我都在本省 xx 市上班，让我先去联系女孩爸爸（他手里没有女孩的联系方式）。",
          "en": "At noon, I received a call from a distant relative in my hometown who said they wanted to introduce me to a girl. The girl and I both work in XX city in the same province, and they asked me to contact the girl's father first (since they didn't have the girl's contact information)."
        },
        {
          "zh": "我说还是你联系她爸爸，把联系方式发给你，你再告诉我，我去联系这个女孩。",
          "en": "I said, you should contact her father, send me the contact information, and then tell me, and I will contact the girl."
        },
        {
          "zh": "\r\n\r\n过了一会儿，女孩爸爸打电话给我，感觉整个聊天我被降维打击，只能嗯嗯。",
          "en": "\n\nA while later, the girl's father called me. I felt like I was being subjected to a lower-dimensional attack throughout the entire chat, and I could only respond with 'uh-huh'."
        },
        {
          "zh": "\r\n\r\n聊天开始，女孩爸爸就把他家的基本情况告诉我，他是公务员，老婆是医生，家里在县城有 3 套房，自己是 85 年的大学生，然后问我父母是做什么的，我说我爸是木工，我妈在超市打工，接着说自己也是从农村里走出去的，不会因为是农村有什么偏见......",
          "en": "\n\nThe chat started with the girl's father telling me about his family's basic situation. He is a civil servant, his wife is a doctor, and they have 3 houses in the county. He himself graduated from college in '85. Then he asked what my parents did. I said my dad is a carpenter, and my mom works in a supermarket. Then he said that he also came from the countryside and wouldn't have any prejudice because it's the countryside…"
        },
        {
          "zh": "\r\n\r\n接着问我房子买在哪里，身高体重之类的，然后跟我聊了一下健康之类问题（他大学是学中医的）。",
          "en": "\n\nThen he asked me where I had bought my house, my height and weight, and then chatted with me about health issues (he studied traditional Chinese medicine in college)."
        },
        {
          "zh": "\r\n\r\n聊到他女儿时，说不想找外地的，自己女儿也是见过世面的（从小跟着他出国旅游）。",
          "en": "\n\nWhen he talked about his daughter, he said he didn't want her to find someone from out of town, and that his daughter had seen the world (traveling abroad with him since she was a child)."
        },
        {
          "zh": "如果两个人要是合缘的话，钱不是问题，女儿在 xx 市有房有车是全款，自己每个月有个一两万的工资&退休金，生活比上不足，比下有余。",
          "en": "If the two of them are compatible, money is not a problem. His daughter has a house and a car in XX city, both paid in full. He himself has a salary and pension of 10,000 to 20,000 each month. Life is not the best, but it is more than sufficient."
        },
        {
          "zh": "\r\n\r\n聊完之后加了女孩爸爸的微信，并把女孩的微信推给我，顺便发了几张女孩的照片，也问我要了照片。",
          "en": "\n\nAfter the chat, I added the girl's father on WeChat, and he sent me the girl's WeChat contact. He also sent me a few photos of the girl and asked for my photos as well."
        },
        {
          "zh": "\r\n\r\n感觉整个聊天过程中，基本上一直他在说，我在听着，也插不上什么话。",
          "en": "\n\nI felt that throughout the entire chat, he was basically the one who was talking, and I was listening, unable to interject."
        },
        {
          "zh": "可能就是门不当户不对吧，让我有种自卑感，虽然女孩爸爸说话很客气，但是无形中就觉得我们之间是两个阶级，尤其说到钱不是问题的时候，心里咯噔了一下，我们家庭是有多差，让你觉得我们很没有钱。",
          "en": "Maybe it's just that we're not a good match, which made me feel inferior. Although the girl's father was very polite, I felt that we were two different classes, especially when he said money was not a problem, my heart sank. How bad is my family that you think we are very poor?"
        },
        {
          "zh": "\r\n\r\n只是发点牢骚，祝大家周五和情人节快乐！",
          "en": "\n\nJust venting a little. Wish everyone a happy Friday and Valentine's Day!"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "反正孩子跟谁姓我已经知道了",
          "en": "Anyway, I already know whose surname the child will have."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "钱不是问题=不要彩礼(就算要嫁妆也会更多)女儿有房有车全款= 结婚想躺平躺平想干啥干啥，没有压力他有 1-2 万的工资&退休金 =  老了不用你们小辈子管，不会给你们小的造成经济压力，甚至可以给你们补贴些跟老丈人聊天，在不熟的情况下本来就嗯嗯嗯听着就对了啊。",
          "en": "Money is not a problem = no dowry (even if there is a dowry, it would be even more). The daughter has a house and a car paid in full = you can lie flat and do whatever you want after marriage without any pressure. He has a salary and pension of 10,000 to 20,000 = you don't need to take care of him when he’s old, and he won’t put financial pressure on you, and may even subsidize you. Talking to the father-in-law, you are supposed to just listen when you are not familiar with each other."
        },
        {
          "zh": "毕竟辈分在这呢，你还想插嘴？",
          "en": "After all, there is a generational difference, do you still want to interrupt?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "基本上，她爸能做她的主",
          "en": "Basically, her dad can make decisions for her."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "洞房花烛夜，新郎掀开盖头，只见那盖头下涂了红唇，手握斐济杯的老丈人眉飞色舞的说道：别怕，我先替我女儿打探打探，她没见过这世面",
          "en": "On the wedding night, the groom lifts the veil and sees the father-in-law under the veil, with red lips and holding a Fiji water bottle, saying with a flourish: Don't be afraid, I'll scout for my daughter first, since she hasn't seen the world."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "世界是一个草台班子，不用把别人想的太高 相亲尽量表现自己比较好的一面，同时不回避自己一般的方面。",
          "en": "The world is a shoddy troupe, don't think too highly of others. When going on a blind date, try to show your better side, and don't avoid your average aspects."
        },
        {
          "zh": "其他的就看缘分祝好",
          "en": "The rest depends on fate. Good luck."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "相亲而言，跟认识个朋友没区别，试着接触，合适就继续，不合适也没什么，对方未必就没缺陷，只是你暂时没发现而已，指不定后面就是你挑剔人家了。",
          "en": "As for blind dates, it's no different from meeting a friend. Try to get in touch. If it's suitable, continue; if it's not suitable, it's nothing. The other person may not be without flaws, you just haven't found them yet. Maybe later you will be the one picking on them."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有没有想过为什么他女儿还在单着",
          "en": "Have you ever wondered why his daughter is still single?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@br9852000 也不一定是女儿需要相亲，可能是爹觉得女儿需要相亲。。--------------TO up：我倒是觉得这爹能处（如果没乱吹牛批的话），站在中老年男性角度角度，结婚就得考虑养家，养家就得考虑钱的问题，而且还得考虑老人赡养问题。",
          "en": "@br9852000 It's not necessarily that the daughter needs a blind date, it may be that the father thinks the daughter needs a blind date. --------------TO up: I think this dad is okay (if he's not bragging). From the perspective of middle-aged and elderly men, marriage must consider supporting the family, and supporting the family must consider financial issues, as well as the issue of supporting the elderly."
        },
        {
          "zh": "理想情况下双方门当户对最好；不门当户对，能做到夫妻双方、大家小家，劲往都一块使也很不错的。",
          "en": "Ideally, it is best for both parties to be a good match. If they are not a good match, it is also very good if the couple, the large family, and the small family can all work together."
        },
        {
          "zh": "但是话说回来， 婚姻首先是两人的事情，这两个人做不到贴心体己，其他都白搭，他爹这波操作明显是加速进度的意图，合适不合适都早点得到结果，但对结果没太大影响",
          "en": "But then again, marriage is first and foremost a matter for two people. If these two people can't be considerate and intimate, everything else is useless. His father's operation is obviously intended to speed up the process, to get results sooner rather than later, regardless of whether it is suitable or not, but it doesn't have much impact on the result."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这么说吧，他爸要是看不上你，不会给你发他女儿的微信和照片，也不会找你要照片。",
          "en": "Let me put it this way, if her dad didn't like you, he wouldn't send you his daughter's WeChat and photos, and he wouldn't ask you for photos."
        },
        {
          "zh": "大家都是成年人了，相亲，如果看不上你不会浪费时间的",
          "en": "Everyone is an adult. For blind dates, if they don't like you, they won't waste time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没必要自卑吧，对方要是看上你，你不就和那些女生攀高枝一样，上升一个阶层吗？",
          "en": "There's no need to feel inferior. If the other party likes you, wouldn't you be climbing the social ladder like those girls, rising a class?"
        },
        {
          "zh": "没看上你，你也无所谓啊，反正也不是自己问题，只是对方太优秀。",
          "en": "If they don't like you, it doesn't matter to you. It's not your problem, it's just that the other person is too good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 感觉你是心眼子小呢，话多也是坏事？",
          "en": "OP, it feels like you are narrow-minded. Is talking too much a bad thing?"
        },
        {
          "zh": "顶多是他可能跟自己的女儿沟通较少，顾虑担忧较多，而且他是作为一个女儿的父亲角色在跟你对话，这不是很正常的吗，如果他家是儿子，能有这么多话吗？",
          "en": "At most, it's that he may not communicate much with his daughter, and he has more concerns and worries. Moreover, he is talking to you as a father of a daughter. Isn't that normal? If he had a son, would he have so much to say?"
        },
        {
          "zh": "父亲关心女儿这不是很正常的事情吗。",
          "en": "Isn't it normal for a father to care about his daughter?"
        },
        {
          "zh": "其次在跟你说什么钱不是问题的时候，基本上是打消你的顾虑，而不是他在炫耀什么东西，如果真的是炫耀的话，在了解你的家庭情况后，还会说没关系，他们也是农村出来的这种话吗，很可能直接就挂了吧。",
          "en": "Secondly, when he says that money is not a problem, he is basically dispelling your concerns, not showing off something. If he were really showing off, after understanding your family situation, would he still say that it doesn't matter and that they also came from the countryside? He probably would have hung up directly."
        },
        {
          "zh": "你个人想法太多了我认为，就只是加个微信，你就当做这次通话是听他作为一个女儿父亲的聊天而已吧",
          "en": "I think you have too many personal thoughts. It's just adding WeChat, you can just think of this call as listening to him chat as the father of a daughter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大概率不靠谱. 她老爸说的太多了,明显是在挑三拣四,一般人够不到",
          "en": "Most likely it's unreliable. Her dad said too much, and it's obvious that he's nitpicking, and most people can't reach that standard."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉你可能过于自卑了，也可能你比较紧张，对方就聊了聊基本情况，最后也把微信照片给你了，你说他还挺客气，我觉得你也可以大大方方的就行了，对方是亲戚介绍的，对你的家庭条件可能已经有一个大概了解了，还见了你说明没啥毛病最主要还是看你和女孩怎么相处吧",
          "en": "I feel that you may be too inferior, or you may be more nervous. The other party just talked about the basic situation, and in the end, he also gave you WeChat photos. You said he was quite polite, and I think you can just be natural. The other party was introduced by relatives, and they may already have a general understanding of your family conditions. He met you, which means there is nothing wrong. The most important thing is how you get along with the girl."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还是算了吧，我怕你后续成了抬不起头",
          "en": "Forget it, I'm afraid you won't be able to hold your head up later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这不就是真正的 boss 直聘吗？",
          "en": "Isn't this the real BOSS direct hire?"
        },
        {
          "zh": "本来把女朋友伺候开心了父母也管不了那么多，这下好了，得伺候两位爷。",
          "en": "Originally, if you made your girlfriend happy, her parents wouldn't care so much, but now, you have to please two masters."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪有相亲前对方爸爸先联系的。。。",
          "en": "Where does the other party's father contact you first before a blind date...?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "run 吧，这还往下聊啥",
          "en": "Run away, what's there to talk about?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这有啥自卑的？你追到岂不是血赚？没必要惧她爹，说句难听话，秦皇汉武都做了土，有啥可怕的？",
          "en": "What's there to be inferior about? Wouldn't it be a huge win if you succeeded in pursuing her? There's no need to fear his dad. To put it bluntly, Qin Shi Huang and Emperor Wu of Han are all in the ground, what's there to be afraid of?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xuqiccr 可能家里管得严，她爸还是当家作主，她依然听她爸的话。",
          "en": "@xuqiccr Maybe the family is strict, her dad is still in charge, and she still listens to her dad."
        },
        {
          "zh": "也不错，起码不打拳。",
          "en": "Not bad, at least she won't be a feminist."
        },
        {
          "zh": "我觉得她爸和你说这些，就是把一些经济条件和未来情况说开而已，节省你们的时间。",
          "en": "I think her dad told you this just to explain some of the economic conditions and future situations, to save you time."
        },
        {
          "zh": "没必要想多。",
          "en": "There's no need to overthink it."
        },
        {
          "zh": "往好了想，老丈人可能是个明事理的人。",
          "en": "Thinking positively, the father-in-law may be a reasonable person."
        },
        {
          "zh": "往坏了想，结婚后说不定会或多或少的管你们。",
          "en": "Thinking negatively, he might interfere with you more or less after marriage."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "上就行了，是不是正缘，试了才知道",
          "en": "Just go for it, you'll only know if it's the right match if you try."
        }
      ],
      "type": "replies"
    }
  ]
}