{
  "id": 1113548,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "如果有房有车经济压力不大后，有哪些幸福感比较强的工作呢",
          "en": "If you have a house, a car, and little economic pressure, what kind of jobs have a stronger sense of happiness?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "v 友们有什么推荐呢",
          "en": "What recommendations do you v-friends have?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "人这种社会性动物，幸福感来自于人际关系和谐，和工作本身无关也就是哪怕你没房没车压力大，只要人际关系和谐也会感觉幸福满满。也就是如果你有房有车压力不大，只要和身边人关系不和谐，那也没什么幸福可言",
          "en": "As social animals, humans' sense of happiness comes from harmonious interpersonal relationships, which has nothing to do with the job itself. That is, even if you don't have a house or a car and you have a lot of pressure, you will feel full of happiness as long as your interpersonal relationships are harmonious. In other words, if you have a house and a car and are not under great pressure, there is no happiness to speak of if your relationships with the people around you are not harmonious."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我上一次也是这么想，于是跳槽时只筛选早九晚六，有免费停车场食堂健身房，开车半小时以内的，去了一家银行的软件公司，去年惨遭全员降薪。",
          "en": "I thought the same way last time, so when I changed jobs, I only looked for 9-to-5 jobs with free parking, a cafeteria, a gym, and a commute of less than half an hour. I went to a software company in a bank, and last year everyone suffered a salary cut."
        },
        {
          "zh": "现在工资连车都养不起了，于是出现了很滑稽的状况，福利还是可以的，就是攒不下钱，跟共产主义实现了一样。",
          "en": "Now I can't even afford to maintain my car with my salary, so a very comical situation has arisen. The benefits are still good, but I can't save money, it's like communism has been achieved."
        },
        {
          "zh": "投研部门会发一些研报和经济分析，自己学着做一些投资，这个工作对我最大的帮助就是让我知道了我的钱也可以替我去赚钱，自己就没那么焦虑了。",
          "en": "The investment research department will issue some research reports and economic analysis, and I learn to do some investment myself. The biggest help this job has given me is letting me know that my money can also make money for me, so I am not so anxious."
        },
        {
          "zh": "国企应该有很多这种，过去两次牛市赚的钱足以解决生活问题，上班就是领个社保。",
          "en": "There should be many state-owned enterprises like this. The money earned in the past two bull markets is enough to solve living problems. Going to work is just to receive social security."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "志愿者，不为了钱工作反而幸福感很高",
          "en": "Volunteer work, not working for money, but a high sense of happiness"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以上都是幻想吧，，等你们去了，就跟 @zqx 这位老哥一样，老哥工作还是可以接触一些信息的，大部分大家认为幸福感强的工作，都有另一面，大家都不太愿意说罢了。",
          "en": "These are all fantasies. When you go, you will be like @zqx. This guy's job can still access some information. Most jobs that people think have a strong sense of happiness have another side that everyone is not willing to talk about."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "感觉跑滴滴挺好，但我没试过。",
          "en": "I feel that driving for Didi is good, but I haven't tried it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "自己觉得好就好吧。",
          "en": "If you feel good, then it's good."
        },
        {
          "zh": "自己开发软件吧，或者自己搞点创作什么的。",
          "en": "Develop your own software, or do some creative work yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "保安 电竞 直播 炒股 慈善",
          "en": "Security guard, e-sports, live streaming, stock trading, charity"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当然是去央企的党群办和工青妇部门了。。。",
          "en": "Of course, go to the Party and Mass Work Department and the Trade Union, Youth League and Women's Federation departments of central enterprises..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "咖啡师 自己开店那种",
          "en": "Barista, the kind that opens their own store"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当网管吧，基本没压力",
          "en": "Be a computer technician, basically no pressure"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "除了带编的，就连国资委下属的那些合同工，也不是铁饭碗，一样会被安排。",
          "en": "Except for those with established positions, even contract workers under the State-owned Assets Supervision and Administration Commission are not guaranteed a secure job and will be assigned tasks anyway."
        },
        {
          "zh": "安逸只会让人技术退步",
          "en": "Comfort will only make people's skills regress."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fsdrw08 别来卷网管啦。。。我找这份网管工作都花了两三个月才找到，大部分面完无后续。",
          "en": "@fsdrw08 Don't come and compete for the computer technician job... It took me two or three months to find this computer technician job, and most of the interviews had no follow-up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "收租带娃",
          "en": "Collecting rent and taking care of children"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@liuzimin 网吧的网管呢",
          "en": "@liuzimin What about the computer technician in an internet cafe?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "门房秦大爷？",
          "en": "Uncle Qin, the doorman?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "偏离一下话题，有没有想过不工作呢",
          "en": "To deviate from the topic a bit, have you ever thought about not working?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zqx 敢问兄弟是已经赚到钱了，还是已经明白赚钱的道理了？",
          "en": "@zqx May I ask, brother, have you already made money, or do you already understand the principle of making money?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@chenliangngng 说的有道理，感觉高压环境人际关系大概率不和谐",
          "en": "@chenliangngng makes sense. I feel that interpersonal relationships are unlikely to be harmonious in a high-pressure environment."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "学术",
          "en": "Academics"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "15 楼说的很有道理我现在算算已有的净值，按照目前花钱的速度（近五年都很稳定），按照 4% rule ，已经可以退休了。",
          "en": "What the 15th floor said makes a lot of sense. I'm now calculating my existing net worth. Based on my current spending rate (which has been very stable for the past five years), according to the 4% rule, I can already retire."
        },
        {
          "zh": "但是上班还是闷闷不乐，不上班的请假玩一两个月也尝试了，玩久了还是无聊。",
          "en": "But I'm still unhappy at work. I've also tried taking a leave of absence for a month or two when I'm not working, but it's boring after playing for a long time."
        },
        {
          "zh": "网约车外卖员也尝试过，也是新鲜劲过了就无聊。",
          "en": "I've also tried being a ride-hailing driver and a food delivery person, but it's boring after the novelty wears off."
        },
        {
          "zh": "感觉幸福感是个修炼内心的过程，并不是工作导致的。",
          "en": "I feel that happiness is a process of cultivating the inner self, not caused by work."
        }
      ],
      "type": "replies"
    }
  ]
}