{
  "id": 1110834,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "终于下定决心要结束北漂生活了",
          "en": "Finally decided to end my Beijing漂(drifting) life."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "因为一些原因下定决心要结束超过 5 年的北漂生活，回到老家。",
          "en": "Due to some reasons, I've decided to end my over 5 years of Beijing漂(drifting) life and return to my hometown."
        },
        {
          "zh": "有没有 V2er 说下自己的经历，帮 OP 避避坑。",
          "en": "Are there any V2ers who can share their experiences to help OP avoid pitfalls?"
        },
        {
          "zh": "有哪些事是可以提前准备的。",
          "en": "What things can be prepared in advance?"
        },
        {
          "zh": "五险一金提取 OR 转移 如何最大化利用？",
          "en": "How to maximize the use of the extraction OR transfer of the five insurances and one fund (social insurance and housing fund)?"
        },
        {
          "zh": "希望也能帮助到有同样想法的人",
          "en": "Hope it can also help people with the same idea."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@lengrongec 结论：县城婆罗门家更不傻，随随便便让人攀？",
          "en": "@lengrongec Conclusion: The families of Brahmins in county towns are not stupid, why would they let anyone climb up the social ladder casually?"
        },
        {
          "zh": "任何不以找对人（不是找对家庭）为伴侣为目的的婚姻，翻车的概率都极高。",
          "en": "Any marriage that does not aim at finding the right person (not the right family) as a partner has a very high probability of failure."
        },
        {
          "zh": "真实案例 1：我表妹找了个：县城婆罗门，生了个孩子，孩子归男方，几乎没探视。",
          "en": "Real case 1: My cousin found a Brahmin in a county town, had a child, the child belonged to the man, and she almost never visited."
        },
        {
          "zh": "俩人离了，给人家当了一回生育机器。",
          "en": "The two divorced, and she became a childbearing machine for them."
        },
        {
          "zh": "男方家里是县环卫局世袭，环卫局里从上到下都有他家亲戚。",
          "en": "The man's family inherited the county sanitation bureau, and there are relatives of his family in the sanitation bureau from top to bottom."
        },
        {
          "zh": "男方是个烂赌狗+家暴，婚前没看出来，只是偶尔玩玩牌，没想到那哥们玩那么大。",
          "en": "The man is a gambling addict + domestic abuser. I didn't see it before marriage. He just played cards occasionally. I didn't expect that guy to play so big."
        },
        {
          "zh": "总结：人家也不是傻 X ，也知道你图什么，也知道他这小子能图到什么。",
          "en": "Summary: They are not stupid, they know what you want, and they know what this kid can get."
        },
        {
          "zh": "表妹之前是班花级，因为离过一次还有个孩子，后来找了个开修车店的。",
          "en": "My cousin used to be a belle in her class, because she divorced once and had a child, she later found someone who runs a car repair shop."
        },
        {
          "zh": "真实案例 2：我小 jiu 子的前妻是县城当地♥️美凯龙老板的独女，婚后男方被岳父各种指派，在对方家没尊严，岳父性格太爆，动不动酒桌上开骂，不给女婿任何面子。",
          "en": "Real case 2: The ex-wife of my little jiu zi is the only daughter of the local ♥️Red Star Macalline owner in the county town. After marriage, the man was assigned by his father-in-law in various ways and had no dignity in the other's home. The father-in-law was too explosive and scolded him at the dinner table from time to time, not giving the son-in-law any face."
        },
        {
          "zh": "也知道你图他家啥，财产啥的都在岳父名下，防的一手。",
          "en": "They also know what you want from their family. The property is all in the father-in-law's name, so they are well-prepared."
        },
        {
          "zh": "门不当户不对，婚后矛盾多，离婚跟分手一样简单，孩子归女方。",
          "en": "Unequal social status, many conflicts after marriage, divorce is as simple as breaking up, and the child belongs to the woman."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我之前也从北京跑路了。",
          "en": "I also ran away from Beijing before."
        },
        {
          "zh": "关于思考过程： https://www.v2ex.com/t/916075关于跨城搬家： https://www.v2ex.com/t/934738关于五险一金：- 医保个人账户可以转移。",
          "en": "About the thinking process: https://www.v2ex.com/t/916075 About cross-city moving: https://www.v2ex.com/t/934738 About five insurances and one fund: - The personal medical insurance account can be transferred."
        },
        {
          "zh": "比如从北京换到 B 地工作，可以在 B 地申请将北京的医保个人账户余额合并到 B 地的余额。",
          "en": "For example, if you change from working in Beijing to place B, you can apply in place B to merge the balance of your personal medical insurance account in Beijing with the balance in place B."
        },
        {
          "zh": "- 北京公积金账户封存 6 个月后，可以申请全额提取，但前提是**申请时**在全国其它地方没有正在缴存的公积金账户，否则只能考虑转移了。",
          "en": "- After the Beijing housing fund account is sealed for 6 months, you can apply for full withdrawal, but the prerequisite is that you do not have a housing fund account that is currently being paid in other parts of the country **when applying**, otherwise you can only consider transferring it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1. 借钱是不可能借的，手里有也说借给亲戚 ABCD 了。",
          "en": "1. It is impossible to borrow money. Even if you have it, you will say that you have lent it to relatives ABCD."
        },
        {
          "zh": "2. I 人 E 人看个乐子就好，是用来评价外人的当前状态，而不是套死自己的永久状态，人是会变的。",
          "en": "2. I-people and E-people are just for fun, they are used to evaluate the current state of outsiders, not to trap your permanent state, people will change."
        },
        {
          "zh": "别自己给自己画地为牢, 你的行为不需要啥 tag ， 有机会就抓住，别为了做 I 人而怯懦。",
          "en": "Don't draw a prison for yourself. Your behavior doesn't need any tag. Seize the opportunity. Don't be timid in order to be an I-person."
        },
        {
          "zh": "3. 前半年心态会急速转变，最直观的是走路的速度都会显得你格格不入，你要做的无非是忘记过去，踏实干活，过去了都过去了。",
          "en": "3. In the first six months, your mentality will change rapidly. The most intuitive thing is that the speed of walking will make you out of place. All you have to do is forget the past, work hard, and the past is over."
        },
        {
          "zh": "4. 别想着创业/入伙开个小店小馆子，套用外面见过的模式，时代变了，客单价现在低的要死更别提客流量锐减的县城，最多赚个温饱，不值得",
          "en": "4. Don't think about starting a business/joining a small shop, applying the models you have seen outside, the times have changed, the customer unit price is now very low, not to mention the county towns where the passenger flow has dropped sharply, you can earn enough to eat and clothe themselves at most, it's not worth it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不可否认，城市逆发展是未来很多人的选择。",
          "en": "It is undeniable that reverse urban development is the choice of many people in the future."
        },
        {
          "zh": "经济不好，各行业内卷严重，进入的门槛越来越高，没有资源，没有背景的人只能选择逃离城市。",
          "en": "The economy is not good, involution in various industries is serious, the threshold for entry is getting higher and higher, and people without resources and backgrounds can only choose to escape the city."
        },
        {
          "zh": "我也计划如果被裁了就回农村，但是不会再出去找工作，因为农村花销比较低，攒的钱 慢慢花 能花个几年，最重要的花销就是父母养老看病，所以医疗保险要买，别的无非就是吃饭穿衣，菜自己种，穿衣一件衣服穿个 10 年根本不用换。",
          "en": "I also plan to return to the countryside if I am laid off, but I will not go out to find a job again, because the cost of living in rural areas is relatively low, and the money I save can be spent slowly for a few years. The most important expense is the parents' pension and medical treatment, so medical insurance must be bought. Other than that, it is nothing more than eating and dressing, growing your own vegetables, and wearing a piece of clothing for 10 years without having to change it at all."
        },
        {
          "zh": "其他的开源节流，作为从事 it 的 转行做个独立开发者，或者接一些 外快，兼职，远程工作，每年有个 几千的收入就可以。",
          "en": "Other open source and throttling, as an IT practitioner, switch to being an independent developer, or take some part-time jobs, and remote work, with an income of several thousand a year."
        },
        {
          "zh": "说到你，如果你要是回老家上班 这感觉跟北京上班差别不大，上班就谈不上照顾父母了。",
          "en": "Speaking of you, if you go back to your hometown for work, this feels not much different from working in Beijing, and you can't take care of your parents if you go to work."
        },
        {
          "zh": "你在北京找个工作，星期天坐高铁回趟老家其实也是一样的。",
          "en": "It's the same as finding a job in Beijing and taking the high-speed rail back to your hometown on Sunday."
        },
        {
          "zh": "选择无非就是要钱还是要陪伴。",
          "en": "The choice is nothing more than money or companionship."
        },
        {
          "zh": "如果选择多挣点钱，就在北京，有钱家里人都有保障。",
          "en": "If you choose to earn more money, stay in Beijing, and the family will be secure if you have money."
        },
        {
          "zh": "要嘛就是完全的在家务农，节省开支，主打的就是一家人的陪伴",
          "en": "Or just be a farmer at home completely, save expenses, and the main focus is family companionship."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "社保+公积金：我从北京到上海，可以直接把北京的社保和公积金转过来",
          "en": "Social Security + Housing Fund: I can directly transfer Beijing's social security and housing fund from Beijing to Shanghai."
        },
        {
          "zh": "医保：当时北京是有个存折可以直接提现",
          "en": "Medical Insurance: At that time, Beijing had a passbook that could be directly withdrawn."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在资源高度集中的县城，没门路也是铁人三项的命，而且工资还不高。",
          "en": "In a county town with highly concentrated resources, you are destined to do an Ironman triathlon without connections, and the salary is not high."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "既然决定了要在老家县城买房，肯定建议公积金直接提出来用，我公积金账户提的比脸都干净了。",
          "en": "Since you have decided to buy a house in your hometown county, it is definitely recommended to directly withdraw the housing fund for use. I have withdrawn the housing fund account cleaner than my face."
        },
        {
          "zh": "至于社保转移，没操作过，我之前是青岛的社保，来济南工作后开通的异地就直接使用了很方便。",
          "en": "As for social security transfer, I haven't done it. I used to have Qingdao's social security. After I came to Jinan for work, it was very convenient to open it in another place and use it directly."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去工厂打螺丝看你进什么厂，什么工种，什么职位，在县城进厂的话一般很低的，而且进厂的工资本来就不是很高，我们哪里县城有个工业区，我妹在里面一个月三四千",
          "en": "Going to the factory to tighten screws depends on what factory you enter, what type of work, what position, if you enter a factory in a county town, it is generally very low, and the salary for entering a factory is not very high. There is an industrial area in our county town where my sister works in it for three or four thousand a month."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说说我自己吧~，6 年北漂存了 100W ，然后回老家(省会城市)一个 IT 企业工作，落差巨大事多了钱少了，甚至想重回北京，无奈干了一年忍不住辞职了，后面换了个国企的工作，又担心裁员失业唉，仔细思考后决定考公，又开启了一年半白天上班晚上复习的日子，真的压力巨大，万幸上岸了，目前生活还算满意咯。",
          "en": "Let me talk about myself~, I saved 1 million after 6 years of Beijing漂(drifting), and then returned to my hometown (capital city) to work in an IT company. There was a huge gap, more things and less money, and I even wanted to return to Beijing. Unfortunately, I couldn't help but resign after working for a year. Later, I changed to a state-owned enterprise job, and I was also worried about layoffs and unemployment. After careful consideration, I decided to take the civil service exam, and started another year and a half of working during the day and reviewing at night. The pressure was really huge. Fortunately, I passed the exam, and I am quite satisfied with my current life."
        },
        {
          "zh": "另外我当时离开北京办相关事宜1 、医保：北京医保办张关联的卡，自己交的部分是可以全部体提现的2 、其他社保：回老家到当地政务大厅、或者 app 办理转移就行，不着急3 、公积金：2021 年的时候离职并不能提取（现在什么情况不清楚），但可以转移，线上办理即可",
          "en": "In addition, when I left Beijing, I handled related matters: 1. Medical insurance: Beijing Medical Security issued a card that can be associated, and the part paid by myself can be fully withdrawn. 2. Other social security: Go back to your hometown and go to the local government affairs hall or app to handle the transfer, don't worry. 3. Housing fund: When I left in 2021, I couldn't withdraw it (I don't know what the situation is now), but it can be transferred, and it can be done online."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小县城真的没那么可怕，，婆罗门也没啥 ，大家现在都知道，人外有人，天外有天。",
          "en": "Small county towns are really not that scary, and Brahmins are nothing. Everyone knows now that there is always someone better than you, and there is always a sky above the sky."
        },
        {
          "zh": "小县城生存比较讲信用和人品，时间长了，做事靠谱，为人可靠，是比较吃得开的。",
          "en": "Survival in small county towns pays more attention to credit and character. Over time, doing things reliably and being reliable is relatively popular."
        },
        {
          "zh": "小县城我觉得大家更加会去相信老板的人品，相对于品牌效应，当然靠谱的品牌+靠谱的老板 ==在小县活得很滋润。",
          "en": "I think people in small county towns are more likely to believe in the character of the boss, compared to the brand effect, of course, a reliable brand + a reliable boss == live a very comfortable life in small county towns."
        },
        {
          "zh": "小县城和北京都有缺点，看你哪一个更不能忍受吧。",
          "en": "Small county towns and Beijing have their own shortcomings, it depends on which one you can't stand more."
        },
        {
          "zh": "我老家小县城同学的生活质量，是高于大部分一线城市的同学的。",
          "en": "The quality of life of my classmates in my hometown small county town is higher than that of most classmates in first-tier cities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看楼主的目标是什么了 是想找个对象？还是在北京很失望， 作为山河四省其中的一员 又从魔都到红码 农商银行 烂尾楼的那个城市辗转几次说一下踩的坑 以及个人的一些思考吧",
          "en": "It depends on what the poster's goal is. Do you want to find a partner? Or are you very disappointed in Beijing? As a member of the four provinces of Shanhe, I have moved from Shanghai to the city with red code, rural commercial banks, and unfinished buildings several times to talk about the pitfalls and personal thoughts."
        },
        {
          "zh": "1.县城房子如果不是刚需 不建议入手 特别是四五线城市。（目前手持五线城市的房子 人在省会城市工作）。",
          "en": "1. If a house in a county town is not a rigid demand, it is not recommended to buy it, especially in fourth- and fifth-tier cities. (Currently holding a house in a fifth-tier city and working in the capital city)."
        },
        {
          "zh": "2.关于找对象这个事情个人认为是个玄学，老家固然介绍的对象有一点资源，但人家也看你的工作、出身等等，在一线城市呆着可能还工资高点，在这点有点优势，但是真回去后，收入骤降，不一定有优势。",
          "en": "2. Regarding finding a partner, I personally think it is a metaphysics. Although the objects introduced in my hometown have some resources, they also look at your work, background, etc. Staying in a first-tier city may have a higher salary, which is a bit of an advantage in this regard, but after you really go back, your income will drop sharply, which may not have an advantage."
        },
        {
          "zh": "3.工厂打螺丝不太清楚 OP 是否经历过，这个看个人承受能力。",
          "en": "3. I am not very clear whether OP has experienced tightening screws in a factory, it depends on personal endurance."
        },
        {
          "zh": "据我了解 四五线城市 全年无休 工资 3 k ，4k 左右。",
          "en": "As far as I know, fourth- and fifth-tier cities have no rest throughout the year and the salary is around 3k, 4k."
        },
        {
          "zh": "好一点的 6k 顶峰了。",
          "en": "A better one is 6k at the peak."
        },
        {
          "zh": "4.公积金等半年后可销户提取。",
          "en": "4. The housing fund can be withdrawn after half a year."
        },
        {
          "zh": "5.社保医保可暂时走灵活就业去缴费，当然需要一点经费。",
          "en": "5. Social security medical insurance can temporarily go to flexible employment to pay, of course, it requires a little funding."
        },
        {
          "zh": "然后走异地医保，待找到合适的工作后直接续上即可。",
          "en": "Then go to out-of-town medical insurance, and renew it directly after finding a suitable job."
        },
        {
          "zh": "最后总结下来就是 现阶段做的决定一定要慎重，首先手里要有 3 到 6 个月的生活开支，然后解决工作问题，再然后才能说谈女朋友，一般现阶段女孩子有的不看你现在的存款，也会看你未来的预期（未来能不能挣钱，真爱除外） 。",
          "en": "The final conclusion is that the decision you make at this stage must be cautious. First, you must have 3 to 6 months of living expenses, then solve the job problem, and then you can talk about finding a girlfriend. Generally, some girls at this stage do not look at your current deposits, but also look at your future expectations (whether you can make money in the future, except for true love)"
        },
        {
          "zh": "IT 开发在没有家庭背景支持的情况下，只能卷自己， 家里能帮着找个工作的话，麻溜的赶紧回去。",
          "en": "IT development can only roll itself up without family support. If your family can help you find a job, go back quickly."
        },
        {
          "zh": "最好还是回自己的省会城市，这样收入一般砍半，离家也会近一点，另外 现阶段买房要慎重 特别的四五线城市的房子，好了暂时就说这么多。",
          "en": "It is best to return to your provincial capital, so that the income will be cut in half, and you will be closer to home. In addition, you should be cautious about buying a house at this stage, especially houses in fourth- and fifth-tier cities. Okay, I'll just say so much for now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "71 楼说得好，就算不在一线，也要在强二线，山河四省小润出省大润出国另还建议留在北京的，不考虑户口结婚生子了吗",
          "en": "71st floor said it well, even if you are not in the first tier, you should be in the strong second tier. The small run of the four provinces of Shanhe goes out of the province and the big run goes abroad. It is also recommended to stay in Beijing, don't you consider going through the household registration, getting married and having children?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "20 年离开的北京，公积金我记得是从官网申请，如果销户了五年内是不能重新开户的，医保的钱之前也能提取出来，现在不知道行不行了，可以问问，社保没必要转走，等退休的时候在哪退休再转就行，毕竟如果以后北京退休钱多一些",
          "en": "I left Beijing in 20 years. I remember that the housing fund was applied for from the official website. If the account is cancelled, you cannot reopen it within five years. The medical insurance money could also be withdrawn before. I don't know if it is possible now. You can ask, there is no need to transfer the social security. Just wait until the retirement and transfer it wherever you retire, after all, if Beijing has more retirement money in the future."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "熟悉下名词“县城婆罗门”，尽量找个有家庭背景在当地有资源的对象，至少多和这样的人打圈",
          "en": "Get familiar with the term 'county town Brahmin', try to find a partner with a family background and local resources, at least hang out with such people more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老家是村里还是县城，老家版本的玩法跟北上广深不一样",
          "en": "Is your hometown a village or a county town? The gameplay in the hometown version is different from Beijing, Shanghai, Guangzhou and Shenzhen."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说说你自己的呀 因为一些什么原因?",
          "en": "Tell me about yourself, what are some of the reasons?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老家是哪里的？",
          "en": "Where is your hometown?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你都 5 年了，社保超过 5 年，可以摇车牌你知道么？",
          "en": "You have been there for 5 years, and your social security has exceeded 5 years, do you know that you can apply for a car license plate?"
        },
        {
          "zh": "摇到转手一卖十几个 w 呢。",
          "en": "If you shake it, you can resell it for more than 100,000."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Ilavena 摇的到么",
          "en": "@Ilavena Can you get it?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "等一个 append 还是继续留在京吧。",
          "en": "Waiting for an append or continue to stay in Beijing."
        }
      ],
      "type": "replies"
    }
  ]
}