{
  "id": 1114779,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "没人聊聊最近的纳指吗? 跌麻了",
          "en": "Is anyone talking about the recent Nasdaq? It's tanking"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "",
          "en": ""
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "定投纳指，买崩了美国国运到头，涨了利好自己钱包",
          "en": "Dollar-cost average into the Nasdaq. If the US's luck runs out, it's the end. If it rises it's good for my wallet"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "东升西降！立刻跟我一起，梭哈做多 CHINA ！",
          "en": "The East rises, the West declines! Follow me immediately, go all-in and go long on CHINA!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坚持定投，长期看好美国，拿个 5 年绝对能赚钱",
          "en": "Stick to dollar-cost averaging, have a long-term optimistic view of the US, and you'll definitely make money in 5 years"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有涨有跌不是正常的吗，继续定投就完事了。",
          "en": "Isn't it normal to have ups and downs? Just keep dollar-cost averaging."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "纳指跌的幅度还算小，科技个股才大。",
          "en": "The Nasdaq's decline is still small, it's the tech stocks that are big."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当所有人都在喊“相信国运满仓纳指”的时候就代表不是顶部也不远了，任何一个市场都不可能只涨不跌，不过长期来看我还是相信美股（毕竟是最先进最完善最有公信力的最大市场），等一个 20%跌幅进场",
          "en": "When everyone is shouting \"believe in national fortune and go all-in on Nasdaq\" it means the top is not far away, no market can only go up and not down, but in the long run I still believe in US stocks (after all, it's the most advanced, comprehensive and credible largest market), waiting for a 20% drop to enter"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "纳指2021/11/30~ 2025/1/31: 涨了 26.64%2023/1/31~2025/1/31: 涨了 87.53%所以 2021/11/30 ~ 2023/1/31 到底跌了多少呢？",
          "en": "Nasdaq 2021/11/30~ 2025/1/31: up 26.64% 2023/1/31~2025/1/31: up 87.53% So how much did it actually fall from 2021/11/30 ~ 2023/1/31?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@WispZhan 其实你想降低风险只需要降低仓位，这种对冲意义不大，对冲很挑标的",
          "en": "@WispZhan Actually, if you want to reduce risk, you only need to reduce your position. This kind of hedging doesn't make much sense, and hedging is very selective about the underlying assets"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "仓内今天割了一点@wyattyhh 今天割掉一点，降低下仓位的压力",
          "en": "I cut a little today @wyattyhh cut a little today to reduce the pressure on my position"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Gray2016 场内是说在国内的交易里所买，和股票一样买的是别人卖出的份额，这个没有限额。场外是找券商买，券商拿着你的钱再去买美股要占用外汇额度所以有限额",
          "en": "@Gray2016 In the domestic trading, it means buying shares like stocks, which are shares sold by others, and there is no limit. Over-the-counter means buying from brokers, and the brokers use your money to buy US stocks, which takes up the foreign exchange quota, so there is a limit"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果效率部大获成功，再次伟大不是说说而已，从目前的形势看，我坚持定投",
          "en": "If the Ministry of Efficiency is a great success, becoming great again is not just talk. Judging from the current situation, I insist on dollar-cost averaging"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加仓机会 /dog 场内限额 100 太烦了",
          "en": "Opportunity to add to position /dog the 100 limit is too annoying"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前段时间讨论纳指的人太多了，当周围一些明显不懂理财的人讨论还买入时就是适当减仓的时候",
          "en": "There were too many people discussing the Nasdaq recently. When some people around me who clearly don't understand financial management are discussing buying, it's time to reduce the position appropriately"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "记得上一次懂王一顿折腾之后也是跌了很久，大概有一年左右吧，后面屎王上台好像才回升的？",
          "en": "I remember after Trump's last round of shenanigans, it also fell for a long time, about a year or so, and it seemed to have recovered after the Shit King came to power?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "跌的越多，定投能买入的越多啊，好事。",
          "en": "The more it falls, the more you can buy with dollar-cost averaging, which is a good thing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "重仓猛干（尤其 TSLA ）",
          "en": "Go heavy (especially TSLA)"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "已经加大了定投的剂量",
          "en": "I have increased the dose of dollar-cost averaging"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "加仓",
          "en": "Add to the position"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "nvda 被 deepseek 干的一蹶不振了",
          "en": "nvda has been devastated by deepseek"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "put 就是了",
          "en": "Just put"
        }
      ],
      "type": "replies"
    }
  ]
}