{
  "id": 1112859,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "小舅子生病有感...",
          "en": "Thoughts on my wife's younger brother's illness..."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "小舅子今年 22 岁，正在读大四，去年底参加了计算机考研。",
          "en": "My wife's younger brother is 22 years old this year, currently a senior in college, and participated in the computer science graduate entrance exam at the end of last year."
        },
        {
          "zh": "去年底他曾晕倒一次，去医院检查后发现是贫血。",
          "en": "He fainted once at the end of last year and was found to be anemic after a hospital checkup."
        },
        {
          "zh": "过年回家时，发现他的脸色蜡黄，状态不佳。",
          "en": "When he went home for Chinese New Year, we noticed that his face was sallow and he was in poor condition."
        },
        {
          "zh": "从 2 月 13 号起，他开始吃东西就呕吐。",
          "en": "He started vomiting after eating on February 13th."
        },
        {
          "zh": "我们带他去医院做了增强 CT 检查，医生告诉我们检查结果不容乐观，肠道的肿瘤已经转移到肝脏。",
          "en": "We took him to the hospital for an enhanced CT scan, and the doctor told us that the results were not optimistic, and the intestinal tumor had metastasized to the liver."
        },
        {
          "zh": "目前他已经去了上海的大医院做病理检查，最终结果还在等待中。\r\n\r\n小舅子平时喜欢吃刺激性食物，考研压力也很大，长期熬夜、抽烟、喝浓咖啡，这些不良习惯都有可能对他的健康产生影响。\r\n\r\n希望大家能够引起重视，定期体检，特别是每隔 3-5 年做一次肠胃镜，保持良好的身体状态。",
          "en": "He has now gone to a large hospital in Shanghai for pathological examination, and the final results are still pending.\r\n\r\nMy wife's younger brother usually likes to eat stimulating food, and the pressure of the graduate entrance examination is also very high. Long-term staying up late, smoking, and drinking strong coffee may all have an impact on his health.\r\n\r\nI hope everyone can pay attention, have regular physical examinations, especially gastroscopies and colonoscopies every 3-5 years, and maintain a good state of health."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "@Guidoo #4 别说二级了，小地方的三甲都不一定靠谱，我直接点名了：商洛市中心医院，刚查了下是三甲，年前给一个亲戚确诊急性髓细胞白血病（做了骨髓穿刺），然后让回家好好过年（准备后事的意思），你猜怎么着，年后去西安大医院（西安交大二附院）一查，啥事没有，就是贫血，你说把人给坑的。。。",
          "en": "@Guidoo #4 Don't even mention secondary hospitals, even the top-tier hospitals in small places may not be reliable. I'll name one directly: Shangluo Central Hospital. I just checked and it's a top-tier hospital. Before the new year, they diagnosed a relative with acute myeloid leukemia (after a bone marrow puncture), and then told them to go home and have a good new year (meaning to prepare for their affairs). Guess what, after the new year, they went to a large hospital in Xi'an (the Second Affiliated Hospital of Xi'an Jiaotong University) and found nothing wrong, just anemia. Can you believe how badly they were tricked..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个年纪这种生活习惯的一抓一大把，但是有肿瘤的绝对是凤毛麟角，所以我认为你小舅子就是运气不好，中年人不用往自己身上带，当然体检这个是对的，只不过针对的不是癌症，而且其它一些常见的疾病。",
          "en": "There are tons of people with these lifestyle habits at this age, but having a tumor is extremely rare. So, I think your wife's younger brother is just unlucky. Middle-aged people don't need to project this onto themselves. Of course, physical examinations are good, but they're not just for cancer, but also for other common diseases."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个是纯悲催，早癌筛查目前推荐的年龄是 35-40 岁，他这个还没到大型体检的年龄但是贫血没进一步检查，医院这么水的吗，年轻人贫血给补铁就打发了？一定要怀疑是不是肿瘤贫血",
          "en": "This is purely tragic. The currently recommended age for early cancer screening is 35-40. He hasn't reached the age for a large-scale physical examination, but there was no further investigation of the anemia. Is the hospital so incompetent, just prescribing iron supplements for anemia in a young person? You must suspect whether it is tumor-related anemia."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最近几年重病年轻化，基本上是因为免疫系统失灵，无法杀灭每个人体内每天都会产生的极少量癌细胞。",
          "en": "In recent years, serious illnesses have become younger, basically because the immune system fails to kill the extremely small number of cancer cells that are produced in everyone's body every day."
        },
        {
          "zh": "1. 工作忙、压力大导致没有休息好。",
          "en": "1. Busy work and high stress lead to a lack of rest."
        },
        {
          "zh": "2. 前几年那个全球卫生事件对免疫系统能力的攻击。",
          "en": "2. The global health crisis in recent years has attacked the immune system's ability."
        },
        {
          "zh": "3. 基因问题。",
          "en": "3. Genetic issues."
        },
        {
          "zh": "我感觉和吃喝刺激性食物、咖啡没有什么关系。",
          "en": "I don't think it has much to do with eating stimulating food or drinking coffee."
        },
        {
          "zh": "我妻子生活规律，定时健身，一年到头吃水果蔬菜粗粮养生饮食。",
          "en": "My wife has a regular life, exercises regularly, and eats fruits, vegetables, whole grains, and a healthy diet all year round."
        },
        {
          "zh": "还是莫名其妙得了鼻咽癌。",
          "en": "She still inexplicably got nasopharyngeal carcinoma."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我去，这么年轻。搞得我都有点怕了。",
          "en": "Wow, so young. It's making me a little scared."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@my101du #6 前几年那个全球卫生事件对免疫系统能力的攻击 +1我一大把年纪还发了水痘。。。",
          "en": "@my101du #6 The global health crisis in recent years attacked the immune system's ability +1 I'm already old and still got chickenpox..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这是年轻基本是基因的问题，和生活习惯的关系是充分但不必要条件拉上你老婆和家人做一次早癌筛查，以及肠胃镜检查",
          "en": "This is basically a genetic issue when young. The relationship with lifestyle habits is a sufficient but not necessary condition. Take your wife and family for early cancer screening, as well as gastroscopy and colonoscopy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wanwaneryide 有没有认真读，导致贫血的原因是肿瘤，和有没有好好吃饭啥关系",
          "en": "@wanwaneryide Did you read carefully? The reason for the anemia is the tumor. What does it have to do with eating well?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Xhack 他的意思是，这个年级贫血就应该怀疑了，就应该进一步进行检查",
          "en": "@Xhack His point is that anemia at this age should raise suspicion and require further investigation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yn1024 同感，沪漂十多年了，关于看病医院，我只有上海和非上海。",
          "en": "@yn1024 I feel the same way. I've been in Shanghai for over ten years, and when it comes to hospitals, I only consider Shanghai and non-Shanghai."
        },
        {
          "zh": "上海这边感觉非常专业，老家那边三甲二甲都不咋的，家人和亲戚遇到一些毛病老家看不好，都立马上来上海。",
          "en": "Shanghai feels very professional. The top-tier and second-tier hospitals in my hometown are not very good. When family and relatives encounter some problems that can't be treated in our hometown, they immediately come to Shanghai."
        },
        {
          "zh": "想起某考研指导老师说的，小地方医生老师就是当年自己那些学习不咋的同学，他们什么水平自己心理有数。",
          "en": "I remembered what a graduate entrance exam instructor said: The doctors and teachers in small places are just those classmates who didn't study well back then. They know their own level."
        },
        {
          "zh": "牛逼的，都被大城市挖走了。",
          "en": "The best ones have been poached by big cities."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@fengfisher3 晚期转移配合治疗也基本 1 年以内，家里有老人从查出来到走就 3 月不到。",
          "en": "@fengfisher3 Even with treatment, late-stage metastasis is usually within 1 year. An elderly family member of mine went from diagnosis to death in less than 3 months."
        },
        {
          "zh": "这种事情只能开导当事人父母和长辈了，当事人知道的话估计都看开了。",
          "en": "In this kind of situation, you can only comfort the parents and elders of the person involved. If the person involved knows, they probably have already accepted it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "B 站有个医生竟然说到厨房卫生。。。每天吃饭前把碗，筷子，汤匙是烫了又烫。。。",
          "en": "A doctor on Bilibili even talked about kitchen hygiene... Scalding bowls, chopsticks, and spoons before every meal..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@murmur 确实都想不到。",
          "en": "@murmur I really couldn't have imagined it."
        },
        {
          "zh": "老丈人带他去家旁边的二级医院（离家 500m 左右）看的贫血，那家二级医院我和我老婆和他们说过很多次了这家医院不行！",
          "en": "My father-in-law took him to a secondary hospital next to his house (about 500m away) to see about the anemia. My wife and I have told them many times that this hospital is not good!"
        },
        {
          "zh": "不行！",
          "en": "No good!"
        },
        {
          "zh": "不行！",
          "en": "No good!"
        },
        {
          "zh": "因为这家医院出过好几次医疗事故。",
          "en": "Because this hospital has had several medical accidents."
        },
        {
          "zh": "还是得去三甲医院看。",
          "en": "You still have to go to a top-tier hospital."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@my101du 说的也有道理",
          "en": "@my101du What you said makes sense too."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@yn1024 死去活来",
          "en": "@yn1024 Between life and death"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这下不用考研了",
          "en": "No need to take the graduate exam now"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这么年轻，感觉还是遗传因素占比更大",
          "en": "So young, I feel that genetic factors play a bigger role"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@my101du 鼻咽癌主要是病毒原因吧",
          "en": "@my101du Isn't nasopharyngeal carcinoma mainly caused by a virus?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@my101du #6顺序错了吧，应该是先 2 ，再 1 ，最后 3 了。",
          "en": "@my101du #6 The order is wrong, it should be 2, then 1, then 3."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "大学生 22 岁 男的，这几个词在一起 不应该是身体最好的时候嘛，贫血，真的好奇吃饭的钱花哪去了还是不吃饭",
          "en": "A 22-year-old male college student, shouldn't this be when the body is at its best? Anemia, I'm really curious where the money for food went, or are they just not eating?"
        }
      ],
      "type": "replies"
    }
  ]
}