{
  "id": 1110503,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "比亚迪车主在吗？",
          "en": "Are there any BYD car owners here?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "怎么说",
          "en": "What's up?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "21 款宋 dmi 现在心态良好",
          "en": "2021 Song DMI owner feeling good right now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "所谓的被刺，是老车主的一种 [本来等等就可以得到] 的惋惜",
          "en": "The so-called 'stab in the back' is a kind of regret from old car owners [who could have gotten it if they had waited]."
        },
        {
          "zh": "其他的老车主连这个 [本来] 都没有，却这么开心？奇怪的心理",
          "en": "Other old car owners didn't even have this [potential], yet they are so happy? Strange psychology."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "秦 l 提车还有半个月到半年，跑了 8500 公里，算下来费用就 1500 左右，还不算开油车时候怕堵车费油省下来的高速费，这就值回票价了。",
          "en": "It will take another half month to half a year to pick up the Qin L. I've driven 8500 kilometers, and the cost is only about 1500, not including the highway tolls saved from being afraid of traffic jams and fuel consumption when driving a gasoline car. This is worth the price."
        },
        {
          "zh": "资本家喜欢通过各种媒介渠道营造他的产品值得购买的感觉并施加在普通人身上，实际上即使有了所谓的智驾，车的使用属性和体验就发生了本质提升吗？",
          "en": "Capitalists like to use various media channels to create the feeling that their products are worth buying and impose it on ordinary people. In reality, even with so-called intelligent driving, has the essential attribute and experience of using a car been fundamentally improved?"
        },
        {
          "zh": "当然没有，只是多了个便利性（舒适性）配置，而车的乘坐空间、底盘滤震、转向特性、储物空间等核心要素其实没什么变化。",
          "en": "Of course not. It's just an added convenience (comfort) feature, while the core elements of the car, such as riding space, chassis vibration filtering, steering characteristics, and storage space, have not changed much."
        },
        {
          "zh": "莫要资本家营造的落入消费主义的陷阱呐。",
          "en": "Don't fall into the trap of consumerism created by capitalists."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只要车企永远不更新功能，那就永远不会背刺",
          "en": "As long as the car company never updates its features, it will never stab you in the back."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "想起了某东北视频博主买了 998 半年后变成 798.最近技术迭代升级太快，早买早享受，晚买不吃亏",
          "en": "Reminds me of a video blogger from Northeastern China who bought a 998 and it became 798 half a year later. Technology iterates and upgrades too quickly these days. Buy early and enjoy early, buy late and you won't lose out."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "现在买新能源车没有不被刺的， 如果是买传统燃油车 那还是三年小改 五年换代的路子，但是那么老旧 体验那么差 你又嫌弃。。",
          "en": "These days, buying a new energy vehicle means you're going to get stabbed in the back sooner or later. If you buy a traditional gasoline car, it's still the routine of a minor change every three years and a generation change every five years, but then you complain that it's so old and the experience is so bad..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "24 年 12 月 28 号下单的宋 L dmi但是没啥啊，虽然是加量不加价，但是买的时候直接现金优惠了一万二",
          "en": "Ordered a Song L DMI on December 28, 2024, but it's no big deal. Although it's more features for the same price, I got a direct cash discount of 12,000 when I bought it."
        },
        {
          "zh": "那些说背刺的，要么就是刚上市的时候原价买的，但是用了半年，压根就不算背刺；像我一样更新换代前买的，其实那时候已经有消息出新款，但砍了价啊，也不算背刺；真正背刺的是更新换代前买的，但是又没有砍刀价的，这种被背刺也是正常，你买啥也都一样",
          "en": "Those who say they were stabbed in the back either bought it at the original price when it was just released, but they've been using it for half a year, so it doesn't really count as a stab in the back. Like me, I bought it before the upgrade, and there was already news of a new model, but I got a discount, so it doesn't count as a stab in the back. The real stab in the back is when you buy it before the upgrade, but you don't get a discount. This kind of stabbing in the back is normal, it's the same no matter what you buy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个十几万的车，年年谈背刺，我也是服了 BYD 车主了。建议车卖了去坐公交。",
          "en": "Buying a car for a little over 100,000 and talking about getting stabbed in the back every year, I'm impressed by BYD car owners. I suggest you sell the car and take the bus."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买定离手我 2023 年 11 月份买的车，现在一年多跑了 2w 公里，我如果等到现在确实可以相同价钱配置高点，但是这一年多 2 万多公里我靠腿走么？",
          "en": "What's done is done. I bought the car in November 2023. I've driven over 20,000 kilometers in over a year. If I had waited until now, I could have gotten higher specs for the same price, but would I have walked over 20,000 kilometers in the past year?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "估计 哭晕在厕所",
          "en": "Probably crying in the bathroom."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "半年被背刺",
          "en": "Stabbed in the back after half a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "习惯了都 我 19 年买的 18 款宋 dm 当时也没怎么关注就是需要买车就买了 没几个月出新款大升级还降价",
          "en": "I'm used to it. I bought the 2018 Song DM in 2019. I didn't pay much attention at the time, I just needed to buy a car and I bought it. A new model with a major upgrade was released and the price was reduced a few months later."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以后再也不会买比亚迪了",
          "en": "I will never buy a BYD again."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "习惯了，这几年不管买什么车都背刺。除非买日韩美德系",
          "en": "I'm used to it. In recent years, you get stabbed in the back no matter what car you buy. Unless you buy a Japanese, Korean, American, or German car."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去年 9 月末刚买宋 L dmi ，已哭晕",
          "en": "Just bought a Song L DMI at the end of September last year, already crying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "再买一辆，拉低均价",
          "en": "Buy another one to lower the average price."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "再买比亚迪我就是猪2023 款秦 PLUS 车主路过",
          "en": "If I buy another BYD, I'm a pig. 2023 Qin PLUS owner passing by."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "以旧换新走起来",
          "en": "Time to trade in the old one."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "比亚迪又怎么了？",
          "en": "What happened to BYD again?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没什么感觉，我喜欢自己开车，高速有个 ACC 就行了",
          "en": "Doesn't bother me. I like to drive myself, and ACC on the highway is enough."
        }
      ],
      "type": "replies"
    }
  ]
}