{
  "id": 1110198,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "大家有啥长期使用的东西吗",
          "en": "What long-term items does everyone have?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "满足三个条件：\r\n1 ，使用时间长（ 5 年以上）；\r\n2 ，高频使用；\r\n3 ，入手时候咬牙买的（价格不便宜），但是用的现在感觉超值。\r\n\r\n目前我能想到我的就是 AirPods Pro 耳机，还有一个 fellow 的卡特杯",
          "en": "Meets three conditions:\r\n1. Long usage time (5 years or more);\r\n2. High frequency of use;\r\n3. Bought with a tight budget (not cheap), but now feels like a great value.\r\n\r\nCurrently, what I can think of is my AirPods Pro earphones and a Fellow Carter Everywhere Mug."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "老婆？",
          "en": "Wife?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "摩托车，买了之后周边方圆 500 公里内基本都被探索完了，周末再也不无聊。",
          "en": "Motorcycle. After buying it, the surrounding 500 kilometers have been almost completely explored. Weekends are no longer boring."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微信读书直接包年 168 ，钱不多，之所以咬牙，原因是有的是免费替代的方案，但是都没微信读书体验好，最高记录连续阅读 1000 天多天了，阅读时长累计 5000 多个小时，累积阅读天数 2000 多天。很多正版书都可以免费看，我想这肯定不是一年 168 可以衡量的了。",
          "en": "WeChat Reading is directly subscribed for 168 yuan per year. The money is not much, but the reason for making a decision is that there are free alternative solutions, but none of them have a better experience than WeChat Reading. The highest record is continuous reading for more than 1000 days, with a cumulative reading time of more than 5000 hours and a cumulative reading days of more than 2000 days. Many genuine books can be read for free. I don't think this can be measured by 168 yuan a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iPad pro 11 2018",
          "en": "iPad Pro 11 2018"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 MX KEYS 键盘 + 罗技 MX Master 3 鼠标",
          "en": "Logitech MX KEYS keyboard + Logitech MX Master 3 mouse"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "苏泊尔铁锅，用了 15 年了",
          "en": "Supor iron wok, used for 15 years"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "老婆，好多年了，现在依旧高强度使用",
          "en": "Wife, for many years, still in high-intensity use."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "罗技 vertical",
          "en": "Logitech vertical"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "显卡吧，当时咬牙买了 3090 ，挖 ETH 还回本了一半，现在依旧坚挺，不过倒也不够 5 年",
          "en": "Graphics card, I bought a 3090 at the time, which was a tough decision. Mining ETH has recovered half of the cost. It is still strong, but not enough for 5 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "墨水屏手机，海信 A5 PRO ，共花费 1599+1199+800大概 20 年买了一个，21 年不慎丢失后又买了一个，24 年看到停产又买了一个备用PS：停产两年后 25 年 1 月份又恢复生产了，京东自营旧款海信 A9 原价 1999 ，现价 3299",
          "en": "E-ink screen phone, Hisense A5 PRO, cost a total of 1599+1199+800. I bought one around 2020, lost it accidentally in 2021 and bought another one, and bought a spare one in 2024 when I saw it was discontinued. PS: After being discontinued for two years, it resumed production in January 2025. The old Hisense A9 on Jingdong's self-operated store was originally priced at 1999, and now it is priced at 3299."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "HHKB 习惯以后已经回不去了，只用 Mac 自带键盘老觉得缺点意思",
          "en": "After getting used to HHKB, there is no going back. I always feel that the Mac's built-in keyboard is lacking."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "niz micro84：- 静电容 35g ，手感超级好- 最好用的自定义编程工具，把空格旁的 fn 键 + sdfe 设置成方向键，fn + wr 设置成 home end ，写代码爽到飞起来。lg c2 42(oled 电视):- 4k 120hz- 4hdmi 接口- 42 英寸当显示器刚刚好，玩游戏、看视频、浏览网页、写代码都好用。- 目前应该接近 1.5w h ，还看不出烧屏。- 缺点： 不是 android ，自带商店软件比较简陋（特指 bilibili ），不能装 android 应用",
          "en": "niz micro84: - Electrostatic capacitor 35g, super good feel - The best custom programming tool, set the fn key next to the space bar + sdfe as the direction keys, fn + wr set as home end, writing code is a breeze. lg c2 42 (oled TV): - 4k 120hz - 4hdmi interface - 42 inches as a monitor is just right, good for playing games, watching videos, browsing the web, and writing code. - Currently, it should be close to 15,000 hours, and there are no signs of burn-in. - Disadvantages: Not Android, the built-in store software is relatively simple (specifically bilibili), and cannot install Android applications."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "超声波牙刷，牙医都说你这样的牙齿我们没业务了。",
          "en": "Ultrasonic toothbrush, the dentist said that we have no business with teeth like yours."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ipad mini 6 每天都用，在家几乎不离手，applewatch 每天都带 主要监控睡眠和运动。 手机电脑这种就不说了基本是废话。",
          "en": "iPad mini 6 is used every day, almost always at hand at home. I wear an Apple Watch every day, mainly to monitor sleep and exercise. Mobile phones and computers are basic, no need to elaborate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "博朗剃须刀, 入门款 3 系, 2015 年初买的用到现在",
          "en": "Braun shaver, entry-level 3 series, bought at the beginning of 2015 and still using it now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@jchnxu 上海啊，下雨的。但是只要不是瓢泼大雨就行。我一年能骑两万公里",
          "en": "@jchnxu Shanghai, it's raining. But as long as it's not a heavy downpour, it's okay. I can ride 20,000 kilometers a year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "右手",
          "en": "Right hand"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "魔物猎人世界+冰原吧，18 年玩到现在。偶尔砍瓜切菜很爽",
          "en": "Monster Hunter World + Iceborne, played from 2018 until now. Sometimes it's great to just hack and slash."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "Filco Minila Air ，2014 年买的，现在还在用",
          "en": "Filco Minila Air, bought in 2014, still using it now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "NV 显卡，这东西说贵不贵，说便宜也不便宜。但立场使用频率还挺高的，和游戏帧率强挂钩。",
          "en": "NV graphics card, this thing is not too expensive, nor too cheap. But the usage frequency is quite high, and it is strongly linked to the game frame rate."
        }
      ],
      "type": "replies"
    }
  ]
}