{
  "id": 1110838,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "关于喝水的问题",
          "en": "About the drinking water issue"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "* 背景：我家目前是烧水壶直接接自来水烧开放到保温壶里面。",
          "en": "* Background: My family currently uses a kettle to directly boil tap water and put it in a thermos."
        },
        {
          "zh": "因为小孩子喝奶，然后家里还买了那种 5L 的桶装水，和热水对冲泡奶粉用。",
          "en": "Because the child drinks milk, we also bought 5L bottled water to mix with hot water for making milk powder."
        },
        {
          "zh": "\r\n* 问题：口感上，个人感觉是口感上肯定是桶装水口感远好于自来水的。",
          "en": "* Question: In terms of taste, I personally feel that bottled water tastes much better than tap water."
        },
        {
          "zh": "所以想知道大家的喝的水是怎么个形式。",
          "en": "So I want to know how everyone drinks water."
        },
        {
          "zh": "是只喝桶装水、矿泉水之类的饮用水。",
          "en": "Do you only drink bottled water, mineral water, or other drinking water?"
        },
        {
          "zh": "还是直接喝烧开的自来水（冷却），抑或是自来水过滤后再烧开的自来水（冷却）。",
          "en": "Or do you directly drink boiled tap water (cooled), or tap water that has been filtered and then boiled (cooled)?"
        },
        {
          "zh": "产生这个问题的原因还有就是买这种饮用水的设备的问题上跟家人讨论出来的",
          "en": "The reason for this question is also due to discussions with my family about the issue of purchasing equipment for drinking water."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "坐标深圳观澜，去樟坑径取山泉水煮来喝，快有 10 年了。",
          "en": "Located in Guanlan, Shenzhen, I've been fetching spring water from Zhangkengjing to boil and drink for almost 10 years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "论方便程度：自来水 ≈ 净水器 >> 桶装水",
          "en": "Convenience: Tap water ≈ Water purifier >> Bottled water"
        },
        {
          "zh": "论水质：净水器 > 桶装水（新）>> 自来水 >> 桶装水（旧）",
          "en": "Water quality: Water purifier > Bottled water (new) >> Tap water >> Bottled water (old)"
        },
        {
          "zh": "口感属于主观因素，就不比较了。",
          "en": "Taste is a subjective factor, so I won't compare it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哇哈哈一箱 24 瓶的纯净水 不买更大桶的水是因为水拆封后 12 小时内不喝完会滋生很多细菌",
          "en": "Wahaha a box of 24 bottles of pure water. I don't buy larger buckets of water because water will breed a lot of bacteria if it is not drunk within 12 hours of being opened."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "目前是：前置——>净水器——>管线机",
          "en": "Currently: Pre-filter -> Water purifier -> Water dispenser"
        },
        {
          "zh": "主打一个喝水随时随地，冷暖随意。",
          "en": "The main thing is to drink water anytime, anywhere, hot or cold as you like."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没必要自己过滤， 直接买大品牌的桶装水，我家买的是冰露（可口可乐） 18.9L ，18 元。",
          "en": "No need to filter it yourself, just buy bottled water from a major brand. My family buys Ice Dew (Coca-Cola) 18.9L, 18 yuan."
        },
        {
          "zh": "一次买 30 张水票， 好像还送几桶。",
          "en": "Buy 30 water coupons at a time, and it seems that a few barrels are also given away."
        },
        {
          "zh": "水桶放在橱柜下面， 用金灶电动上水器。",
          "en": "The water barrel is placed under the cabinet and uses a Kinzo electric water dispenser."
        },
        {
          "zh": "凉水就直接喝，冬天微波炉打 30 秒再喝， 或者兑开水喝。",
          "en": "Drink cold water directly, microwave for 30 seconds in winter before drinking, or mix with boiling water."
        },
        {
          "zh": "也烧开水泡茶。",
          "en": "Also boil water for tea."
        },
        {
          "zh": "烧饭烧菜也用这个水。",
          "en": "This water is also used for cooking."
        },
        {
          "zh": "一桶 5-7 天左右（不是天天做饭）。",
          "en": "One barrel lasts about 5-7 days (not cooking every day)."
        },
        {
          "zh": "家里长期 3 个桶， 喝完 2 桶开第 3 桶的时候 微信小程序订水， 和送水工达成默契了， 不限定时间， 在第三桶喝完之前送过来就行了。",
          "en": "My family has 3 barrels long-term. When 2 barrels are finished and the 3rd barrel is opened, I order water through the WeChat applet and have an agreement with the water delivery person. There is no specific time limit, just deliver it before the third barrel is finished."
        },
        {
          "zh": "家里自来水， 在水壶里烧一次， 就会出现星星点点的白斑， 烧一周， 肯定会出一圈白粉。",
          "en": "The tap water at home, once boiled in the kettle, will have sporadic white spots. After boiling for a week, a ring of white powder will definitely appear."
        },
        {
          "zh": "已经这样喝水十几年了。",
          "en": "I have been drinking water like this for over ten years."
        },
        {
          "zh": "供参考。",
          "en": "For reference."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接桶装水，一般 18.9L 的桶装水 ¥20 左右，饮水机的话直接海鲜市场淘一个，或者淘宝买一个都不怎么贵。",
          "en": "Directly use bottled water, generally 18.9L bottled water is about ¥20. For water dispensers, you can directly find one in the seafood market, or buy one on Taobao, which is not very expensive."
        },
        {
          "zh": "优先海鲜市场看一看。",
          "en": "Give priority to checking the seafood market."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐标广州，过年的时候桶装水喝完了，商户还没开门，搞了点自来水，烧开了喝也是一股子味道，涩。",
          "en": "Located in Guangzhou, when the bottled water ran out during the Chinese New Year, the shops were not open yet, so I got some tap water, boiled it and drank it, and it had a taste and was astringent."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "桶装水 + 烧开 已经这么做了很多年了。",
          "en": "Bottled water + boiling. I have been doing this for many years."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "装个净水器吧",
          "en": "Install a water purifier"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "最佳选择是过滤后再烧开的自来水。",
          "en": "The best choice is tap water that is filtered and then boiled."
        },
        {
          "zh": "另外，喝桶装水，记得注意卫生。",
          "en": "Also, when drinking bottled water, remember to pay attention to hygiene."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个恒温水壶不就好了",
          "en": "Why not just buy a constant temperature kettle?"
        },
        {
          "zh": "烧开恒温 45 度样子泡奶粉",
          "en": "Boil and keep it at a constant temperature of 45 degrees for preparing milk powder."
        },
        {
          "zh": "另外我自己喝是买整箱的农夫山泉怡宝这种，方便。",
          "en": "In addition, I buy a whole box of Nongfu Spring or C'estbon for myself, which is convenient."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过滤的自来水再烧开 保温壶一年到头基本都没有水垢",
          "en": "Filtered tap water is boiled again, and there is basically no scale in the thermos all year round."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "小米净水器，电加热壶保温，冲奶粉温度要求多",
          "en": "Xiaomi water purifier, electric heating kettle insulation, there are many temperature requirements for making milk powder."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "过滤后的自来水，我感觉口感比桶装水好",
          "en": "I feel that filtered tap water tastes better than bottled water."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一直都是过滤自来水再烧开",
          "en": "Always filtered tap water and then boiled."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一直喝不惯桶装水 不知道为什么",
          "en": "I've never been used to drinking bottled water, I don't know why."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐标东京，水龙头有净水功能➕无印良品的净水壶，过滤出来的水直接喝。",
          "en": "Located in Tokyo, the faucet has a water purification function + Muji's water purification pot, and the filtered water is drunk directly."
        },
        {
          "zh": "刚来的时候是直接打开水龙头接着喝的，喝了一段时间之后感觉还是需要过滤一下。",
          "en": "When I first came, I directly opened the tap and drank it, but after drinking it for a while, I felt that I still needed to filter it."
        },
        {
          "zh": "在国内的话我会选择买桶装水，价格便宜物流也快。",
          "en": "In China, I would choose to buy bottled water, which is cheap and the logistics are fast."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喝水直接桶装水，装净水器其实不是很划算，而且每隔一段时间就需要换滤芯；买净水器坑也很多，我就踩过坑，买的净水器过滤不掉自来水烧开之后的味道，可能功课没做足吧。",
          "en": "Drinking water directly from bottled water, installing a water purifier is actually not very cost-effective, and the filter element needs to be replaced every once in a while; there are also many pitfalls in buying a water purifier, and I have stepped on the pit. The water purifier I bought cannot filter out the taste of tap water after boiling, maybe I didn't do enough research."
        },
        {
          "zh": "现在喝桶装水 13.5 一桶 18L ，坐标上海",
          "en": "Now I drink bottled water 13.5 for an 18L barrel, located in Shanghai"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前置过滤器+净水器，平时大人喝烧开的水，孩子冲奶粉是用恒温壶烧开，然后恒温 43 度",
          "en": "Pre-filter + water purifier, adults usually drink boiled water, and children use a constant temperature kettle to boil milk powder and keep it at a constant temperature of 43 degrees."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "直接桶装水烧吧。",
          "en": "Just boil bottled water."
        }
      ],
      "type": "replies"
    }
  ]
}