{
  "id": 1111619,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "老妈让我存 40w,打电话问银行大额存单利息多少，才 1.5 几，怎么搞，放支付宝和微信吗",
          "en": "My mom asked me to deposit 400,000 yuan. I called the bank to ask about the interest rate for large deposit certificates, and it's only around 1.5%. What should I do? Should I put it in Alipay or WeChat?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "降的太夸张了，不想存农村信用社之类的小银行",
          "en": "The decrease is too exaggerated. I don't want to deposit in small banks like rural credit unions."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "开渣打，凑个 50w ，换刀有 4.1 的利率至少。汇丰卓越是 3.8",
          "en": "Open a Standard Chartered account, gather 500,000 yuan, and exchange it for USD to get an interest rate of at least 4.1%. HSBC Premier is 3.8%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微众银行活期 plus ？",
          "en": "WeBank current account plus?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zeusho871 招商永隆 5w 刀一个月就有 3.9 了",
          "en": "@zeusho871 CMB Wing Lung offers 3.9% per month for 50,000 USD."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "广东的话去趟香港吧",
          "en": "If you are in Guangdong, take a trip to Hong Kong."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只看利率，容易掉坑。收益高，时间短，风险低，，这是理财的不可能三角，，这 40 万能接受多久不动，，，或者说，分成 X 笔，每笔可以多久不动，先把时间定了，然后看收益和风险。活期目前都还好，定期只看国有银行，全国性股份制银行。理财要注意，尤其是含有地方 zf 债券的，比如城投，，，保险型的看清楚条款。基金去境外。股市先掂量掂量自己。理财最忌是人家谁谁挣了多少，，，，他的做法，他买的产品当然可以借鉴学习，但适不适合自己，自己最清楚。",
          "en": "Only looking at the interest rate can easily lead to pitfalls. High return, short time, and low risk form the impossible triangle of financial management. How long can you leave this 400,000 yuan untouched? Or rather, divide it into X amounts, and how long can you leave each amount untouched? First, determine the time, and then look at the return and risk. Current accounts are currently okay, and for fixed deposits, only consider state-owned banks and national joint-stock banks. Pay attention to wealth management, especially those containing local government bonds, such as urban investment bonds. For insurance-type products, read the terms carefully. Invest in overseas funds. Consider your own capabilities before investing in the stock market. The biggest taboo in financial management is comparing yourself to others who have earned a lot. You can learn from their methods and the products they buy, but only you know what is suitable for you."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你如果定投黄金，注意是定投不是梭哈，年收益估计 10 个点有",
          "en": "If you dollar-cost average into gold, note that it's dollar-cost averaging, not gambling everything. The annual return is estimated to be around 10%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "丢到支付宝，找个货币基金（相对风险较低），大概有 3 个点，好一点能到 4 ～ 4.5",
          "en": "Put it in Alipay and find a money market fund (relatively low risk), which has about 3%, or even 4 to 4.5% if you are lucky."
        },
        {
          "zh": "余额宝背后也是货币基金，目前 1 个多点",
          "en": "Yu'ebao is also a money market fund, currently at just over 1%."
        },
        {
          "zh": "如果不放心，分多笔投，降低风险",
          "en": "If you are not at ease, invest in multiple tranches to reduce risk."
        },
        {
          "zh": "你放到支付宝，40w 能够上黑卡 v1,50w 是 v2,100w 是 v3 ，如果不介意，可以凑个 50w ，基金经理会很高兴服务 v2 客户的",
          "en": "If you put it in Alipay, 400,000 yuan can get you a black card V1, 500,000 yuan is V2, and 1 million yuan is V3. If you don't mind, you can gather 500,000 yuan, and the fund manager will be happy to serve a V2 customer."
        },
        {
          "zh": "v2 每周有一杯星巴克，v3 有 100 油卡，这些比较直接还有出行、送医什么的乱七八糟的权益",
          "en": "V2 gets one Starbucks cup per week, and V3 gets a 100 yuan gas card. These are more direct benefits, along with various travel and medical benefits."
        },
        {
          "zh": "要么丢到大银行，例如招行，在里面也有基金，现场找个柜台约个号问一下，比你问网友靠谱",
          "en": "Or put it in a big bank, such as China Merchants Bank, which also has funds. Find a counter on-site and make an appointment to ask. It's more reliable than asking netizens."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "微众银行大额存单 3%，随时可提前取不损失已存的利息。或者换美元存大陆美元定存高的银行，不清楚能否提前取出。",
          "en": "WeBank large deposit certificates offer 3%, and you can withdraw early without losing the accrued interest. Or exchange it for USD and deposit it in a mainland bank with high USD fixed deposit rates. I'm not sure if you can withdraw early."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买债券",
          "en": "Buy bonds."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "哪天股票暴涨的时候，去银行 app 的大额存单转让区，会有惊喜的",
          "en": "On the day when stocks soar, go to the large deposit certificate transfer section of the bank app, and there will be surprises."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Tiande 没有这个利率了吧",
          "en": "@Tiande That interest rate doesn't exist anymore, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Tiande 现在是 2.1",
          "en": "@Tiande It's 2.1 now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买纳斯达克 一天就 1.5 了 然后取出来 买债基",
          "en": "Buy Nasdaq, it'll yield 1.5% in a day, then take it out and buy bond funds."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "中低风险理财产品",
          "en": "Medium to low-risk wealth management products."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Jason168 我自己有理财投资，她的钱不敢冒太大的风险，1.9 左右我都心满意足了",
          "en": "@Jason168 I have my own wealth management investments, but I don't dare to take too much risk with her money. I would be satisfied with around 1.9%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以去小红书找一些地推的客户经理来做，我能拿到的 2.3 左右 （ 3 年） + （ 10000 返现 60 元）。都是 app 操作，填个经理推荐码不是四大行，但也不是村镇银行。（省级）另外可以考虑美元，部分银行可以操作",
          "en": "You can go to Xiaohongshu to find some on-the-ground customer managers to do it. I can get about 2.3% (3 years) + (60 yuan cashback for 10,000 yuan). It's all done through the app, filling in a manager's referral code. It's not one of the four major banks, but it's not a village bank either (provincial level). Also, you can consider USD. Some banks can do it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@elaiza 四大行现在三年期的就是 1.9 。",
          "en": "@elaiza The three-year term at the four major banks is now 1.9%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "城市银行嘛，不知道你在哪儿，我们这边成都银行，重庆银行之类的都是 2.3",
          "en": "City banks, I don't know where you are, but here in Chengdu Bank, Chongqing Bank, etc. are all 2.3%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "40w 可以存大额,某些银行可以给到利息 2.1.",
          "en": "400,000 can be deposited as a large deposit, and some banks can offer an interest rate of 2.1%."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "中信百信银行 3 年 2.4中信银行控股",
          "en": "CITIC aiBank 3 years 2.4, CITIC Bank holds the controlling stake."
        }
      ],
      "type": "replies"
    }
  ]
}