{
  "id": 1114304,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "求求老哥们推荐个新生儿安全座椅，太难买了 ｡°(°¯᷄◠¯᷅°)°｡",
          "en": "Please, brothers, recommend a newborn car seat, it's too hard to buy ｡°(°¯᷄◠¯᷅°)°｡"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "之前做了很多攻略，在有限的预算内，买了个 京东京造的顶配智能款安全座椅。\r\n发现有如下问题：",
          "en": "I did a lot of research before, and within a limited budget, I bought a top-of-the-line smart car seat from Jingdong.\r\nI found the following problems:"
        },
        {
          "zh": "1. 安全带过短，超过三四岁就要换 3 点式安全带，看视频换 3 点式安全带 操作 还挺麻烦的。\r\n2. 目测有点窝脖子\r\n3. 带的 通风、加热 好像没什么用，起码在大人试用下来 没什么感觉。。。 不知道婴儿体感会不会强点\r\n4. 似乎 躺的角度优点小 我妈说 有点直，不知道是 车座椅的角度问题，还是产品本身有问题，还是 都是这样的？有没有用过的老哥们，求求了，给点建议",
          "en": "1. The seat belt is too short, and you need to switch to a 3-point seat belt after three or four years old. It's quite troublesome to watch videos to change the 3-point seat belt.\r\n2. It looks like it might be straining the neck.\r\n3. The ventilation and heating seem to be useless. At least when adults try it, they don't feel anything... I don't know if the baby will feel it more strongly.\r\n4. It seems that the lying angle is a bit too small. My mother said it's a bit straight. I don't know if it's the angle of the car seat, the product itself, or if they are all like this? Are there any brothers who have used it? Please, give me some suggestions"
        },
        {
          "zh": "唯一优点是 便宜，2100 就有 通风、加热、蓝牙、app 操作。",
          "en": "The only advantage is that it is cheap. 2100 has ventilation, heating, Bluetooth, and app operation."
        },
        {
          "zh": "还有一个选项是 安全提篮，但这个安全系数没有安全座椅高，婴儿长得快 用个几个月就用不了",
          "en": "Another option is a safety carrier, but its safety factor is not as high as a car seat. Babies grow quickly and it will be unusable in a few months."
        },
        {
          "zh": "背景：\r\n小孩快要出生了，出生后 呆个几天就出发回老家，路程 900km ，分两天开车，有老哥干过这事吗，不知道对孕妇跟小孩有没有影响。",
          "en": "Background:\r\nThe child is about to be born. After staying for a few days after birth, we will go back to our hometown, a journey of 900km, driving for two days. Have any brothers done this before? I don't know if it will affect the pregnant woman and the child."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "“出生后 呆个几天就出发回老家”看到这句话血压都上来了。",
          "en": "\"After staying for a few days after birth, we will go back to our hometown.\" Seeing this sentence, my blood pressure went up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "前几天刚买，咸鱼淘的二手，宝得适 双面骑士 二代，700 到手，原价 3k ，二代已停产。",
          "en": "I just bought it a few days ago. I bought a second-hand Britax Dualfix i-Size 2nd generation on Xianyu for 700, the original price was 3k, and the 2nd generation has been discontinued."
        },
        {
          "zh": "山姆的新款是双面骑士 pro ，3k 左右。",
          "en": "Sam's new model is the Dualfix Pro, around 3k."
        },
        {
          "zh": "这款适合 0-4 岁的，有新生儿坐垫。",
          "en": "This model is suitable for 0-4 years old and has a newborn cushion."
        },
        {
          "zh": "大了可以买宝得适的百变骑士，印象中可以坐到 12 岁。",
          "en": "When they grow up, you can buy Britax's Adventure, which I think can be used up to 12 years old."
        },
        {
          "zh": "基于背景多说几句，最近在狂补新生儿护理知识：1. 新生儿每天睡眠时间较长，约 16-20 小时；2. 母乳喂养宝宝每日排便 5-6 次甚至更多，奶粉喂养约 2-3 次左右；满月后排便次数减少，通常每日 1-3 次；3. 母乳消化时间约 2.5-3 小时，奶粉消化时间约 3-4 小时，消化完后需要喂养；4. 新生儿偶尔打嗝是正常现象，通常持续 5-10 分钟；产后护理知识：1. 顺产如果不顺利，有可能要对下体进行侧切，剖宫产是在肚子上拉一刀，不论是否要动刀，产后的产妇需要休养；2. 坐月子（洋话叫产褥期）期间，产妇会排恶露，大多数女性患者会在 42 天左右排完恶露；你看看你在路途上有什么方式能将这一大一小都照顾好么，如果资源不够，还是在家休整好了再让她们出远门吧。可以不信月子文化，但你要相信现代医学。",
          "en": "Based on the background, let me say a few more words. Recently, I've been cramming on newborn care knowledge: 1. Newborns sleep for a long time every day, about 16-20 hours; 2. Breastfed babies defecate 5-6 times or more a day, while formula-fed babies defecate about 2-3 times; after the full moon, the number of bowel movements decreases, usually 1-3 times a day; 3. Breast milk takes about 2.5-3 hours to digest, while formula takes about 3-4 hours. You need to feed them after digestion; 4. Occasional hiccups in newborns are normal and usually last 5-10 minutes; Postpartum care knowledge: 1. If a vaginal delivery is not smooth, you may need to have an episiotomy, and a cesarean section is a cut on the abdomen. Regardless of whether you need surgery, postpartum women need to rest; 2. During postpartum confinement (called the puerperium in foreign languages), postpartum women will discharge lochia. Most female patients will finish discharging lochia in about 42 days; You see how you can take care of this big and small one on the road. If you don't have enough resources, it's better to rest at home before letting them go on a long trip. You can disbelieve in the postpartum confinement culture, but you have to believe in modern medicine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "疯了吧，出生几天就跑长途，这年代就别搞封建了吧",
          "en": "Are you crazy? Running a long distance a few days after birth, don't be feudal in this era."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "\"出生后 呆个几天就出发回老家，路程 900km\"家里是有什么天大的事情，需要如此特殊的两个人冒这么大的风险回去的",
          "en": "\"After staying for a few days after birth, we will go back to our hometown, a journey of 900km\" Is there anything major happening at home that requires such two special people to take such a big risk to go back?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "二手，不然你这钱大概率打水漂。",
          "en": "Second-hand, otherwise your money is likely to be wasted."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我买了个宝得适 0 岁提篮式，挺好…也是出生 3 天，跑了 800 公里回老家…",
          "en": "I bought a Britax 0-year-old carrycot, it's pretty good... I also ran 800 kilometers back to my hometown 3 days after birth..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不要买。。坐不了几次。。就吃尘！！！！！",
          "en": "Don't buy it... It won't be used many times... It will just collect dust!!!!!!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坐不了几次的都是孩子一哭，就心疼的不坐了。",
          "en": "Those who don't use it a few times are just too distressed when the child cries, so they don't let them sit in it."
        },
        {
          "zh": "狠心点，坐着哭几次就好了。",
          "en": "Be ruthless, and it will be fine after crying a few times while sitting."
        },
        {
          "zh": "我女儿刚出生去月子中心，用的提篮，后面躺不下了还安全座椅。",
          "en": "My daughter used a carrycot when she first went to the postpartum center, and later, when she couldn't lie down, she used a car seat."
        },
        {
          "zh": "刚换安全座椅也是哭的撕心裂肺的，现在 2 岁上车就知道要做安全座椅，有时放个东西安全带系晚了还会说宝宝还没系上。",
          "en": "She cried her heart out when she first switched to a car seat, but now at 2 years old, she knows that she has to sit in a car seat when she gets in the car, and sometimes if I put something down and buckle the seat belt late, she will say that the baby hasn't buckled up yet."
        },
        {
          "zh": "30 公里的时速追尾，人是抱不住孩子的。",
          "en": "In a rear-end collision at 30 kilometers per hour, you can't hold the child."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "1 、建议尽量让妈妈和娃休养一段时间，从我养蛙的经验看，一岁内都不适合出远门。",
          "en": "1. It is recommended to let the mother and baby rest for a period of time as much as possible. From my experience of raising a frog (child), it is not suitable to travel far within one year."
        },
        {
          "zh": "2 、安全座椅绝对不是闲置的物品。",
          "en": "2. Car seats are definitely not idle items."
        },
        {
          "zh": "那些说不要买的老哥 ，说娃坐不惯的。",
          "en": "Those brothers who say don't buy it, and say that the baby is not used to sitting in it."
        },
        {
          "zh": "有没有想过是你们买的东西坐着不舒服？",
          "en": "Have you ever thought that the things you buy are uncomfortable to sit in?"
        },
        {
          "zh": "或者没从小让娃坐，没给娃建立坐车要坐安全座椅的概念。",
          "en": "Or you didn't let the baby sit in it from a young age, and didn't establish the concept that the baby should sit in a car seat when riding in a car."
        },
        {
          "zh": "我自己是五年前娃没出生就买的 Beryl Pro ，第一次回医院检查还是打针就坐上反向安装的。",
          "en": "I bought a Beryl Pro five years ago before my baby was born, and the first time I went back to the hospital for a checkup or injection, I sat in it with it installed in reverse."
        },
        {
          "zh": "之后几乎没从车上拆下来过。",
          "en": "After that, it was almost never removed from the car."
        },
        {
          "zh": "看小猪佩奇都提醒娃，你看，他们坐车都坐自己的儿童座椅。",
          "en": "Watching Peppa Pig even reminds the baby, look, they all sit in their own children's seats when riding in the car."
        },
        {
          "zh": "现在短途出行不让她坐的话，她都喊着要坐儿童座椅。",
          "en": "Now, if I don't let her sit in it for short trips, she shouts that she wants to sit in the child seat."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@busier 不爱坐的原因是没养成习惯，为啥国外娃儿都爱坐，国内就不爱坐了？",
          "en": "@busier The reason for not liking to sit is that they haven't developed the habit. Why do foreign babies like to sit in it, but domestic ones don't?"
        },
        {
          "zh": "这玩意还跟国籍有关系吗",
          "en": "Does this thing have anything to do with nationality?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我买的 cybex sirona gi plus 和 Maxicosi 的 AxissFixPlus ，两个都不错",
          "en": "I bought the Cybex Sirona Gi Plus and the Maxi-Cosi AxissFix Plus, both are good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看完你的背景，我想说，你特娘的还真是个天才.jpg",
          "en": "After reading your background, I want to say, you are really a genius.jpg"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就一趟的话建议找救护车，有接这种活的",
          "en": "If it's just for one trip, it is recommended to find an ambulance, there are people who take on this kind of work."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "婴儿：天崩开局",
          "en": "Baby: Disaster start"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是先买了一个 800 元左右的国产小牌凑活，到了能坐的年纪，就换了一个 4000 多的大牌。",
          "en": "I first bought a cheap domestic brand for about 800 yuan to make do, and when I reached the age when I could sit in it, I replaced it with a big brand for more than 4000 yuan."
        },
        {
          "zh": "不要想着一步到位，现在的孩子 8 岁就能达到安全带标准身高了，可以换增高垫了",
          "en": "Don't think about getting it all done in one step. Nowadays, children can reach the standard height for seat belts at the age of 8, and they can switch to booster cushions."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我家花巨资买的安全座椅娃现在 10 个多月了，满打满算坐有十次？",
          "en": "My family spent a lot of money to buy a car seat, and my baby is now more than 10 months old, and I have used it only about ten times?"
        },
        {
          "zh": "最后两次是真不上去啊，哭的撕心裂肺本来想上高速，最后走的国道回家娃这么小，你就开车跑这么远折腾大人，折腾小孩啊",
          "en": "The last two times, I really couldn't get her to sit in it, she cried so hard that I originally wanted to take the expressway, but in the end I took the national highway home. The baby is so small, and you drive so far to torture adults and children."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "京东，按销量排名来买",
          "en": "Jingdong, buy according to sales ranking."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "新生儿没办法用儿童座椅，因为整体是碗状的，无法平躺。",
          "en": "Newborns can't use child seats because the whole thing is bowl-shaped and can't lie flat."
        },
        {
          "zh": "900 公里，新生儿和未恢复的产妇，放弃这种折腾的想法吧。",
          "en": "900 kilometers, a newborn and an unrecovered postpartum woman, give up this idea of ​​torture."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买个二手的，这玩意你买回来跟全新的没有区别，基本都是用不了多长时间就出掉了",
          "en": "Buy a second-hand one, there is no difference between buying this thing back and a brand new one, basically it will be sold after it can't be used for a long time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "二手收个安全提篮，高速用安全提篮，一两百就能收到。",
          "en": "Pick up a used safety carrier, use a safety carrier on the highway, and you can receive it for one or two hundred."
        },
        {
          "zh": "我当年就是这样用的。",
          "en": "That's how I used it back then."
        },
        {
          "zh": "但是只有大约 150km 的车程，挺顺利的，刚好在车上睡一觉。",
          "en": "But it was only about 150km drive, it went smoothly, and I just took a nap in the car."
        }
      ],
      "type": "replies"
    }
  ]
}