{
  "id": 1113194,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "求推荐 4000 内的安卓机，想弃果投卓了…",
          "en": "Looking for recommendations for an Android phone under 4000, thinking of switching from Apple... "
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "本来打算换 iPhone16E 的，看了看果断放弃了，准备给苹果全家桶都出了，我就几个想法",
          "en": "I originally planned to switch to the iPhone 16E, but after looking at it, I decisively gave up. I'm planning to sell all my Apple products. I have a few ideas:"
        },
        {
          "zh": "\r\n\r\n1.4000 以内",
          "en": "1. Within 4000"
        },
        {
          "zh": "\r\n2.流畅用 4 年左右",
          "en": "2. Smooth use for about 4 years"
        },
        {
          "zh": "\r\n3.拍照清晰好看些，不用绝对惊艳，中等偏上即可",
          "en": "3. The photos should be clear and nice, no need to be absolutely stunning, just above average"
        },
        {
          "zh": "\r\n4.游戏性能好，主要玩鸣潮",
          "en": "4. Good gaming performance, mainly playing Wuthering Waves"
        },
        {
          "zh": "\r\n5.广告尽量都可以关掉",
          "en": "5. Be able to turn off as many ads as possible"
        },
        {
          "zh": "\r\n6.直屏",
          "en": "6. Flat screen"
        },
        {
          "zh": "\r\n7.电池稍微耐用下（ iPhone12 我真忍无可忍）",
          "en": "7. The battery should last a little longer (I really can't stand my iPhone 12)"
        },
        {
          "zh": "\r\n8.可以 Google 全家桶",
          "en": "8. Compatible with Google services"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "一加 13",
          "en": "OnePlus 13"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只推荐两款 oppo x8 ，vivo x200 pro mini ，安卓机主要是做工精致程度比 iphone 有差距，这两款相对来说是比较精致的。",
          "en": "I only recommend two models: OPPO X8 and VIVO X200 Pro mini. The main difference between Android phones and iPhones is the level of craftsmanship and refinement, and these two models are relatively refined."
        },
        {
          "zh": "安卓手机实际用起来其实差距是没有特别大的。",
          "en": "In practice, there isn't a huge difference between Android phones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "OnePlus 13",
          "en": "OnePlus 13"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一加 13 呗 或者等着一加 13mini",
          "en": "OnePlus 13, or wait for the OnePlus 13 mini"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是从 iPhone 12 换到一加 13 ，体验好太多了，尤其是那块屏幕，没事就想解锁看看，太通透了还有续航，网上都说一加 13 续航差，我手上这个可能抽到奖了，能亮屏 10+小时以上，每天夜里充满，白天根本不用充",
          "en": "I switched from an iPhone 12 to a OnePlus 13, and the experience is so much better, especially the screen. I just want to unlock it and look at it all the time, it's so clear, and the battery life is great too. People online say the OnePlus 13 has bad battery life, but mine might be a lucky one, it can last for 10+ hours of screen-on time, I charge it every night and don't need to charge it during the day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@DT27 #1 k80 拍照不行吧...",
          "en": "@DT27 #1 K80's camera isn't good, right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "红米 K80 ，不到三千就够了 我小米 10Pro 今年第五年了。",
          "en": "Redmi K80, less than 3000 is enough. My Xiaomi 10Pro is in its fifth year this year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "iqoo13 ，主摄够用，长焦就当不存在，游戏性能在 8e 中也算是顶尖的了",
          "en": "IQOO 13, the main camera is usable, consider the telephoto non-existent, the gaming performance is also top-notch among 8e phones."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "流畅 4 年…Android…要求是不是有点高了",
          "en": "Smooth for 4 years... Android... Isn't that asking a bit much?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MacsedProtoss 不是听说现在五年都不是问题了么",
          "en": "@MacsedProtoss Haven't you heard that five years is no longer a problem?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "玩鸣潮用电脑啊，手机玩又糊又不方便。",
          "en": "Play Wuthering Waves on a computer, playing on a phone is blurry and inconvenient."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@revival83 哈哈 厂商说的？",
          "en": "@revival83 Haha, is that what the manufacturer said?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MacsedProtoss 手持 mate40 首发购入，差不多五年了，当主力机使用，目前使用还算丝滑。",
          "en": "@MacsedProtoss Holding a Mate 40 purchased at launch, almost five years, used as my main phone, and it's still pretty smooth."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "打算购入 小米 15 ， 线下体验手感很好。",
          "en": "Planning to buy a Xiaomi 15, the feel in hand is very good in the offline experience."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ys2016814 haha 我有个测试机是 m60p 卡的要死",
          "en": "@ys2016814 haha I have a test machine that is a M60P and it's terribly slow."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "X200 Pro mini 不过没超声波指纹",
          "en": "X200 Pro mini but it doesn't have an ultrasonic fingerprint sensor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@MacsedProtoss 使用一加 9 目前整整三年半依然丝滑",
          "en": "@MacsedProtoss Using a OnePlus 9, and after exactly three and a half years, it's still smooth."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "找一个能刷 LineageOS 或者 pixel 的手机, 我 1200 买的 778G 小米,用了两年依然流畅(不打游戏不拍照",
          "en": "Find a phone that can flash LineageOS or Pixel. I bought a 778G Xiaomi for 1200, and it's still smooth after two years (no gaming, no photography)."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一加 ACE 5 pro 或 一加 13",
          "en": "OnePlus Ace 5 Pro or OnePlus 13"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "PIXL 9 PRO XL",
          "en": "PIXL 9 PRO XL"
        }
      ],
      "type": "replies"
    }
  ]
}