{
  "id": 1109882,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "何去何从，求建议",
          "en": "Where to go, seeking advice"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "研究生毕业，27 岁刚参加工作不久，月薪两万，搞 ai 相关工作，公司不大，也没加过班，但我感到内心非常痛苦，每天接触不到什么人，来公司坐班，一坐一天，现实生活也没什么人可以交流，说实话，我大学去餐厅干帮厨，干服务员都没这么痛苦，现在每天都感觉心中压抑，也没什么干劲。\r\n我可以从事什么自由职业吗？或者现在开始如何布局？\r\n求朋友们给一点建议，每条回复我都会认真思考，谢谢了",
          "en": "Graduated with a master's degree, 27 years old and just started working not long ago, with a monthly salary of 20,000, doing AI-related work. The company is not big, and I haven't worked overtime, but I feel very painful inside. I can't meet anyone every day, I come to the company to sit all day, and there is no one to communicate with in real life. To be honest, even working as a kitchen helper or waitress in a restaurant in college wasn't this painful. Now I feel depressed and have no motivation every day.\r\nWhat kind of freelance work can I do? Or how should I start planning now?\r\nI ask my friends to give me some advice, and I will carefully consider every reply, thank you."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "还有这种好事？",
          "en": "Such good things exist?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我猜测 LZ 应该不忙，并且没什么产出。然后感到焦虑。如果楼主是公司顶梁柱天天老板开会，测试，产品，下属天天讨论肯定没那么焦虑。他焦虑的是自己的价值没体现",
          "en": "I guess the poster (LZ) is not busy and has little output. Then feels anxious. If the poster were the backbone of the company, with bosses meeting, testing, products, and subordinates discussing every day, they definitely wouldn't be so anxious. What he's anxious about is that his value isn't being reflected."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有比你这种更痛苦的 那就是任务完成了要主动完成任务 不能闲着 也不能自己学东西  每天开早会 写日报",
          "en": "There's something even more painful than you: that's when you have to actively seek out tasks after finishing your own. You can't be idle, and you can't even learn anything on your own. You have to attend morning meetings and write daily reports every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我之前也和你一样有这种痛苦，经历了不同公司，大的公司（几万人）、小公司都有，这些年也做了不同方向的业务线，只能说职场并不一定能带来快乐， 不要试图从职场中得到快乐，职场就是职场，拿钱做事，学习成长，挑战困难。不过这是后话了，只有亲身经历了才能感同身受，我非常希望身边同事都是聪明活泼外向善言辞，合作上也能有干劲，但事实不一定如愿。你刚毕业，如果适应不了程序员这种概率极大的情况碰到很多“闷的一笔”的人的行业，建议换个职业方向，早点换，或者换家公司换批同事。工作就是钱多事少离家近，但我也希望能碰到合得来的同事们。",
          "en": "I used to have the same pain as you. I have experienced different companies, both large (tens of thousands of people) and small. Over the years, I have also worked on different business lines. I can only say that the workplace does not necessarily bring happiness. Don't try to get happiness from the workplace. The workplace is just the workplace. Get paid to do things, learn and grow, and challenge difficulties. But this is an afterthought. Only after experiencing it personally can you empathize. I really hope that my colleagues are smart, lively, outgoing, and eloquent, and can also be motivated in cooperation, but the reality may not be as expected. You just graduated. If you can't adapt to the high probability that programmers encounter many 'boring' people in the industry, I suggest you change your career direction, change it sooner, or change companies and batches of colleagues. Work is about more money, less work, and being close to home, but I also hope to meet compatible colleagues."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "怎么说呢，毕业快十年了，刚毕业的时候也是这种情绪，现在依然是这种情绪，已经做好准备辞职了。别人眼里肯定觉得我作。工作不加班早九晚五福利好。但是内心就是很痛苦，看着职场不公，做的事情不被认可，没有成就感。感觉人生被浪费。怎么说呢。没人能给你标准答案，人生的体验是自己的。如果难受，那么就看看自己内心想做什么，去尝试一下。毕竟你的能力，下限肯定不会差。",
          "en": "How can I put it? It's been almost ten years since I graduated, and I had the same emotions when I first graduated. I still have these emotions now, and I'm ready to resign. Others must think I'm being pretentious. The job has no overtime, is 9 to 5, and has good benefits. But I'm very painful inside, seeing the unfairness in the workplace, the things I do are not recognized, and I have no sense of accomplishment. I feel like life is being wasted. How should I say it? No one can give you a standard answer, the experience of life is your own. If you feel uncomfortable, then see what you want to do in your heart and try it. After all, with your ability, the lower limit will definitely not be bad."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年轻的时候害怕一眼望到头，年纪大了才觉得，一眼望到头的日子才是最好的",
          "en": "When I was young, I was afraid of seeing the end at a glance, but when I got older, I felt that the days of seeing the end at a glance were the best."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "5.顺便了解一下，AI 什么方面的工作，如何入门的，我都想找一个，年轻人好好珍惜这个世代",
          "en": "5. By the way, I would like to know what aspects of AI work are, and how to get started. I also want to find one. Young people should cherish this era."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "> 27 岁刚参加工作不久，月薪两万，搞 ai 相关工作，公司不大，也没加过班这种工作条件是很不错的> 公司不大，也没加过班，但我感到内心非常痛苦，每天接触不到什么人，来公司坐班，一坐一天，现实生活也没什么人可以交流.....现在每天都感觉心中压抑，也没什么干劲社交孤独症 + 目标缺失感 + 成长焦虑------------工作在哪儿都不好干，能有这样的工作环境其实给你自己留足了业余时间，你只是不知道怎么利用这个时间。1. 缺乏社交，找点有意思的事情做，培养下兴趣爱好。比如，户外徒步、跑步，健身房约人撸铁，下班了约朋友吃个饭，聊聊天。2. 目标缺失和成长焦虑：毕业之后你的目标不再是发论文、拿到毕业证，这些清晰且明确的事情。接下来日子要怎么过，需要你自己去定义：职场爬格子升级打怪、积累经验为创业准备、经验好感情结婚生子家庭为重、这些都有路可循。唯一的建议是，动起来，不断去探索。想多了都是问题，动起来总有答案。",
          "en": "> 27 years old just started working not long ago, with a monthly salary of 20,000, doing AI-related work, the company is not big, and there is no overtime. This kind of working condition is very good.\r\n> The company is not big, and there is no overtime, but I feel very painful inside. I can't meet anyone every day, I come to the company to sit all day, and there is no one to communicate with in real life... Now I feel depressed and have no motivation. Social loneliness + lack of goals + growth anxiety----\r\n------------ It’s not easy to work anywhere. Having such a working environment actually leaves you with plenty of free time, but you just don’t know how to use it. 1. Lack of social interaction, find something interesting to do, and develop hobbies. For example, outdoor hiking, running, going to the gym to exercise with people, going out with friends for dinner after get off work, and chatting. 2. Lack of goals and growth anxiety: After graduation, your goal is no longer to publish papers or get a diploma, these clear and specific things. How to live the next days, you need to define it yourself: climbing the career ladder to upgrade and fight monsters, accumulating experience to prepare for entrepreneurship, good experience, marriage and children, and family are the most important. These all have paths to follow. The only suggestion is to move around and keep exploring. Thinking too much is the problem, moving around always has the answer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@echoyangjx 确实，工资低了立马换行了，不带考虑的",
          "en": "@echoyangjx Indeed, if the salary is low, I would immediately change careers without any consideration."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "能让我承受这份痛苦吗？",
          "en": "Can you let me endure this pain?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也一样，我感觉自己陷入了中等收入陷阱，时间一过就是半年，感觉除了天天写业务，没有任何进步。",
          "en": "Me too, I feel like I'm stuck in the middle-income trap. Half a year passes by, and I feel like I haven't made any progress except for writing business code every day."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "建议辞职,而且是马上. 人不能为了钱而少了交流. 大家说我说的对不对.",
          "en": "Suggest resigning, and immediately. People can't have less communication for the sake of money. Do you all think I'm right?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我在公司的同事基本上也只是同事，没有深交，有时候一天都能不说话。一个人在外面飘着也懒得去社交。现在搞的和大学舍友聚餐的时候说话都有些结巴了。我一直想着有没有我这种情况的朋友，一起找个通讯软件拉个群，没事的时候开开语音聊聊天，大家随便唠唠嗑，至少让我多说说话。",
          "en": "My colleagues at the company are basically just colleagues. We don't have deep friendships, and sometimes we don't even talk for a whole day. Being alone outside makes me too lazy to socialize. Now I even stutter a bit when I talk during gatherings with my college roommates. I've been wondering if there are any friends in my situation. We could find a communication software to create a group, and chat via voice chat when we have time. Everyone can just chat casually, at least let me talk more."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@hmxxmh ai 应用，算法都是大佬，本身就不是特别爱编程、算法什么的，也刷不下去题，只好来应用混口饭吃……至于知识都是大模型相关的，部署、微调、rag 、agent 基本就这些",
          "en": "@hmxxmh AI applications and algorithms are all done by experts. I'm not particularly fond of programming or algorithms, and I can't get through the coding challenges, so I have to come to applications to make a living... As for knowledge, it's all related to large models, deployment, fine-tuning, RAG, agents, basically just these."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我懂，跟坐牢一样，甚至坐牢还有说好好听的老哥",
          "en": "I understand, it's like being in prison, and even in prison there are old guys who tell you nice things."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "唉.... 能 get 到楼主的痛苦， 我目前也是这个处境...    对日复一日的牛马生活极度厌倦，但又找不到转型的出路，浑浑噩噩的过一天算一天，迷茫、焦虑...",
          "en": "Alas... I can get the poster's pain, I am also in this situation... I am extremely tired of the repetitive drudgery, but I can't find a way to transform. I live one day at a time in a daze, confused and anxious..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "来找我交流",
          "en": "Come and talk to me"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "继续干帮厨",
          "en": "Continue working as a kitchen helper"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "殊不知 你的痛苦是很多人一辈子达不到的快乐",
          "en": "Little do you know that your pain is the happiness that many people cannot achieve in their lifetime"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "兄弟，这份痛苦我来帮你承受，有意加 v",
          "en": "Brother, let me help you bear this pain, add me on WeChat if you're interested"
        }
      ],
      "type": "replies"
    }
  ]
}