{
  "id": 1113244,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "步梯顶楼能入手吗，有住顶楼的能否说下日常感受优缺点看法及建议",
          "en": "Is it worth buying a top-floor apartment in a building without an elevator? Residents of top-floor apartments, please share your daily experiences, pros and cons, opinions, and suggestions."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "一套老破小顶楼平层，总高 6 层，户型是我最最中意的，可以说是在这有限的预算里面户型是最好的。\r\n\r\n但唯一不足的是在顶楼，但凡低一层就立马买了。这小区就这一套在卖，也没有听说有加装电梯的计划。\r\n\r\n没有住过顶楼，是否真的有所说的漏水、夏暖冬凉、每次爬楼都是绝望、及日后转手流通性的问题。\r\n\r\n\r\n![户型图]( https://i.imgur.com/Nrcsvtp.jpeg)",
          "en": "It's an old, small, top-floor apartment on the top floor of a 6-story building. The layout is my absolute favorite, and it can be said to be the best layout within this limited budget.\r\n\r\nBut the only drawback is that it's on the top floor. I would have bought it immediately if it were just one floor lower. This is the only unit for sale in this complex, and there are no plans to install an elevator.\r\n\r\nI've never lived on the top floor. Is the talk of leaks, hot summers and cold winters, the despair of climbing stairs every time, and the issue of future resale liquidity true?\r\n\r\n\r\n![Floor Plan]( https://i.imgur.com/Nrcsvtp.jpeg)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "就四个字，不建议买，爱听不听，反正花的不是我的钱",
          "en": "In four words, I don't recommend buying it. Take it or leave it, it's not my money being spent anyway."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "顶楼漏水是早晚的问题",
          "en": "Roof leaks are just a matter of time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "漏水是必然的，尤其是老破小，使用年限本身就已经比较长了。另外有老人，爬楼压力大。有小朋友爬楼压力也大，小朋友出去玩，带个车子啥的，真的很累，扛上扛下的。优点么，阳光好，无遮挡；另外头顶没噪音。",
          "en": "Leaks are inevitable, especially in old and small buildings, as the service life is already relatively long. Also, if there are elderly people, climbing stairs is stressful. It's also stressful for children, and it's really tiring to carry things up and down when kids go out to play and bring a stroller or something. The advantages are good sunlight and no obstructions; also, there is no noise from above."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "优点就是冬天可以享受阳光浴",
          "en": "The advantage is that you can enjoy sunbathing in the winter."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "绝对是不建议买的 不要冲动  特别是老破小",
          "en": "Absolutely not recommended, don't be impulsive, especially for old and small apartments."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当地核心区可以买，非核心区就算了",
          "en": "You can buy it if it's in the core area of the city, but forget about it if it's not."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你找个小区了同样的租一个月住住看就懂了。楼里劝半天不如你遭罪住住",
          "en": "Find a similar apartment in the complex and rent it for a month to see for yourself. All the advice in the world isn't as good as experiencing the suffering of living there."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我住一楼，我都要说，顶楼是垃圾漏水就是那种你看着着急，却一点办法都没，无力感巨强另外，爬楼梯会让你出门欲望大大下降。爸妈年纪大点就都来不了了，因为爬不上去唯一好处是，阳光是真好",
          "en": "I live on the first floor, and I have to say that the top floor is garbage. Leaks are the kind of thing you watch anxiously, but there's nothing you can do about it, a feeling of utter helplessness. Also, climbing stairs will greatly reduce your desire to go out. Parents can't come if they're older because they can't climb the stairs. The only benefit is that the sunlight is really good."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个户型并不好，次卧通风采光问题很大，客厅除去餐厅其实很小，活动不开。阳台还没封。又是顶楼，强烈建议不要考虑。即使是户型没问题，单单一个顶楼这个因素，你都要慎重，除非价格很低。",
          "en": "This layout isn't good. The secondary bedroom has significant ventilation and lighting isssues. The living room is actually very small excluding the dining area, and there's not much room to move around. The balcony isn't enclosed. And it's on the top floor. I strongly advise against considering it. Even if the layout were perfect, the top floor factor alone should make you cautious, unless the price is very low."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "一直在蹲这个小区的房子，没有人挂出来。确实，缺点是显著的。",
          "en": "I've been waiting for an apartment in this complex to be listed, but no one has put one up. Indeed, the disadvantages are significant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "爬楼太累了，再拎点东西更累",
          "en": "Climbing stairs is too tiring, and it's even more tiring if you're carrying something."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@loryyang #8 不过有一说一，我租房租过顶楼，所以还是有经验，在阳台晒太阳或者吹风那是真的爽。但买房子么，还是再等等吧",
          "en": "@loryyang #8 However, to be fair, I've rented a top-floor apartment, so I have some experience. It's really nice to bask in the sun or feel the breeze on the balcony. But when it comes to buying a house, maybe wait a bit longer."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不买 爬楼真的麻烦 我住 3 层 实际爬楼 2 层 楼顶 7 楼阳台我都懒得去。。之前搬家前还打算在楼顶种花花草草来着",
          "en": "Don't buy it. Climbing stairs is really a pain. I live on the 3rd floor, which is actually the 2nd floor physically, and I'm too lazy to go to the 7th-floor rooftop balcony... I was even planning to plant flowers and grass on the roof before I moved."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "就是你说的这几个问题，家里房子还有物业呢找修了好几次还是漏，最后受不了了自己花了几千块弄好了，但是也不保证下次啥时候漏。夏天都还好，开空调也凉快，但是冬天是真的冷，开空调都不顶事，尤其室外温度低的时候，只能再掏出来个电油汀之类的才好点，房间大了非得电费也多很多。",
          "en": "It's exactly the problems you mentioned. I have a property management company, but even after they fixed the leaks several times, it still leaked. I couldn't stand it anymore, so I spent several thousand RMB to fix it myself, but there's no guarantee when it will leak again. Summers are fine, air conditioning keeps it cool, but winters are really cold, and air conditioning doesn't help much, especially when the outdoor temperature is low. You have to pull out an oil heater or something to make it better, and if the room is large, it definitely costs a lot more in electricity."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我住顶楼。爬楼能忍受，买东西特别是大件比较麻烦，搬运太受限了，我自己买了个小桌子抬上来也累死。漏水遇到过，越老的房子越容易漏，我家是雨水管那里，不过没漏到家里。冬冷夏热感知不明显。除此以外就是安静，这一点也是我买的主要目的。",
          "en": "I live on the top floor. I can tolerate climbing stairs, but buying things, especially large items, is quite troublesome. Transportation is very limited. I was exhausted just carrying a small table up myself. I have experienced leaks. The older the house, the more likely it is to leak. In my case, it was from the rain pipe, but it didn't leak into the house. The cold in winter and heat in summer are not noticeably significant. Other than that, it's quiet, which is my main reason for buying it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "买房迫在眉睫，这里一刻都不想租了。马上又得续租，差点就动摇了，还得是强大的 v 站。",
          "en": "Buying a house is imminent, and I don't want to rent here for another moment. I have to renew my lease soon. I was almost swayed, but thankfully, there's the powerful V2EX community."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别买，价格再低也别买。漏雨之类的只要是房子不是太破，做个防水问题不大但是其他缺点就多了去了。夏天特别热，动态特别冷；开空调多费的电费钱加上去可以换个低层了。夏天用水量大的时候水压不够，水特别小；买个东西尤其是大一点的家电啥的，拿上楼真的累死；定个桶装水，送水的师傅都不上，或者要加钱；非要说优点，也有安静，基本上没人打扰，小偷都懒得上来如果楼顶上不去，更安静，听不到别人的脚步声或者椅子腿地上摩擦的声音，也听不到弹珠掉在地上的声音如果顶楼可以上去，晒衣服被子方便，有的还可以在上面种种花草和蔬菜不怕下水道堵塞，堵了也殃及不到自己家",
          "en": "Don't buy it, even if the price is very low. Rain leaks are not a big problem as long as the house isn't too dilapidated, you can waterproof it. But there are many other disadvantages. It's very hot in the summer and extremely cold in the winter; the extra electricity bill for air conditioning adds up to the cost of a lower floor. The water pressure is insufficient in the summer when there is a high demand for water, and the water flow is very low. It's extremely tiring to carry things upstairs, especially large appliances. When you order bottled water, the delivery guys won't bring it up, or they'll charge extra. If I had to say a benefit, it's quiet, basically no one bothers you, and even thieves don't bother coming up. If you can't access the roof, it's even quieter. You can't hear other people's footsteps or the sound of chair legs scraping on the floor, or the sound of marbles dropping on the floor. If you can access the top floor, it's easy to dry clothes and bedding, and some people can grow flowers, grass, and vegetables on it. You don't have to worry about the sewer being clogged, because it won't affect your home."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不建议买顶楼：1. 大概率漏水和渗水，物业维修金没有的话要自己出钱，有的话挨家挨户签名也很麻烦，万一有一些头铁不签名，只能自己掏钱。2.  夏天太热，有些人在楼顶铺隔热层，同样要经过物业允许，如果不允许就无解，如果有同栋头铁反对，基本没办法。",
          "en": "I don't recommend buying the top floor: 1. High probability of leaks and seepage. If there is no property maintenance fund, you have to pay for it yourself. If there is, it is very troublesome to get signatures from door to door. If some stubborn people don't sign, you can only pay for it yourself. 2. It's too hot in the summer. Some people lay insulation on the roof, which also requires property management permission. If it is not allowed, there is no solution. If some stubborn people in the same building object, there is basically no way."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没电梯，楼顶老破小强烈不建议。楼顶漏水很难搞的，不是说你有钱就可以。你不知道下次漏水会是什么时候到来。",
          "en": "No elevator, strongly not recommended for old, small, top-floor apartments. Roof leaks are very difficult to deal with, it's not just a matter of having money. You don't know when the next leak will come."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我没买过房，但在北京租过房，很不幸好几次都是顶楼漏水倒没遇到，因为北京很少小雨夏暖是肯定的，很明显能感觉是那种晒出来的热，大早上就要开空调了。冬凉倒还好，北京暖气还行爬楼的绝望，年轻人还行，老人小孩真不行转手流通性，这个肯定，你看你自己都发帖了",
          "en": "I've never bought an apartment, but I've rented apartments in Beijing, and unfortunately, I had several experiences of top-floor leaks... well, I didn't encounter leaks, because Beijing rarely has light rain. It's definitely hot in the summer; you can clearly feel the heat from the sun, and you have to turn on the air conditioner early in the morning. It's okay to be cool in the winter, Beijing's heating is pretty good. The despair of climbing stairs is okay for young people, but not for the elderly and children. Resale liquidity, for sure. Look, you've even posted about it yourself."
        }
      ],
      "type": "replies"
    }
  ]
}