{
  "id": 1114223,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "逆向从众？有没有同样不追热点的朋友",
          "en": "Reverse conformity? Are there any friends who also don't chase after hot topics?"
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "不知道有没有同样的朋友，面对爆火的事物，我会选择拒绝，甚至有点抗拒。\r\n\r\n比如短视频，身边人早就沉迷其中吧，但是我到现在连抖音账号都没注册过（绝对没有我的手机号），最近《哪吒》电影大火，朋友圈、微博，自媒体全是讨论，在大众世界太过于火火火了，我甚至有点“咄之以鄙”。\r\n\r\n也就是当某个事物被太多数人追捧时，我反而会本能地产生抵触情绪，有一种逆反心理。\r\n\r\n不过，我并不是完全排斥流行文化，对于中度流行的东西，我反而能接受的，甚至会去主动去了解。但相比之下，我更喜欢小众的东西，可能是因为它们更有个性，也更符合自己的审美和兴趣。\r\n\r\n不知道有没有同样感觉的朋友？你们是如何看待这种心理的？会不会有时候也觉得自己错过了一些好东西或机会？",
          "en": "I wonder if there are any friends who feel the same way. When faced with something that's become extremely popular, I choose to reject it, even resist it a little.\r\n\r\nFor example, short videos. The people around me have long been addicted, but I haven't even registered for a Douyin account (absolutely not with my phone number). Recently, the movie 'Ne Zha' became a huge hit, with discussions all over social media, Weibo, and self-media. It's just too hot in the mainstream world, and I even feel a bit 'disdainful' towards it.\r\n\r\nIn other words, when something is sought after by too many people, I instinctively feel resistance, a kind of rebellious attitude.\r\n\r\nHowever, I don't completely reject popular culture. I can accept things that are moderately popular, and I might even actively try to understand them. But compared to that, I prefer niche things, probably because they have more personality and are more in line with my own aesthetics and interests.\r\n\r\nI wonder if there are any friends who feel the same way? How do you view this psychology? Do you ever feel like you've missed out on some good things or opportunities?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "有没有考虑法系车",
          "en": "Have you considered French cars?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以再进一步，单纯地拒绝评价自己不了解的事、物、人。有时候「拒绝从众」只是另一个角度的「从众」。",
          "en": "You can go a step further and simply refuse to evaluate things, objects, or people you don't understand. Sometimes 'refusing to conform' is just another form of 'conformity' from a different angle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "只关注自己喜欢的东西, 只关注别人不喜欢的东西. 是两码事.",
          "en": "Only focusing on what you like, and only focusing on what others don't like are two different things."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "真不在乎就不会生出情绪了，嘴上说不在乎，内心还是受影响",
          "en": "If you really didn't care, you wouldn't have any emotions. Saying you don't care doesn't mean you aren't affected inside."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因为在装逼呗。有人追热点装逼。你反其道而行之，装不随波逐流的逼。你的帖子里有“咄之以鄙”这个成语，这也印证了我的推断。是不是在那种心境下感觉自己很牛逼，整个人都升华了。都正常，哪有人有逼不装的。",
          "en": "Because you're showing off. Some people show off by chasing hot topics. You're doing the opposite, showing off that you don't follow the crowd. The idiom '咄之以鄙' in your post confirms my deduction. Do you feel very awesome in that state of mind, like your whole person is sublimated? It's all normal, who doesn't like to show off."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "好一副众人皆醉你（们）独醒",
          "en": "What a picture of 'everyone is drunk but you (plural) are sober'."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这种心理大多都是因为不够包容，只注重自己的感受。",
          "en": "This kind of psychology is mostly due to a lack of inclusiveness, only focusing on one's own feelings."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你和我初中的时候一样。 简单来说就是自己想法更多一些。",
          "en": "You are just like me when I was in junior high school. Simply put, you just have more of your own ideas."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "ChatGPT 爆火你用不用？ deepseek 爆火你用不用？这时候你怎么不「逆向从众」了？",
          "en": "ChatGPT is a hit, do you use it? Deepseek is a hit, do you use it? Why don't you 'reverse conform' at this time?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@xiaocongcong1 #14 其实就是想标新立异，结果把底裤都漏出来了，有点像 20 年前的 MSN 党看不起 QQ 一样的。",
          "en": "@xiaocongcong1 #14 Actually, you just want to be different, but you ended up revealing your underwear. It's a bit like the MSN users from 20 years ago looking down on QQ."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我不是主动逆向, 而是单纯的懒, 明明生活中有那么多能安安静静享受的东西, 没必要去追求和别人同步, 虽然我也会看看热点, 刷刷短视频, 但都是随缘, 看不到不是我的损失, 看到了是我的荣幸",
          "en": "I'm not actively against the grain, but purely lazy. There are so many things in life that can be enjoyed quietly, there's no need to pursue synchronization with others. Although I also look at hot topics and watch short videos, it's all random. Not seeing them isn't my loss, seeing them is my honor."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "喜欢一件事，是不需要理由的。至于那件事是万众皆喜还是自己的独特口味，一点也不重要。",
          "en": "Liking something doesn't need a reason. Whether that thing is universally loved or your own unique taste, it doesn't matter at all."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "在中国追求小众是一件很大众的事情",
          "en": "In China, pursuing niche interests is a very mainstream thing."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还中二时是这样的。现在只要合适，无不可。",
          "en": "That's how it was when I was still in my chuunibyou phase. Now, as long as it's appropriate, anything is fine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "因为别人的行为而喜欢或不喜欢某一个事物，而不是因为这个事物本身，我觉得你可能只是想标榜自己的特殊，根本不知道自己到底喜欢什么",
          "en": "Liking or disliking something because of other people's behavior, rather than because of the thing itself, I think you might just want to show off your uniqueness and don't even know what you really like."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "笑。。。不玩抖音是因为看到同事刷抖音还是快手时，一个又一个下拉时，那种面无表情，失神状态，而不是内容有多精彩。当然这 1/2 年接受了 B 站。哪吒就算了，看见那张图片就欣赏不来，前一集都没想点开看，可能渐渐也懂得博眼球。老板问我应该更懂 deepseek ，我反而回答用不起来。。。看来就如他所说真的会被时代淘汰。这不连财务的 office 培训都带 AI 两字。买东西时我最喜欢挑不懂的广告词去搜索，这个时代就是喜欢牛在天上飞，人在地上吹。各种神名词。这不最近买了台德业除湿机，第 5 代高精准温湿度传感器，结果非工作状态根本就不准。被忽悠多了，也逐渐熟悉各种套路。狼来了，编吧。。。",
          "en": "Haha... I don't use Douyin because when I see my colleagues scrolling through Douyin or Kuaishou, going from one video to the next, their expressions are blank and they're in a daze, it's not because of the content. Of course, I've accepted Bilibili in the past year or two. As for Ne Zha, forget it, I can't appreciate that picture, I didn't even want to click on the first episode, maybe I'm gradually understanding the tricks to grab attention. My boss asked if I should know more about Deepseek, but I replied that I can't use it... It seems that, as he said, I will really be eliminated by the times. Even the finance department's Office training now includes the word AI. When buying things, I like to pick out ad slogans I don't understand and research them. This era likes to have cows flying in the sky and people blowing hot air on the ground. All sorts of magical terms. I recently bought a Deeye dehumidifier with a 5th-generation high-precision temperature and humidity sensor, but it's not accurate at all when it's not working. After being fooled so much, I'm gradually becoming familiar with the routines. The wolf is coming, keep making it up..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "很少刷抖音，注册账号只给儿子传了个 mc 解说。哪吒 1 2 都没看，流浪地球 1 2 也没看。ds 我去年 2 月内测用户，去年用的多。今年他火了后 我反而用的少了（卡也是一个原因）但我会刷 v2 推特，看权力的游戏，grok3 也会跟风体验",
          "en": "I rarely use Douyin. I only registered an account to upload an MC commentary for my son. I haven't watched Ne Zha 1 or 2, or Wandering Earth 1 or 2. I was an internal beta user of DS last February and used it a lot last year. After it became popular this year, I used it less (the lag is also a reason). But I browse V2 and Twitter, watch Game of Thrones, and also try Grok3 when it's trendy."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有很多人喜欢的 cursor windsurf 我体验后感觉不太适合我。但会常用 zed 的 AI assistant",
          "en": "Also, I tried the popular Cursor Windsurf and felt it wasn't suitable for me. But I often use Zed's AI assistant."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "抖音，小红书等各种短视频平台都没注册过，平时娱乐是刷 b 站自己感兴趣的 up哪吒电影什么的，会去看，看看是不是真的那么好DeepSeek ，Claude ，Openai 等大模型会去体验，感受技术进步带来的冲击，喜欢这类新事物体验后感觉很火的东西，有的的确很不错，有的也比较一般，总之，自己去感受吧，享受体验的过程最重要",
          "en": "I haven't registered for Douyin, Xiaohongshu, or any other short video platforms. My usual entertainment is browsing Bilibili for UP content that interests me. As for Ne Zha movies, I'll watch them to see if they're really that good. I'll try out large models like DeepSeek, Claude, and OpenAI to experience the impact of technological progress. After experiencing these kinds of new things that are very popular, some are indeed very good, and some are just average. In short, experience it for yourself and enjoy the process."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这倒没有。我四十多了，不想完全落伍，但是也不愿在不喜欢的事情上从众。话说我还以为楼主是讨论逆向的。。。",
          "en": "Not really. I'm in my forties and don't want to be completely out of touch, but I also don't want to conform to things I don't like. By the way, I thought the original poster was discussing reverse engineering..."
        }
      ],
      "type": "replies"
    }
  ]
}