{
  "id": 1109072,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "关于结婚这件事，大家帮帮我",
          "en": "Regarding this matter of marriage, everyone please help me."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "背景：已经到了准备定亲阶段，女朋友目前不愿生小孩，觉得生小孩会降低生活质量。",
          "en": "Background: We've reached the stage of preparing for engagement, but my girlfriend currently doesn't want to have children, as she feels it would reduce her quality of life."
        },
        {
          "zh": "我个人是想要的",
          "en": "Personally, I want to have children."
        },
        {
          "zh": "前提：\r\n1.与女朋友谈了 7 年 \r\n2.两人目前年收入总共税后 50 万 \r\n3.她是县城父亲国企独生女 \r\n4.我是哥姐已置业结婚，农村父母自交社保，珠三角市区非广深留了一套房。\r\n5.两人的工作不能保证稳定",
          "en": "Premise:\n1. Been dating my girlfriend for 7 years.\n2. Our current total annual income after tax is 500,000.\n3. She is the only daughter of a father working in a state-owned enterprise in a county-level city.\n4. My older siblings have already bought houses and gotten married. My rural parents pay their social security themselves. I have a property in a non-Guangzhou/Shenzhen city in the Pearl River Delta.\n5. Neither of our jobs can guarantee stability."
        },
        {
          "zh": "之前已经谈了许多结婚的事情。",
          "en": "We've already discussed many things about marriage before."
        },
        {
          "zh": "她的父亲要求要有自己的房子（要有她名），彩礼 10W 。",
          "en": "Her father requires her to have her own house (with her name on it) and a bride price of 100,000."
        },
        {
          "zh": "关于房子：给我爸 30W ，房子(市值打折能卖 60W ）转给我两，我爸之前是很强烈的排斥的，他说转给我要 10 万都行，但是得知她爸要求加名字就比较生气，反复沟通以后终于松口。",
          "en": "Regarding the house: Give my dad 300,000, and the house (market value discounted, can be sold for 600,000) will be transferred to both of us. My dad was initially strongly opposed to this. He said he'd be fine transferring it for even 100,000, but he got angry when he learned that her dad required her name to be added. After repeated communication, he finally relented."
        },
        {
          "zh": "在付完这个钱以后，我个人存款应该只有 10 几万，之前她知道了这个事情，觉得会把我的存款掏空，她就不是很乐意了，她只同意给我爸 20W 。",
          "en": "After paying this money, my personal savings should only be a little over 100,000. She knew about this beforehand and wasn't very happy because she felt it would drain my savings. She only agreed to give my dad 200,000."
        },
        {
          "zh": "这一块上面，我已经来回沟通了很久，而且我觉得我已经占了很大的一部分了，毕竟我还有哥哥姐姐。",
          "en": "I've communicated back and forth about this for a long time, and I feel like I've already taken a large share, considering I also have older siblings."
        },
        {
          "zh": "我也说了 10 万块钱并不多，她只有一句话：我要的是一个态度",
          "en": "I also said that 100,000 yuan isn't a lot, but she only has one sentence: I want an attitude."
        },
        {
          "zh": "昨晚从老家回来，我说我们今年 8 月订婚怎么样，又进行了一轮深聊，原来房子彩礼什么的，只是结婚的第一步。",
          "en": "Last night, after returning from my hometown, I suggested we get engaged in August this year. We had another in-depth conversation. It turns out that the house, bride price, etc., are just the first steps of marriage."
        },
        {
          "zh": "她对我两的收入稳定性与稳定性有很大的不安全感，其实我现在的收入水平与潜力并不能让她愿意生孩子，",
          "en": "She has a great sense of insecurity about the stability and stability of our income. In fact, my current income level and potential are not enough to make her willing to have children."
        },
        {
          "zh": "只觉心灰意冷。",
          "en": "I just feel disheartened."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "已婚人士建议谨慎和她结婚，过于现实了，结了婚也是一团糟，不要为结而结",
          "en": "Married people suggest being cautious about marrying her. She's too realistic, and marriage will be a mess. Don't marry for the sake of marrying."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "清官难断家务事，核心不就是她不满意你，不想给你生，你不分了赶紧找个能给你生的，自己 emo 干啥",
          "en": "It's hard for an honest official to settle a family dispute. The core issue is that she's not satisfied with you and doesn't want to have children with you. If you don't break up, quickly find someone who can give you children. Why are you being emo?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "女人不愿生就是不爱，没别的可能",
          "en": "If a woman doesn't want to give birth, it means she doesn't love you. There's no other possibility."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@frankkly “两人税后 50”这个条件都不适合生小孩。",
          "en": "@frankkly \"A combined income of 500,000 after tax\" is not suitable for having children."
        },
        {
          "zh": "那全地球有多少适合生的？",
          "en": "Then how many people on the entire planet are suitable to have children?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "年入 50w 为啥你们会没存款？",
          "en": "Why don't you have savings with an annual income of 500,000?"
        },
        {
          "zh": "另外\"我要的是一个态度\" 是服从性测试",
          "en": "Also, \"I want an attitude\" is a compliance test."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "去年我老婆跟她朋友做媒，把老婆村里的一个男的撮合成功了，说一下这俩人的背景，坐标苏北。",
          "en": "Last year, my wife acted as a matchmaker for her friend and successfully matched a man from my wife's village. Let me tell you about the backgrounds of these two people; the location is northern Jiangsu."
        },
        {
          "zh": "男生：父母在相亲之前就给男生全款购买了一辆日产天籁，以及当地一套房(位置不太好)附带车库，但是男生目前上班的公司是南京(国企)的，工作地也在上班，但是根据项目后期可能会换地方，薪资大概一万多，父母都是从事体力劳动，没有医保和养老金，有一个姐姐，但是嫁到浙江去了，姐姐的老公家庭条件比较好(住别墅)，平日里的衣服还有一些日用品都是姐姐出钱买的，并且声称只要婆家还有钱，家里的这些花销都由姐姐来承担。",
          "en": "Male: Before the matchmaking, his parents bought him a Nissan Teana in full and a house with a garage in the local area (not in a very good location). However, the man's current company is in Nanjing (state-owned enterprise), and he works there. However, depending on the project, he may be transferred to another location later. His salary is about 10,000+. His parents are both engaged in physical labor and do not have medical insurance or a pension. He has an older sister, but she married in Zhejiang. Her husband's family conditions are pretty good (lives in a villa). Usually, clothes and some daily necessities are paid for by her sister. She also stated that as long as her in-law's family has money, these household expenses will be borne by the sister."
        },
        {
          "zh": "女生：父母貌似没有养老金和医保(听我老婆讲的不太清楚是否准确)，但是声称有几十万的养老钱，所以女方的一切彩礼和五金之类一概不碰，全部给女儿，女方目前没有一份稳定的工作，并且答应婚后去南京找工作跟男方先一起住，女方名下有一辆女方父母全款购买的马自达 3 ，并且女方家房子是村里的商品房，并非是市区范围内的房子，女方名下没有单独的房产，女生是独生女。",
          "en": "Female: Her parents do not seem to have a pension or medical insurance (from what my wife said, I'm not sure if this is accurate), but her parents say they have hundreds of thousands of yuan for retirement. Therefore, the woman does not touch any of the bride price, gold jewelry things, etc. All of that will be given to the daughter. The woman currently does not have a stable job and agreed to go to Nanjing after marriage to find a job and live with the man first. The woman has a Mazda 3 that her parents bought in full, and the woman's family house is a commercial house in the village, not a house in the city. The woman does not have a separate property under her name. The girl is an only child."
        },
        {
          "zh": "彩礼 18 万 8 ，五金加起来差不多 6-8 万，还有 2 万的钻戒，还有什么改口费、抬轿礼之类的另算，然后这些钱全部让女生一个人所有，就是只进她一人的口袋，至于后期是否给二人使用，目前还没松口。",
          "en": "The bride price was 188,000, the gold jewelry added up to almost 60,000-80,000, and there was also a 20,000 yuan diamond ring, as well as a name change fee, palanquin carrying fee, etc., which are calculated separately. Then all this money is for the woman to own alone; the money goes directly into her personal pocket. As for whether the two of them will use it later, they have yet to agree."
        },
        {
          "zh": "然后婚期都订下来过后，女生(不清楚是女生自己的意思，还是女生父母的意思)，要求当地的房子保留不卖的情况下，还要让男方多出 30-50 万，加上女生自己出钱(不清楚是彩礼钱还是自己的存款)，付首付在南京购房，并且写上俩人的名字，这件事情，让男方的父母头都大了，因为买房买车已经掏空全部家底了，再加上后期还有婚礼的费用，所以手头上基本上没剩多少钱了，额外的钱肯定是拿不出来的，最后，几经沟通后，女生说，那不在南京买房也行，把当地的房子卖了，然后在当地买一套 200 多平以上的别墅。",
          "en": "Then, after the wedding date was set, the woman (it is unclear whether this was the woman's own idea or her parents' idea) requested that the local house be kept and not sold and that the man pay an additional 300,000-500,000 yuan, plus the money that the woman contributes herself (it is unclear whether that would come from the bride price or her own savings) to put down a down payment for a house in Nanjing and have both of their names written on the title. This matter gave the man's parents a headache because buying a house and a car had already emptied out all their savings, and in addition, there were later wedding expenses, so they basically did not have much money left on hand. They definitely could not come up with the extra money. Finally, after several communications, the woman said that it would be okay not to buy a house in Nanjing and sell the local house and then buy a villa of more than 200 square meters in the local area."
        },
        {
          "zh": "不知道 OP 看到这段有什么感想？",
          "en": "I wonder what OP thinks after seeing this?"
        },
        {
          "zh": "你的情况跟我上面说的并没有本质的区别，当然，你可能觉得你的女朋友比我例子里的可能好一点，但是，都一个样，全篇充满了计算和算计，以及觉得自己嫁过去吃亏了，所以才有各种各样的条款，本质就是没啥感情，或者对你的感情淡了，所以才可以用最理性的方式对待你，理性本没有错，但是把这种理性全部用在自己枕边人身上，说好听点是为了这个家，说难听点，不就是为了离婚做准备？",
          "en": "Your situation is not essentially different from what I said above. Of course, you may think that your girlfriend may be a little better than the one in my example, but they are all the same. The whole thing is full of calculations and plotting, and she feels that she will suffer if she marries you. That's why there are all sorts of clauses. The essence is that there is no emotion, or her feelings for you have faded, so she can treat you in the most rational way. Rationality is not wrong in itself, but using this rationality entirely on your bedfellow, to put it nicely, is for the sake of this family, and to put it bluntly, isn't it just preparing for a divorce?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "兄弟，好心提醒一句，月入 2W 的女人，男方至少要她 2-3 倍的工资才能在婚姻中握有主导地位，不是说你能力不好，而是现在女人都很有“主见”，婚后会无限放大你的缺点。",
          "en": "Brother, a friendly reminder, for a woman earning 20,000 per month, the man must earn at least 2-3 times her salary to maintain a dominant position in the marriage. It's not that you're not capable, but women nowadays are very \"opinionated\" and will infinitely magnify your shortcomings after marriage."
        },
        {
          "zh": "来自刚离婚的老哥建议。",
          "en": "Advice from a recently divorced brother."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "《你挑的嘛偶像》你女朋友挺理性的。",
          "en": "《You Picked It, Idol》 Your girlfriend is quite rational."
        },
        {
          "zh": "不是冒犯，没好的物质条件，小孩生下来也遭罪。",
          "en": "No offense, but without good material conditions, children will suffer if they are born."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "不生娃就没必要结婚了，一直谈恋爱不就行",
          "en": "If you're not having kids, there's no need to get married. Just keep dating."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "帮不了你，7 年不是网友的嘴炮可以轰开的城墙！",
          "en": "Can't help you. Seven years is not a city wall that internet users' verbal attacks can bomb open!"
        },
        {
          "zh": "祝好，加油！",
          "en": "Wish you well, and good luck!"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "还有按照你的描述，我都感受不到女方的爱与退让，只有利益，只有锱铢必较，难道你自己感受不到吗？",
          "en": "Also, according to your description, I don't feel any love or compromise from the woman's side, only interests, only penny-pinching. Don't you feel it yourself?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我也觉得建议分手，不谈什么生孩子不生孩子之类的，楼主女朋友爸爸就不是省油的灯，还有楼主女朋友做电商有什么好得瑟的，臭电商打工仔有什么好牛气的。",
          "en": "I also suggest breaking up. Let's not talk about having children or not. OP's girlfriend's father is not an easy person to deal with. Also, there's nothing to brag about in OP's girlfriend working in e-commerce. What's so great about a lousy e-commerce worker?"
        },
        {
          "zh": "IT 和电商确实都不稳定，不过电商裁员会更快而且更疯狂，电商比 IT 更卷。",
          "en": "IT and e-commerce are indeed unstable, but e-commerce layoffs are faster and more crazy. E-commerce is more competitive than IT."
        },
        {
          "zh": "楼主女朋友以及她家人其实没有多看得上楼主，楼主结婚了就是一个受气包，搞得楼主好像受了女朋友多大恩惠似的，已经可以看到未来了，那就是楼主每天会被女朋友唠叨，说楼主不够强不够厉害挣钱不多，找这种女的结婚就是找罪受，这种女性烂货色现在比例很高呀，所以建议分手。",
          "en": "OP's girlfriend and her family don't really look up to OP. If OP marries her, he will be a punching bag, making it seem like OP has received a great favor from his girlfriend. I can already see the future, which is that OP will be nagged by his girlfriend every day, saying that OP is not strong enough, not good enough, and doesn't earn enough money. Marrying this kind of woman is just asking for trouble. The proportion of this kind of rotten woman is very high now, so I suggest breaking up."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "看了这么大一个帖子，看到后面都不想看了说说我身边的故事包括我自己的1 、我老婆是她姑姑牵线认识的，适婚年龄，彩礼开始说好 6.66W ，后面未婚怀孕，坐地起价，拿娃儿威胁我，要我 10W ，我没答应，她回去赌气一个多月，后面我硬刚她妥协，6.66W 了事，但是婚礼没办（也有多方面因素，包括父母的，婆媳关系等）我觉得我这种直男性格也蛮好，少跟我算计，开始我对她姑姑抱有莫大的敌意（涨价是绝壁是她姑姑作梗），至今娃快 4 岁了，这婚结得也憋屈。。。",
          "en": "After reading such a long post, I didn't even want to finish it. Let me tell you about the stories around me, including my own. 1. I met my wife through her aunt. She was of a marriageable age. The bride price was initially agreed upon as 66,600. Later, she became pregnant out of wedlock and raised the price. She threatened me with the child and wanted 100,000 from me. I didn't agree. She went back and sulked for more than a month. Later, I stood my ground, and she compromised. 66,600 settled the matter, but the wedding was not held (there were also many factors, including my parents and the relationship between my mother-in-law and daughter-in-law, etc.). I think my straightforward personality is pretty good. Don't scheme with me too much. I started to have great hostility towards her aunt (the price increase must have been her aunt causing trouble). Now that our child is almost 4 years old, this marriage still feels constricted..."
        },
        {
          "zh": "2 、我一朋友，他是西安周边县农村的，家里条件很一般，母亲身体还不好，好在自己比较有想法有冲劲；女方好像也是独生女还是两个女，不记得了，反正是小女，南昌的，老丈人早年华强北做生意的，我朋友给了彩礼 30W ，老丈人立马还他 50W 现金（他没要）；现在同住一个小区，丈母娘给他带娃煮饭，做好后端过来。。。",
          "en": "2. A friend of mine, he's from a rural county near Xi'an. His family conditions are very average, and his mother's health is not good. Fortunately, he has his own ideas and drive. The woman seems to be an only child or one of two daughters. I don't remember, but anyway, she's the younger daughter, from Nanchang. Her father-in-law used to do business in Huaqiangbei. My friend gave a bride price of 300,000, and his father-in-law immediately returned 500,000 in cash (he didn't want it). Now they live in the same community, and his mother-in-law takes care of his child and cooks for him. She brings the food over after it's done..."
        },
        {
          "zh": "你看这老丈人、女婿都是开明人啊，是不是羡煞你我所以遇到结婚的时候还来算计的，打心眼都是下作之人",
          "en": "Look, these father-in-law and son-in-law are all understanding people. Aren't they the envy of us all? So they meet at the time of marriage and still calculate. From the bottom of my heart, I think they are lowly people."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这种情况结个集贸, 结完也得离",
          "en": "In this case, it's like a market transaction. You'll end up divorced even if you get married."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "“我要的是一个态度” 那房子过户后再过回去她是否同意“其实我现在的收入水平与潜力并不能让她愿意生孩子” 那以后万一失业她是否愿意继续这段婚姻",
          "en": "\"I want an attitude.\" Would she agree to transfer the house back after it's transferred to her? \"In fact, my current income level and potential are not enough to make her willing to have children.\" If you lose your job in the future, will she still be willing to continue this marriage?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "省流：《我要的是一个态度》",
          "en": "TL;DR: 《I want an attitude》"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没有感情，全是算计。",
          "en": "No feelings, just calculations."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "女生比我们想象的要现实多，基因里面就对安全感就有很天然的执念，但感觉你们收入再国内不算抵呀，7 年的感情为了所谓的未来不安全感，就不愿一起前进了？",
          "en": "Girls are more realistic than we imagine. They have a natural obsession with security in their genes. But it feels like your income isn't low in China. After 7 years of relationship, you're unwilling to move forward together because of so-called future insecurity?"
        },
        {
          "zh": "感觉不太能理解。",
          "en": "I can't really understand."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "或者爷们儿点儿 多谈几个 谁有种娶谁 要绝种的干啥？",
          "en": "Or be more of a man and date a few more. Whoever has the guts to marry, marry them. Why bother with someone who is going extinct?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "md 税后 50w 还有这问题，我想不通",
          "en": "Damn, with 500,000 after tax, there's still this problem. I can't figure it out."
        }
      ],
      "type": "replies"
    }
  ]
}