{
  "id": 1112677,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "关于要不要在老家建房，麻烦各位给点建议",
          "en": "Regarding whether to build a house in my hometown, I would appreciate some advice."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "首先介绍下背景，我老家是在广东大概是四五线的城市，我上班这么多年都是在广东省内打工，基本上就过年和国庆回老家，我目前在纠结的点就是害怕自己失业，这两年基本是上一年班就换一家公司，加上年龄也快三十了，学历还是成人大专，去年年底找到工作又入职了某个小公司干码农，薪资不到 1w ，要是建的话基本把我和我父母的钱都用完了，手里存款大概 30 个 w ，再找我几个姐姐要点能到 40w ，现在家里人把要不要建房的主意给我到了我这边，让我做决定建还是不建...",
          "en": "First, let me introduce the background. My hometown is a tier 4 or 5 city in Guangdong. I've been working in Guangdong province for many years, and I basically only go back home during the Chinese New Year and National Day holidays. The point I'm struggling with right now is that I'm afraid of losing my job. In the past two years, I've basically changed companies every year. Plus, I'm almost 30 years old and only have an adult associate degree. At the end of last year, I found a job and joined a small company as a coder, with a salary of less than 10,000 yuan. If I build a house, it will basically use up all the money of me and my parents. I have about 300,000 yuan in savings, and I can get a little more from my sisters, up to 400,000 yuan. Now my family has passed the decision of whether or not to build a house to me, asking me to decide whether to build or not..."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "你这倾家荡产建房有什么意义，父母在老家住吗？",
          "en": "What's the point of building a house if it means going bankrupt? Do your parents live in your hometown?"
        },
        {
          "zh": "回老家建房的都是在外面赚到钱了，衣锦还乡回去建房给相亲们看的。",
          "en": "People who build houses in their hometowns are usually those who have made money outside and are returning home in glory to show off to their neighbors."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你这个收入、年龄和存款，个人建议，可以建。",
          "en": "Given your income, age, and savings, my personal suggestion is that you can build."
        },
        {
          "zh": "如未来在城市买房，你这个收入压力是非常大的，更何况还养小孩。",
          "en": "If you want to buy a house in the city in the future, your income will be under a lot of pressure, let alone raising children."
        },
        {
          "zh": "现在虽然掏空了建房，但你的三件人生大事之一算是解决了 1 个，还没有贷款。",
          "en": "Although building the house will deplete your savings, one of the three major life events has been solved, and you don't have any loans."
        },
        {
          "zh": "以后存钱结婚养小孩就行了，有钱富养没钱穷养。",
          "en": "You just need to save money for marriage and raising children in the future. If you have money, raise them well; if you don't have money, raise them frugally."
        },
        {
          "zh": "而且，显然你父母也是还会在世少说二三十年的，重建后他们也是住的很开心的，这一点很难得。",
          "en": "Moreover, it's obvious that your parents will live for at least another twenty or thirty years, and they will be very happy living in a rebuilt house. This is very rare."
        },
        {
          "zh": "！再一个，老一辈都有老家房子重建/重装的执念，在邻居面前长脸，也希望后代无论走多远回来都有个不错的居住的地方。",
          "en": "Furthermore, the older generation has an obsession with rebuilding/renovating houses in their hometown to save face in front of their neighbors and hope that their descendants, no matter how far they go, will have a good place to live when they return."
        },
        {
          "zh": "但无奈能力有限，他们不愿说的太直白给子孙后代造成压力（毕竟得大家出钱）。",
          "en": "But unfortunately, their ability is limited, and they are unwilling to say it too directly to put pressure on their descendants (since everyone has to contribute money)."
        },
        {
          "zh": "综上，相信楼主会得到一个归于内心的答案。",
          "en": "In summary, I believe the original poster will get an answer that comes from the heart."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "离市区、县城繁华区多远？",
          "en": "How far is it from the city center or the prosperous areas of the county seat?"
        },
        {
          "zh": "市区超过 1 个小时、县城超过半个小时，就没必要掏空家底 30-50W 去建。",
          "en": "If it's more than 1 hour from the city center or more than half an hour from the county seat, then it's not worth emptying your pockets to build for 300,000-500,000 yuan."
        },
        {
          "zh": "有更多闲置资金在考虑。",
          "en": "Consider it when you have more idle funds."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "19 年广东揭阳，我出 30 万，父母出 30 万，60 万建了三层半，然后只装修了一层在住，外墙也没贴瓷砖。",
          "en": "In Jieyang, Guangdong in 2019, I paid 300,000 yuan, and my parents paid 300,000 yuan. We built a three-and-a-half story house for 600,000 yuan, and then only renovated one floor to live in. The exterior walls were not tiled."
        },
        {
          "zh": "如果你还是单身，后面难以在工作地买房，那我建议你搞起来，找老家的女孩子结婚还是有优势的。",
          "en": "If you are still single and it's difficult to buy a house where you work, then I suggest you do it. It's still advantageous to find a girl from your hometown to marry."
        },
        {
          "zh": "现在农村建房不容易，审批手续搞定才去做，不然会被折腾死。",
          "en": "It's not easy to build houses in rural areas now. Only do it after completing the approval procedures, otherwise you will be tortured to death."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我跟 op 的背景很像，也是 30 岁左右，在广州打工，老家广东四五线城市，也是基本过年和国庆回去（甚至如果后面没什么必要的话都不怎么想回去了），也是存款也差不多 30w ，但是没有父母支持，毕竟父母没有多少存款，而且父亲之前生病存款基本也花光了（就是要建的话，基本只能靠自己了）",
          "en": "My background is very similar to the original poster. I'm also around 30 years old, working in Guangzhou, and my hometown is a tier 4 or 5 city in Guangdong. I also basically only go back during the Chinese New Year and National Day holidays (and I don't even want to go back if it's not necessary). I also have about 300,000 yuan in savings, but I don't have my parents' support. After all, my parents don't have much savings, and they basically spent all of their savings when my father was sick (I have to rely on myself if I want to build a house)."
        },
        {
          "zh": "稍微不一样的地方是因为我那个地方地不够，我是和我哥一起建的，他建三层，我建两层，钱是花的各自的，包括楼层设计布局都是可以分开的。（但我选择基本保持一致，除非有我在意的地方）",
          "en": "The slight difference is that there is not enough land in my area, so I am building it together with my brother. He is building three floors, and I am building two floors. The money is spent separately, including the floor design layout can be separated (but I choose to basically keep it the same, unless there are places I care about)."
        },
        {
          "zh": "所以可能稍微能省点，但据他们估计说我建两层整体费用差不多 25-30w然后去年问的我，然后我这边是选择建了（但是每个人情况不同，经历也不同，请慎重参考），我的想法就是花个 20-30w 建个房算是给父母买个心安，毕竟像我这种 30 岁还单身的人，在农村都该被'判刑'了，而且同龄小时候的玩伴有的小孩子都可以打酱油了。",
          "en": "So it may save a little money. But according to their estimate, the overall cost of building two floors is about 250,000-300,000 yuan. I asked last year, and then I chose to build it (but everyone's situation is different, and their experiences are different, so please refer to it carefully). My idea is to spend 200,000-300,000 yuan to build a house as a reassurance for my parents. After all, people like me who are 30 years old and still single should be 'sentenced' in rural areas, and some of my playmates of the same age have children who can buy soy sauce."
        },
        {
          "zh": "对我而言比起钱，我跟注重的是自由，我算了一下我的消费物欲其实也没有很高，平时一些爱好基本就看书、唱歌（吼两嗓子）、打游戏、运动，有时候发发呆看视频啥的，大部分都不怎么花钱。",
          "en": "For me, I value freedom more than money. I calculated that my consumption desires are not actually very high. My usual hobbies are basically reading, singing (shouting a few words), playing games, exercising, and sometimes daydreaming and watching videos, which doesn't cost much money."
        },
        {
          "zh": "综合衡量了一下，最后就选择建了。",
          "en": "After comprehensive consideration, I finally chose to build it."
        },
        {
          "zh": "虽然以后我可能也不打算怎么回去了（如果可以的话），但是这些钱在我看来对我生活的提升并不大了（毕竟物欲就那样了），还不如换成'世俗的成功'，起码可以让在家里的老母亲能稍微抬起头，也是在变相地告诉他们，虽然我在外面没有多成功，但是也还能照顾好自己，让我野蛮生长就好。",
          "en": "Although I may not plan to go back much in the future (if I can), I don't think this money will improve my life much (after all, my material desires are just like that). It's better to exchange it for 'worldly success', at least to make my old mother at home a little more proud. It's also indirectly telling them that although I'm not very successful outside, I can still take care of myself, so let me grow wildly."
        },
        {
          "zh": "ps：准备月底裸辞了，但是也没打算回家，然后在出租屋躺着，打游戏，看看书，然后拾起之前的爱好，捣腾一下吃灰已久的 idea 列表，先让子弹飞一会这么多年一直在努力前进，不知道为了什么，建完这个房子后（虽然还在建，但是预计是今年的 5 、6 月份就能入伙），可算对家里有个交代了，往后可以认真思考一下我是谁，我想要干什么，我能干什么了",
          "en": "ps: I'm preparing to resign at the end of the month, but I don't plan to go home. I'll lie in the rental house, play games, read books, and then pick up my previous hobbies, tinker with the long-dusted idea list, and let the bullets fly for a while. I've been working hard for so many years, and I don't know why. After building this house (although it's still under construction, but it's expected to be completed in May or June this year), I can finally give my family an explanation. I can seriously think about who I am, what I want to do, and what I can do."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这事完全看你能不能回去工作，但是大城市你都害怕失业呢，回小城市你还能干啥。",
          "en": "It completely depends on whether you can go back to work. But you are afraid of losing your job in big cities, so what can you do if you go back to smaller cities?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan 估计回不去，我都在想着要是再被裁员就随便找一份工作活着了，所以现在就很纠结",
          "en": "@coderluan I guess I can't go back. I'm thinking that if I get laid off again, I'll just find a job to survive, so I'm very tangled now."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我是很想老家建房，但是不给建啊，我想老了回乡下，主要乡下离市区也近，交通也很便利。",
          "en": "I really want to build a house in my hometown, but they don't allow it. I want to go back to the countryside when I'm old. The main reason is that the countryside is close to the city and the transportation is very convenient."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这个钱拿去广州增城可以买个户型不错 100 多方的商品房了，月供也很少。",
          "en": "This money can be used to buy a commercial house with a good layout of more than 100 square meters in Zengcheng, Guangzhou, and the monthly payment is very small."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@evan9527 目前是父母住，主要考虑到老房子因为隔壁邻居重新建房导致我这边的房屋有些地方出现裂痕了，加上家里人都建议重新建了，还说趁父母还在建房的那些流程他们可以帮忙搞，以后要是不在了你自己还不会搞",
          "en": "@evan9527 Currently, my parents live there. The main consideration is that the old house has some cracks in some places because the neighbor next door rebuilt their house. Plus, my family all suggested rebuilding it, and said that while my parents are still around, they can help with the building procedures. If they are gone in the future, you won't be able to handle it yourself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sssmm666 那你纠结啥，怕之后不让建了吗，否则你等真回去了再建啊，不回去这钱不是纯浪费吗？",
          "en": "@sssmm666 Then what are you struggling with? Are you afraid that they won't allow you to build it later? Otherwise, wait until you really go back to build it. Isn't this money a pure waste if you don't go back?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@BeforeTooLate 我也是想建的，但是就考虑到自己这边的经济问题，加上这两年的环境不太好，感觉自己随时会失业的",
          "en": "@BeforeTooLate I also want to build it, but I'm considering my own financial problems, plus the environment has not been good in the past two years, and I feel like I could lose my job at any time."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "要掏光自己积蓄就没意思了。",
          "en": "It's pointless to empty all your savings."
        },
        {
          "zh": "但是生活总是越来越好，就这么说吧，不同年代因为建筑行业无法提供工作，工人的价格也影响了整体价格。",
          "en": "But life is always getting better and better. Let's just say that in different eras, because the construction industry cannot provide jobs, the prices of workers also affect the overall price."
        },
        {
          "zh": "自建房是个劳心劳力的过程，当年家人大部分时间都监工到，但是阳台可能因为吊机位置后来封合，又铺了瓷砖然后从渗透变成滴水。",
          "en": "Building your own house is a laborious and mentally taxing process. Back then, my family supervised the work most of the time, but the balcony may have been sealed later due to the position of the crane, and then tiled, and then changed from seepage to dripping water."
        },
        {
          "zh": "别人家的找亲戚监工，结果沙子没用清水洗，然后都刷漆了，后期外墙面挂了。",
          "en": "Other people asked relatives to supervise the work, but the sand was not washed with clean water, and then it was all painted, and the outer wall was hung later."
        },
        {
          "zh": "你不在家，家人能搞定监工嘛。",
          "en": "Can your family handle the supervision if you are not at home?"
        },
        {
          "zh": "建个房子可是长达 1 年以上。",
          "en": "Building a house can take more than a year."
        },
        {
          "zh": "这些年房子都跟人口数量有高，层数也是有变化的。",
          "en": "In recent years, houses have been tall compared to population, and the number of floors has also changed."
        },
        {
          "zh": "其实一开始我有个想法是房型结构做成出租房赚钱的。。。当然最后也没去做。",
          "en": "Actually, at the beginning, I had an idea to make the house structure into a rental house to make money... Of course, I didn't do it in the end."
        },
        {
          "zh": "有个新房子，新的心情，人家来说亲有个新房子也是不一样。",
          "en": "Having a new house gives you a new mood. It's also different when people come to propose marriage and you have a new house."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "如果父母在老家住可以新建的，我们家今年准备把 30 多年的老房子推到重建，现在建材比前几年都便宜，就是人工越来越贵。",
          "en": "If your parents live in your hometown, you can rebuild it. Our family is planning to tear down and rebuild our 30-year-old house this year. Building materials are cheaper than in previous years, but labor is getting more and more expensive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@coderluan 确实有点怕之后不给建了，因为现在重新建房都要什么隔壁邻居签名，要是邻居不签名你还建不了的，加上之前和隔壁邻居有矛盾，现在我爸好不容易才搞定让村里的邻居签名",
          "en": "@coderluan I'm really a little afraid that they won't allow it later, because now rebuilding a house requires the signatures of the neighbors next door. If the neighbors don't sign, you can't build it. Plus, I had conflicts with the neighbors next door before. Now my dad finally managed to get the neighbors in the village to sign."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@Takizawa 不敢去买房，杠杆太大了，一失业的话感觉人都要焦虑的不行",
          "en": "@Takizawa I don't dare to buy a house. The leverage is too high. If I lose my job, I feel like I will be extremely anxious."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@datocp 目前要是建的话就是父母做监工哈，我这边主要负责给钱，建房的流程他们搞定",
          "en": "@datocp If we build now, my parents will be the supervisors. I am mainly responsible for giving money, and they will handle the building process."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@kerner 是父母在老家住，主要这个建房确实是算倾家荡产了，说到底还自己的经济问题，所以我现在一直下不了决心...",
          "en": "@kerner Yes, my parents live in my hometown. The main thing is that building this house is really going to bankrupt me. In the end, it's still my own financial problem, so I can't make up my mind..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sssmm666 #6 有居住需求可以建啊，但是可以建小点，20W 建平层呗，多少钱干多少事",
          "en": "@sssmm666 #6 If there is a need for housing, you can build it, but you can build it smaller. Build a single-story house for 200,000 yuan. Do as much as you can with the money you have."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@sssmm666 #11 这些都不是问题钱不够再等等呗，你现在 all in 一个没有必要的农村自建房？",
          "en": "@sssmm666 #11 These are not problems. If you don't have enough money, just wait. Why are you all in on an unnecessary rural self-built house?"
        },
        {
          "zh": "至于宅基地的政策我倾向于越来越开放你这条件，现金流太重要了，意味着有更多选择",
          "en": "As for the policy on homesteads, I tend to think that it will become more and more open given your conditions. Cash flow is too important, which means you have more choices."
        }
      ],
      "type": "replies"
    }
  ]
}