{
  "id": 1114777,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "这些年传染病也太多了吧..."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "今年蛇年开始真的太惨了...\r\n1 月 29 日 ~ 2 月 1 日老婆流感...\r\n2 月  9 日 ~ 2 月 15 日儿子诺如...\r\n2 月 10 日 ~ 2 月 13 日老丈人诺如...\r\n2 月 11 日 ~ 2 月 13 日老婆诺如...\r\n2 月 12 日 ~ 2 月 14 日我诺如...\r\n2 月 13 日 ~ 2 月 15 日我妈诺如...\r\n2 月 17 日 ~ 2 月 27 日儿子偏肺病毒感染住院...\r\n2 月 20 日 ~ 2 月 27 日我妈肺炎(检查说不是偏肺病毒感染)...\r\n2 月 20 日 ~ 2 月 27 日我爸流感...\r\n2 月 26 日 ~ 2 月 26 日我丈母娘肺部咳嗽...\r\n\r\n这开年过得太惨!打算去灵隐寺拜一拜了.传染感觉诺如是去丈母娘家吃饭 我老婆的姐夫传染的...肺炎感觉像在医院打点滴的时候传染到的...\r\n\r\n![]( https://i.imgur.com/LegXKga.png)"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "今年蛇年开始真的太惨了...",
          "en": "It's been a terrible start to the Year of the Snake..."
        },
        {
          "zh": "1 月 29 日 ~ 2 月 1 日老婆流感...",
          "en": "January 29th ~ February 1st: Wife got the flu..."
        },
        {
          "zh": "2 月  9 日 ~ 2 月 15 日儿子诺如...",
          "en": "February 9th ~ February 15th: Son had Norovirus..."
        },
        {
          "zh": "2 月 10 日 ~ 2 月 13 日老丈人诺如...",
          "en": "February 10th ~ February 13th: Father-in-law had Norovirus..."
        },
        {
          "zh": "2 月 11 日 ~ 2 月 13 日老婆诺如...",
          "en": "February 11th ~ February 13th: Wife had Norovirus..."
        },
        {
          "zh": "2 月 12 日 ~ 2 月 14 日我诺如...",
          "en": "February 12th ~ February 14th: I had Norovirus..."
        },
        {
          "zh": "2 月 13 日 ~ 2 月 15 日我妈诺如...",
          "en": "February 13th ~ February 15th: Mother had Norovirus..."
        },
        {
          "zh": "2 月 17 日 ~ 2 月 27 日儿子偏肺病毒感染住院...",
          "en": "February 17th ~ February 27th: Son hospitalized with metapneumovirus infection..."
        },
        {
          "zh": "2 月 20 日 ~ 2 月 27 日我妈肺炎(检查说不是偏肺病毒感染)...",
          "en": "February 20th ~ February 27th: Mother had pneumonia (tests showed it was not metapneumovirus infection)..."
        },
        {
          "zh": "2 月 20 日 ~ 2 月 27 日我爸流感...",
          "en": "February 20th ~ February 27th: Father had the flu..."
        },
        {
          "zh": "2 月 26 日 ~ 2 月 26 日我丈母娘肺部咳嗽...",
          "en": "February 26th ~ February 26th: Mother-in-law had a cough in her lungs..."
        },
        {
          "zh": "这开年过得太惨!打算去灵隐寺拜一拜了.传染感觉诺如是去丈母娘家吃饭 我老婆的姐夫传染的...肺炎感觉像在医院打点滴的时候传染到的...",
          "en": "This start to the year has been too miserable! Planning to go to Lingyin Temple to pray. Regarding the infections, it seems like the Norovirus came from eating at my mother-in-law's, and my wife's brother-in-law was the one who spread it... Pneumonia feels like it was contracted while getting IV drips at the hospital..."
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "打算去灵隐寺拜一拜认知配得上现状",
          "en": "Planning to go to Lingyin Temple to pray. Awareness matches the current situation."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拜佛不如去打疫苗，打完流感+肺炎疫苗就没这么多事儿了",
          "en": "Praying is not as good as getting vaccinated. After getting the flu + pneumonia vaccines, there wouldn't be so many issues."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@wu67 你再好好回忆下，一切的问题是否是在对 COVID-2019 躺平后才发生的？COVID-2019 破甲效果拔群，一大堆人阳后很长时间内都免疫力低下",
          "en": "@wu67 Think carefully, did all the problems start after the COVID-2019 'lying flat' policy? COVID-2019 has a powerful armor-breaking effect, and a lot of people have weakened immunity for a long time after testing positive."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "没办法，生病后的恢复免疫力需要时间，但是一波接一波的大流行不会给你时间流行越多感染越多免疫越低流行越多，死循环了啊",
          "en": "There's no way out. It takes time to recover immunity after getting sick, but the successive waves of pandemics won't give you time. The more outbreaks there are, the more infections, the lower the immunity, the more outbreaks there are. It's a vicious cycle."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "居然还敢去人多的地方拜一拜。。。",
          "en": "You still dare to go to crowded places to pray..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@ysxb1145 灵隐寺也报不过来了，大家都想去拜一拜，然后来一次集体感染",
          "en": "@ysxb1145 Lingyin Temple can't handle it either, everyone wants to go pray, and then it will be a mass infection."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "对对对，去灵隐寺拜一拜，再去人群感染点新的毒株尝尝咸淡",
          "en": "Exactly, go to Lingyin Temple to pray, and then go to a crowded place to get infected with new strains to taste the difference."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "坚持喝牛奶，保持好作息，提高免疫力。每天晚上一杯牛奶+一个橙子，感觉身体很健康 ，之前冬天多少有点小毛病",
          "en": "Stick to drinking milk, maintain a good routine, and improve immunity. One glass of milk + one orange every night, feel like the body is very healthy, before the winter had some minor ailments."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你家的问题很明显：1. 人太多2. 怀疑你对传染病没有隔离、消毒措施，卫生习惯可能很差3. 诺如大概率是你儿子带回家的，学校本来就是毒窝",
          "en": "The problems in your family are obvious: 1. Too many people. 2. Suspect you don't have isolation and disinfection measures for infectious diseases, and your hygiene habits may be poor. 3. Norovirus is most likely brought back by your son; schools are inherently breeding grounds for germs."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "都是疫苗后遗症造成的免疫力下降，楼里的还让人打疫苗",
          "en": "It's all caused by weakened immunity due to vaccine side effects, and people in this thread are still recommending getting vaccinated."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@firelynx 你的论点站不住脚。2 年前年龄很小无法打新冠疫苗的小朋友现在生病的频率和症状的严重性都比新冠未在中国流行前猛多了",
          "en": "@firelynx Your argument doesn't hold up. The frequency and severity of illness in young children who couldn't get the COVID vaccine 2 years ago are now much worse than before COVID was prevalent in China."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "正在诺如中...",
          "en": "Currently with Norovirus..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "这两年确实感觉得肺炎比以前容易了，诺如也多起来了",
          "en": "It's true that pneumonia seems easier to get than before in these two years, and Norovirus is also more frequent."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "确实很多，去老丈人家过年，先是我和我老婆流感，隔天我老丈人家三个人感染诺如上吐下泻，过年去了几天病了几天。。",
          "en": "Indeed, there are many cases. We went to my father-in-law's for the New Year. First, my wife and I got the flu. The next day, three people in my father-in-law's family were infected with norovirus, vomiting and diarrhea. We were sick for several days of the few days we spent celebrating the New Year."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "拜佛然后又交叉感染",
          "en": "Praying and then getting cross-infected."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我只感觉, 3 年疫情之后, 免疫力下降了很多. 二十几岁的人, 感冒变频繁, 体力大不如前, 还得了鼻炎...",
          "en": "I just feel that after 3 years of the pandemic, my immunity has decreased a lot. People in their twenties get colds more frequently, their physical strength is not as good as before, and they also suffer from rhinitis..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@zqqf16 @reoah2 疫苗是打算打的,但是一下子全家都遭遇的感觉就是想拜拜佛,有个精神寄托...",
          "en": "@zqqf16 @reoah2 I plan to get vaccinated, but the feeling of the whole family experiencing this at once is like wanting to pray for a spiritual support..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我去年年前打了两针流感疫苗，直到现在都没感染任何病毒，以前年年这个季节感冒咳嗽，今年没有。很多疫苗其实不是老人小孩才打，成年人打也有好处的，可以去医院问问。.",
          "en": "I got two flu shots before last year's Chinese New Year, and haven't been infected with any viruses until now. Before, I would get colds and coughs every year during this season, but not this year. Many vaccines aren't just for the elderly and children; adults can also benefit, you can ask the hospital."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "@PeiXyJ 你要真想好好防，可以买卡拉胶鼻喷 物理防护呼吸道疾病。",
          "en": "@PeiXyJ If you really want to protect yourself well, you can buy a carrageenan nasal spray for physical protection against respiratory diseases."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "诺如就是纯纯的菜没煮熟，不知道你是自己做的还是外面吃的。13 号发作了自己都不了解下怎么感染的吗？大学时宿舍 6 个人一起诺如病毒住院住了两天，校领导都来了，后面找到那家店赔了全部医药费加路费再加了两千块钱",
          "en": "Norovirus is just from uncooked food, I don't know if you made it yourself or ate it outside. You don't even know how you got infected when you got sick on the 13th? When I was in college, 6 people in the dormitory were hospitalized for two days due to the norovirus, and the school leaders came. Later they found that store and they paid for all the medical expenses, plus travel expenses, and another two thousand yuan."
        }
      ],
      "type": "replies"
    }
  ]
}