{
  "id": 1109948,
  "blocks": [
    {
      "chunks": [
        {
          "zh": "亲妹妹住我家，给我老婆转钱了，我不要，老婆坚持留下，为此吵了一架",
          "en": "My younger sister lives in my house and transferred money to my wife. I didn't want it, but my wife insisted on keeping it, and we had a fight about it."
        }
      ],
      "type": "title"
    },
    {
      "chunks": [
        {
          "zh": "我妹妹大学毕业后来到杭州工作，由于我在杭州买了一套房子，所以就让我妹妹住在我家，给了一间房间，这样她能省点房租。\r\n今年春节，妹妹给我老婆转了 5000 块钱，说是作为这两年住在我家的水电费。",
          "en": "After my younger sister graduated from university, she came to Hangzhou to work. Because I bought a house in Hangzhou, I let her live with me and gave her a room so she could save on rent.\r\nThis Spring Festival, my sister transferred 5,000 yuan to my wife, saying it was for the utility bills for living in my house for the past two years."
        },
        {
          "zh": "我老婆没有把这件事告诉我，直接收下了，我是和我妈聊天得知的。",
          "en": "My wife didn't tell me about this and accepted it directly. I found out when I was chatting with my mother."
        },
        {
          "zh": "于是我跟老婆沟通，让她把钱还给我妹妹。\r\n我的理由是：\r\n1 ，亲妹妹住在当哥哥的家里，哪里有给钱的道理，这显得多生份。\r\n2 ，妹妹住在我家，对她来说基本就是一个晚上睡觉的地方，平时待在家里时间不多，周末也基本不在家，偶尔在我家吃顿饭，夏天天热空调都舍不得开（怕我多交电费），没有打扰到我的生活，也基本没有给我增加生活成本\r\n3 ，平时妹妹还时不时给小孩买玩具，带到娱乐场玩，这次春节还给了我两个小孩各 2000 钱压岁钱\r\n\r\n但是我老婆坚持留下，她的理由是：妹妹如果不住在我家，在外面租房子每个月得 1000 多，花的更多。",
          "en": "So I talked to my wife and asked her to return the money to my sister.\r\nMy reasons are:\r\n1. There's no reason for a younger sister to give money when living in her older brother's house. It seems too formal.\r\n2. For my sister, living in my house is basically just a place to sleep at night. She doesn't spend much time at home during the week, and she's basically not home on weekends. She occasionally eats a meal at my house, and she's reluctant to turn on the air conditioner in the hot summer (for fear of me paying more electricity bills). She hasn't disturbed my life or added to my living costs.\r\n3. My sister also occasionally buys toys for the children and takes them to the entertainment park. This Spring Festival, she also gave each of my two children 2,000 yuan in lucky money.\r\n\r\nBut my wife insisted on keeping it. Her reason is that if my sister didn't live with us, she would have to rent a house outside for more than 1,000 yuan a month, which would cost even more."
        },
        {
          "zh": "这 5000 块妹妹应该给，她也应该收。\r\n我觉得妹妹做的可以了，心意已经到了，她工资也不高，所以 5000 块我绝对不要，是我老婆把钱看得太重了，比亲情看得重，这一点我很生气，为此大吵了一架，各位能帮我评论下这事吗",
          "en": "My sister should give this 5,000 yuan, and she should accept it.\r\nI think my sister has done enough, and her intention is there. Her salary is not high, so I absolutely don't want the 5,000 yuan. My wife values money too much, more than family affection. I'm very angry about this, and we had a big fight. Can you all comment on this matter?"
        }
      ],
      "type": "content"
    },
    {
      "chunks": [
        {
          "zh": "我的看法：楼主妹妹很懂事，本来事情已经办妥了，她嫂子（楼主老婆）收了钱也永远无法拿这件事出来说恩情（人情债才是最贵的）。",
          "en": "My opinion: The original poster's sister is very sensible. Originally, things were settled. Her sister-in-law (the original poster's wife) accepted the money and would never be able to bring this up to talk about favors (debts of gratitude are the most expensive)."
        },
        {
          "zh": "结果楼主出来把事情搞砸了，老婆不高兴，必然迁怒妹妹，如果真的退了钱，以后几十年妹妹在嫂子面前都要矮一头。",
          "en": "As a result, the original poster came out and ruined things. His wife is unhappy and will inevitably vent her anger on her sister. If the money is really returned, the sister will have to be inferior to her sister-in-law for decades to come."
        },
        {
          "zh": "原本，楼主的正确做法应该是抢在妹妹主动给钱之前，给钱妹妹，让妹妹以她自己的名义交给她嫂子。",
          "en": "Originally, the original poster's correct approach should have been to give money to his sister before she offered it, and let her give it to her sister-in-law in her own name."
        },
        {
          "zh": "这一步楼主没有做，妹妹只好自己掏钱了。",
          "en": "The original poster didn't do this, so the sister had to pay the money herself."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "妹妹好懂事",
          "en": "The sister is so sensible."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "可以收，但你老婆得跟你说一声啊。",
          "en": "It's okay to accept it, but your wife should have told you about it."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "息事宁人的做法是，自己掏 5000 还给妹妹，然后安慰老婆。",
          "en": "The way to appease everyone is to take out 5,000 yourself and return it to your sister, then comfort your wife."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我觉得里面最大的问题是老婆收了钱没有第一时间跟楼主说",
          "en": "I think the biggest problem is that the wife didn't tell the original poster immediately after receiving the money."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "我支持你，你老婆欠吊",
          "en": "I support you, your wife is out of line."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首先你妹妹做的没问题，一是表达了自己的感恩，并且是给你老婆，也是表示你们家对你老婆的重视。",
          "en": "First of all, your sister did nothing wrong. First, she expressed her gratitude, and it was to your wife, which also shows that your family values your wife."
        },
        {
          "zh": "二是你老婆的说法也没什么问题，亲情不是一点金钱都容不下，有时候这些钱只是人情的流通。",
          "en": "Secondly, there is nothing wrong with what your wife said. Family affection cannot tolerate a little money. Sometimes this money is just the circulation of favors."
        },
        {
          "zh": "你实在觉得这钱不该收的话，回头找个理由（过年/生日/给钱让妹妹给父母买东西等等）包个红包给你妹妹就行了。",
          "en": "If you really think the money shouldn't be accepted, then find a reason later (Chinese New Year/birthday/giving money for your sister to buy things for your parents, etc.) and give your sister a red envelope."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你老婆能让你妹妹住两年真的很难得了你能接受小舅子在你家住两年吗",
          "en": "It's really rare that your wife can let your sister live for two years. Can you accept your brother-in-law living in your house for two years?"
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "那你是妹妹，不是你老婆的妹妹",
          "en": "That's your sister, not your wife's sister."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "你一直站在你的角度来看, 反过来看看 就像看伏地魔一样",
          "en": "You are always looking at it from your perspective, look at it the other way around, it's like looking at Voldemort."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "妹妹懂事，老婆不懂事。鉴定完毕。",
          "en": "The sister is sensible, and the wife is not. Verdict complete."
        },
        {
          "zh": "其实你老婆完全可以拿这五千给你妹妹买个金项链，这样有来有回最好了。",
          "en": "In fact, your wife could have used this 5,000 to buy your sister a gold necklace, which would be the best way to reciprocate."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "首先你妹妹就不该住你家，同理你老婆如果有妹妹也不应该住你家",
          "en": "First of all, your sister shouldn't live in your house. By the same token, if your wife has a sister, she shouldn't live in your house either."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "有个关键问题，你妹妹还要在你这住多久？",
          "en": "There is a key question: How long will your sister be staying with you?"
        },
        {
          "zh": "在不常住的情况下，按你的描述：1. 亲妹妹2. 节俭省电费3. 周末基本不在家4. 买玩具，游乐场。5. 一共 4000 压岁钱。",
          "en": "If she doesn't live there often, according to your description: 1. Younger sister 2. Thrifty and saves electricity 3. Basically not home on weekends 4. Buys toys, amusement parks 5. A total of 4000 in lucky money."
        },
        {
          "zh": "我觉得你老婆不该收。",
          "en": "I don't think your wife should accept it."
        },
        {
          "zh": "说实话，这钱都收，在我这个路人眼里你老婆是“不可交”的人吧。",
          "en": "To be honest, if she accepts this money, in the eyes of a stranger like me, your wife is an 'unreliable' person."
        },
        {
          "zh": "不过我这就是随便发表下意见，你俩好好的。",
          "en": "But I'm just expressing my opinion, you two should be fine."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "短期住可以，两年了，感觉已经不是钱的问题。",
          "en": "Short-term stay is okay, but after two years, it feels like it's no longer about the money."
        },
        {
          "zh": "你是跟你老婆过日子，不是跟你妹。。。",
          "en": "You are living with your wife, not your sister..."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "其实收不收这钱 OP 先放一放，有个关键问题，为啥你老婆收了你妹妹的钱没有和你同步下？",
          "en": "Actually, OP should put aside whether to accept the money or not, there is a key question, why didn't your wife synchronize with you after receiving your sister's money?"
        },
        {
          "zh": "这个更重要！",
          "en": "This is more important!"
        },
        {
          "zh": "其实你老婆有点傻，5000 块没多少钱，但是你收了，相当于你妹妹住的 2 年人情就算了结了，人情债是最难还的，我觉得你妹妹应该谢谢你老婆收钱了。",
          "en": "Actually, your wife is a bit silly. 5,000 yuan is not much money, but if you accept it, it means that the two years of favor that your sister lived there is settled. Favors are the hardest to repay. I think your sister should thank your wife for accepting the money."
        },
        {
          "zh": "如果是 5000 块的礼物，其实还是可以收的，但是钱就味道不对了。",
          "en": "If it was a gift worth 5,000 yuan, it would actually be acceptable, but money just doesn't feel right."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "说实话，如果我老婆的弟弟说要在我家住两年或者更长，我愿意直接赞助他 2w 让他自己租房",
          "en": "To be honest, if my wife's younger brother said he wanted to live in my house for two years or longer, I would be willing to directly sponsor him 20,000 so he could rent his own place."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "op 虽然说是让大家来评论结果自己专门挑向着自己的来回复也是醉了",
          "en": "Although OP said he wanted everyone to comment, he only picked those who sided with him to reply, which is also speechless."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "当亲情被量化时，双方都会受伤",
          "en": "When family affection is quantified, both parties will be hurt."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "别想太多，你妹妹给这笔钱你不收下，以后吵架了大概率让你老婆拿出来嚼舌根，你收下了反而对你和你妹妹好，吵起来了也不会拿这件事压你一头。",
          "en": "Don't think too much, if you don't accept this money from your sister, there is a high probability that your wife will bring it up when you quarrel in the future. Accepting it will be better for you and your sister, and she won't use it to pressure you when you quarrel."
        },
        {
          "zh": "你从别处找补你妹妹就好了，思路放开一点，别老纠结这 5000 块。",
          "en": "Just make it up to your sister in other ways, open your mind a little, and don't keep dwelling on this 5,000 yuan."
        }
      ],
      "type": "replies"
    },
    {
      "chunks": [
        {
          "zh": "太可怕了，上面批评楼主老婆的人不知道她老婆真的是非常的大度，非常的容忍相比于私密自由的小空间被外人打破的牺牲，5000 块算根毛啊",
          "en": "That's terrible, those who criticize the original poster's wife above don't know that his wife is really very generous and very tolerant. Compared to the sacrifice of the small space of private freedom being broken by outsiders, 5,000 yuan is nothing."
        }
      ],
      "type": "replies"
    }
  ]
}